{
  "behavior_id": "BEH_COG_SUPERFICIAL_KNOWING",
  "label_ar": "المعرفة الظاهرية",
  "label_en": "Superficial Knowing",
  "category": "cognitive",
  "roots": [
    "ظ-ه-ر"
  ],
  "stems": [],
  "synonyms_ar": [],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:85",
      "text_ar": "ثُمَّ أَنتُمْ هَـٰٓؤُلَآءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَـٰرِهِمْ تَظَـٰهَرُونَ عَلَيْهِم بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَإِن يَأْتُوكُمْ أُسَـٰرَىٰ تُفَـٰدُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَـٰبِ وَتَكْفُرُونَ بِبَعْضٍ ۚ فَمَا جَزَآءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْىٌ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَيَوْمَ ٱلْقِيَـٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلْعَذَابِ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:101",
      "text_ar": "وَلَمَّا جَآءَهُمْ رَسُولٌ مِّنْ عِندِ ٱللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌ مِّنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ كِتَـٰبَ ٱللَّهِ وَرَآءَ ظُهُورِهِمْ كَأَنَّهُمْ لَا يَعْلَمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:189",
      "text_ar": "يَسْـَٔلُونَكَ عَنِ ٱلْأَهِلَّةِ ۖ قُلْ هِىَ مَوَٰقِيتُ لِلنَّاسِ وَٱلْحَجِّ ۗ وَلَيْسَ ٱلْبِرُّ بِأَن تَأْتُوا۟ ٱلْبُيُوتَ مِن ظُهُورِهَا وَلَـٰكِنَّ ٱلْبِرَّ مَنِ ٱتَّقَىٰ ۗ وَأْتُوا۟ ٱلْبُيُوتَ مِنْ أَبْوَٰبِهَا ۚ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:187",
      "text_ar": "وَإِذْ أَخَذَ ٱللَّهُ مِيثَـٰقَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ لَتُبَيِّنُنَّهُۥ لِلنَّاسِ وَلَا تَكْتُمُونَهُۥ فَنَبَذُوهُ وَرَآءَ ظُهُورِهِمْ وَٱشْتَرَوْا۟ بِهِۦ ثَمَنًا قَلِيلًا ۖ فَبِئْسَ مَا يَشْتَرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:31",
      "text_ar": "قَدْ خَسِرَ ٱلَّذِينَ كَذَّبُوا۟ بِلِقَآءِ ٱللَّهِ ۖ حَتَّىٰٓ إِذَا جَآءَتْهُمُ ٱلسَّاعَةُ بَغْتَةً قَالُوا۟ يَـٰحَسْرَتَنَا عَلَىٰ مَا فَرَّطْنَا فِيهَا وَهُمْ يَحْمِلُونَ أَوْزَارَهُمْ عَلَىٰ ظُهُورِهِمْ ۚ أَلَا سَآءَ مَا يَزِرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:94",
      "text_ar": "وَلَقَدْ جِئْتُمُونَا فُرَٰدَىٰ كَمَا خَلَقْنَـٰكُمْ أَوَّلَ مَرَّةٍ وَتَرَكْتُم مَّا خَوَّلْنَـٰكُمْ وَرَآءَ ظُهُورِكُمْ ۖ وَمَا نَرَىٰ مَعَكُمْ شُفَعَآءَكُمُ ٱلَّذِينَ زَعَمْتُمْ أَنَّهُمْ فِيكُمْ شُرَكَـٰٓؤُا۟ ۚ لَقَد تَّقَطَّعَ بَيْنَكُمْ وَضَلَّ عَنكُم مَّا كُنتُمْ تَزْعُمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:120",
      "text_ar": "وَذَرُوا۟ ظَـٰهِرَ ٱلْإِثْمِ وَبَاطِنَهُۥٓ ۚ إِنَّ ٱلَّذِينَ يَكْسِبُونَ ٱلْإِثْمَ سَيُجْزَوْنَ بِمَا كَانُوا۟ يَقْتَرِفُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:138",
      "text_ar": "وَقَالُوا۟ هَـٰذِهِۦٓ أَنْعَـٰمٌ وَحَرْثٌ حِجْرٌ لَّا يَطْعَمُهَآ إِلَّا مَن نَّشَآءُ بِزَعْمِهِمْ وَأَنْعَـٰمٌ حُرِّمَتْ ظُهُورُهَا وَأَنْعَـٰمٌ لَّا يَذْكُرُونَ ٱسْمَ ٱللَّهِ عَلَيْهَا ٱفْتِرَآءً عَلَيْهِ ۚ سَيَجْزِيهِم بِمَا كَانُوا۟ يَفْتَرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:146",
      "text_ar": "وَعَلَى ٱلَّذِينَ هَادُوا۟ حَرَّمْنَا كُلَّ ذِى ظُفُرٍ ۖ وَمِنَ ٱلْبَقَرِ وَٱلْغَنَمِ حَرَّمْنَا عَلَيْهِمْ شُحُومَهُمَآ إِلَّا مَا حَمَلَتْ ظُهُورُهُمَآ أَوِ ٱلْحَوَايَآ أَوْ مَا ٱخْتَلَطَ بِعَظْمٍ ۚ ذَٰلِكَ جَزَيْنَـٰهُم بِبَغْيِهِمْ ۖ وَإِنَّا لَصَـٰدِقُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:151",
      "text_ar": "قُلْ تَعَالَوْا۟ أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا۟ بِهِۦ شَيْـًٔا ۖ وَبِٱلْوَٰلِدَيْنِ إِحْسَـٰنًا ۖ وَلَا تَقْتُلُوٓا۟ أَوْلَـٰدَكُم مِّنْ إِمْلَـٰقٍ ۖ نَّحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ ۖ وَلَا تَقْرَبُوا۟ ٱلْفَوَٰحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ۖ وَلَا تَقْتُلُوا۟ ٱلنَّفْسَ ٱلَّتِى حَرَّمَ ٱللَّهُ إِلَّا بِٱلْحَقِّ ۚ ذَٰلِكُمْ وَصَّىٰكُم بِهِۦ لَعَلَّكُمْ تَعْقِلُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "7:33",
      "text_ar": "قُلْ إِنَّمَا حَرَّمَ رَبِّىَ ٱلْفَوَٰحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَٱلْإِثْمَ وَٱلْبَغْىَ بِغَيْرِ ٱلْحَقِّ وَأَن تُشْرِكُوا۟ بِٱللَّهِ مَا لَمْ يُنَزِّلْ بِهِۦ سُلْطَـٰنًا وَأَن تَقُولُوا۟ عَلَى ٱللَّهِ مَا لَا تَعْلَمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "7:172",
      "text_ar": "وَإِذْ أَخَذَ رَبُّكَ مِنۢ بَنِىٓ ءَادَمَ مِن ظُهُورِهِمْ ذُرِّيَّتَهُمْ وَأَشْهَدَهُمْ عَلَىٰٓ أَنفُسِهِمْ أَلَسْتُ بِرَبِّكُمْ ۖ قَالُوا۟ بَلَىٰ ۛ شَهِدْنَآ ۛ أَن تَقُولُوا۟ يَوْمَ ٱلْقِيَـٰمَةِ إِنَّا كُنَّا عَنْ هَـٰذَا غَـٰفِلِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "9:4",
      "text_ar": "إِلَّا ٱلَّذِينَ عَـٰهَدتُّم مِّنَ ٱلْمُشْرِكِينَ ثُمَّ لَمْ يَنقُصُوكُمْ شَيْـًٔا وَلَمْ يُظَـٰهِرُوا۟ عَلَيْكُمْ أَحَدًا فَأَتِمُّوٓا۟ إِلَيْهِمْ عَهْدَهُمْ إِلَىٰ مُدَّتِهِمْ ۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُتَّقِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "9:8",
      "text_ar": "كَيْفَ وَإِن يَظْهَرُوا۟ عَلَيْكُمْ لَا يَرْقُبُوا۟ فِيكُمْ إِلًّا وَلَا ذِمَّةً ۚ يُرْضُونَكُم بِأَفْوَٰهِهِمْ وَتَأْبَىٰ قُلُوبُهُمْ وَأَكْثَرُهُمْ فَـٰسِقُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "9:33",
      "text_ar": "هُوَ ٱلَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِٱلْهُدَىٰ وَدِينِ ٱلْحَقِّ لِيُظْهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوْ كَرِهَ ٱلْمُشْرِكُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "9:35",
      "text_ar": "يَوْمَ يُحْمَىٰ عَلَيْهَا فِى نَارِ جَهَنَّمَ فَتُكْوَىٰ بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ ۖ هَـٰذَا مَا كَنَزْتُمْ لِأَنفُسِكُمْ فَذُوقُوا۟ مَا كُنتُمْ تَكْنِزُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "9:48",
      "text_ar": "لَقَدِ ٱبْتَغَوُا۟ ٱلْفِتْنَةَ مِن قَبْلُ وَقَلَّبُوا۟ لَكَ ٱلْأُمُورَ حَتَّىٰ جَآءَ ٱلْحَقُّ وَظَهَرَ أَمْرُ ٱللَّهِ وَهُمْ كَـٰرِهُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "11:92",
      "text_ar": "قَالَ يَـٰقَوْمِ أَرَهْطِىٓ أَعَزُّ عَلَيْكُم مِّنَ ٱللَّهِ وَٱتَّخَذْتُمُوهُ وَرَآءَكُمْ ظِهْرِيًّا ۖ إِنَّ رَبِّى بِمَا تَعْمَلُونَ مُحِيطٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "13:33",
      "text_ar": "أَفَمَنْ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفْسٍۭ بِمَا كَسَبَتْ ۗ وَجَعَلُوا۟ لِلَّهِ شُرَكَآءَ قُلْ سَمُّوهُمْ ۚ أَمْ تُنَبِّـُٔونَهُۥ بِمَا لَا يَعْلَمُ فِى ٱلْأَرْضِ أَم بِظَـٰهِرٍ مِّنَ ٱلْقَوْلِ ۗ بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا۟ مَكْرُهُمْ وَصُدُّوا۟ عَنِ ٱلسَّبِيلِ ۗ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٍ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "17:88",
      "text_ar": "قُل لَّئِنِ ٱجْتَمَعَتِ ٱلْإِنسُ وَٱلْجِنُّ عَلَىٰٓ أَن يَأْتُوا۟ بِمِثْلِ هَـٰذَا ٱلْقُرْءَانِ لَا يَأْتُونَ بِمِثْلِهِۦ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "18:20",
      "text_ar": "إِنَّهُمْ إِن يَظْهَرُوا۟ عَلَيْكُمْ يَرْجُمُوكُمْ أَوْ يُعِيدُوكُمْ فِى مِلَّتِهِمْ وَلَن تُفْلِحُوٓا۟ إِذًا أَبَدًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "18:22",
      "text_ar": "سَيَقُولُونَ ثَلَـٰثَةٌ رَّابِعُهُمْ كَلْبُهُمْ وَيَقُولُونَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًۢا بِٱلْغَيْبِ ۖ وَيَقُولُونَ سَبْعَةٌ وَثَامِنُهُمْ كَلْبُهُمْ ۚ قُل رَّبِّىٓ أَعْلَمُ بِعِدَّتِهِم مَّا يَعْلَمُهُمْ إِلَّا قَلِيلٌ ۗ فَلَا تُمَارِ فِيهِمْ إِلَّا مِرَآءً ظَـٰهِرًا وَلَا تَسْتَفْتِ فِيهِم مِّنْهُمْ أَحَدًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "18:97",
      "text_ar": "فَمَا ٱسْطَـٰعُوٓا۟ أَن يَظْهَرُوهُ وَمَا ٱسْتَطَـٰعُوا۟ لَهُۥ نَقْبًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "21:39",
      "text_ar": "لَوْ يَعْلَمُ ٱلَّذِينَ كَفَرُوا۟ حِينَ لَا يَكُفُّونَ عَن وُجُوهِهِمُ ٱلنَّارَ وَلَا عَن ظُهُورِهِمْ وَلَا هُمْ يُنصَرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "24:31",
      "text_ar": "وَقُل لِّلْمُؤْمِنَـٰتِ يَغْضُضْنَ مِنْ أَبْصَـٰرِهِنَّ وَيَحْفَظْنَ فُرُوجَهُنَّ وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنْهَا ۖ وَلْيَضْرِبْنَ بِخُمُرِهِنَّ عَلَىٰ جُيُوبِهِنَّ ۖ وَلَا يُبْدِينَ زِينَتَهُنَّ إِلَّا لِبُعُولَتِهِنَّ أَوْ ءَابَآئِهِنَّ أَوْ ءَابَآءِ بُعُولَتِهِنَّ أَوْ أَبْنَآئِهِنَّ أَوْ أَبْنَآءِ بُعُولَتِهِنَّ أَوْ إِخْوَٰنِهِنَّ أَوْ بَنِىٓ إِخْوَٰنِهِنَّ أَوْ بَنِىٓ أَخَوَٰتِهِنَّ أَوْ نِسَآئِهِنَّ أَوْ مَا مَلَكَتْ أَيْمَـٰنُهُنَّ أَوِ ٱلتَّـٰبِعِينَ غَيْرِ أُو۟لِى ٱلْإِرْبَةِ مِنَ ٱلرِّجَالِ أَوِ ٱلطِّفْلِ ٱلَّذِينَ لَمْ يَظْهَرُوا۟ عَلَىٰ عَوْرَٰتِ ٱلنِّسَآءِ ۖ وَلَا يَضْرِبْنَ بِأَرْجُلِهِنَّ لِيُعْلَمَ مَا يُخْفِينَ مِن زِينَتِهِنَّ ۚ وَتُوبُوٓا۟ إِلَى ٱللَّهِ جَمِيعًا أَيُّهَ ٱلْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "24:58",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لِيَسْتَـْٔذِنكُمُ ٱلَّذِينَ مَلَكَتْ أَيْمَـٰنُكُمْ وَٱلَّذِينَ لَمْ يَبْلُغُوا۟ ٱلْحُلُمَ مِنكُمْ ثَلَـٰثَ مَرَّٰتٍ ۚ مِّن قَبْلِ صَلَوٰةِ ٱلْفَجْرِ وَحِينَ تَضَعُونَ ثِيَابَكُم مِّنَ ٱلظَّهِيرَةِ وَمِنۢ بَعْدِ صَلَوٰةِ ٱلْعِشَآءِ ۚ ثَلَـٰثُ عَوْرَٰتٍ لَّكُمْ ۚ لَيْسَ عَلَيْكُمْ وَلَا عَلَيْهِمْ جُنَاحٌۢ بَعْدَهُنَّ ۚ طَوَّٰفُونَ عَلَيْكُم بَعْضُكُمْ عَلَىٰ بَعْضٍ ۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْـَٔايَـٰتِ ۗ وَٱللَّهُ عَلِيمٌ حَكِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "25:55",
      "text_ar": "وَيَعْبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُهُمْ وَلَا يَضُرُّهُمْ ۗ وَكَانَ ٱلْكَافِرُ عَلَىٰ رَبِّهِۦ ظَهِيرًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "28:17",
      "text_ar": "قَالَ رَبِّ بِمَآ أَنْعَمْتَ عَلَىَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "28:48",
      "text_ar": "فَلَمَّا جَآءَهُمُ ٱلْحَقُّ مِنْ عِندِنَا قَالُوا۟ لَوْلَآ أُوتِىَ مِثْلَ مَآ أُوتِىَ مُوسَىٰٓ ۚ أَوَلَمْ يَكْفُرُوا۟ بِمَآ أُوتِىَ مُوسَىٰ مِن قَبْلُ ۖ قَالُوا۟ سِحْرَانِ تَظَـٰهَرَا وَقَالُوٓا۟ إِنَّا بِكُلٍّ كَـٰفِرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "28:86",
      "text_ar": "وَمَا كُنتَ تَرْجُوٓا۟ أَن يُلْقَىٰٓ إِلَيْكَ ٱلْكِتَـٰبُ إِلَّا رَحْمَةً مِّن رَّبِّكَ ۖ فَلَا تَكُونَنَّ ظَهِيرًا لِّلْكَـٰفِرِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "30:7",
      "text_ar": "يَعْلَمُونَ ظَـٰهِرًا مِّنَ ٱلْحَيَوٰةِ ٱلدُّنْيَا وَهُمْ عَنِ ٱلْـَٔاخِرَةِ هُمْ غَـٰفِلُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "30:18",
      "text_ar": "وَلَهُ ٱلْحَمْدُ فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَعَشِيًّا وَحِينَ تُظْهِرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "30:41",
      "text_ar": "ظَهَرَ ٱلْفَسَادُ فِى ٱلْبَرِّ وَٱلْبَحْرِ بِمَا كَسَبَتْ أَيْدِى ٱلنَّاسِ لِيُذِيقَهُم بَعْضَ ٱلَّذِى عَمِلُوا۟ لَعَلَّهُمْ يَرْجِعُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "31:20",
      "text_ar": "أَلَمْ تَرَوْا۟ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُۥ ظَـٰهِرَةً وَبَاطِنَةً ۗ وَمِنَ ٱلنَّاسِ مَن يُجَـٰدِلُ فِى ٱللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَـٰبٍ مُّنِيرٍ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "33:4",
      "text_ar": "مَّا جَعَلَ ٱللَّهُ لِرَجُلٍ مِّن قَلْبَيْنِ فِى جَوْفِهِۦ ۚ وَمَا جَعَلَ أَزْوَٰجَكُمُ ٱلَّـٰٓـِٔى تُظَـٰهِرُونَ مِنْهُنَّ أُمَّهَـٰتِكُمْ ۚ وَمَا جَعَلَ أَدْعِيَآءَكُمْ أَبْنَآءَكُمْ ۚ ذَٰلِكُمْ قَوْلُكُم بِأَفْوَٰهِكُمْ ۖ وَٱللَّهُ يَقُولُ ٱلْحَقَّ وَهُوَ يَهْدِى ٱلسَّبِيلَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "33:26",
      "text_ar": "وَأَنزَلَ ٱلَّذِينَ ظَـٰهَرُوهُم مِّنْ أَهْلِ ٱلْكِتَـٰبِ مِن صَيَاصِيهِمْ وَقَذَفَ فِى قُلُوبِهِمُ ٱلرُّعْبَ فَرِيقًا تَقْتُلُونَ وَتَأْسِرُونَ فَرِيقًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "34:18",
      "text_ar": "وَجَعَلْنَا بَيْنَهُمْ وَبَيْنَ ٱلْقُرَى ٱلَّتِى بَـٰرَكْنَا فِيهَا قُرًى ظَـٰهِرَةً وَقَدَّرْنَا فِيهَا ٱلسَّيْرَ ۖ سِيرُوا۟ فِيهَا لَيَالِىَ وَأَيَّامًا ءَامِنِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "34:22",
      "text_ar": "قُلِ ٱدْعُوا۟ ٱلَّذِينَ زَعَمْتُم مِّن دُونِ ٱللَّهِ ۖ لَا يَمْلِكُونَ مِثْقَالَ ذَرَّةٍ فِى ٱلسَّمَـٰوَٰتِ وَلَا فِى ٱلْأَرْضِ وَمَا لَهُمْ فِيهِمَا مِن شِرْكٍ وَمَا لَهُۥ مِنْهُم مِّن ظَهِيرٍ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "35:45",
      "text_ar": "وَلَوْ يُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِمَا كَسَبُوا۟ مَا تَرَكَ عَلَىٰ ظَهْرِهَا مِن دَآبَّةٍ وَلَـٰكِن يُؤَخِّرُهُمْ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۖ فَإِذَا جَآءَ أَجَلُهُمْ فَإِنَّ ٱللَّهَ كَانَ بِعِبَادِهِۦ بَصِيرًۢا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "40:26",
      "text_ar": "وَقَالَ فِرْعَوْنُ ذَرُونِىٓ أَقْتُلْ مُوسَىٰ وَلْيَدْعُ رَبَّهُۥٓ ۖ إِنِّىٓ أَخَافُ أَن يُبَدِّلَ دِينَكُمْ أَوْ أَن يُظْهِرَ فِى ٱلْأَرْضِ ٱلْفَسَادَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "40:29",
      "text_ar": "يَـٰقَوْمِ لَكُمُ ٱلْمُلْكُ ٱلْيَوْمَ ظَـٰهِرِينَ فِى ٱلْأَرْضِ فَمَن يَنصُرُنَا مِنۢ بَأْسِ ٱللَّهِ إِن جَآءَنَا ۚ قَالَ فِرْعَوْنُ مَآ أُرِيكُمْ إِلَّا مَآ أَرَىٰ وَمَآ أَهْدِيكُمْ إِلَّا سَبِيلَ ٱلرَّشَادِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "42:33",
      "text_ar": "إِن يَشَأْ يُسْكِنِ ٱلرِّيحَ فَيَظْلَلْنَ رَوَاكِدَ عَلَىٰ ظَهْرِهِۦٓ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "43:13",
      "text_ar": "لِتَسْتَوُۥا۟ عَلَىٰ ظُهُورِهِۦ ثُمَّ تَذْكُرُوا۟ نِعْمَةَ رَبِّكُمْ إِذَا ٱسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا۟ سُبْحَـٰنَ ٱلَّذِى سَخَّرَ لَنَا هَـٰذَا وَمَا كُنَّا لَهُۥ مُقْرِنِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "43:33",
      "text_ar": "وَلَوْلَآ أَن يَكُونَ ٱلنَّاسُ أُمَّةً وَٰحِدَةً لَّجَعَلْنَا لِمَن يَكْفُرُ بِٱلرَّحْمَـٰنِ لِبُيُوتِهِمْ سُقُفًا مِّن فِضَّةٍ وَمَعَارِجَ عَلَيْهَا يَظْهَرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "48:28",
      "text_ar": "هُوَ ٱلَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِٱلْهُدَىٰ وَدِينِ ٱلْحَقِّ لِيُظْهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ ۚ وَكَفَىٰ بِٱللَّهِ شَهِيدًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "57:3",
      "text_ar": "هُوَ ٱلْأَوَّلُ وَٱلْـَٔاخِرُ وَٱلظَّـٰهِرُ وَٱلْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "57:13",
      "text_ar": "يَوْمَ يَقُولُ ٱلْمُنَـٰفِقُونَ وَٱلْمُنَـٰفِقَـٰتُ لِلَّذِينَ ءَامَنُوا۟ ٱنظُرُونَا نَقْتَبِسْ مِن نُّورِكُمْ قِيلَ ٱرْجِعُوا۟ وَرَآءَكُمْ فَٱلْتَمِسُوا۟ نُورًا فَضُرِبَ بَيْنَهُم بِسُورٍ لَّهُۥ بَابٌۢ بَاطِنُهُۥ فِيهِ ٱلرَّحْمَةُ وَظَـٰهِرُهُۥ مِن قِبَلِهِ ٱلْعَذَابُ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "58:2",
      "text_ar": "ٱلَّذِينَ يُظَـٰهِرُونَ مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهَـٰتِهِمْ ۖ إِنْ أُمَّهَـٰتُهُمْ إِلَّا ٱلَّـٰٓـِٔى وَلَدْنَهُمْ ۚ وَإِنَّهُمْ لَيَقُولُونَ مُنكَرًا مِّنَ ٱلْقَوْلِ وَزُورًا ۚ وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "58:3",
      "text_ar": "وَٱلَّذِينَ يُظَـٰهِرُونَ مِن نِّسَآئِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُوا۟ فَتَحْرِيرُ رَقَبَةٍ مِّن قَبْلِ أَن يَتَمَآسَّا ۚ ذَٰلِكُمْ تُوعَظُونَ بِهِۦ ۚ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "60:9",
      "text_ar": "إِنَّمَا يَنْهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ قَـٰتَلُوكُمْ فِى ٱلدِّينِ وَأَخْرَجُوكُم مِّن دِيَـٰرِكُمْ وَظَـٰهَرُوا۟ عَلَىٰٓ إِخْرَاجِكُمْ أَن تَوَلَّوْهُمْ ۚ وَمَن يَتَوَلَّهُمْ فَأُو۟لَـٰٓئِكَ هُمُ ٱلظَّـٰلِمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "قوله عز وجل: {ثم أنتم هؤلاء} يعني: يا هؤلاء، وهؤلاء للتنبيه.{تقتلون أنفسكم} أي (يقتل) بعضكم بعضاً.{وتخرجون فريقاً منكم من ديارهم تظاهرون عليهم} بتشديد الظاء أي تتظاهرون أدغمت التاء في الظاء، وقرأ عاصم وحمزة والكسائي بتخفيف الظاء فحذفوا تاء التفاعل وأبقوا تاء الخطاب كقوله تعالى: {ولا تعاونوا} معناهما جميعاً: تتعاونون، والظهير: العون.{بالإثم والعدوان} المعصية والظلم.{وإن يأتوكم أسارى} وقرأ حمزة: أسرى، وهما جمع أسير، ومعناهما واحد.{تفادوهم} بالمال وتنقذوهم.وقرأ أهل المدينة وعاصم والكسائي ويعقوب ( ت",
        "char_start": 0,
        "char_end": 1904,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_101_chunk00",
        "verse_key": "2:101",
        "text_ar": "{ولما جاءهم رسول من عند الله} يعني محمداً.{مصدق لما معهم نبذ فريق من الذين أوتوا الكتاب كتاب الله وراء ظهورهم} يعني التوراة، وقيل: التوراة وقيل: القرآن.{كأنهم لا يعلمون} قال الشعبي: \"كانوا يقرؤون التوراة ولا يعملون بها\"، وقال سفيان بن عينية: \"أدرجوها في الحرير والديباج وحلوها بالذهب والفضة ولم يعملوا بها فذلك نبذهم لها\".",
        "char_start": 0,
        "char_end": 322,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_189_chunk00",
        "verse_key": "2:189",
        "text_ar": "قوله تعالى : ( يسألونك عن الأهلة ) نزلت في معاذ بن جبل وثعلبة بن غنم الأنصاريين قالا يا رسول الله ما بال الهلال يبدو دقيقا ثم يزيد حتى يمتلئ نورا ثم يعود دقيقا كما بدأ ولا يكون على حالة واحدة ؟ فأنزل الله تعالى ( يسألونك عن الأهلة ) وهي جمع هلال مثل رداء وأردية سمي هلالا لأن الناس يرفعون أصواتهم بالذكر عند رؤيته من قولهم استهل الصبي إذا صرخ حين يولد وأهل القوم بالحج إذا رفعوا أصواتهم بالتلبية ( قل هي مواقيت للناس والحج ) جمع ميقات أي فعلنا ذلك ليعلم الناس أوقات الحج والعمرة والصوم ، والإفطار وآج",
        "char_start": 0,
        "char_end": 2398,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_187_chunk00",
        "verse_key": "3:187",
        "text_ar": "( وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه ) قرأ ابن كثير وأهل البصرة وأبو بكر بالياء فيهما لقوله تعالى : ( فنبذوه وراء ظهورهم ) وقرأ الآخرون بالتاء فيها على إضمار القول ، ( فنبذوه وراء ظهورهم ) أي : طرحوه وضيعوه وتركوا العمل به ، ( واشتروا به ثمنا قليلا ) يعني : المآكل والرشا ، ( فبئس ما يشترون ) قال قتادة : هذا ميثاق أخذه الله تعالى على أهل العلم فمن علم شيئا فليعلمه وإياكم وكتمان العلم فإنه هلكة .وقال أبو هريرة رضي الله عنه : لولا ما أخذ الله على أهل الكتاب ما حدثتكم بش",
        "char_start": 0,
        "char_end": 1320,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_031_chunk00",
        "verse_key": "6:31",
        "text_ar": "( قد خسر الذين كذبوا بلقاء الله ) أي : خسروا أنفسهم بتكذيبهم المصير إلى الله بالبعث بعد الموت ، ( حتى إذا جاءتهم الساعة ) أي : القيامة ( بغتة ) أي : فجأة ، ( قالوا يا حسرتنا ) ندامتنا ، [ ذكر ] على وجه النداء للمبالغة ، وقال سيبويه : كأنه يقول : أيتها الحسرة هذا أوانك ( على ما فرطنا ) أي : قصرنا ( فيها ) أي : في الطاعة ، وقيل : تركنا في الدنيا من عمل الآخرة .قال محمد بن جرير : الهاء راجعة إلى الصفقة ، وذلك أنه لما تبين لهم خسران صفقتهم ببيعهم الآخرة بالدنيا قالوا : يا حسرتنا على ما فرطنا فيها ، ",
        "char_start": 0,
        "char_end": 1248,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_094_chunk00",
        "verse_key": "6:94",
        "text_ar": "( ولقد جئتمونا فرادى ) هذا خبر من الله أنه يقول للكفار يوم القيامة : ولقد جئتمونا فرادى وحدانا ، لا مال معكم ولا زوج ولا ولد ولا خدم ، وفرادى جمع فردان ، مثل سكران وسكارى ، وكسلان وكسالى ، وقرأ الأعرج فردى بغير ألف مثل سكرى ، ( كما خلقناكم أول مرة ) عراة حفاة غرلا ( وتركتم ) خلفتم ( ما خولناكم ) أعطيناكم من الأموال والأولاد والخدم ، ( وراء ظهوركم ) خلف ظهوركم في الدنيا ، ( وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء ) وذلك أن المشركين زعموا أنهم يعبدون الأصنام لأنهم شركاء الله وشفعاؤهم عنده",
        "char_start": 0,
        "char_end": 832,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_120_chunk00",
        "verse_key": "6:120",
        "text_ar": "( وذروا ظاهر الإثم وباطنه ) يعني : الذنوب كلها لأنها لا تخلو من هذين الوجهين ، قال قتادة : علانيته وسره ، وقال مجاهد : ظاهر الإثم ما يعمله بالجوارح من الذنوب ، وباطنه ما ينويه ويقصده بقلبه كالمصر على الذنب القاصد له .وقال الكلبي : ظاهره الزنا وباطنه المخالة ، وأكثر المفسرين على أن ظاهر الإثم الإعلان بالزنا ، وهم أصحاب الروايات ، وباطنه الاستسرار به ، وذلك أن العرب كانوا يحبون الزنا فكان الشريف منهم يتشرف ، فيسر به ، وغير الشريف لا يبالي به فيظهره ، فحرمهما الله عز وجل ، وقال سعيد بن جبير : ظاهر ",
        "char_start": 0,
        "char_end": 802,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_138_chunk00",
        "verse_key": "6:138",
        "text_ar": "( وقالوا ) يعني : المشركين ، ( هذه أنعام وحرث حجر ) أي حرام ، يعني : ما جعلوا لله ولآلهتهم من الحرث والأنعام على ما مضى ذكره . وقال مجاهد : يعني بالأنعام البحيرة والسائبة والوصيلة والحام ، ( لا يطعمها إلا من نشاء بزعمهم ) يعنون الرجال دون النساء ، ( وأنعام حرمت ظهورها ) يعني الحوامي كانوا لا يركبونها ، ( وأنعام لا يذكرون اسم الله عليها ) أي : يذبحونها باسم الأصنام لا باسم الله ، وقال أبو وائل : معناه لا يحجون عليها ولا يركبونها لفعل الخير ، لأنه لما جرت العادة بذكر اسم الله على فعل الخير عبر بذك",
        "char_start": 0,
        "char_end": 632,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_146_chunk00",
        "verse_key": "6:146",
        "text_ar": "قوله - عز وجل - : ( وعلى الذين هادوا ) يعني اليهود ، ( حرمنا كل ذي ظفر ) وهو ما لم يكن مشقوق الأصابع من البهائم والطير مثل : البعير والنعامة والإوز والبط ، قال القتيبي : هو كل ذي مخلب من الطير وكل ذي حافر من الدواب وحكاه عن بعض المفسرين ، وقال : سمي الحافر ظفرا على الاستعارة .( ومن البقر والغنم حرمنا عليهم شحومهما ) يعني شحوم الجوف ، وهي الثروب ، وشحم الكليتين ، ( إلا ما حملت ظهورهما ) أي : إلا ما علق بالظهر والجنب من داخل بطونهما ، ( أو الحوايا ) وهي المباعر ، واحدتها : حاوية وحوية ، أي : ما حم",
        "char_start": 0,
        "char_end": 1363,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_151_chunk00",
        "verse_key": "6:151",
        "text_ar": "قوله - عز وجل - : ( قل تعالوا أتل ما حرم ربكم عليكم ألا تشركوا به شيئا ) وذلك أنهم سألوا وقالوا : أي شيء الذي حرم الله تعالى؟ فقال - عز وجل - : \" قل تعالوا أتل \" أقرأ ما حرم ربكم عليكم حقا يقينا لا ظنا ولا كذبا كما تزعمون .فإن قيل : ما معنى قوله \" حرم ربكم عليكم ألا تشركوا به شيئا \" والمحرم هو الشرك لا ترك الشرك؟ .قيل : موضع \" أن \" رفع ، معناه هو أن لا تشركوا ، وقيل : محله نصب ، واختلفوا في وجه انتصابه ، قيل : معناه حرم عليكم أن تشركوا به ، و \" لا \" صلة كقوله تعالى : ( ما منعك ألا تسجد ) ( الأعر",
        "char_start": 0,
        "char_end": 1711,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_033_chunk00",
        "verse_key": "7:33",
        "text_ar": "( قل إنما حرم ربي الفواحش ما ظهر منها وما بطن ) يعني : الطواف عراة ( ما ظهر ) طواف الرجال بالنهار ( وما بطن ) طواف النساء بالليل . وقيل : هو الزنا سرا وعلانية .أخبرنا عبد الواحد بن أحمد المليحي أنبأنا أحمد بن عبد الله النعيمي أنبأنا محمد بن يوسف حدثنا محمد بن إسماعيل حدثنا سليمان بن حرب حدثنا شعبة عن عمرو بن مرة عن أبي وائل عن عبد الله قال قلت : أنت سمعت هذا من عبد الله؟ قال : نعم ، فرفعه ، قال : قال رسول الله - صلى الله عليه وسلم - : \" لا أحد أغير من الله ، فلذلك حرم الفواحش ما ظهر منها وما بطن",
        "char_start": 0,
        "char_end": 954,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_172_chunk00",
        "verse_key": "7:172",
        "text_ar": "قوله تعالى : ( وإذ أخذ ربك من بني آدم من ظهورهم ذريتهم ) الآية .أخبرنا أبو الحسن محمد بن محمد السرخسي ، أنا زاهر بن أحمد ، أنا أبو إسحاق الهاشمي ، أنا أبو مصعب ، عن مالك ، عن زيد بن أبي أنيسة ، عن عبد الحميد بن عبد الرحمن ، عن زيد بن الخطاب أخبره عن مسلم بن يسار الجهني أن عمر بن الخطاب رضي الله عنه سئل عن هذه الآية : ( وإذ أخذ ربك من بني آدم من ظهورهم ذريتهم ) الآية . قال عمر بن الخطاب : سمعت رسول الله - صلى الله عليه وسلم - يسأل عنها؟ فقال رسول الله - صلى الله عليه وسلم - \" إن الله - عز وجل - خ",
        "char_start": 0,
        "char_end": 4310,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_004_chunk00",
        "verse_key": "9:4",
        "text_ar": "( إلا الذين عاهدتم من المشركين ) هذا استثناء من قوله : \" براءة من الله ورسوله إلى الذين عاهدتم من المشركين \" إلا من عهد الذين عاهدتم من المشركين ، وهم بنو ضمرة ، حي من كنانة ، أمر الله تعالى رسوله صلى الله عليه وسلم بإتمام عهدهم إلى مدتهم ، وكان قد بقي من مدتهم تسعة أشهر ، وكان السبب فيه : أنهم لم ينقضوا العهد ، وهذا معنى قوله تعالى : ( ثم لم ينقصوكم شيئا ) من عهدهم الذي عاهدتموهم عليه ، ( ولم يظاهروا ) لم يعاونوا ، ( عليكم أحدا ) من عدوكم . وقرأ عطاء بن يسار : \" لم ينقضوكم \" بالضاد المعجمة من ن",
        "char_start": 0,
        "char_end": 625,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_008_chunk00",
        "verse_key": "9:8",
        "text_ar": "قوله تعالى : ( كيف وإن يظهروا عليكم ) هذا مردود على الآية الأولى تقديره : كيف يكون لهم عهد عند الله كيف وإن يظهروا عليكم! ( لا يرقبوا فيكم إلا ولا ذمة ) قال الأخفش : كيف لا تقتلونهم وهم إن يظهروا عليكم أي : يظفروا بكم ، لا يرقبوا : لا يحفظوا؟ وقال الضحاك : لا ينتظروا . وقال قطرب : لا يراعوا فيكم إلا . قال ابن عباس والضحاك : قرابة . وقال يمان : رحما . وقال قتادة : الإل الحلف . وقال السدي : هو العهد . وكذلك الذمة ، إلا أنه كرر لاختلاف اللفظين . وقال أبو مجلز ومجاهد : الإل هو الله عز وجل . وكان عبي",
        "char_start": 0,
        "char_end": 1160,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "( هو الذي أرسل رسوله ) يعني : الذي يأبى إلا إتمام دينه هو الذي أرسل رسوله محمدا صلى الله عليه وسلم ، ( بالهدى ) قيل : بالقرآن . وقيل : ببيان الفرائض ، ( ودين الحق ) وهو الإسلام ، ( ليظهره ) ليعليه وينصره ، ( على الدين كله ) على سائر الأديان ، ( ولو كره المشركون ) .واختلفوا في معنى هذه الآية : فقال ابن عباس : الهاء عائدة إلى رسول الله صلى الله عليه وسلم أي : ليعلمه شرائع الدين كلها فيظهره عليها حتى لا يخفى عليه منها شيء .وقال الآخرون : الهاء راجعة إلى دين الحق ، وظهوره على الأديان هو أن لا يدان ا",
        "char_start": 0,
        "char_end": 2215,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_035_chunk00",
        "verse_key": "9:35",
        "text_ar": "( يوم يحمى عليها في نار جهنم ) أي : تدخل النار فيوقد عليها أي على الكنوز ، ( فتكوى بها ) فتحرق بها ، ( جباههم ) أي : جباه كانزيها ، ( وجنوبهم وظهورهم ) روي عن ابن مسعود قال : إنه لا يوضع دينار على دينار ولا درهم على درهم ، ولكن يوسع جلده حتى يوضع كل دينار ودرهم في موضع على حدة .وسئل أبو بكر الوراق : لم خص الجباه والجنوب والظهور بالكي؟ قال : لأن الغني صاحب الكنز إذا رأى الفقير قبض وجهه ، وزوى ما بين عينيه ، وولاه ظهره ، وأعرض عنه بكشحه .قوله تعالى : ( هذا ما كنزتم ) أي : يقال لهم : هذا ما كنزتم ،",
        "char_start": 0,
        "char_end": 700,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_048_chunk00",
        "verse_key": "9:48",
        "text_ar": "( لقد ابتغوا الفتنة من قبل ) أي : طلبوا صد أصحابك عن الدين وردهم إلى الكفر ، وتخذيل الناس عنك قبل هذا اليوم ، كفعل عبد الله بن أبي يوم أحد حين انصرف عنك بأصحابه . ( وقلبوا لك الأمور ) وأجالوا فيك وفي إبطال دينك الرأي ، بالتخذيل عنك وتشتيت أمرك ، ( حتى جاء الحق ) النصر والظفر ، ( وظهر أمر الله ) دين الله ، ( وهم كارهون ) .",
        "char_start": 0,
        "char_end": 323,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_011_092_chunk00",
        "verse_key": "11:92",
        "text_ar": "( يا قوم أرهطي أعز عليكم من الله ) أي : مكان رهطي أهيب عندكم من الله ، أي : إن تركتم قتلي لمكان رهطي فالأولى أن تحفظوني في الله . ( واتخذتموه وراءكم ظهريا ) أي : نبذتم أمر الله وراء ظهوركم وتركتموه ، ( إن ربي بما تعملون محيط ) .",
        "char_start": 0,
        "char_end": 228,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_013_033_chunk00",
        "verse_key": "13:33",
        "text_ar": "( أفمن هو قائم على كل نفس بما كسبت ) أي : حافظها ، ورازقها ، وعالم بها ، ومجازيها بما عملت . وجوابه محذوف ، تقديره : كمن ليس بقائم بل عاجز عن نفسه .( وجعلوا لله شركاء قل سموهم ) بينوا أسماءهم .وقيل : صفوهم ثم انظروا : هل هي أهل لأن تعبد ؟( أم تنبئونه ) أي : تخبرون الله تعالى : ( بما لا يعلم في الأرض ) فإنه لا يعلم لنفسه شريكا ولا في الأرض إلها غيره ( أم بظاهر ) يعني : أم تتعلقون بظاهر ( من القول ) مسموع ، وهو في الحقيقة باطل لا أصل له .وقيل : بباطل من القول : قال الشاعر :وعيرني الواشون أني أحبها",
        "char_start": 0,
        "char_end": 927,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_017_088_chunk00",
        "verse_key": "17:88",
        "text_ar": "قوله جل وعلا ( قل لئن اجتمعت الإنس والجن على أن يأتوا بمثل هذا القرآن لا يأتون بمثله ) لا يقدرون على ذلك ( ولو كان بعضهم لبعض ظهيرا ) عونا ومظاهرا .نزلت حين قال الكفار : لو نشاء لقلنا مثل هذا فكذبهم الله تعالىفالقرآن معجز في النظم والتأليف والإخبار عن الغيوب وهو كلام في أعلى طبقات البلاغة لا يشبه كلام الخلق لأنه غير مخلوق ولو كان مخلوقا لأتوا بمثله",
        "char_start": 0,
        "char_end": 350,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "( ثم انتم هولاء تقتلون انفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالاثم والعدوان وان ياتوكم اساري تفادوهم وهو محرم عليكم اخراجهم ) قال محمد بن اسحاق بن يسار : حدثني محمد بن ابي محمد ، عن سعيد بن جبير او عكرمه عن ابن عباس : ( ثم انتم هولاء تقتلون انفسكم ) الايه ، قال : انبهم الله من فعلهم ، وقد حرم عليهم في التوراه سفك دمايهم وافترض عليهم فيها فداء اسراهم ، فكانوا فريقين : طايفه منهم بنو قينقاع وانهم حلفاء الخزرج ، والنضير ، وقريظه وانهم حلفاء الاوس ، فكانوا اذا كانت بين الاوس والخزرج حرب",
        "char_start": 0,
        "char_end": 3715,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_101_chunk00",
        "verse_key": "2:101",
        "text_ar": "وقال هاهنا : ( ولما جاءهم رسول من عند الله مصدق لما معهم نبذ فريق من الذين اوتوا الكتاب كتاب الله وراء ظهورهم كانهم لا يعلمون ) اي : اطرح طايفه منهم كتاب الله الذي بايديهم ، مما فيه البشاره بمحمد صلي الله عليه وسلم وراء ظهورهم ، اي : تركوها ، كانهم لا يعلمون ما فيها ، واقبلوا علي تعلم السحر واتباعه . ولهذا ارادوا كيدا برسول الله صلي الله عليه وسلم وسحروه في مشط ومشاطه وجف طلعه ذكر ، تحت راعوثه بير ذي اروان . وكان الذي تولي ذلك منهم رجل ، يقال له : لبيد بن الاعصم ، لعنه الله ، فاطلع الله علي ذلك ",
        "char_start": 0,
        "char_end": 999,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_189_chunk00",
        "verse_key": "2:189",
        "text_ar": "قال العوفي عن ابن عباس : سال الناس رسول الله صلي الله عليه وسلم عن الاهله ، فنزلت هذه الايه : ( يسالونك عن الاهله قل هي مواقيت للناس [ والحج ] ) يعلمون بها حل دينهم ، وعده نسايهم ، ووقت حجهم .وقال ابو جعفر ، عن الربيع ، عن ابي العاليه : بلغنا انهم قالوا : يا رسول الله ، لم خلقت الاهله ؟ فانزل الله ( يسالونك عن الاهله قل هي مواقيت للناس ) يقول : جعلها الله مواقيت لصوم المسلمين وافطارهم ، وعده نسايهم ، ومحل دينهم .وكذا روي عن عطاء ، والضحاك ، وقتاده ، والسدي ، والربيع بن انس ، نحو ذلك .وقال عبد ال",
        "char_start": 0,
        "char_end": 2949,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_187_chunk00",
        "verse_key": "3:187",
        "text_ar": "هذا توبيخ من الله وتهديد لاهل الكتاب ، الذين اخذ عليهم العهد علي السنه الانبياء ان يومنوا بمحمد صلي الله عليه وسلم ، وان ينوهوا بذكره في الناس ليكونوا علي اهبه من امره ، فاذا ارسله الله تابعوه ، فكتموا ذلك وتعوضوا عما وعدوا عليه من الخير في الدنيا والاخره بالدون الطفيف ، والحظ الدنيوي السخيف ، فبيست الصفقه صفقتهم ، وبيست البيعه بيعتهم .وفي هذا تحذير للعلماء ان يسلكوا مسلكهم فيصيبهم ما اصابهم ، ويسلك بهم مسلكهم ، فعلي العلماء ان يبذلوا ما بايديهم من العلم النافع ، الدال علي العمل الصالح ، ولا يكت",
        "char_start": 0,
        "char_end": 647,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_031_chunk00",
        "verse_key": "6:31",
        "text_ar": "يقول تعالي مخبرا عن خساره من كذب بلقاء الله وعن خيبته اذا جاءته الساعه بغته ، وعن ندامته علي ما فرط من العمل ، وما اسلف من قبيح الفعال ولهذا قال : ( حتي اذا جاءتهم الساعه بغته قالوا يا حسرتنا علي ما فرطنا فيها )وهذا الضمير يحتمل عوده علي الحياه [ الدنيا ] وعلي الاعمال ، وعلي الدار الاخره ، اي : في امرها .وقوله ( وهم يحملون اوزارهم علي ظهورهم الا ساء ما يزرون ) اي : يحملون . وقال قتاده : يعملون .[ و ] قال ابن ابي حاتم : حدثنا ابو سعيد الاشج ، حدثنا ابو خالد ، عن عمرو بن قيس ، عن ابي مرزوق قال : و",
        "char_start": 0,
        "char_end": 1411,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_094_chunk00",
        "verse_key": "6:94",
        "text_ar": "وقوله : ( ولقد جيتمونا فرادي كما خلقناكم اول مره ) اي : يقال لهم يوم معادهم هذا ، كما قال ( وعرضوا علي ربك صفا لقد جيتمونا كما خلقناكم اول مره ) [ الكهف : 48 ] ، اي : كما بداناكم اعدناكم ، وقد كنتم تنكرون ذلك وتستبعدونه ، فهذا يوم البعث .وقوله : ( وتركتم ما خولناكم ) اي : من النعم والاموال التي اقتنيتموها في الدار الدنيا ( وراء ظهوركم ) وثبت في الصحيح ان رسول الله صلي الله عليه وسلم قال : \" يقول ابن ادم : مالي مالي ، وهل لك من مالك الا ما اكلت فافنيت ، او لبست فابليت ، او تصدقت فامضيت ، وما سوي ",
        "char_start": 0,
        "char_end": 2304,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_120_chunk00",
        "verse_key": "6:120",
        "text_ar": "قال مجاهد : ( وذروا ظاهر الاثم وباطنه ) معصيته في السر والعلانيه - وفي روايه عنه قال هو ما ينوي مما هو عامل .وقال : قتاده : ( وذروا ظاهر الاثم وباطنه ) اي : قليله وكثيره ، سره وعلانيته .وقال السدي : ظاهره : الزنا مع البغايا ذوات الرايات ، وباطنه : الزنا مع الخليله والصدايق والاخدان .وقال عكرمه : ظاهره : نكاح ذوات المحارم .والصحيح ان الايه عامه في ذلك كله ، وهي كقوله تعالي : ( قل انما حرم ربي الفواحش ما ظهر منها وما بطن والاثم والبغي بغير الحق وان تشركوا بالله ما لم ينزل به سلطانا ) الايه [ الاعر",
        "char_start": 0,
        "char_end": 890,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_138_chunk00",
        "verse_key": "6:138",
        "text_ar": "قال علي بن ابي طلحه ، عن ابن عباس : \" الحجر \" : الحرام ، مما حرموا الوصيله ، وتحريم ما حرموا .وكذلك قال مجاهد ، والضحاك ، والسدي ، وقتاده ، وعبد الرحمن بن زيد بن اسلم .وقال قتاده : ( وقالوا هذه انعام وحرث حجر ) الايه : تحريم كان عليهم من الشياطين في اموالهم ، وتغليظ وتشديد ، وكان ذلك من الشياطين ، ولم يكن من الله تعالي .وقال ابن زيد بن اسلم : ( حجر ) انما احتجزوها لالهتهم .وقال السدي : ( لا يطعمها الا من نشاء بزعمهم ) يقولون : حرام ان نطعم الا من شينا .وهذه الايه الكريمه كقوله تعالي : ( قل ارايت",
        "char_start": 0,
        "char_end": 1411,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_146_chunk00",
        "verse_key": "6:146",
        "text_ar": "قال ابن جرير : يقول تعالي : وحرمنا علي اليهود ( كل ذي ظفر ) وهو البهايم والطير ما لم يكن مشقوق الاصابع ، كالابل والنعام والاوز والبط . قال علي بن ابي طلحه ، عن ابن عباس : ( وعلي الذين هادوا حرمنا كل ذي ظفر ) وهو البعير والنعامه . وكذا قال مجاهد ، والسدي في روايه .وقال سعيد بن جبير : هو الذي ليس بمنفرج الاصابع ، وفي روايه عنه : كل شيء متفرق الاصابع ، ومنه الديك .وقال قتاده في قوله : ( وعلي الذين هادوا حرمنا كل ذي ظفر ) وكان يقال : البعير والنعامه واشياء من الطير والحيتان . وفي روايه : البعير والن",
        "char_start": 0,
        "char_end": 4660,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_151_chunk00",
        "verse_key": "6:151",
        "text_ar": "قال داود الاودي ، عن الشعبي ، عن علقمه ، عن ابن مسعود ، رضي الله عنه ، قال : من اراد ان يقرا صحيفه رسول الله صلي الله عليه وسلم التي عليها خاتمه ، فليقرا هولاء الايات : ( قل تعالوا اتل ما حرم ربكم عليكم الا تشركوا به شييا ) الي قوله : ( لعلكم تتقون ) .وقال الحاكم في مستدركه : حدثنا بكر بن محمد الصيرفي بمرو ، حدثنا عبد الصمد بن الفضل ، حدثنا مالك بن اسماعيل النهدي ، حدثنا اسراييل ، عن ابي اسحاق ، عن عبد الله بن خليفه قال : سمعت ابن عباس يقول : في الانعام ايات محكمات هن ام الكتاب ، ثم قرا : ( قل ت",
        "char_start": 0,
        "char_end": 8613,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_033_chunk00",
        "verse_key": "7:33",
        "text_ar": "قال الامام احمد : حدثنا ابو معاويه ، حدثنا الاعمش ، عن شقيق ، عن عبد الله قال : قال رسول الله صلي الله عليه وسلم : \" لا احد اغير من الله ، فلذلك حرم الفواحش ما ظهر منها وما بطن ، ولا احد احب اليه المدح من الله \"اخرجاه في الصحيحين ، من حديث سليمان بن مهران الاعمش ، عن شقيق عن ابي وايل ، عن عبد الله بن مسعود وتقدم الكلام في سوره الانعام علي ما يتعلق بالفواحش ما ظهر منها وما بطن .وقوله : ( والاثم والبغي بغير الحق ) قال السدي : اما الاثم فالمعصيه ، والبغي ان تبغي علي الناس بغير الحق .وقال مجاهد : ال",
        "char_start": 0,
        "char_end": 976,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_172_chunk00",
        "verse_key": "7:172",
        "text_ar": "يخبر تعالي انه استخرج ذريه بني ادم من اصلابهم ، شاهدين علي انفسهم ان الله ربهم ومليكهم ، وانه لا اله الا هو . كما انه تعالي فطرهم علي ذلك وجبلهم عليه ، قال تعالي : ( فاقم وجهك للدين حنيفا فطره الله التي فطر الناس عليها لا تبديل لخلق الله ) [ الروم : 30 ] وفي الصحيحين عن ابي هريره ، رضي الله عنه ، قال : قال رسول الله صلي الله عليه وسلم : \" كل مولود يولد علي الفطره - وفي روايه : علي هذه المله - فابواه يهودانه ، وينصرانه ، ويمجسانه ، كما تولد البهيمه بهيمه جمعاء ، هل تحسون فيها من جدعاء \" وفي صحيح ",
        "char_start": 0,
        "char_end": 13139,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_004_chunk00",
        "verse_key": "9:4",
        "text_ar": "هذا استثناء من ضرب مده التاجيل باربعه اشهر ، لمن له عهد مطلق ليس بموقت ، فاجله ، اربعه اشهر يسيح في الارض ، يذهب فيها لينجو بنفسه حيث شاء ، الا من له عهد موقت ، فاجله الي مدته المضروبه التي عوهد عليها ، وقد تقدمت الاحاديث : ومن كان له عهد مع رسول الله - صلي الله عليه وسلم - فعهده الي مدته وذلك بشرط الا ينقض المعاهد عهده ، ولم يظاهر علي المسلمين احدا ، اي : يمالي عليهم من سواهم ، فهذا الذي يوفي له بذمته وعهده الي مدته ؛ ولهذا حرض الله تعالي علي الوفاء بذلك فقال : ( ان الله يحب المتقين ) اي : المو",
        "char_start": 0,
        "char_end": 512,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_008_chunk00",
        "verse_key": "9:8",
        "text_ar": "يقول تعالي محرضا للمومنين علي معاداه المشركين والتبري منهم ، ومبينا انهم لا يستحقون ان يكون لهم عهد لشركهم بالله وكفرهم برسول الله ولو انهم اذ ظهروا علي المسلمين واديلوا عليهم ، لم يبقوا ولم يذروا ، ولا راقبوا فيهم الا ولا ذمه .قال علي بن ابي طلحه ، وعكرمه ، والعوفي عن ابن عباس : \" الال \" : القرابه ، \" والذمه \" : العهد . وكذا قال الضحاك والسدي ، كما قال تميم بن مقبل :افسد الناس خلوف خلفوا قطعوا الال واعراق الرحموقال حسان بن ثابت - رضي الله عنه - :وجدناهم كاذبا الهم وذو الال والعهد لا يكذبوقال اب",
        "char_start": 0,
        "char_end": 1023,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "ثم قال تعالي : ( هو الذي ارسل رسوله بالهدي ودين الحق ) فالهدي : هو ما جاء به من الاخبارات الصادقه ، والايمان الصحيح ، والعلم النافع . ودين الحق : هي الاعمال [ الصالحه ] الصحيحه النافعه في الدنيا والاخره .( ليظهره علي الدين كله ) اي : علي ساير الاديان ، كما ثبت في الصحيح عن رسول الله - صلي الله عليه وسلم - انه قال : ان الله زوي لي الارض مشارقها ومغاربها ، وسيبلغ ملك امتي ما زوي لي منها .وقال الامام احمد : حدثنا محمد بن جعفر ، حدثنا شعبه ، عن محمد بن ابي يعقوب : سمعت شقيق بن حيان يحدث عن مسعود بن ",
        "char_start": 0,
        "char_end": 3079,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_035_chunk00",
        "verse_key": "9:35",
        "text_ar": "وقوله تعالي : ( يوم يحمي عليها في نار جهنم فتكوي بها جباههم وجنوبهم وظهورهم هذا ما كنزتم لانفسكم فذوقوا ما كنتم تكنزون ) اي : يقال لهم هذا الكلام تبكيتا وتقريعا وتهكما ، كما في قوله : ( ثم صبوا فوق راسه من عذاب الحميم ذق انك انت العزيز الكريم ) [ الدخان : 48 ، 49 ] اي : هذا بذاك ، وهو الذي كنتم تكنزون لانفسكم ؛ ولهذا يقال : من احب شييا وقدمه علي طاعه الله ، عذب به . وهولاء لما كان جمع هذه الاموال اثر عندهم من رضا الله عنهم ، عذبوا بها ، كما كان ابو لهب - لعنه الله - جاهدا في عداوه الرسول ، صلوات",
        "char_start": 0,
        "char_end": 6248,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_048_chunk00",
        "verse_key": "9:48",
        "text_ar": "يقول تعالي محرضا لنبيه عليه السلام علي المنافقين : ( لقد ابتغوا الفتنه من قبل وقلبوا لك الامور ) اي : لقد اعملوا فكرهم واجالوا اراءهم في كيدك وكيد اصحابك وخذلان دينك واخماله مده طويله ، وذلك اول مقدم النبي - صلي الله عليه وسلم - المدينه رمته العرب عن قوس واحده ، وحاربته يهود المدينه ومنافقوها ، فلما نصره الله يوم بدر واعلي كلمته ، قال عبد الله بن ابي واصحابه : هذا امر قد توجه . فدخلوا في الاسلام ظاهرا ، ثم كلما اعز الله الاسلام واهله غاظهم ذلك وساءهم ؛ ولهذا قال تعالي : ( حتي جاء الحق وظهر امر ا",
        "char_start": 0,
        "char_end": 516,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_011_092_chunk00",
        "verse_key": "11:92",
        "text_ar": "( قال ياقوم ارهطي اعز عليكم من الله ) يقول : اتتركوني لاجل قومي ، ولا تتركوني اعظاما لجناب الله ان تنالوا نبيه بمساءه . وقد اتخذتم جانب الله ( وراءكم ظهريا ) اي : نبذتموه خلفكم ، لا تطيعونه ولا تعظمونه ، ( ان ربي بما تعملون محيط ) اي : هو يعلم جميع اعمالكم وسيجزيكم بها .",
        "char_start": 0,
        "char_end": 271,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_013_033_chunk00",
        "verse_key": "13:33",
        "text_ar": "يقول تعالي : ( افمن هو قايم علي كل نفس بما كسبت ) اي : حفيظ عليم رقيب علي كل نفس منفوسه ، يعلم ما يعمل العاملون من خير وشر ، ولا يخفي عليه خافيه ، ( وما تكون في شان وما تتلو منه من قران ولا تعملون من عمل الا كنا عليكم شهودا اذ تفيضون فيه ) [ يونس : 61 ] وقال تعالي : ( وما تسقط من ورقه الا يعلمها ) [ الانعام : 59 ] وقال ( وما من دابه في الارض الا علي الله رزقها ويعلم مستقرها ومستودعها كل في كتاب مبين ) [ هود : 6 ] وقال ( سواء منكم من اسر القول ومن جهر به ومن هو مستخف بالليل وسارب بالنهار ) [ الرع",
        "char_start": 0,
        "char_end": 2052,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_017_088_chunk00",
        "verse_key": "17:88",
        "text_ar": "ثم نبه تعالي علي شرف هذا القران العظيم ، فاخبر انه لو اجتمعت الانس والجن كلهم ، واتفقوا علي ان ياتوا بمثل ما انزله علي رسوله ، لما اطاقوا ذلك ولما استطاعوه ، ولو تعاونوا وتساعدوا وتظافروا ، فان هذا امر لا يستطاع ، وكيف يشبه كلام المخلوقين كلام الخالق ، الذي لا نظير له ، ولا مثال له ، ولا عديل له ؟ !وقد روي محمد بن اسحاق عن محمد بن ابي محمد ، عن سعيد [ بن جبير ] او عكرمه ، عن ابن عباس : ان هذه الايه نزلت في نفر من اليهود ، جاءوا رسول الله صلي الله عليه وسلم فقالوا له : انا ناتيك بمثل ما جيتنا به ",
        "char_start": 0,
        "char_end": 631,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "«ثم أنتم» يا «هؤلاء تقتلون أنفسكم» بقتل بعضكم بعضا «وتخرجون فريقا منكم من ديارهم تَظَّاهَرُونَ» فيه إدغام التاء في الأصل في الظاء، وفي قراءة بالتخفيف على حذفها تتعاونون «عليهم بالإثم» بالمعصية «والعدوان» الظلم «وإن يأتوكم أسارى» وفي قراءة أسرى «تَفْدُوهُمْ» وفي قراءة «تُفَادُوهُمْ» تنقذوهم من الأسر بالمال أو غيره وهو مما عهد إليهم «وهو» أي الشأن «محرَّم عليكم إخراجهم» متصل بقوله وتخرجون والجملة بينهما اعتراض: أي كما حرم ترك الفداء، وكانت قريظةُ حالفوا الأوسَ، والنضيرُ الخزرجَ فكان كل فريق يقاتل ",
        "char_start": 0,
        "char_end": 954,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_101_chunk00",
        "verse_key": "2:101",
        "text_ar": "«ولما جاءهم رسول من عند الله» محمد «مصدق لما معهم نبذ فريق من الذين أوتوا الكتاب كتاب الله» أي التوراة «وراء ظهورهم» أي لم يعملوا بما فيها من الإيمان بالرسول وغيره «كأنهم لا يعلمون» ما فيها من أنه نبي حق أو أنها كتاب الله.",
        "char_start": 0,
        "char_end": 222,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_189_chunk00",
        "verse_key": "2:189",
        "text_ar": "«يسألونك» يا محمد «عن الأهلة» جمع هلال لمَ تبدو دقيقة ثم تزيد حتى تمتلئ نورا ثم تعود كما بدت ولا تكون على حالة واحدة كالشمس «قل» لهم «هي مواقيت» جمع ميقات «للناس» يعلمون بها أوقات زرعهم ومتاجرهم وعُدد نسائهم وصيامهم وإفطارهم «والحج» عطف على الناس أي يعلم بها وقته فلو استمرت على حالة لم يعرف ذلك «وليس البر بأن تأتوا البيوت من ظهورها» في الإحرام كغيره بأن تنقبوا فيها نقبا تدخلون منه وتخرجون وتتركوا الباب وكانوا يفعلون ذلك ويزعمونه برّا «ولكنَّ البرَّ» أي ذا البِر «من اتقى» الله بترك مخالفته «وأتوا",
        "char_start": 0,
        "char_end": 565,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_187_chunk00",
        "verse_key": "3:187",
        "text_ar": "«و» اذكر «إذ أخذ الله ميثاق الذين أوتوا الكتاب» أي العهد عليهم في التوراة «لَيُبَيِّنَنَّهُ» أي الكتاب «للناس ولا يكتمونه» أي الكتاب بالياء والتاء في الفعلين «فنبذوه» طرحوا الميثاق «وراء ظهورهم» فلم يعملوا به «واشتروا به» أخذوا بدله «ثمنا قليلا» من الدنيا من سفلتهم برياستهم في العلم فكتموه خوف فوته عليهم «فبئس ما يشترون» شراؤهم هذا.",
        "char_start": 0,
        "char_end": 334,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_031_chunk00",
        "verse_key": "6:31",
        "text_ar": "«قد خسر الذين كذَّبوا بلقاء الله» بالبعث «حتى» غاية للتكذيب «إذا جاءتهم الساعة» القيامة «بغتة» فجأة «قالوا يا حسرتنا» هي شدة التألم ونداؤها مجاز أي هذا أوانك فاحضري «على ما فرَّطنا» قصَّرنا «فيها» أي الدنيا «وهم يحملون أوزارهم على ظهورهم» بأن تأتيهم عند البعث في أقبح شيء صورة وأنتنه ريحا فتركبهم «ألا ساء» بئس «ما يزرون» يحملونه حملهم ذلك.",
        "char_start": 0,
        "char_end": 340,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_094_chunk00",
        "verse_key": "6:94",
        "text_ar": "«و» يقال لهم إذا بعثوا «لقد جئتمونا فرادى» منفردين عن الأهل والمال والولد «كما خلقناكم أول مرة» أي حفاة عراة غرلا «وتركتم ما خولناكم» أعطيناكم من الأموال «وراء ظهوركم» في الدنيا بغير اختباركم «و» يقال لهم توبيخا «ما نرى معكم شفعاءكم» الأصنام «الذين زعمتم أنهم فيكم» أي في استحقاق عبادتكم «شركاء» لله «لقد تقطع بينكُمْ» وصلكم أي تشتيت جمعكم وفي قراءة بالنصب ظرف أي وصلكم بينكم «وضل» ذهب «عنكم ما كنتم تزعمون» في الدنيا من شفاعتها.",
        "char_start": 0,
        "char_end": 429,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_120_chunk00",
        "verse_key": "6:120",
        "text_ar": "«وذروا» أُتركوا «ظاهر الإثم وباطنه» علانيته وسره والإثم قيل الزنا، وقيل كل معصية «إن الذين يكسبون الإثم سيُجزون» في الآخرة «بما كانوا يقترفون» يكتسبون.",
        "char_start": 0,
        "char_end": 151,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_138_chunk00",
        "verse_key": "6:138",
        "text_ar": "«وقالوا هذه أنعام وحرث حجر» حرام «لا يطعمها إلا من شاء» من خَدَمَةِ الأوثان وغيرهم «بزَعمهم» أي لا حجة لهم فيه «وأنعام حرمت ظهورها» فلا تركب كالسوائب والحوامي «وأنعام لا يذكرون اسم الله عليها» عند ذبحها بل يذكرون اسم أصنامهم ونسبوا ذلك إلى الله «افتراء عليه سيجزيهم بما كانوا يفترون» عليه.",
        "char_start": 0,
        "char_end": 289,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_146_chunk00",
        "verse_key": "6:146",
        "text_ar": "«وعلى الذين هادوا» أي اليهود «حرَّمنا كل ذي ظفر» وهو ما لم تفرق أصابعه كالإبل والنعام «ومن البقر والغنم حرمنا عليهم شحومهما» الثروب وشحم الكلي «إلا ما حملت ظهورهما» أي ما علق بها منه «أو» حملته «الحوايا» الأمعاء جمع حاوياء أو حاوية «أو ما اختلط بعظم» منه وهو شحم الإلية فإنه أحل لهم «ذلك» التحريم «جزيناهم» به «ببغيهم» بسبب ظلمهم بما سبق في سورة النساء «وإنا لصادقون» في أخبارنا ومواعيدنا.",
        "char_start": 0,
        "char_end": 389,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_151_chunk00",
        "verse_key": "6:151",
        "text_ar": "«قل تعالوا أتل» أقرأ «ما حرم ربكم عليكم أ» ن مفسرة «لا تشركوا به شيئا و» أحسنوا «بالوالدين إحسانا ولا تقتلوا أولادكم» بالوأد «من» أجل «إملاق» فقر تخافونه «نحن نرزقكم وإياكم ولا تقربوا الفواحش» الكبائر كالزنا «ما ظهر منها وما بطن» أي علانيتها وسرها «ولا تقتلوا النفس التي حرَّم الله إلا بالحق» كالقود وحد الردة ورجم المحصن «ذلكم» المذكور «وصاكم به لعلكم تعقلون» تتدبرون.",
        "char_start": 0,
        "char_end": 369,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_033_chunk00",
        "verse_key": "7:33",
        "text_ar": "«قل إنما حرَّم ربي الفواحش» الكبائر كالزنا «ما ظهر منها وما بطن» أي جهرها وسرها «والإثم» المعصية «والبغي» على الناس «بغير الحق» وهو الظلم «وأن تشركوا بالله ما لم ينزل به» بإشراكه «سلطانا» حجة «وأن تقولوا على الله ما لا تعلمون» من تحريم ما لم يحرم وغيره.",
        "char_start": 0,
        "char_end": 253,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_172_chunk00",
        "verse_key": "7:172",
        "text_ar": "«و» اذكر «إذ» حين «أخذ ربُّك من بني آدم من ظهورهم» بدل اشتمال مما قبله بإعادة الجار «ذرِّيّاتهم» بأن أخرج بعضهم من صلب بعض من صلب آدم نسلا بعد نسل كنحو ما يتوالدون كالذّر بنعمان يوم عرفة ونصب لهم دلائل على ربوبيته وركب فيهم عقلا «وأشْهدهم على أنفسهم» قال «ألست بربكم؟ قالوا بلى» أنت ربنا «شهدنا» بذلك والإشهاد لـ «أن» لا «يقولوا» بالياء والتاء في الموضعين، أي الكفار «يوم القيامة إنا كنَّا عن هذا» التوحيد «غافلين» لا نعرفه.",
        "char_start": 0,
        "char_end": 424,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_004_chunk00",
        "verse_key": "9:4",
        "text_ar": "«إلا الذين عاهدتم من المشركين ثم لم ينقصوكم شيئا» من شروط العهد «ولم يظاهروا» يعاونوا «عليكم أحدا» من الكفار «فأتموا إليهم عهدهم إلى» انقضاء «مدتهم» التي عاهدتم عليها «إن الله يحب المتقين» بإتمام العهود.",
        "char_start": 0,
        "char_end": 203,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_008_chunk00",
        "verse_key": "9:8",
        "text_ar": "«كيف» يكون لهم عهد «وإن يظهروا عليكم» يظفروا بكم «لا يرقبوا» يراعوا «فيكم إلاّ» قرابة «ولا ذمة» عهدا بل يؤذوكم ما استطاعوا وجملة الشرط حال «يرضونكم بأفواههم» بكلامهم الحسن «وتأبى قلوبهم» الوفاء به «وأكثرهم فاسقون» ناقضون للعهد.",
        "char_start": 0,
        "char_end": 227,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "«هو الذي أرسل رسوله» محمدا صلى الله عليه وسلم «بالهدى ودين الحق ليُظهره» يعليه «على الدين كله» جميع الأديان المخالفة له «ولو كره المشركون» ذلك.",
        "char_start": 0,
        "char_end": 143,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_035_chunk00",
        "verse_key": "9:35",
        "text_ar": "«يوم يحمى عليها في نار جهنم فتكوى» تحرق «بها جباههم وجنوبهم وظهورهم» وتوسع جلودهم حتى توضع عليها كلها ويقال لهم «هذا ما كنزتم لأنفسكم فذوقوا ما كنتم تكنزون» أي جزاءه.",
        "char_start": 0,
        "char_end": 166,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_048_chunk00",
        "verse_key": "9:48",
        "text_ar": "«لقد ابتغوا» لك «الفتنة من قبل» أول ما قدمت المدينة «وقلَّبوا لك الأمور» أي أحالوا الفكر في كيدك وإبطال دينك «حتى جاء الحق» النصر «وظهر» عَزَّ «أمر الله» دينه «وهم كارهون» له فدخلوا فيه ظاهرا.",
        "char_start": 0,
        "char_end": 192,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_011_092_chunk00",
        "verse_key": "11:92",
        "text_ar": "«قال يا قوم أرهطي أعز عليكم من الله» فتتركوا قتلي لأجلهم ولا تحفظوني لله «واتخذتموه» أي الله «وراءكم ظهريا» منبوذا خلف ظهوركم لا تراقبونه «إن ربي بما تعملون محيط» علما فيجازيكم.",
        "char_start": 0,
        "char_end": 177,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_013_033_chunk00",
        "verse_key": "13:33",
        "text_ar": "«أفمن هو قائم» رقيب «على كل نفس بما كسبت» عملت من خير وشر وهو الله كمن ليس كذلك من الأصنام لا، دل على هذا «وجعلوا الله شركاء قل سمّوهم» له من هم؟ «أم» بل أ «تنبئونه» تخبرون الله «بما» أي بشريك «لا يعلمـ» ـه «في الأرض» استفهام إنكار أي لا شريك له إذ لو كان لعلمه تعالى عن ذلك «أم» بل تسمونهم شركاء «بظاهر من القول» بظن باطل لا حقيقة له في الباطن «بل زُيّن للذين كفروا مكرهم» كفرهم «وصدوا عن السبيل» طريق الهدى «ومن يضلل الله فما له من هاد».",
        "char_start": 0,
        "char_end": 439,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_017_088_chunk00",
        "verse_key": "17:88",
        "text_ar": "(قل لئن اجتمعت الإنس والجن على أن يأتوا بمثل هذا القرآن) في الفصاحة والبلاغة. (لا يأتون بمثله ولو كان بعضهم لبعض ظهيرا) معينا نزل ردا لقولهم \"\" ولو نشاء لقلنا مثل هذا \"\".",
        "char_start": 0,
        "char_end": 170,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "ثم أنتم يا هؤلاء يقتل بعضكم بعضًا، ويُخرج بعضكم بعضًا من ديارهم، ويَتَقَوَّى كل فريق منكم على إخوانه بالأعداء بغيًا وعدوانًا. وأن يأتوكم أسارى في يد الأعداء سعيتم في تحريرهم من الأسر، بدفع الفدية، مع أنه محرم عليكم إخراجهم من ديارهم. ما أقبح ما تفعلون حين تؤمنون ببعض أحكام التوراة وتكفرون ببعضها! فليس جزاء مَن يفعل ذلك منكم إلا ذُلا وفضيحة في الدنيا. ويوم القيامة يردُّهم الله إلى أفظع العذاب في النار. وما الله بغافل عما تعملون.",
        "char_start": 0,
        "char_end": 431,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_101_chunk00",
        "verse_key": "2:101",
        "text_ar": "ولما جاءهم محمد رسول الله صلى الله عليه وسلم بالقرآن الموافق لما معهم من التوراة طرح فريق منهم كتاب الله، وجعلوه وراء ظهورهم، شأنهم شأن الجهال الذين لا يعلمون حقيقته.",
        "char_start": 0,
        "char_end": 166,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_189_chunk00",
        "verse_key": "2:189",
        "text_ar": "يسالك اصحابك -ايها النبي-: عن الاهله وتغيُّر احوالها، قل لهم: جعل اللهُ الاهله علامات يعرف بها الناس اوقات عباداتهم المحدده بوقت مثل الصيام والحج، ومعاملاتهم. وليس الخير ما تعودتم عليه في الجاهليه واول الاسلام من دخول البيوت من ظهورها حين تُحْرِمون بالحج او العمره، ظانين ان ذلك قربه الي الله، ولكن الخير هو فِعْلُ مَنِ اتقي الله واجتنب المعاصي، وادخلوا البيوت من ابوابها عند احرامكم بالحج او العمره، واخشوا الله تعالي في كل اموركم، لتفوزوا بكل ما تحبون من خيري الدنيا والاخره.",
        "char_start": 0,
        "char_end": 477,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_187_chunk00",
        "verse_key": "3:187",
        "text_ar": "واذكر -أيها الرسول- إذ أخذ الله العهد الموثق على الذين آتاهم الله الكتاب من اليهود والنصارى، فلليهود التوراة وللنصارى الإنجيل; ليعملوا بهما، ويبينوا للناس ما فيهما، ولا يكتموا ذلك ولا يخفوه، فتركوا العهد ولم يلتزموا به، وأخذوا ثمنا بخسًا مقابل كتمانهم الحق وتحريفهم الكتاب، فبئس الشراء يشترون، في تضييعهم الميثاق، وتبديلهم الكتاب.",
        "char_start": 0,
        "char_end": 330,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_031_chunk00",
        "verse_key": "6:31",
        "text_ar": "قد خسر الكفار الذين أنكروا البعث بعد الموت، حتى إذا قامت القيامة، وفوجئوا بسوء المصير، نادَوا على أنفسهم بالحسرة على ما ضيَّعوه في حياتهم الدنيا، وهم يحملون آثامهم على ظهورهم، فما أسوأ الأحمال الثقيلة السيئة التي يحملونها!!",
        "char_start": 0,
        "char_end": 223,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_094_chunk00",
        "verse_key": "6:94",
        "text_ar": "ولقد جئتمونا للحساب والجزاء فرادى كما أوجدناكم في الدنيا أول مرة حفاة عراة، وتركتم وراء ظهوركم ما مكنَّاكم فيه مما تتباهون به من أموال في الدنيا، وما نرى معكم في الآخرة أوثانكم التي كنتم تعتقدون أنها تشفع لكم، وتَدَّعون أنها شركاء مع الله في العبادة، لقد زال تَواصُلُكم الذي كان بينكم في الدنيا، وذهب عنكم ما كنتم تَدَّعون من أن آلهتكم شركاء لله في العبادة، وظهر أنكم الخاسرون لأنفسكم وأهليكم وأموالكم.",
        "char_start": 0,
        "char_end": 402,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_120_chunk00",
        "verse_key": "6:120",
        "text_ar": "واتركوا -أيها الناس- جميع المعاصي، ما كان منها علانية وما كان سرًّا. إن الذين يفعلون المعاصي سيعاقبهم ربهم; بسبب ما كانوا يعملونه من السيئات.",
        "char_start": 0,
        "char_end": 141,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_138_chunk00",
        "verse_key": "6:138",
        "text_ar": "وقال المشركون: هذه ابل وزرع حرام، لا ياكلها الا مَن ياذنون له -حسب ادعايهم- مِن سدنه الاوثان وغيرهم. وهذه ابل حُرِّمت ظهورها، فلا يحل ركوبها والحملُ عليها بحال من الاحوال. وهذه ابل لا يَذكرون اسم الله تعالي عليها في اي شان من شيونها. فعلوا ذلك كذبًا منهم علي الله، سيجزيهم الله بسبب ما كانوا يفترون من كذبٍ عليه سبحانه.",
        "char_start": 0,
        "char_end": 319,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_146_chunk00",
        "verse_key": "6:146",
        "text_ar": "واذكر -ايها الرسول- لهولاء المشركين ما حرمَّنا علي اليهود من البهايم والطير: وهو كل ما لم يكن مشقوق الاصابع كالابل والنَّعام، وشحوم البقر والغنم، الا ما عَلِق من الشحم بظهورها او امعايها، او اختلط بعظم الالْيه والجنب ونحو ذلك. ذلك التحرم المذكور علي اليهود عقوبه مِنَّا لهم بسبب اعمالهم السييه، وانَّا لصادقون فيما اخبرنا به عنهم.",
        "char_start": 0,
        "char_end": 330,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_151_chunk00",
        "verse_key": "6:151",
        "text_ar": "قل -ايها الرسول- لهم: تعالوا اتل ما حرم ربكم عليكم: ان لا تشركوا معه شييًا من مخلوقاته في عبادته، بل اصرفوا جميع انواع العباده له وحده، كالخوف والرجاء والدعاء، وغير ذلك، وان تحسنوا الي الوالدين بالبر والدعاء ونحو ذلك من الاحسان، ولا تقتلوا اولادكم مِن اجل فقر نزل بكم; فان الله يرزقكم واياهم، ولا تقربوا ما كان ظاهرًا من كبير الاثام، وما كان خفيًّا، ولا تقتلوا النفس التي حرم الله قتلها الا بالحق، وذلك في حال القصاص من القاتل او الزني بعد الاحصان او الرده عن الاسلام، ذلكم المذكور مما نهاكم الله عنه",
        "char_start": 0,
        "char_end": 583,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_033_chunk00",
        "verse_key": "7:33",
        "text_ar": "قل -ايها الرسول- لهولاء المشركين: انما حَرَّم الله القبايح من الاعمال، ما كان منها ظاهرًا، وما كان خفيًّا، وحَرَّم المعاصي كلها، ومِن اعظمها الاعتداء علي الناس، فان ذلك مجانب للحق، وحرَّم ان تعبدوا مع الله تعالي غيره مما لم يُنَزِّل به دليلا وبرهانًا، فانه لا حجه لفاعل ذلك، وحرَّم ان تنسبوا الي الله تعالي ما لم يشرعه افتراءً وكذبًا، كدعوي ان لله ولدًا، وتحريم بعض الحلال من الملابس والماكل.",
        "char_start": 0,
        "char_end": 392,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_172_chunk00",
        "verse_key": "7:172",
        "text_ar": "واذكر -أيها الرسول- إذ استخرج ربك أولاد آدم مِن أصلاب آبائهم، وقررهم بتوحيده بما أودعه في فطرهم من أنه ربهم وخالقهم ومليكهم، فأقروا له بذلك، خشية أن ينكروا يوم القيامة، فلا يقروا بشيء منه، ويزعموا أن حجة الله ما قامت عليهم، ولا عندهم علم بها، بل كانوا عنها غافلين.",
        "char_start": 0,
        "char_end": 264,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_004_chunk00",
        "verse_key": "9:4",
        "text_ar": "ويُستثنى من الحكم السابق المشركون الذين دخلوا معكم في عهد محدد بمدة، ولم يخونوا العهد، ولم يعاونوا عليكم أحدا من الأعداء، فأكملوا لهم عهدهم إلى نهايته المحدودة. إن الله يحب المتقين الذين أدَّوا ما أمروا به، واتقوا الشرك والخيانة، وغير ذلك من المعاصي.",
        "char_start": 0,
        "char_end": 250,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_008_chunk00",
        "verse_key": "9:8",
        "text_ar": "إن شأن المشركين أن يلتزموا بالعهود ما دامت الغلبة لغيرهم، أما إذا شعروا بالقوة على المؤمنين فإنهم لا يراعون القرابة ولا العهد، فلا يغرنكم منهم ما يعاملونكم به وقت الخوف منكم، فإنهم يقولون لكم كلامًا بألسنتهم; لترضوا عنهم، ولكن قلوبهم تأبى ذلك، وأكثرهم متمردون على الإسلام ناقضون للعهد.",
        "char_start": 0,
        "char_end": 285,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "هو الذي أرسل رسوله محمدًا صلى الله عليه وسلم بالقرآن ودين الإسلام; ليعليه على الأديان كلها، ولو كره المشركون دين الحق -الإسلام- وظهوره على الأديان.",
        "char_start": 0,
        "char_end": 147,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_035_chunk00",
        "verse_key": "9:35",
        "text_ar": "يوم القيامه توضع قطع الذهب والفضه في النار، فاذا اشتدت حرارتها اُحرقت بها جباه اصحابها وجنوبهم وظهورهم. وقيل لهم توبيخًا: هذا مالكم الذي امسكتموه ومنعتم منه حقوق الله، فذوقوا العذاب الموجع; بسبب كنزكم وامساككم.",
        "char_start": 0,
        "char_end": 210,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_048_chunk00",
        "verse_key": "9:48",
        "text_ar": "لقد ابتغي المنافقون فتنه المومنين عن دينهم وصدهم عن سبيل الله من قبل غزوه (تبوك) ، وكشف امرهم، وصرَّفوا لك -ايها النبي- الامور في ابطال ما جيت به، كما فعلوا يوم (احد) ويوم (الخندق) ، ودبَّروا لك الكيد حتي جاء النصر من عند الله، واعز جنده ونصر دينه، وهم كارهون له.",
        "char_start": 0,
        "char_end": 263,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_011_092_chunk00",
        "verse_key": "11:92",
        "text_ar": "قال: يا قوم اعشيرتي اعزُّ واكرم عليكم من الله؟ ونبذتم امر ربكم فجعلتموه خلف ظهوركم، لا تاتمرون به ولا تنتهون بنهيه، ان ربي بما تعملون محيط، لا يخفي عليه من اعمالكم مثقال ذره، وسيجازيكم عليها عاجلا واجلا.",
        "char_start": 0,
        "char_end": 203,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_013_033_chunk00",
        "verse_key": "13:33",
        "text_ar": "أفمن هو قائم على كل نفس يُحصي عليها ما تعمل، أحق أن يعبد، أم هذه المخلوقات العاجزة؟ وهم -من جهلهم- جعلوا لله شركاء مِن خَلْقه يعبدونهم، قل لهم -أيها الرسول-: اذكروا أسماءهم وصفاتهم، ولن يجدوا من صفاتهم ما يجعلهم أهلا للعبادة، أم تخبرون الله بشركاء في أرضه لا يعلمهم، أم تسمونهم شركاء بظاهر من اللفظ من غير أن يكون لهم حقيقة. بل حسَّن الشيطان للكفار قولهم الباطل وصدَّهم عن سبيل الله. ومَن لم يوفِّقه الله لهدايته فليس له أحد يهديه، ويوفقه إلى الحق والرشاد.",
        "char_start": 0,
        "char_end": 456,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_017_088_chunk00",
        "verse_key": "17:88",
        "text_ar": "قل: لو اتفقت الانس والجن علي محاوله الاتيان بمثل هذا القران المعجز لا يستطيعون الاتيان به، ولو تعاونوا وتظاهروا علي ذلك.",
        "char_start": 0,
        "char_end": 120,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "قوله تعالى : ثم أنتم هؤلاء تقتلون أنفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالإثم والعدوان وإن يأتوكم أسارى تفادوهم وهو محرم عليكم إخراجهم أفتؤمنون ببعض الكتاب وتكفرون ببعض فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا ويوم القيامة يردون إلى أشد العذاب وما الله بغافل عما تعملون أولئك الذين اشتروا الحياة الدنيا بالآخرة فلا يخفف عنهم العذاب ولا هم ينصرونقوله تعالى : ثم أنتم هؤلاء أنتم في موضع رفع بالابتداء ، ولا يعرب ; لأنه مضمر . وضمت التاء من أنتم لأنها كانت مفتوحة إذا خاطبت واحدا ",
        "char_start": 0,
        "char_end": 5797,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_101_chunk00",
        "verse_key": "2:101",
        "text_ar": "قوله تعالى : ولما جاءهم رسول من عند الله مصدق لما معهم نبذ فريق من الذين أوتوا الكتاب كتاب الله وراء ظهورهم كأنهم لا يعلمونقوله تعالى : ولما جاءهم رسول من عند الله مصدق لما معهم نعت لرسول ، ويجوز نصبه على الحال . نبذ فريق جواب لما ، من الذين أوتوا الكتاب كتاب الله نصب ب نبذ ، والمراد التوراة ; لأن كفرهم بالنبي عليه السلام وتكذيبهم له نبذ لها . قال السدي : نبذوا التوراة وأخذوا بكتاب آصف وسحر هاروت وماروت . وقيل : يجوز أن يعني به القرآن . قال الشعبي : هو بين أيديهم يقرءونه ، ولكن نبذوا العمل به . ",
        "char_start": 0,
        "char_end": 733,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_189_chunk00",
        "verse_key": "2:189",
        "text_ar": "قوله تعالى : يسألونك عن الأهلة قل هي مواقيت للناس والحج وليس البر بأن تأتوا البيوت من ظهورها ولكن البر من اتقى وأتوا البيوت من أبوابها واتقوا الله لعلكم تفلحون[ ص: 318 ] فيه اثنتا عشرة مسألة :الأولى : قوله تعالى : يسألونك عن الأهلة هذا مما سأل عنه اليهود واعترضوا به على النبي صلى الله عليه وسلم ، فقال معاذ : يا رسول الله ، إن اليهود تغشانا ويكثرون مسألتنا عن الأهلة فما بال الهلال يبدو دقيقا ثم يزيد حتى يستوي ويستدير ، ثم ينتقص حتى يعود كما كان ؟ فأنزل الله هذه الآية . وقيل : إن سبب نزولها سؤال ق",
        "char_start": 0,
        "char_end": 9508,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_187_chunk00",
        "verse_key": "3:187",
        "text_ar": "قوله تعالى : وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه فنبذوه وراء ظهورهم واشتروا به ثمنا قليلا فبئس ما يشترونفيه مسألتان :الأولى : قوله تعالى : وإذ أخذ الله ميثاق الذين أوتوا الكتاب هذا متصل بذكر اليهود ; فإنهم أمروا بالإيمان بمحمد عليه السلام وبيان أمره ، فكتموا نعته . فالآية توبيخ لهم ، ثم مع ذلك هو خبر عام لهم ولغيرهم . قال الحسن وقتادة : هي في كل من أوتي علم شيء من الكتاب . فمن علم شيئا فليعلمه ، وإياكم وكتمان العلم فإنه هلكة . وقال محمد بن كعب : لا يحل لعالم أن يسكت ع",
        "char_start": 0,
        "char_end": 1923,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_031_chunk00",
        "verse_key": "6:31",
        "text_ar": "قوله تعالى : قد خسر الذين كذبوا بلقاء الله حتى إذا جاءتهم الساعة بغتة قالوا يا حسرتنا على ما فرطنا فيها وهم يحملون أوزارهم على ظهورهم ألا ساء ما يزرونقوله تعالى : قد خسر الذين كذبوا بلقاء الله قيل : بالبعث بعد الموت وبالجزاء ; دليله قوله عليه السلام : من حلف على يمين كاذبة ليقتطع بها مال امرئ مسلم لقي الله وهو عليه غضبان أي : لقي جزاءه ; لأن من غضب عليه لا يرى الله عند مثبتي الرؤية ، ذهب إلى هذا القفال وغيره ; قال القشيري : وهذا ليس بشيء ; لأن حمل اللقاء في موضع على الجزاء [ ص: 321 ] لدليل قائم ",
        "char_start": 0,
        "char_end": 3084,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_094_chunk00",
        "verse_key": "6:94",
        "text_ar": "قوله تعالى ولقد جئتمونا فرادى كما خلقناكم أول مرة وتركتم ما خولناكم وراء ظهوركم وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء لقد تقطع بينكم وضل عنكم ما كنتم تزعمونقوله تعالى ولقد جئتمونا فرادى هذه عبارة عن الحشر وفرادى في موضع نصب على الحال ، ولم ينصرف لأن فيه ألف تأنيث . وقرأ أبو حيوة \" فرادا \" بالتنوين وهي لغة تميم ، ولا يقولون في موضع الرفع فراد . وحكى أحمد بن يحيى \" فراد \" بلا تنوين ، قال : مثل ثلاث ورباع . وفرادى جمع فردان كسكارى جمع سكران ، وكسالى جمع كسلان . وقيل : واحده \" فرد \" بجزم ",
        "char_start": 0,
        "char_end": 2653,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_120_chunk00",
        "verse_key": "6:120",
        "text_ar": "للعلماء فيه أقوال كثيرة وحاصلها راجع إلى أن الظاهر ما كان عملا بالبدن مما نهى الله عنه , وباطنه ما عقد بالقلب من مخالفة أمر الله فيما أمر ونهى ; وهذه المرتبة لا يبلغها إلا من اتقى وأحسن ; كما قال : \" ثم اتقوا وآمنوا ثم اتقوا وأحسنوا \" [ المائدة : 93 ] .وهي المرتبة الثالثة حسب ما تقدم بيانه في \" المائدة \" .وقيل : هو ما كان عليه الجاهلية من الزنا الظاهر واتخاذ الحلائل في الباطن .وما قدمنا جامع لكل إثم وموجب لكل أمر .",
        "char_start": 0,
        "char_end": 418,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_138_chunk00",
        "verse_key": "6:138",
        "text_ar": "قوله : وقالوا هذه أنعام وحرث حجر لا يطعمها إلا من نشاء بزعمهم وأنعام حرمت ظهورها وأنعام لا يذكرون اسم الله عليها افتراء عليه سيجزيهم بما كانوا يفترونذكر تعالى نوعا آخر من جهالتهم . وقرأ أبان بن عثمان ( حجر ) بضم الحاء والجيم . وقرأ الحسن وقتادة ( حجر ) بفتح الحاء وإسكان الجيم ، لغتان بمعنى . وعن الحسن أيضا ( حجر ) بضم الحاء . قال أبو عبيد عن هارون قال : كان الحسن يضم الحاء في ( حجر ) في جميع القرآن إلا في قوله : برزخا وحجرا محجورا فإنه كان يكسرها هاهنا . وروي عن [ ص: 86 ] ابن عباس وابن الزبير ( ",
        "char_start": 0,
        "char_end": 1593,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_146_chunk00",
        "verse_key": "6:146",
        "text_ar": "قوله تعالى وعلى الذين هادوا حرمنا كل ذي ظفر ومن البقر والغنم حرمنا عليهم شحومهما إلا ما حملت ظهورهما أو الحوايا أو ما اختلط بعظم ذلك جزيناهم ببغيهم وإنا لصادقونفيه ست مسائل :الأولى : قوله تعالى وعلى الذين هادوا حرمنا كل ذي ظفر لما ذكر الله عز وجل ما حرم على أمة محمد صلى الله عليه وسلم عقب ذلك بذكر ما حرم على اليهود ; لما في ذلك من تكذيبهم في قولهم : إن الله لم يحرم علينا شيئا ، وإنما نحن حرمنا على أنفسنا ما حرمه إسرائيل على نفسه . وقد تقدم في \" البقرة \" معنى هادوا . وهذا التحريم على الذين هادوا ",
        "char_start": 0,
        "char_end": 5304,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_151_chunk00",
        "verse_key": "6:151",
        "text_ar": "قل تعالوا أتل ما حرم ربكم عليكم ألا تشركوا به شيئا وبالوالدين إحسانا ولا تقتلوا أولادكم من إملاق نحن نرزقكم وإياهم ولا تقربوا الفواحش ما ظهر منها وما بطن ولا تقتلوا النفس التي حرم الله إلا بالحق ذلكم وصاكم به لعلكم تعقلونفيه عشرة مسألة :الأولى : قوله تعالى قل تعالوا أتل أي تقدموا واقرءوا حقا يقينا كما أوحى إلي ربي ، لا ظنا ولا كذبا كما زعمتم . ثم بين ذلك فقال ألا تشركوا به شيئا يقال للرجل : تعال ، أي تقدم ، وللمرأة تعالي ، وللاثنين والاثنتين تعاليا ، ولجماعة الرجال تعالوا ، ولجماعة النساء تعالين",
        "char_start": 0,
        "char_end": 6595,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_033_chunk00",
        "verse_key": "7:33",
        "text_ar": "قوله تعالى قل إنما حرم ربي الفواحش ما ظهر منها وما بطن والإثم والبغي بغير الحق وأن تشركوا بالله ما لم ينزل به سلطانا وأن تقولوا على الله ما لا تعلمونفيه مسألة واحدة :قال الكلبي : لما لبس المسلمون الثياب وطافوا بالبيت عيرهم المشركون ; فنزلت هذه الآية . والفواحش : الأعمال المفرطة في القبح ، ما ظهر منها وما بطن . وروى روح بن عبادة [ ص: 181 ] عن زكريا بن إسحاق عن ابن أبي نجيح عن مجاهد قال : ما ظهر منها نكاح الأمهات في الجاهلية . وما بطن : الزنى . وقال قتادة : سرها وعلانيتها . وهذا فيه نظر ; فإنه ذكر",
        "char_start": 0,
        "char_end": 1805,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_172_chunk00",
        "verse_key": "7:172",
        "text_ar": "قوله تعالى وإذ أخذ ربك من بني آدم من ظهورهم ذريتهم وأشهدهم على أنفسهم ألست بربكم قالوا بلى شهدنا أن تقولوا يوم القيامة إنا كنا عن هذا غافلينفيه ثلاث مسائل :الأولى : قوله تعالى وإذ أخذ ربك أي واذكر لهم مع ما سبق من تذكير المواثيق في كتابهم ما أخذت من المواثيق من العباد يوم الذر . وهذه آية مشكلة ، وقد تكلم العلماء في تأويلها وأحكامها ، فنذكر ما ذكروه من ذلك حسب ما وقفنا عليه فقال قوم : معنى الآية أن الله تعالى أخرج من ظهور بني آدم بعضهم من بعض . قالوا ومعنى وأشهدهم على أنفسهم ألست بربكم دلهم بخلقه",
        "char_start": 0,
        "char_end": 4731,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_004_chunk00",
        "verse_key": "9:4",
        "text_ar": "قوله تعالى إلا الذين عاهدتم من المشركين ثم لم ينقصوكم شيئا ولم يظاهروا عليكم أحدا فأتموا إليهم عهدهم إلى مدتهم إن الله يحب المتقينقوله تعالى إلا الذين عاهدتم من المشركين في موضع نصب بالاستثناء المتصل ، المعنى : أن الله بريء من المشركين إلا من المعاهدين في مدة عهدهم . وقيل : الاستثناء منقطع ، أي أن الله بريء منهم ولكن الذين عاهدتم فثبتوا على العهد فأتموا إليهم عهدهم .وقوله لم ينقصوكم يدل على أنه كان من أهل العهد من خاس بعهده ومنهم من ثبت على الوفاء ، فأذن الله سبحانه لنبيه صلى الله عليه وسلم في ن",
        "char_start": 0,
        "char_end": 837,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_008_chunk00",
        "verse_key": "9:8",
        "text_ar": "قوله تعالى كيف وإن يظهروا عليكم لا يرقبوا فيكم إلا ولا ذمة يرضونكم بأفواههم وتأبى قلوبهم وأكثرهم فاسقونقوله تعالى كيف وإن يظهروا عليكم أعاد التعجب من أن يكون لهم عهد مع خبث أعمالهم ، أي كيف يكون لهم عهد وإن يظهروا عليكم لا يرقبوا فيكم إلا ولا ذمة . يقال : ظهرت على فلان أي غلبته ، وظهرت البيت علوته ، ومنه فما اسطاعوا أن يظهروه أي يعلوا عليه .[ ص: 18 ] قوله تعالى لا يرقبوا فيكم يرقبوا يحافظوا . والرقيب الحافظ . وقد تقدم .إلا عهدا ، عن مجاهد وابن زيد . وعن مجاهد أيضا : هو اسم من أسماء الله عز وجل .",
        "char_start": 0,
        "char_end": 1814,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "قوله تعالى هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركونقوله تعالى هو الذي أرسل رسوله يريد محمدا صلى الله عليه وسلم .بالهدى أي بالفرقان ودين الحق ليظهره على الدين كله أي بالحجة والبراهين . وقد أظهره على شرائع الدين حتى لا يخفى عليه شيء منها ، عن ابن عباس وغيره . وقيل : ليظهره أي ليظهر الدين دين الإسلام على كل دين . قال أبو هريرة والضحاك : هذا عند نزول عيسى عليه السلام . وقال السدي : ذاك عند خروج المهدي ، لا يبقى أحد إلا دخل في الإسلام أو أدى الجزية . وقيل : المهدي هو ",
        "char_start": 0,
        "char_end": 1128,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_035_chunk00",
        "verse_key": "9:35",
        "text_ar": "قوله تعالى يوم يحمى عليها في نار جهنم فتكوى بها جباههم وجنوبهم وظهورهم هذا ما كنزتم لأنفسكم فذوقوا ما كنتم تكنزونفيه أربع مسائل :الأولى : قوله تعالى يوم يحمى عليها في نار جهنم يوم ظرف ، والتقدير : يعذبون يوم يحمى . ولا يصح أن يكون على تقدير : فبشرهم يوم يحمى عليها ؛ لأن البشارة لا تكون حينئذ . يقال : أحميت الحديدة في النار ، أي أوقدت عليها . ويقال : أحميته ، ولا يقال : أحميت عليه . وهاهنا قال ( عليها ) لأنه جعل \" على \" من صلة معنى الإحماء ، ومعنى الإحماء الإيقاد . أي يوقد عليها فتكوى . الكي : إل",
        "char_start": 0,
        "char_end": 4526,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_048_chunk00",
        "verse_key": "9:48",
        "text_ar": "قوله تعالى لقد ابتغوا الفتنة من قبل وقلبوا لك الأمور حتى جاء الحق وظهر أمر الله وهم كارهونقوله تعالى لقد ابتغوا الفتنة من قبل أي لقد طلبوا الإفساد والخبال من قبل أن يظهر أمرهم ، وينزل الوحي بما أسروه وبما سيفعلونه . وقال ابن جريج : أراد اثني عشر رجلا من المنافقين ، وقفوا على ثنية الوداع ليلة العقبة ليفتكوا بالنبي صلى الله عليه وسلم .وقلبوا لك الأمور أي صرفوها وأجالوا الرأي في إبطال ما جئت بهحتى جاء الحق وظهر أمر الله أي دينه وهم كارهون",
        "char_start": 0,
        "char_end": 439,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_011_092_chunk00",
        "verse_key": "11:92",
        "text_ar": "قوله تعالى : قال يا قوم أرهطي أرهطي رفع بالابتداء ; والمعنى أرهطي في قلوبكمأعز عليكم من الله وأعظم وأجل وهو يملككم .واتخذتموه وراءكم ظهريا أي اتخذتم ما جئتكم به من أمر الله ظهريا ; أي جعلتموه وراء ظهوركم ، وامتنعتم من قتلي مخافة قومي يقال : جعلت أمره بظهر إذا قصرت فيه ، وقد مضى في \" البقرة \" ،إن ربي بما تعملون أي من الكفر والمعصية .\" محيط \" أي عليم . وقيل : حفيظ .",
        "char_start": 0,
        "char_end": 366,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_013_033_chunk00",
        "verse_key": "13:33",
        "text_ar": "قوله تعالى : أفمن هو قائم على كل نفس بما كسبت ليس هذا القيام القيام الذي هو ضد القعود ، بل هو بمعنى التولي لأمور الخلق ; كما يقال : قام فلان بشغل كذا ; فإنه قائم على كل نفس بما كسبت أي يقدرها على الكسب ، ويخلقها ويرزقها ويحفظها ويجازيها على عملها ; فالمعنى : أنه حافظ لا يغفل ، والجواب محذوف ; والمعنى : أفمن هو حافظ لا يغفل كمن يغفل . وقيل : أفمن هو قائم أي عالم ; قاله الأعمش . قال الشاعر :فلولا رجال من قريش أعزة سرقتم ثياب البيت والله قائمأي عالم ; فالله عالم بكسب كل نفس . وقيل : المراد بذلك الم",
        "char_start": 0,
        "char_end": 3290,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_017_088_chunk00",
        "verse_key": "17:88",
        "text_ar": "قوله تعالى : قل لئن اجتمعت الإنس والجن على أن يأتوا بمثل هذا القرآن لا يأتون بمثله ولو كان بعضهم لبعض ظهيراأي عونا ونصيرا ; مثلما يتعاون الشعراء على بيت شعر فيقيمونه . نزلت حين قال الكفار : لو نشاء لقلنا مثل هذا ; فأكذبهم الله - تعالى - . وقد مضى القول في إعجاز القرآن في أول الكتاب والحمد لله . و \" لا يأتون \" جواب القسم في لئن وقد يجزم على إرادة الشرط . قال الشاعر :[ ص: 294 ]لئن كان ما حدثته اليوم صادقا أقم في نهار القيظ للشمس باديا",
        "char_start": 0,
        "char_end": 436,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "تفسير الايات من 84 ال 85 وهذا الفعل المذكور في هذه الايه, فعل للذين كانوا في زمن الوحي بالمدينه، وذلك ان الاوس والخزرج - وهم الانصار - كانوا قبل مبعث النبي صلي الله عليه وسلم مشركين, وكانوا يقتتلون علي عاده الجاهليه، فنزلت عليهم الفرق الثلاث من فرق اليهود, بنو قريظه, وبنو النضير, وبنو قينقاع، فكل فرقه منهم حالفت فرقه من اهل المدينه. فكانوا اذا اقتتلوا اعان اليهودي حليفه علي مقاتليه الذين تعينهم الفرقه الاخري من اليهود, فيقتل اليهودي اليهودي, ويخرجه من دياره اذا حصل جلاء ونهب، ثم اذا وضعت الحرب ا",
        "char_start": 0,
        "char_end": 1250,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_101_chunk00",
        "verse_key": "2:101",
        "text_ar": "اي: ولما جاءهم هذا الرسول الكريم بالكتاب العظيم بالحق الموافق لما معهم، وكانوا يزعمون انهم متمسكون بكتابهم, فلما كفروا بهذا الرسول وبما جاء به، { نَبَذَ فَرِيقٌ مِنَ الَّذِينَ اُوتُوا الْكِتَابَ كِتَابَ اللَّهِ } الذي انزل اليهم اي: طرحوه رغبه عنه { وَرَاءَ ظُهُورِهِمْ } وهذا ابلغ في الاعراض كانهم في فعلهم هذا من الجاهلين وهم يعلمون صدقه، وحقيّه ما جاء به. تبين بهذا ان هذا الفريق من اهل الكتاب لم يبق في ايديهم شيء حيث لم يومنوا بهذا الرسول, فصار كفرهم به كفرا بكتابهم من حيث لا يشعرون.",
        "char_start": 0,
        "char_end": 489,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_189_chunk00",
        "verse_key": "2:189",
        "text_ar": "يقول تعالي: { يَسْاَلُونَكَ عَنِ الْاَهِلَّهِ } جمع - هلال - ما فايدتها وحكمتها؟ او عن ذاتها، { قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ } اي: جعلها الله تعالي بلطفه ورحمته علي هذا التدبير يبدو الهلال ضعيفا في اول الشهر, ثم يتزايد الي نصفه, ثم يشرع في النقص الي كماله, وهكذا, ليعرف الناس بذلك, مواقيت عباداتهم من الصيام, واوقات الزكاه, والكفارات, واوقات الحج. ولما كان الحج يقع في اشهر معلومات, ويستغرق اوقاتا كثيره قال: { وَالْحَجِّ } وكذلك تعرف بذلك, اوقات الديون الموجلات, ومده الاجارات, ومده العدد والحمل, ",
        "char_start": 0,
        "char_end": 1700,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_187_chunk00",
        "verse_key": "3:187",
        "text_ar": "الميثاق هو العهد الثقيل الموكد، وهذا الميثاق اخذه الله تعالي علي كل من اعطاه [الله] الكتب وعلمه العلم، ان يبين للناس ما يحتاجون اليه مما علمه الله، ولا يكتمهم ذلك، ويبخل عليهم به، خصوصا اذا سالوه، او وقع ما يوجب ذلك، فان كل من عنده علم يجب عليه في تلك الحال ان يبينه، ويوضح الحق من الباطل. فاما الموفقون، فقاموا بهذا اتم القيام، وعلموا الناس مما علمهم الله، ابتغاء مرضاه ربهم، وشفقه علي الخلق، وخوفا من اثم الكتمان. واما الذين اوتوا الكتاب، من اليهود والنصاري ومن شابههم، فنبذوا هذه العهود والمواثيق ",
        "char_start": 0,
        "char_end": 1008,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_031_chunk00",
        "verse_key": "6:31",
        "text_ar": "اي: قد خاب وخسر، وحرم الخير كله، من كذب بلقاء الله، فاوجب له هذا التكذيب، الاجتراء علي المحرمات، واقتراف الموبقات { حَتَّي اِذَا جَاءَتْهُمُ السَّاعَهُ } وهم علي اقبح حال واسويه، فاظهروا غايه الندم. و { قَالُوا يَا حَسْرَتَنَا عَلَي مَا فَرَّطْنَا فِيهَا } ولكن هذا تحسر ذهب وقته، { وَهُمْ يَحْمِلُونَ اَوْزَارَهُمْ عَلَي ظُهُورِهِمْ اَلَا سَاءَ مَا يَزِرُونَ } فان وزرهم وزر يثقلهم، ولا يقدرون علي التخلص منه، ولهذا خلدوا في النار، واستحقوا التابيد في غضب الجبار.",
        "char_start": 0,
        "char_end": 464,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_094_chunk00",
        "verse_key": "6:94",
        "text_ar": "فهذه حالهم في البرزخ.واما يوم القيامه، فانهم اذا وردوها، وردوها مفلسين فرادي بلا اهل ولا مال، ولا اولاد ولا جنود، ولا انصار، كما خلقهم الله اول مره، عارين من كل شيء.فان الاشياء، انما تتمول وتحصل بعد ذلك، باسبابها، التي هي اسبابها، وفي ذلك اليوم تنقطع جميع الامور، التي كانت مع العبد في الدنيا، سوي العمل الصالح والعمل السيء، الذي هو ماده الدار الاخره، الذي تنشا عنه، ويكون حسنها وقبحها، وسرورها وغمومها، وعذابها ونعيمها، بحسب الاعمال. فهي التي تنفع او تضر، وتسوء او تسر، وما سواها من الاهل والولد، وا",
        "char_start": 0,
        "char_end": 1641,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_120_chunk00",
        "verse_key": "6:120",
        "text_ar": "المراد بالاثم: جميع المعاصي، التي توثم العبد، اي: توقعه في الاثم، والحرج، من الاشياء المتعلقه بحقوق الله، وحقوق عباده. فنهي الله عباده، عن اقتراف الاثم الظاهر والباطن، اي: السر والعلانيه، المتعلقه بالبدن والجوارح، والمتعلقه بالقلب، ولا يتم للعبد، ترك المعاصي الظاهره والباطنه، الا بعد معرفتها، والبحث عنها، فيكون البحث عنها ومعرفه معاصي القلب والبدن، والعلمُ بذلك واجبا متعينا علي المكلف. وكثير من الناس، تخفي عليه كثير من المعاصي، خصوصا معاصي القلب، كالكبر والعجب والرياء، ونحو ذلك، حتي انه يكون به ",
        "char_start": 0,
        "char_end": 768,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_138_chunk00",
        "verse_key": "6:138",
        "text_ar": "ومن انواع سفاهتهم ان الانعام التي احلها الله لهم عموما، وجعلها رزقا ورحمه، يتمتعون بها وينتفعون، قد اخترعوا فيها بِدعًا واقوالا من تلقاء انفسهم، فعندهم اصطلاح في بعض الانعام [والحرث] انهم يقولون فيها: { هَذِهِ اَنْعَامٌ وَحَرْثٌ حِجْرٌ } اي: محرم { لَا يَطْعَمُهَا اِلَّا مَنْ نَشَاءُ } اي: لا يجوز ان يطعمه احد، الا من اردنا ان يطعمه، او وصفناه بوصف -من عندهم-. وكل هذا بزعمهم لا مستند لهم ولا حجه الا اهويتهم، واراوهم الفاسده. وانعام ليست محرمه من كل وجه، بل يحرمون ظهورها، اي: بالركوب والحمل عليها",
        "char_start": 0,
        "char_end": 781,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_146_chunk00",
        "verse_key": "6:146",
        "text_ar": "واما ما حرم علي اهل الكتاب، فبعضه طيب ولكنه حرم عليهم عقوبه لهم، ولهذا قال: { وَعَلَي الَّذِينَ هَادُوا حَرَّمْنَا كُلَّ ذِي ظُفُرٍ } وذلك كالابل، وما اشبهها { وَ } حرمنا عليهم. { وَمِنَ الْبَقَرِ وَالْغَنَمِ } بعض اجزايها، وهو: { شُحُومَهُمَا } وليس المحرم جميع الشحوم منها، بل شحم الاليه والثرب، ولهذا استثني الشحم الحلال من ذلك فقال: { اِلَّا مَا حَمَلَتْ ظُهُورُهُمَا اَوِ الْحَوَايَا } اي: الشحم المخالط للامعاء { اَوْ مَا اخْتَلَطَ بِعَظْمٍ } { ذَلِكَ } التحريم علي اليهود { جَزَيْنَاهُمْ بِبَغ",
        "char_start": 0,
        "char_end": 714,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_151_chunk00",
        "verse_key": "6:151",
        "text_ar": "يقول تعالي لنبيه صلي الله عليه وسلم: { قُلْ } لهولاء الذين حرموا ما احل الله. { تَعَالَوْا اَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ } تحريما عاما شاملا لكل احد، محتويا علي ساير المحرمات، من الماكل والمشارب والاقوال والافعال. { اَلَّا تُشْرِكُوا بِهِ شَيْيًا } اي: لا قليلا ولا كثيرا. وحقيقه الشرك بالله: ان يعبد المخلوق كما يعبد الله، او يعظم كما يعظم الله، او يصرف له نوع من خصايص الربوبيه والالهيه، واذا ترك العبد الشرك كله صار موحدا، مخلصا لله في جميع احواله، فهذا حق الله علي عباده، ان يعبدوه ولا ",
        "char_start": 0,
        "char_end": 1839,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_033_chunk00",
        "verse_key": "7:33",
        "text_ar": "ثم ذكر المحرمات التي حرمها اللّه في كل شريعه من الشرايع فقال: { قُلْ اِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ } اي: الذنوب الكبار التي تستفحش وتستقبح لشناعتها وقبحها، وذلك كالزنا واللواط ونحوهما. وقوله: { مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ } اي: الفواحش التي تتعلق بحركات البدن، والتي تتعلق بحركات القلوب، كالكبر والعجب والرياء والنفاق، ونحو ذلك، { وَالْاِثْمَ وَالْبَغْيَ بِغَيْرِ الْحَقِّ } اي: الذنوب التي توثم وتوجب العقوبه في حقوق اللّه، والبغي علي الناس في دمايهم واموالهم واعراضهم، فدخل في هذا الذنو",
        "char_start": 0,
        "char_end": 1037,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_172_chunk00",
        "verse_key": "7:172",
        "text_ar": "يقول تعالي: وَاِذْ اَخَذَ رَبُّكَ مِنْ بَنِي ادَمَ مِنْ ظُهُورِهِمْ ذُرِّيَّتَهُمْ اي: اخرج من اصلابهم ذريتهم، وجعلهم يتناسلون ويتوالدون قرنا بعد قرن. و حين اخرجهم من بطون امهاتهم واصلاب ابايهم اَشْهَدَهُمْ عَلَي اَنْفُسِهِمْ اَلَسْتُ بِرَبِّكُمْ اي: قررهم باثبات ربوبيته، بما اودعه في فطرهم من الاقرار، بانه ربهم وخالقهم ومليكهم. قالوا: بلي قد اقررنا بذلك، فان اللّه تعالي فطر عباده علي الدين الحنيف القيم. فكل احد فهو مفطور علي ذلك، ولكن الفطره قد تغير وتبدل بما يطرا عليها من العقايد الفاسده، ولهذ",
        "char_start": 0,
        "char_end": 854,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_004_chunk00",
        "verse_key": "9:4",
        "text_ar": "اي هذه البراءه التامه المطلقه من جميع المشركين‏.‏ ‏{‏اِلَّا الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ‏}‏ واستمروا علي عهدهم، ولم يجر منهم ما يوجب النقض، فلا نقصوكم شييًا، ولا عاونوا عليكم احدا، فهولاء اتموا لهم عهدهم الي مدتهم، قَلَّتْ، او كثرت، لان الاسلام لا يامر بالخيانه وانما يامر بالوفاء‏.‏ ‏{‏اِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ‏}‏ الذين ادوا ما امروا به، واتقوا الشرك والخيانه، وغير ذلك من المعاصي‏.‏",
        "char_start": 0,
        "char_end": 408,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_008_chunk00",
        "verse_key": "9:8",
        "text_ar": "اي‏:‏ ‏{‏كَيْفَ‏}‏ يكون للمشركين عند اللّه عهد وميثاق ‏{‏و‏}‏ الحال انهم ‏{‏وَاِنْ يَظْهَرُوا عَلَيْكُمْ‏}‏ بالقدره والسلطه، لا يرحموكم، و ‏{‏لَا يَرْقُبُوا فِيكُمْ اِلًّا وَلَا ذِمَّهً‏}‏ اي‏:‏ لا ذمه ولا قرابه، ولا يخافون اللّه فيكم، بل يسومونكم سوء العذاب، فهذه حالكم معهم لو ظهروا‏.‏ ولا يغرنكم منهم ما يعاملونكم به وقت الخوف منكم، فانهم ‏{‏يُرْضُونَكُمْ بِاَفْوَاهِهِمْ وَتَاْبَي قُلُوبُهُمْ‏}‏ الميل والمحبه لكم، بل هم الاعداء حقا، المبغضون لكم صدقًا، ‏{‏وَاَكْثَرُهُمْ فَاسِقُونَ‏}‏ لا ديانه ل",
        "char_start": 0,
        "char_end": 515,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "ثم بين تعالي هذا النور الذي قد تكفل باتمامه وحفظه فقال‏:‏ ‏{‏هُوَ الَّذِي اَرْسَلَ رَسُولَهُ بِالْهُدَي‏}‏ الذي هو العلم النافع ‏{‏وَدِينِ الْحَقِّ‏}‏ الذي هو العمل الصالح فكان ما بعث اللّه به محمدا ـ صلي الله عليه وسلم ـ مشتملًا علي بيان الحق من الباطل في اسماء اللّه واوصافه وافعاله، وفي احكامه واخباره، والامر بكل مصلحه نافعه للقلوب، والارواح والابدان من اخلاص الدين للّه وحده، ومحبه اللّه وعبادته، والامر بمكارم الاخلاق ومحاسن الشيم، والاعمال الصالحه والاداب النافعه، والنهي عن كل ما يضاد ذلك وين",
        "char_start": 0,
        "char_end": 881,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_035_chunk00",
        "verse_key": "9:35",
        "text_ar": "‏{‏يَوْمَ يُحْمَي عَلَيْهَا‏}‏ اي‏:‏ علي اموالهم، ‏{‏فِي نَارِ جَهَنَّمَ‏}‏ فيحمي كل دينار او درهم علي حدته‏.‏ ‏{‏فَتُكْوَي بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ‏}‏ في يوم القيامه كلما بردت اعيدت في يوم كان مقداره خمسين الف سنه، ويقال لهم توبيخا ولوما‏:‏ ‏{‏هَذَا مَا كَنَزْتُمْ لِاَنْفُسِكُمْ فَذُوقُوا مَا كُنْتُمْ تَكْنِزُونَ‏}‏ فما ظلمكم ولكنكم ظلمتم انفسكم وعذبتموها بهذا الكنز‏.‏ وذكر اللّه في هاتين الايتين، انحراف الانسان في ماله، وذلك باحد امرين‏:‏ اما ان ينفقه في الباطل الذي لا يجد",
        "char_start": 0,
        "char_end": 719,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_048_chunk00",
        "verse_key": "9:48",
        "text_ar": "ثم ذكر انه قد سبق لهم سوابق في الشر فقال‏:‏ ‏{‏لَقَدِ ابْتَغَوُا الْفِتْنَهَ مِنْ قَبْلُ‏}‏ اي‏:‏ حين هاجرتم الي المدينه، بذلوا الجهد، ‏{‏وَقَلَّبُوا لَكَ الْاُمُورَ‏}‏ اي‏:‏ اداروا الافكار، واعملوا الحيل في ابطال دعوتكم وخذلان دينكم، ولم يقصروا في ذلك، ‏{‏حَتَّي جَاءَ الْحَقُّ وَظَهَرَ اَمْرُ اللَّهِ وَهُمْ كَارِهُونَ‏}‏ فبطل كيدهم واضمحل باطلهم، فحقيق بمثل هولاء ان يحذر اللّه عباده المومنين منهم، وان لا يبالي المومنين، بتخلفهم عنهم‏.‏",
        "char_start": 0,
        "char_end": 440,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_011_092_chunk00",
        "verse_key": "11:92",
        "text_ar": "فـ { قَالَ ْ} لهم مترققا لهم: { يَا قَوْمِ اَرَهْطِي اَعَزُّ عَلَيْكُمْ مِنَ اللَّهِ ْ} اي: كيف تراعوني لاجل رهطي، ولا تراعوني لله، فصار رهطي اعز عليكم من الله. { وَاتَّخَذْتُمُوهُ وَرَاءَكُمْ ظِهْرِيًّا ْ} اي: نبذتم امر الله، وراء ظهوركم، ولم تبالوا به، ولا خفتم منه. { اِنَّ رَبِّي بِمَا تَعْمَلُونَ مُحِيطٌ ْ} لا يخفي عليه من اعمالكم مثقال ذره في الارض ولا في السماء، فسيجازيكم علي ما عملتم اتم الجزاء.",
        "char_start": 0,
        "char_end": 405,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_013_033_chunk00",
        "verse_key": "13:33",
        "text_ar": "يقول تعالي: { اَفَمَنْ هُوَ قَايِمٌ عَلَي كُلِّ نَفْسٍ بِمَا كَسَبَتْ } بالجزاء العاجل والاجل، بالعدل والقسط، وهو الله تبارك وتعالي كمن ليس كذلك؟ ولهذا قال: { وَجَعَلُوا لِلَّهِ شُرَكَاءَ } وهو الله الاحد الفرد الصمد، الذي لا شريك له ولا ند ولا نظير، { قُلْ } لهم ان كانوا صادقين: { سَمُّوهُمْ } لتعلم حالهم { اَمْ تُنَبِّيُونَهُ بِمَا لَا يَعْلَمُ فِي الْاَرْضِ } فانه اذا كان عالم الغيب والشهاده وهو لا يعلم له شريكا، علم بذلك بطلان دعوي الشريك له، وانكم بمنزله الذي يُعَلِّمُ الله ان له شريكا وهو ",
        "char_start": 0,
        "char_end": 972,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_017_088_chunk00",
        "verse_key": "17:88",
        "text_ar": "وهذا دليل قاطع، وبرهان ساطع، علي صحه ما جاء به الرسول وصدقه، حيث تحدي الله الانس والجن ان ياتوا بمثله، واخبر انهم لا ياتون بمثله، ولو تعاونوا كلهم علي ذلك لم يقدروا عليه. ووقع كما اخبر الله، فان دواعي اعدايه المكذبين به، متوفره علي رد ما جاء به باي: وجه كان، وهم اهل اللسان والفصاحه، فلو كان عندهم ادني تاهل وتمكن من ذلك لفعلوه. فعلم بذلك، انهم اذعنوا غايه الاذعان، طوعًا وكرهًا، وعجزوا عن معارضته. وكيف يقدر المخلوق من تراب، الناقص من جميع الوجوه، الذي ليس له علم ولا قدره ولا اراده ولا مشييه ولا كل",
        "char_start": 0,
        "char_end": 1027,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "القول في تاويل قوله تعالي : ثُمَّ اَنْتُمْ هَوُلاءِ تَقْتُلُونَ اَنْفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِنْكُمْ مِنْ دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِمْ بِالاِثْمِ وَالْعُدْوَانِقال ابو جعفر: ويتجه في قوله: (ثم انتم هولاء) وجهان. احدهما ان يكون اريد به: ثم انتم يا هولاء, فترك \" يا \" استغناء بدلاله الكلام عليه, كما قال: يُوسُفُ اَعْرِضْ عَنْ هَذَا [ يوسف: 29]، وتاويله: يا يوسف اعرض عن هذا. فيكون معني الكلام حينيذ: ثم انتم يا معشر يهود بني اسراييل - بعد اقراركم بالميثاق الذي اخذته عليكم: لا تسفكون دم",
        "char_start": 0,
        "char_end": 18866,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_101_chunk00",
        "verse_key": "2:101",
        "text_ar": "القول في تاويل قوله تعالي : وَلَمَّا جَاءَهُمْ رَسُولٌ مِنْ عِنْدِ اللَّهِ مُصَدِّقٌ لِمَا مَعَهُمْ نَبَذَ فَرِيقٌ مِنَ الَّذِينَ اُوتُوا الْكِتَابَ كِتَابَ اللَّهِ وَرَاءَ ظُهُورِهِمْ كَاَنَّهُمْ لا يَعْلَمُونَ (101)قال ابو جعفر: يعني جل ثناوه بقوله: (ولما جاءهم)، احبار اليهود وعلماءها من بني اسراييل -(رسول)، يعني بالرسول: محمدا صلي الله عليه وسلم. كما:-1643 - حدثني موسي بن هارون قال، حدثنا عمرو قال، حدثنا اسباط, عن السدي في قوله: (ولما جاءهم رسول)، قال: لما جاءهم محمد صلي الله عليه وسلم.* * *و",
        "char_start": 0,
        "char_end": 2670,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_189_chunk00",
        "verse_key": "2:189",
        "text_ar": "القول في تاويل قوله تعالي : يَسْاَلُونَكَ عَنِ الاَهِلَّهِ قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِّقال ابو جعفر: ذكر ان رسول الله صلي الله عليه وسلم سُيل عن زياده الاهله ونقصانها واختلاف احوالها، فانـزل الله تعالي ذكره هذه الايه، جوابا لًهُم فيما سالوا عنه.ذكر الاخبار بذلك:3067 - حدثنا بشر بن معاذ قال، حدثنا يزيد قال، حدثنا سعيد، عن قتاده قوله: \" يَسالُونك عن الاهله قُلْ هيَ مواقيت للناس \"، قال قتاده: سالوا نبيَّ الله صلي الله عليه وسلم عن ذلك: لم جُعلت هذه الاهله؟ فانـزل الله فيها ما تَسمعون: ",
        "char_start": 0,
        "char_end": 12861,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_187_chunk00",
        "verse_key": "3:187",
        "text_ar": "القول في تاويل قوله : وَاِذْ اَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ اُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلا تَكْتُمُونَهُ فَنَبَذُوهُ وَرَاءَ ظُهُورِهِمْ وَاشْتَرَوْا بِهِ ثَمَنًا قَلِيلا فَبِيْسَ مَا يَشْتَرُونَ (187)قال ابو جعفر: يعني بذلك تعالي ذكره: واذكر ايضا من [امر] هولاء اليهود وغيرهم من اهل الكتاب منهم، يا محمد، (1) اذ اخذ الله ميثاقهم، ليبيننّ للناس امرك الذي اخذ ميثاقهم علي بيانه للناس في كتابهم الذي في ايديهم، وهو التوراه والانجيل، وانك لله رسول مرسل بالحق، ولا يكتمونه=\" فنبذوه",
        "char_start": 0,
        "char_end": 7962,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_031_chunk00",
        "verse_key": "6:31",
        "text_ar": "القول في تاويل قوله : قَدْ خَسِرَ الَّذِينَ كَذَّبُوا بِلِقَاءِ اللَّهِ حَتَّي اِذَا جَاءَتْهُمُ السَّاعَهُ بَغْتَهً قَالُوا يَا حَسْرَتَنَا عَلَي مَا فَرَّطْنَا فِيهَاقال ابو جعفر: يعني تعالي ذكره بقوله: \" قد خسر الذين كذبوا بلقاء الله \" ، قد هلك ووُكس، في بيعهم الايمان بالكفر (6) =\" الذين كذبوا بلقاء الله \", يعني: الذين انكروا البعثَ بعد الممات، والثواب والعقابَ، والجنهَ والنارَ, من مشركي قريش ومَنْ سلك سبيلهم في ذلك =\" حتي اذا جاءَتهم الساعه \"، يقول: حتي اذا جاءتهم السَّاعه التي يَبْعث الله ف",
        "char_start": 0,
        "char_end": 6243,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_094_chunk00",
        "verse_key": "6:94",
        "text_ar": "القول في تاويل قوله : وَلَقَدْ جِيْتُمُونَا فُرَادَي كَمَا خَلَقْنَاكُمْ اَوَّلَ مَرَّهٍ وَتَرَكْتُمْ مَا خَوَّلْنَاكُمْ وَرَاءَ ظُهُورِكُمْقال ابو جعفر: وهذا خبر من الله جل ثناوه عما هو قايل يوم القيامه لهولاء العادلين به الالهه والانداد, يخبر عبادَه انه يقول لهم عند ورودهم عليه: \" لقد جيتمونا فرادي \" .ويعني بقوله: \" فرادي \"، وُحدانًا لا مال معهم، ولا اناث، ولا رقيق، (59) ولا شيء مما كان الله خوّلهم في الدنيا =\" كما خلقناكم اوّل مره \"، عُرَاه غُلْفًا غُرْلا حُفاه، كما ولدتهم امهاتهم, (60) وكما ",
        "char_start": 0,
        "char_end": 10757,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_120_chunk00",
        "verse_key": "6:120",
        "text_ar": "القول في تاويل قوله : وَذَرُوا ظَاهِرَ الاِثْمِ وَبَاطِنَهُقال ابو جعفر: يقول تعالي ذكره: ودعوا، ايها الناس، (9) علانيه الاثم، وذلك ظاهره= وسرّه، وذلك باطنه، . كذلك:-13794- حدثنا بشر بن معاذ قال، حدثنا يزيد قال، حدثنا سعيد, عن قتاده: (وذروا ظاهر الاثم وباطنه)، اي: قليله وكثيره، وسرّه وعلانيته .13795- حدثنا محمد بن عبد الاعلي قال، حدثنا محمد بن ثور, عن معمر, عن قتاده: (وذروا ظاهر الاثم وباطنه)، قال: سره وعلانيته .13796- حدثنا ابن حميد قال، حدثنا حكام, عن ابي جعفر, عن الربيع بن انس في قوله: (وذروا",
        "char_start": 0,
        "char_end": 4765,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_138_chunk00",
        "verse_key": "6:138",
        "text_ar": "القول في تاويل قوله : وَقَالُوا هَذِهِ اَنْعَامٌ وَحَرْثٌ حِجْرٌ لا يَطْعَمُهَا اِلا مَنْ نَشَاءُ بِزَعْمِهِمْقال ابو جعفر: وهذا خبر من الله تعالي ذكره عن هولاء الجهله من المشركين انهم كانوا يحرمون ويحللون من قِبَل انفسهم، من غير ان يكون الله اذن لهم بشيء من ذلك .يقول تعالي ذكره: وقال هولاء العادلون بربهم من المشركين، جهلا منهم, لانعام لهم وحرث: هذه انعامٌ وهذا حرث حجر= يعني بـ\" الانعام \" و \" الحرث \" ما كانوا جعلوه لله ولالهتهم، التي قد مضي ذكرها في الايه قبل هذه .* * *وقيل: ان \" الانعام \"، السا",
        "char_start": 0,
        "char_end": 11124,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_146_chunk00",
        "verse_key": "6:146",
        "text_ar": "القول في تاويل قوله : وَعَلَي الَّذِينَ هَادُوا حَرَّمْنَا كُلَّ ذِي ظُفُرٍقال ابو جعفر: يقول تعالي ذكره: وحرّمنا علي اليهود (25) =\" كل ذي ظفر \", وهو من البهايم والطير ما لم يكن مشقُوق الاصابع، كالابل والنَّعام والاوز والبط .* * *وبنحو ما قلنا في ذلك قال اهل التاويل .* ذكر من قال ذلك:14092- حدثني المثني, وعلي بن داود قالا حدثنا عبد الله بن صالح قال، حدثني معاويه بن صالح, عن علي بن ابي طلحه, عن ابن عباس قوله: (وعلي الذين هادوا حرمنا كل ذي ظفر)، وهو البعير والنعامه .14093- حدثني محمد بن سعد قال، ح",
        "char_start": 0,
        "char_end": 10513,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_151_chunk00",
        "verse_key": "6:151",
        "text_ar": "القول في تاويل قوله : قُلْ تَعَالَوْا اَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ اَلا تُشْرِكُوا بِهِ شَيْيًا وَبِالْوَالِدَيْنِ اِحْسَانًاقال ابو جعفر: يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم: قل، يا محمد، لهولاء العادلين بربهم الاوثان والاصنام, الزاعمين ان الله حرم عليهم ما هم محرِّموه من حروثهم وانعامهم, علي ما ذكرت لك في تنـزيلي عليك =: تعالوا، ايها القوم، (12) اقرا عليكم ما حرم ربكم حقًا يقينًا, (13) لا الباطل تخرُّصًا، تخرُّصَكم علي الله الكذبَ والفريهَ ظنًّا, (14) ولكن وحيًا من الله او",
        "char_start": 0,
        "char_end": 7797,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_033_chunk00",
        "verse_key": "7:33",
        "text_ar": "القول في تاويل قوله : قُلْ اِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَالاِثْمَ وَالْبَغْيَ بِغَيْرِ الْحَقِّقال ابو جعفر: يقول تعالي ذكره لنبيه محمد: قل، يا محمد، لهولاء المشركين الذين يتجرّدون من ثيابهم للطواف بالبيت, ويحرمون اكل طيبات ما احل الله لهم من رزقه: ايها القوم، ان الله لم يحرم ما تحرمونه, بل احل ذلك لعباده المومنين وطيَّبه لهم، وانما حرم ربِّي القبايح من الاشياء = وهي\" الفواحش \" (28) =\" ما ظهر منها \"، فكان علانيه =\" وما بطن \"، منها فكان سرًّا في خفاء. (29",
        "char_start": 0,
        "char_end": 2730,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_172_chunk00",
        "verse_key": "7:172",
        "text_ar": "واذ اخذ ربك من بني ادم من ظهورهم ذريتهم واشهدهم علي انفسهم الست بربكم قالوا بلي شهدنا ان تقولوا يوم القيامه انا كنا عن هذا غافلينالقول في تاويل قوله تعالي : { واذ اخذ ربك من بني ادم من ظهورهم ذريتهم واشهدهم علي انفسهم الست بربكم قالوا بلي شهدنا ان تقولوا يوم القيامه انا كنا عن هذا غافلين } يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم : واذكر يا محمد ربك اذ استخرج ولد ادم من اصلاب ابايهم , فقررهم بتوحيده , واشهد بعضهم علي بعض شهادتهم بذلك , واقرارهم به . كما : 11915 - حدثني احمد بن محمد الطوسي ,",
        "char_start": 0,
        "char_end": 18815,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_004_chunk00",
        "verse_key": "9:4",
        "text_ar": "القول في تاويل قوله : اِلا الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ ثُمَّ لَمْ يَنْقُصُوكُمْ شَيْيًا وَلَمْ يُظَاهِرُوا عَلَيْكُمْ اَحَدًا فَاَتِمُّوا اِلَيْهِمْ عَهْدَهُمْ اِلَي مُدَّتِهِمْ اِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ (4)قال ابو جعفر: يقول تعالي ذكره: وَاَذَانٌ مِنَ اللَّهِ وَرَسُولِهِ اِلَي النَّاسِ يَوْمَ الْحَجِّ الاَكْبَرِ اَنَّ اللَّهَ بَرِيءٌ مِنَ الْمُشْرِكِينَ وَرَسُولُهُ ،, الا من عَهْدِ الذين عاهدتم من المشركين، ايها المومنون (58) =(ثم لم ينقصوكم شييا)، من عهدكم الذي عاهدتموه",
        "char_start": 0,
        "char_end": 2265,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_008_chunk00",
        "verse_key": "9:8",
        "text_ar": "القول في تاويل قوله : كَيْفَ وَاِنْ يَظْهَرُوا عَلَيْكُمْ لا يَرْقُبُوا فِيكُمْ اِلا وَلا ذِمَّهً يُرْضُونَكُمْ بِاَفْوَاهِهِمْ وَتَاْبَي قُلُوبُهُمْ وَاَكْثَرُهُمْ فَاسِقُونَ (8)قال ابو جعفر: يعني جل ثناوه بقوله: كيف يكون لهولاء المشركين الذين نقضوا عهدهم او لمن لا عهد له منهم منكم، ايها المومنون، عهد وذمه, وهم =(ان يظهروا عليكم)، يغلبوكم =(لا يرقبوا فيكم الا ولا ذمه).* * *واكتفي بـ \" كيف \" دليلا علي معني الكلام, لتقدم ما يراد من المعني بها قبلها. وكذلك تفعل العرب، اذا اعادت الحرف بعد مضيّ معنا",
        "char_start": 0,
        "char_end": 7599,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "القول في تاويل قوله : هُوَ الَّذِي اَرْسَلَ رَسُولَهُ بِالْهُدَي وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَي الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ (33)قال ابو جعفر: يقول تعالي ذكره: الله الذي يابي الا اتمام دينه ولو كره ذلك جاحدوه ومنكروه =(الذي ارسل رسوله)، محمدًا صلي الله عليه وسلم =(بالهدي), يعني: ببيان فرايض الله علي خلقه, وجميع اللازم لهم (2) = وبدين الحق، وهو الاسلام =(ليظهره علي الدين كله)، يقول: ليعلي الاسلام علي الملل كلها =(ولو كره المشركون)، بالله ظهورَه عليها.* * *وقد اختلف اهل التاو",
        "char_start": 0,
        "char_end": 1480,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_035_chunk00",
        "verse_key": "9:35",
        "text_ar": "القول في تاويل قوله : يَوْمَ يُحْمَي عَلَيْهَا فِي نَارِ جَهَنَّمَ فَتُكْوَي بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ هَذَا مَا كَنَزْتُمْ لاَنْفُسِكُمْ فَذُوقُوا مَا كُنْتُمْ تَكْنِزُونَ (35)قال ابو جعفر: يقول تعالي ذكره: فبشر هولاء الذين يكنـزون الذهب والفضه, ولا يخرجون حقوق الله منها، يا محمد، بعذاب اليم =(يوم يحمي عليها في نار جهنم)، فـ \" اليوم \" من صله \" العذاب الاليم \", كانه قيل: يبشرهم بعذاب اليم، يعذبهم الله به في يوم يحمي عليها.ويعني بقوله: (يحمي عليها)، تدخل النار فيوقد عليها، اي:",
        "char_start": 0,
        "char_end": 6455,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_048_chunk00",
        "verse_key": "9:48",
        "text_ar": "القول في تاويل قوله : لَقَدِ ابْتَغَوُا الْفِتْنَهَ مِنْ قَبْلُ وَقَلَّبُوا لَكَ الاُمُورَ حَتَّي جَاءَ الْحَقُّ وَظَهَرَ اَمْرُ اللَّهِ وَهُمْ كَارِهُونَ (48)قال ابو جعفر: يقول تعالي ذكره: لقد التمس هولاء المنافقون الفتنه لاصحابك، يا محمد, التمسوا صدَّهم عن دينهم (1) وحرصوا علي ردّهم الي الكفرِ بالتخذيل عنه، (2) كفعل عبد الله بن ابيّ بك وباصحابك يوم احدٍ، حين انصرف عنك بمن تبعه من قومه. وذلك كان ابتغاءهم ما كانوا ابتغوا لاصحاب رسول الله صلي الله عليه وسلم من الفتنه من قبل. ويعني بقوله: (من قبل)",
        "char_start": 0,
        "char_end": 5304,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_011_092_chunk00",
        "verse_key": "11:92",
        "text_ar": "القول في تاويل قوله تعالي : قَالَ يَا قَوْمِ اَرَهْطِي اَعَزُّ عَلَيْكُمْ مِنَ اللَّهِ وَاتَّخَذْتُمُوهُ وَرَاءَكُمْ ظِهْرِيًّا اِنَّ رَبِّي بِمَا تَعْمَلُونَ مُحِيطٌ (92)قال ابو جعفر: يقول تعالي ذكره: قال شعيب لقومه: يا قوم ، اعزّزتم قومكم، فكانوا اعزّ عليكم من الله، واستخففتم بربكم، فجعلتموه خلف ظهوركم، لا تاتمرون لامره ولا تخافون عقابه، ولا تعظِّمونه حق عظَمته؟* * *يقال للرجل اذا لم يقض حاجه الرجل: \" نَبَذ حاجته وراء ظهره \" ، (9) اي : تركها لا يلتفت اليها. و اذا قضاها قيل: \" جعلها امامه ، ونُ",
        "char_start": 0,
        "char_end": 4460,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_013_033_chunk00",
        "verse_key": "13:33",
        "text_ar": "قال ابو جعفر: يقول تعالي ذكره: افَالرَّبُ الذي هو دايمٌ لا يَبيدُ ولا يَهْلِك ، قايم بحفظ ارزاق جميع الخَلْق, (58) متضمنٌ لها, عالمٌ بهم وبما يكسبُونه من الاعمال, رقيبٌ عليهم, لا يَعْزُب عنه شيء اينما كانوا، كَمن هو هالك بايِدٌ لا يَسمَع ولا يُبصر ولا يفهم شييًا, ولا يدفع عن نفسه ولا عَمَّن يعبده ضُرًّا, ولا يَجْلب اليهما نفعًا؟ كلاهما سَواءٌ؟* * *وحذف الجواب في ذلك فلم يَقُل، وقد قيل (افمن هو قايم علي كل نفس بما كسبت) : ككذا وكذا, اكتفاءً بعلم السامع بما ذَكَر عما ترك ذِكْره . وذلك انه لما قال ",
        "char_start": 0,
        "char_end": 8160,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_017_088_chunk00",
        "verse_key": "17:88",
        "text_ar": "يقول جلّ ثناوه: قل يا محمد للذين قالوا لك: انا ناتي بمثل هذا القران: لين اجتمعت الانس والجنّ علي ان ياتوا بمثله، لا ياتون ابدا بمثله، ولو كان بعضهم لبعض عونا وظهيرا. وذُكِر ان هذه الايه نـزلت علي رسول الله صلي الله عليه وسلم بسبب قوم من اليهود جادلوه في القران، وسالوه ان ياتيهم بايه غيره شاهده له علي نبوّته، لان مثل هذا القران بهم قُدره علي ان ياتوا به.ذكر الروايه بذلك حدثنا ابو كريب، قال: ثنا يونس بن بكير ، قال: ثنا محمد بن اسحاق، قال: ثنا محمد بن ابي محمد مولي زيد بن ثابت، قال: ثني سعيد بن جبي",
        "char_start": 0,
        "char_end": 3016,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [],
  "incoming_edges": [],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [
      {
        "value": "ORG_HEART",
        "citation_type": "rule",
        "confidence": 0.85,
        "citation_ref": "RULE_COGNITION_HEART"
      }
    ],
    "internal_external": {
      "value": "باطن",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_INTERNAL_BEH_COG_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 50,
    "quran_direct_count": 0,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 0,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.644,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.001748Z",
  "schema_version": "1.0.0"
}