{
  "behavior_id": "BEH_SOC_TRUSTWORTHINESS",
  "label_ar": "أمانة",
  "label_en": "Trustworthiness",
  "category": "social",
  "roots": [
    "أ-م-ن"
  ],
  "stems": [],
  "synonyms_ar": [
    "أمانة",
    "الأمانات",
    "أمين",
    "أمناء",
    "مؤتمن"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:13",
      "text_ar": "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓا۟ أَنُؤْمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُ ۗ أَلَآ إِنَّهُمْ هُمُ ٱلسُّفَهَآءُ وَلَـٰكِن لَّا يَعْلَمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:44",
      "text_ar": "أَتَأْمُرُونَ ٱلنَّاسَ بِٱلْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ ٱلْكِتَـٰبَ ۚ أَفَلَا تَعْقِلُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:75",
      "text_ar": "أَفَتَطْمَعُونَ أَن يُؤْمِنُوا۟ لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلَـٰمَ ٱللَّهِ ثُمَّ يُحَرِّفُونَهُۥ مِنۢ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:78",
      "text_ar": "وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ ٱلْكِتَـٰبَ إِلَّآ أَمَانِىَّ وَإِنْ هُمْ إِلَّا يَظُنُّونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:85",
      "text_ar": "ثُمَّ أَنتُمْ هَـٰٓؤُلَآءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَـٰرِهِمْ تَظَـٰهَرُونَ عَلَيْهِم بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَإِن يَأْتُوكُمْ أُسَـٰرَىٰ تُفَـٰدُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَـٰبِ وَتَكْفُرُونَ بِبَعْضٍ ۚ فَمَا جَزَآءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْىٌ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَيَوْمَ ٱلْقِيَـٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلْعَذَابِ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:111",
      "text_ar": "وَقَالُوا۟ لَن يَدْخُلَ ٱلْجَنَّةَ إِلَّا مَن كَانَ هُودًا أَوْ نَصَـٰرَىٰ ۗ تِلْكَ أَمَانِيُّهُمْ ۗ قُلْ هَاتُوا۟ بُرْهَـٰنَكُمْ إِن كُنتُمْ صَـٰدِقِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:124",
      "text_ar": "وَإِذِ ٱبْتَلَىٰٓ إِبْرَٰهِـۧمَ رَبُّهُۥ بِكَلِمَـٰتٍ فَأَتَمَّهُنَّ ۖ قَالَ إِنِّى جَاعِلُكَ لِلنَّاسِ إِمَامًا ۖ قَالَ وَمِن ذُرِّيَّتِى ۖ قَالَ لَا يَنَالُ عَهْدِى ٱلظَّـٰلِمِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:125",
      "text_ar": "وَإِذْ جَعَلْنَا ٱلْبَيْتَ مَثَابَةً لِّلنَّاسِ وَأَمْنًا وَٱتَّخِذُوا۟ مِن مَّقَامِ إِبْرَٰهِـۧمَ مُصَلًّى ۖ وَعَهِدْنَآ إِلَىٰٓ إِبْرَٰهِـۧمَ وَإِسْمَـٰعِيلَ أَن طَهِّرَا بَيْتِىَ لِلطَّآئِفِينَ وَٱلْعَـٰكِفِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:139",
      "text_ar": "قُلْ أَتُحَآجُّونَنَا فِى ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَآ أَعْمَـٰلُنَا وَلَكُمْ أَعْمَـٰلُكُمْ وَنَحْنُ لَهُۥ مُخْلِصُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:161",
      "text_ar": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ وَمَاتُوا۟ وَهُمْ كُفَّارٌ أُو۟لَـٰٓئِكَ عَلَيْهِمْ لَعْنَةُ ٱللَّهِ وَٱلْمَلَـٰٓئِكَةِ وَٱلنَّاسِ أَجْمَعِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:196",
      "text_ar": "وَأَتِمُّوا۟ ٱلْحَجَّ وَٱلْعُمْرَةَ لِلَّهِ ۚ فَإِنْ أُحْصِرْتُمْ فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْىِ ۖ وَلَا تَحْلِقُوا۟ رُءُوسَكُمْ حَتَّىٰ يَبْلُغَ ٱلْهَدْىُ مَحِلَّهُۥ ۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ بِهِۦٓ أَذًى مِّن رَّأْسِهِۦ فَفِدْيَةٌ مِّن صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ ۚ فَإِذَآ أَمِنتُمْ فَمَن تَمَتَّعَ بِٱلْعُمْرَةِ إِلَى ٱلْحَجِّ فَمَا ٱسْتَيْسَرَ مِنَ ٱلْهَدْىِ ۚ فَمَن لَّمْ يَجِدْ فَصِيَامُ ثَلَـٰثَةِ أَيَّامٍ فِى ٱلْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ ۗ تِلْكَ عَشَرَةٌ كَامِلَةٌ ۗ ذَٰلِكَ لِمَن لَّمْ يَكُنْ أَهْلُهُۥ حَاضِرِى ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ شَدِيدُ ٱلْعِقَابِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:224",
      "text_ar": "وَلَا تَجْعَلُوا۟ ٱللَّهَ عُرْضَةً لِّأَيْمَـٰنِكُمْ أَن تَبَرُّوا۟ وَتَتَّقُوا۟ وَتُصْلِحُوا۟ بَيْنَ ٱلنَّاسِ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:225",
      "text_ar": "لَّا يُؤَاخِذُكُمُ ٱللَّهُ بِٱللَّغْوِ فِىٓ أَيْمَـٰنِكُمْ وَلَـٰكِن يُؤَاخِذُكُم بِمَا كَسَبَتْ قُلُوبُكُمْ ۗ وَٱللَّهُ غَفُورٌ حَلِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:228",
      "text_ar": "وَٱلْمُطَلَّقَـٰتُ يَتَرَبَّصْنَ بِأَنفُسِهِنَّ ثَلَـٰثَةَ قُرُوٓءٍ ۚ وَلَا يَحِلُّ لَهُنَّ أَن يَكْتُمْنَ مَا خَلَقَ ٱللَّهُ فِىٓ أَرْحَامِهِنَّ إِن كُنَّ يُؤْمِنَّ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ ۚ وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِى ذَٰلِكَ إِنْ أَرَادُوٓا۟ إِصْلَـٰحًا ۚ وَلَهُنَّ مِثْلُ ٱلَّذِى عَلَيْهِنَّ بِٱلْمَعْرُوفِ ۚ وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ ۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:231",
      "text_ar": "وَإِذَا طَلَّقْتُمُ ٱلنِّسَآءَ فَبَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ سَرِّحُوهُنَّ بِمَعْرُوفٍ ۚ وَلَا تُمْسِكُوهُنَّ ضِرَارًا لِّتَعْتَدُوا۟ ۚ وَمَن يَفْعَلْ ذَٰلِكَ فَقَدْ ظَلَمَ نَفْسَهُۥ ۚ وَلَا تَتَّخِذُوٓا۟ ءَايَـٰتِ ٱللَّهِ هُزُوًا ۚ وَٱذْكُرُوا۟ نِعْمَتَ ٱللَّهِ عَلَيْكُمْ وَمَآ أَنزَلَ عَلَيْكُم مِّنَ ٱلْكِتَـٰبِ وَٱلْحِكْمَةِ يَعِظُكُم بِهِۦ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ بِكُلِّ شَىْءٍ عَلِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:239",
      "text_ar": "فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًا ۖ فَإِذَآ أَمِنتُمْ فَٱذْكُرُوا۟ ٱللَّهَ كَمَا عَلَّمَكُم مَّا لَمْ تَكُونُوا۟ تَعْلَمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:250",
      "text_ar": "وَلَمَّا بَرَزُوا۟ لِجَالُوتَ وَجُنُودِهِۦ قَالُوا۟ رَبَّنَآ أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:283",
      "text_ar": "وَإِن كُنتُمْ عَلَىٰ سَفَرٍ وَلَمْ تَجِدُوا۟ كَاتِبًا فَرِهَـٰنٌ مَّقْبُوضَةٌ ۖ فَإِنْ أَمِنَ بَعْضُكُم بَعْضًا فَلْيُؤَدِّ ٱلَّذِى ٱؤْتُمِنَ أَمَـٰنَتَهُۥ وَلْيَتَّقِ ٱللَّهَ رَبَّهُۥ ۗ وَلَا تَكْتُمُوا۟ ٱلشَّهَـٰدَةَ ۚ وَمَن يَكْتُمْهَا فَإِنَّهُۥٓ ءَاثِمٌ قَلْبُهُۥ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:20",
      "text_ar": "فَإِنْ حَآجُّوكَ فَقُلْ أَسْلَمْتُ وَجْهِىَ لِلَّهِ وَمَنِ ٱتَّبَعَنِ ۗ وَقُل لِّلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ وَٱلْأُمِّيِّـۧنَ ءَأَسْلَمْتُمْ ۚ فَإِنْ أَسْلَمُوا۟ فَقَدِ ٱهْتَدَوا۟ ۖ وَّإِن تَوَلَّوْا۟ فَإِنَّمَا عَلَيْكَ ٱلْبَلَـٰغُ ۗ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:21",
      "text_ar": "إِنَّ ٱلَّذِينَ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيْرِ حَقٍّ وَيَقْتُلُونَ ٱلَّذِينَ يَأْمُرُونَ بِٱلْقِسْطِ مِنَ ٱلنَّاسِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:75",
      "text_ar": "وَمِنْ أَهْلِ ٱلْكِتَـٰبِ مَنْ إِن تَأْمَنْهُ بِقِنطَارٍ يُؤَدِّهِۦٓ إِلَيْكَ وَمِنْهُم مَّنْ إِن تَأْمَنْهُ بِدِينَارٍ لَّا يُؤَدِّهِۦٓ إِلَيْكَ إِلَّا مَا دُمْتَ عَلَيْهِ قَآئِمًا ۗ ذَٰلِكَ بِأَنَّهُمْ قَالُوا۟ لَيْسَ عَلَيْنَا فِى ٱلْأُمِّيِّـۧنَ سَبِيلٌ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلْكَذِبَ وَهُمْ يَعْلَمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:77",
      "text_ar": "إِنَّ ٱلَّذِينَ يَشْتَرُونَ بِعَهْدِ ٱللَّهِ وَأَيْمَـٰنِهِمْ ثَمَنًا قَلِيلًا أُو۟لَـٰٓئِكَ لَا خَلَـٰقَ لَهُمْ فِى ٱلْـَٔاخِرَةِ وَلَا يُكَلِّمُهُمُ ٱللَّهُ وَلَا يَنظُرُ إِلَيْهِمْ يَوْمَ ٱلْقِيَـٰمَةِ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:87",
      "text_ar": "أُو۟لَـٰٓئِكَ جَزَآؤُهُمْ أَنَّ عَلَيْهِمْ لَعْنَةَ ٱللَّهِ وَٱلْمَلَـٰٓئِكَةِ وَٱلنَّاسِ أَجْمَعِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:104",
      "text_ar": "وَلْتَكُن مِّنكُمْ أُمَّةٌ يَدْعُونَ إِلَى ٱلْخَيْرِ وَيَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ ۚ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:110",
      "text_ar": "كُنتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِٱلْمَعْرُوفِ وَتَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَتُؤْمِنُونَ بِٱللَّهِ ۗ وَلَوْ ءَامَنَ أَهْلُ ٱلْكِتَـٰبِ لَكَانَ خَيْرًا لَّهُم ۚ مِّنْهُمُ ٱلْمُؤْمِنُونَ وَأَكْثَرُهُمُ ٱلْفَـٰسِقُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:114",
      "text_ar": "يُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَيَأْمُرُونَ بِٱلْمَعْرُوفِ وَيَنْهَوْنَ عَنِ ٱلْمُنكَرِ وَيُسَـٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَأُو۟لَـٰٓئِكَ مِنَ ٱلصَّـٰلِحِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:147",
      "text_ar": "وَمَا كَانَ قَوْلَهُمْ إِلَّآ أَن قَالُوا۟ رَبَّنَا ٱغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِىٓ أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:154",
      "text_ar": "ثُمَّ أَنزَلَ عَلَيْكُم مِّنۢ بَعْدِ ٱلْغَمِّ أَمَنَةً نُّعَاسًا يَغْشَىٰ طَآئِفَةً مِّنكُمْ ۖ وَطَآئِفَةٌ قَدْ أَهَمَّتْهُمْ أَنفُسُهُمْ يَظُنُّونَ بِٱللَّهِ غَيْرَ ٱلْحَقِّ ظَنَّ ٱلْجَـٰهِلِيَّةِ ۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلْأَمْرِ مِن شَىْءٍ ۗ قُلْ إِنَّ ٱلْأَمْرَ كُلَّهُۥ لِلَّهِ ۗ يُخْفُونَ فِىٓ أَنفُسِهِم مَّا لَا يُبْدُونَ لَكَ ۖ يَقُولُونَ لَوْ كَانَ لَنَا مِنَ ٱلْأَمْرِ شَىْءٌ مَّا قُتِلْنَا هَـٰهُنَا ۗ قُل لَّوْ كُنتُمْ فِى بُيُوتِكُمْ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيْهِمُ ٱلْقَتْلُ إِلَىٰ مَضَاجِعِهِمْ ۖ وَلِيَبْتَلِىَ ٱللَّهُ مَا فِى صُدُورِكُمْ وَلِيُمَحِّصَ مَا فِى قُلُوبِكُمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:162",
      "text_ar": "أَفَمَنِ ٱتَّبَعَ رِضْوَٰنَ ٱللَّهِ كَمَنۢ بَآءَ بِسَخَطٍ مِّنَ ٱللَّهِ وَمَأْوَىٰهُ جَهَنَّمُ ۚ وَبِئْسَ ٱلْمَصِيرُ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:3",
      "text_ar": "وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا۟ فِى ٱلْيَتَـٰمَىٰ فَٱنكِحُوا۟ مَا طَابَ لَكُم مِّنَ ٱلنِّسَآءِ مَثْنَىٰ وَثُلَـٰثَ وَرُبَـٰعَ ۖ فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا۟ فَوَٰحِدَةً أَوْ مَا مَلَكَتْ أَيْمَـٰنُكُمْ ۚ ذَٰلِكَ أَدْنَىٰٓ أَلَّا تَعُولُوا۟",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:15",
      "text_ar": "وَٱلَّـٰتِى يَأْتِينَ ٱلْفَـٰحِشَةَ مِن نِّسَآئِكُمْ فَٱسْتَشْهِدُوا۟ عَلَيْهِنَّ أَرْبَعَةً مِّنكُمْ ۖ فَإِن شَهِدُوا۟ فَأَمْسِكُوهُنَّ فِى ٱلْبُيُوتِ حَتَّىٰ يَتَوَفَّىٰهُنَّ ٱلْمَوْتُ أَوْ يَجْعَلَ ٱللَّهُ لَهُنَّ سَبِيلًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:24",
      "text_ar": "وَٱلْمُحْصَنَـٰتُ مِنَ ٱلنِّسَآءِ إِلَّا مَا مَلَكَتْ أَيْمَـٰنُكُمْ ۖ كِتَـٰبَ ٱللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُم مَّا وَرَآءَ ذَٰلِكُمْ أَن تَبْتَغُوا۟ بِأَمْوَٰلِكُم مُّحْصِنِينَ غَيْرَ مُسَـٰفِحِينَ ۚ فَمَا ٱسْتَمْتَعْتُم بِهِۦ مِنْهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَٰضَيْتُم بِهِۦ مِنۢ بَعْدِ ٱلْفَرِيضَةِ ۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:25",
      "text_ar": "وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلًا أَن يَنكِحَ ٱلْمُحْصَنَـٰتِ ٱلْمُؤْمِنَـٰتِ فَمِن مَّا مَلَكَتْ أَيْمَـٰنُكُم مِّن فَتَيَـٰتِكُمُ ٱلْمُؤْمِنَـٰتِ ۚ وَٱللَّهُ أَعْلَمُ بِإِيمَـٰنِكُم ۚ بَعْضُكُم مِّنۢ بَعْضٍ ۚ فَٱنكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَءَاتُوهُنَّ أُجُورَهُنَّ بِٱلْمَعْرُوفِ مُحْصَنَـٰتٍ غَيْرَ مُسَـٰفِحَـٰتٍ وَلَا مُتَّخِذَٰتِ أَخْدَانٍ ۚ فَإِذَآ أُحْصِنَّ فَإِنْ أَتَيْنَ بِفَـٰحِشَةٍ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى ٱلْمُحْصَنَـٰتِ مِنَ ٱلْعَذَابِ ۚ ذَٰلِكَ لِمَنْ خَشِىَ ٱلْعَنَتَ مِنكُمْ ۚ وَأَن تَصْبِرُوا۟ خَيْرٌ لَّكُمْ ۗ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:33",
      "text_ar": "وَلِكُلٍّ جَعَلْنَا مَوَٰلِىَ مِمَّا تَرَكَ ٱلْوَٰلِدَانِ وَٱلْأَقْرَبُونَ ۚ وَٱلَّذِينَ عَقَدَتْ أَيْمَـٰنُكُمْ فَـَٔاتُوهُمْ نَصِيبَهُمْ ۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَىْءٍ شَهِيدًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:36",
      "text_ar": "وَٱعْبُدُوا۟ ٱللَّهَ وَلَا تُشْرِكُوا۟ بِهِۦ شَيْـًٔا ۖ وَبِٱلْوَٰلِدَيْنِ إِحْسَـٰنًا وَبِذِى ٱلْقُرْبَىٰ وَٱلْيَتَـٰمَىٰ وَٱلْمَسَـٰكِينِ وَٱلْجَارِ ذِى ٱلْقُرْبَىٰ وَٱلْجَارِ ٱلْجُنُبِ وَٱلصَّاحِبِ بِٱلْجَنۢبِ وَٱبْنِ ٱلسَّبِيلِ وَمَا مَلَكَتْ أَيْمَـٰنُكُمْ ۗ إِنَّ ٱللَّهَ لَا يُحِبُّ مَن كَانَ مُخْتَالًا فَخُورًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:37",
      "text_ar": "ٱلَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ ٱلنَّاسَ بِٱلْبُخْلِ وَيَكْتُمُونَ مَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضْلِهِۦ ۗ وَأَعْتَدْنَا لِلْكَـٰفِرِينَ عَذَابًا مُّهِينًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:58",
      "text_ar": "إِنَّ ٱللَّهَ يَأْمُرُكُمْ أَن تُؤَدُّوا۟ ٱلْأَمَـٰنَـٰتِ إِلَىٰٓ أَهْلِهَا وَإِذَا حَكَمْتُم بَيْنَ ٱلنَّاسِ أَن تَحْكُمُوا۟ بِٱلْعَدْلِ ۚ إِنَّ ٱللَّهَ نِعِمَّا يَعِظُكُم بِهِۦٓ ۗ إِنَّ ٱللَّهَ كَانَ سَمِيعًۢا بَصِيرًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:83",
      "text_ar": "وَإِذَا جَآءَهُمْ أَمْرٌ مِّنَ ٱلْأَمْنِ أَوِ ٱلْخَوْفِ أَذَاعُوا۟ بِهِۦ ۖ وَلَوْ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰٓ أُو۟لِى ٱلْأَمْرِ مِنْهُمْ لَعَلِمَهُ ٱلَّذِينَ يَسْتَنۢبِطُونَهُۥ مِنْهُمْ ۗ وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَٱتَّبَعْتُمُ ٱلشَّيْطَـٰنَ إِلَّا قَلِيلًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:91",
      "text_ar": "سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأْمَنُوكُمْ وَيَأْمَنُوا۟ قَوْمَهُمْ كُلَّ مَا رُدُّوٓا۟ إِلَى ٱلْفِتْنَةِ أُرْكِسُوا۟ فِيهَا ۚ فَإِن لَّمْ يَعْتَزِلُوكُمْ وَيُلْقُوٓا۟ إِلَيْكُمُ ٱلسَّلَمَ وَيَكُفُّوٓا۟ أَيْدِيَهُمْ فَخُذُوهُمْ وَٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ۚ وَأُو۟لَـٰٓئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَـٰنًا مُّبِينًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:104",
      "text_ar": "وَلَا تَهِنُوا۟ فِى ٱبْتِغَآءِ ٱلْقَوْمِ ۖ إِن تَكُونُوا۟ تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ ۖ وَتَرْجُونَ مِنَ ٱللَّهِ مَا لَا يَرْجُونَ ۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:119",
      "text_ar": "وَلَأُضِلَّنَّهُمْ وَلَأُمَنِّيَنَّهُمْ وَلَـَٔامُرَنَّهُمْ فَلَيُبَتِّكُنَّ ءَاذَانَ ٱلْأَنْعَـٰمِ وَلَـَٔامُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ ٱللَّهِ ۚ وَمَن يَتَّخِذِ ٱلشَّيْطَـٰنَ وَلِيًّا مِّن دُونِ ٱللَّهِ فَقَدْ خَسِرَ خُسْرَانًا مُّبِينًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:123",
      "text_ar": "لَّيْسَ بِأَمَانِيِّكُمْ وَلَآ أَمَانِىِّ أَهْلِ ٱلْكِتَـٰبِ ۗ مَن يَعْمَلْ سُوٓءًا يُجْزَ بِهِۦ وَلَا يَجِدْ لَهُۥ مِن دُونِ ٱللَّهِ وَلِيًّا وَلَا نَصِيرًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:4",
      "text_ar": "يَسْـَٔلُونَكَ مَاذَآ أُحِلَّ لَهُمْ ۖ قُلْ أُحِلَّ لَكُمُ ٱلطَّيِّبَـٰتُ ۙ وَمَا عَلَّمْتُم مِّنَ ٱلْجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُ ۖ فَكُلُوا۟ مِمَّآ أَمْسَكْنَ عَلَيْكُمْ وَٱذْكُرُوا۟ ٱسْمَ ٱللَّهِ عَلَيْهِ ۖ وَٱتَّقُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:53",
      "text_ar": "وَيَقُولُ ٱلَّذِينَ ءَامَنُوٓا۟ أَهَـٰٓؤُلَآءِ ٱلَّذِينَ أَقْسَمُوا۟ بِٱللَّهِ جَهْدَ أَيْمَـٰنِهِمْ ۙ إِنَّهُمْ لَمَعَكُمْ ۚ حَبِطَتْ أَعْمَـٰلُهُمْ فَأَصْبَحُوا۟ خَـٰسِرِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:89",
      "text_ar": "لَا يُؤَاخِذُكُمُ ٱللَّهُ بِٱللَّغْوِ فِىٓ أَيْمَـٰنِكُمْ وَلَـٰكِن يُؤَاخِذُكُم بِمَا عَقَّدتُّمُ ٱلْأَيْمَـٰنَ ۖ فَكَفَّـٰرَتُهُۥٓ إِطْعَامُ عَشَرَةِ مَسَـٰكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ ۖ فَمَن لَّمْ يَجِدْ فَصِيَامُ ثَلَـٰثَةِ أَيَّامٍ ۚ ذَٰلِكَ كَفَّـٰرَةُ أَيْمَـٰنِكُمْ إِذَا حَلَفْتُمْ ۚ وَٱحْفَظُوٓا۟ أَيْمَـٰنَكُمْ ۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمْ ءَايَـٰتِهِۦ لَعَلَّكُمْ تَشْكُرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:108",
      "text_ar": "ذَٰلِكَ أَدْنَىٰٓ أَن يَأْتُوا۟ بِٱلشَّهَـٰدَةِ عَلَىٰ وَجْهِهَآ أَوْ يَخَافُوٓا۟ أَن تُرَدَّ أَيْمَـٰنٌۢ بَعْدَ أَيْمَـٰنِهِمْ ۗ وَٱتَّقُوا۟ ٱللَّهَ وَٱسْمَعُوا۟ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْفَـٰسِقِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:117",
      "text_ar": "مَا قُلْتُ لَهُمْ إِلَّا مَآ أَمَرْتَنِى بِهِۦٓ أَنِ ٱعْبُدُوا۟ ٱللَّهَ رَبِّى وَرَبَّكُمْ ۚ وَكُنتُ عَلَيْهِمْ شَهِيدًا مَّا دُمْتُ فِيهِمْ ۖ فَلَمَّا تَوَفَّيْتَنِى كُنتَ أَنتَ ٱلرَّقِيبَ عَلَيْهِمْ ۚ وَأَنتَ عَلَىٰ كُلِّ شَىْءٍ شَهِيدٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:71",
      "text_ar": "قُلْ أَنَدْعُوا۟ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُنَا وَلَا يَضُرُّنَا وَنُرَدُّ عَلَىٰٓ أَعْقَابِنَا بَعْدَ إِذْ هَدَىٰنَا ٱللَّهُ كَٱلَّذِى ٱسْتَهْوَتْهُ ٱلشَّيَـٰطِينُ فِى ٱلْأَرْضِ حَيْرَانَ لَهُۥٓ أَصْحَـٰبٌ يَدْعُونَهُۥٓ إِلَى ٱلْهُدَى ٱئْتِنَا ۗ قُلْ إِنَّ هُدَى ٱللَّهِ هُوَ ٱلْهُدَىٰ ۖ وَأُمِرْنَا لِنُسْلِمَ لِرَبِّ ٱلْعَـٰلَمِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:81",
      "text_ar": "وَكَيْفَ أَخَافُ مَآ أَشْرَكْتُمْ وَلَا تَخَافُونَ أَنَّكُمْ أَشْرَكْتُم بِٱللَّهِ مَا لَمْ يُنَزِّلْ بِهِۦ عَلَيْكُمْ سُلْطَـٰنًا ۚ فَأَىُّ ٱلْفَرِيقَيْنِ أَحَقُّ بِٱلْأَمْنِ ۖ إِن كُنتُمْ تَعْلَمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "6:82",
      "text_ar": "ٱلَّذِينَ ءَامَنُوا۟ وَلَمْ يَلْبِسُوٓا۟ إِيمَـٰنَهُم بِظُلْمٍ أُو۟لَـٰٓئِكَ لَهُمُ ٱلْأَمْنُ وَهُم مُّهْتَدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_013_chunk00",
        "verse_key": "2:13",
        "text_ar": "{وإذا قيل لهم}: أي للمنافقين، وقيل: لليهود.{آمنوا كما آمن الناس} عبد الله بن سلام وغيره من مؤمني أهل الكتاب، وقيل: كما آمن المهاجرون والأنصار.{قالوا أنؤمن كما آمن السفهاء}: أي الجُهَّال.فإن قيل: كيف يصح النفاق مع (المهاجرة) بقولهم (أنؤمن كما آمن السفهاء)؟ قيل: أنهم كانوا يظهرون هذا القول فيما بينهم لا عند المؤمنين، فأخبر الله نبيه صلى الله عليه وسلم والمؤمنين بذلك فَرَدَّ الله عليهم فقال:{ألا إنهم هم السفهاء ولكن لا يعلمون}: أنهم كذلك فالسفيه خفيف العقل رقيق الحلم من قولهم: ثوب سفيه أي رقير، وقي",
        "char_start": 0,
        "char_end": 972,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "{أتأمرون الناس بالبر} أي بالطاعة، نزلت في علماء اليهود، وذلك أن الرجل منهم كان يقول لقريبه وحليفه من المسلمين إذا سأله عن أمر محمد صلى الله عليه وسلم: اثبت على دينه فإن أمره حق وقوله صدق.وقيل: هو خطاب لأحبارهم حيث أمروا أتباعهم بالتمسك بالتوراة، ثم خالفوا وغيروا نعت محمد صلى الله عليه وسلم.{وتنسون أنفسكم} أي تتركون أنفسكم فلا تتبعونه.{وأنتم تتلون الكتاب} تقرؤون التوراة فيها نعته وصفته.{أفلا تعقلون} أنه حق فتتبعونه.والعقل مأخوذ من عقال الدابة؛ وهو ما يشد به ركبة البعير فيمنعه من الشرود، فكذلك الع",
        "char_start": 0,
        "char_end": 1449,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_075_chunk00",
        "verse_key": "2:75",
        "text_ar": "قوله تعالى: {أفتطمعون} أفترجون؟؛ يريد: محمداً وأصحابه.{أن يؤمنوا لكم} تصدقكم اليهود بما تخبرونهم به.{وقد كان فريق منهم يسمعون كلام الله} يعني التوراة.{ثم يحرفونه} يغيرون ما فيها من الأحكام.{من بعد ما عقلوه} علموه كما غيروا صفة محمد صلى الله عليه وسلم، وآية الرجم.{وهم يعلمون} أنهم كاذبون، هذا قول مجاهد وقتادة وعكرمة والسدي وجماعة، وقال ابن عباس ومقاتل: \"نزلت في السبعين الذين اختارهم موسى لميقات ربه، وذلك أنهم لما رجعوا - بعد ما سمعوا كلام الله - إلى قومهم رجع الناس إلى قولهم، وأما الصادقون منهم ف",
        "char_start": 0,
        "char_end": 648,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_078_chunk00",
        "verse_key": "2:78",
        "text_ar": "وقوله تعالى: {ومنهم أميون} أي من اليهود أميون لا يحسنون القراءة والكتابة، جمع أمي منسوب إلى الأم كأنه باق على ما انفصل من الأم لم يتعلم كتابة ولا قراءة.وروي عن رسول الله صلى الله عليه وسلم أنه قال: \"إنا أمة أمية لا نكتب ولا نحسب\".وقيل: هو منسوب إلى أم القرى وهي مكة.{لا يعلمون الكتاب إلا أماني} قرأ أبو جعفر: أماني بتخفيف الياء كل القرآن حذف إحدى الياءين (تخفيفاً)، وقراءة العامة بالتشديد، وهي جمع الأمنية وهي التلاوة.قال الله تعالى: {إلا إذا تمنى ألقى الشيطان في أمنيته} [52-الحج] أي في قراءته، قال ",
        "char_start": 0,
        "char_end": 1363,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "قوله عز وجل: {ثم أنتم هؤلاء} يعني: يا هؤلاء، وهؤلاء للتنبيه.{تقتلون أنفسكم} أي (يقتل) بعضكم بعضاً.{وتخرجون فريقاً منكم من ديارهم تظاهرون عليهم} بتشديد الظاء أي تتظاهرون أدغمت التاء في الظاء، وقرأ عاصم وحمزة والكسائي بتخفيف الظاء فحذفوا تاء التفاعل وأبقوا تاء الخطاب كقوله تعالى: {ولا تعاونوا} معناهما جميعاً: تتعاونون، والظهير: العون.{بالإثم والعدوان} المعصية والظلم.{وإن يأتوكم أسارى} وقرأ حمزة: أسرى، وهما جمع أسير، ومعناهما واحد.{تفادوهم} بالمال وتنقذوهم.وقرأ أهل المدينة وعاصم والكسائي ويعقوب ( ت",
        "char_start": 0,
        "char_end": 1904,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_111_chunk00",
        "verse_key": "2:111",
        "text_ar": "قوله: {وقالوا لن يدخل الجنة إلا من كان هوداً} أي يهودياً، قال الفراء: \"حذف الياء الزائدة ورجع إلى الفعل من اليهودية\"، وقال الأخفش : \"الهود: جمع هائد، مثل عائد وعود، وحائل وحول\".{أو نصارى} وذلك أن اليهود قالوا: لن يدخل الجنة إلا من كان يهودياً ولا دين إلا دين اليهودية، وقالت النصارى لن يدخل الجنة إلا من كان نصرانياً ولا دين إلا دين النصرانية.وقيل: نزلت في وفد نجران وكانوا نصارى اجتمعوا في مجلس رسول الله صلى الله عليه وسلم مع اليهود فكذب بعضهم.قال الله تعالى: {تلك أمانيهم} أي شهواتهم الباطلة التي ",
        "char_start": 0,
        "char_end": 602,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_124_chunk00",
        "verse_key": "2:124",
        "text_ar": "قوله تعالى: {وإذ ابتلى إبراهيم ربه بكلمات فأتمهن} قرأ ابن عامر (إبراهام) بالألف في أكثر المواضع وهو اسم أعجمي ولذلك لا يجر وهو إبراهيم بن تارخ بن ناخور وكان مولده بالسوس من أرض الأهواز وقيل بابل وقيل: كوفي، وقيل:لشكر، وقيل حران، وكان أبوه نقله إلى أرض بابل أرض نمرود بن كنعان.ومعنى الابتلاء: الاختبار والامتحان والأمر، وابتلاء الله العباد ليس ليعلم أحوالهم بالابتلاء، لأنه عالم بهم، ولكن ليعلم العباد أحوالهم حتى يعرف بعضهم بعضاً.واختلفوا في الكلمات التي ابتلى الله بها إبراهيم عليه السلام؛ فقال عكرم",
        "char_start": 0,
        "char_end": 2547,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_125_chunk00",
        "verse_key": "2:125",
        "text_ar": "قال الله تعالى: {وإذ جعلنا البيت} يعني الكعبة.{مثابة للناس} مرجعاً لهم، قال مجاهد وسعيد بن جبير: \"يأتون إليه من كل جانب ويحجون\"، وقال ابن عباس رضي الله عنهما: \"معاذاً وملجأ\"، وقال قتادة وعكرمة: \"مجمعاً\".{وأمنا} أي مأمناً يأمنون فيه من إيذاء المشركين، فإنهم ما كانوا يتعرضون لأهل مكة ويقولون: هم أهل الله ويتعرضون لمن حوله كما قال الله تعال: {أولم يروا أنا جعلنا حرما آمنا ويتخطف الناس من حولهم} [67-العنكبوت].أخبرنا عبد الواحد المليحي أنا أحمد بن عبد الله النعيمي أنا محمد بن يوسف أنا محمد بن إسماعيل",
        "char_start": 0,
        "char_end": 5302,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "{قل} يا محمد لليهود والنصارى.{أتحاجوننا في الله} أي في دين الله، والمحاجة: المجادلة في الله لإظهار الحجة، وذلك بأنهم قالوا إن الأنبياء كانوا منا وعلى ديننا، وديننا أقوم فنحن أولى بالله منكم فقال الله تعالى: {قل أتحاجوننا في الله}.{وهو ربنا وربكم} أي نحن وأنتم سواء في الله فإنه ربنا وربكم.{ولنا أعمالنا ولكم أعمالكم} أي لكل واحد جزاء عمله، فكيف تدعون أنكم أولى بالله.{ونحن له مخلصون} وأنتم به مشركون. قال سعيد بن جبير : \"الإخلاص أن يخلص العبد دينه وعمله لله فلا يشرك به في دينه ولا يرائي بعمله\"، قال ",
        "char_start": 0,
        "char_end": 593,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_161_chunk00",
        "verse_key": "2:161",
        "text_ar": "{إن الذين كفروا وماتوا وهم كفار أولئك عليهم لعنة الله والملائكة} أي لعنة الملائكة.{والناس أجمعين} قال أبو العالية: \"هذا يوم القيامة يوقف الكافر فيلعنه الله ثم تلعنه الملائكة ثم يلعنه الناس\".فإن قيل فقد قال {والناس أجمعين} والملعون هو من جملة الناس فكيف يلعن نفسه؟ قيل: يلعن نفسه في القيامة قال الله تعالى: {ويلعن بعضكم بعضاً} [25-العنكبوت]. وقيل: إنهم يلعنون الظالمين والكافرين ومن يلعن الظالمين والكافرين وهو منهم فقد لعن نفسه.",
        "char_start": 0,
        "char_end": 428,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_196_chunk00",
        "verse_key": "2:196",
        "text_ar": "قوله عز وجل ( وأتموا الحج والعمرة لله ) قرأ علقمة وإبراهيم النخعي ( وأقيموا الحج والعمرة لله ) واختلفوا في إتمامهما فقال بعضهم هو أن يتمهما بمناسكهما وحدودهما ، وسننهما وهو قول ابن عباس وعلقمة وإبراهيم النخعي ومجاهد وأركان الحج خمسة . . الإحرام والوقوف بعرفة وطواف الزيارة والسعي بين الصفا والمروة وحلق الرأس أو التقصير وللحج تحللان وأسباب التحلل ثلاثة رمي جمرة العقبة يوم النحر وطواف الزيارة ، والحلق فإذا وجد شيئان من هذه الأشياء الثلاثة حصل التحلل الأول وبالثلاث حصل التحلل الثاني وبعد التحلل الأو",
        "char_start": 0,
        "char_end": 16395,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_224_chunk00",
        "verse_key": "2:224",
        "text_ar": "قوله تعالى : ( ولا تجعلوا الله عرضة لأيمانكم ) نزلت في عبد الله بن رواحة كان بينه وبين ختنه على أخته بشير بن النعمان الأنصاري شيء فحلف عبد الله أن لا يدخل عليه ولا يكلمه ولا يصلح بينه وبين خصمه وإذا قيل له فيه قال : قد حلفت بالله أن لا أفعل فلا يحل لي إلا أن تبر بيميني فأنزل الله هذه الآية .وقال ابن جريج : نزلت في أبي بكر الصديق حين حلف أن لا ينفق على مسطح حين خاض في حديث الإفك ، والعرضة : أصلها الشدة والقوة ومنه قيل للدابة التي تتخذ للسفر عرضة لقوتها عليه ثم قيل لكل ما يصلح لشيء هو عرضة له حتى ",
        "char_start": 0,
        "char_end": 1112,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_225_chunk00",
        "verse_key": "2:225",
        "text_ar": "قوله تعالى : ( لا يؤاخذكم الله باللغو في أيمانكم ) اللغو كل مطرح من الكلام لا يعتد به واختلف أهل العلم في اللغو في اليمين المذكورة في الآية فقال قوم : هو ما يسبق إلى اللسان على عجلة لصلة الكلام من غير عقد وقصد كقول القائل : لا والله وبلى والله وكلا والله .أخبرنا عبد الوهاب بن محمد الكسائي أنا عبد العزيز بن أحمد الخلال أخبرنا أبو العباس الأصم أنا الربيع أنا الشافعي أنا مالك عن هشام بن عروة عن أبيه عن عائشة أنها قالت : لغو اليمين قول الإنسان : لا والله وبلى والله ورفعه بعضهم وإلى هذا ذهب الشعبي وع",
        "char_start": 0,
        "char_end": 2734,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_228_chunk00",
        "verse_key": "2:228",
        "text_ar": "قوله تعالى : ( والمطلقات ) أي المخليات من حبال أزواجهن ) ( يتربصن ) ينتظرن ( بأنفسهن ثلاثة قروء ) فلا يتزوجن والقروء : جمع قرء مثل فرع وجمعه القليل أقرؤ والجمع الكثير أقراء واختلف أهل العلم في القروء فذهب جماعة إلى أنها الحيض وهو قول عمر وعلي وابن مسعود وابن عباس وبه قال الحسن ومجاهد وإليه ذهب الأوزاعي والثوري وأصحاب الرأي واحتجوا بأن النبي صلى الله عليه وسلم قال للمستحاضة : \" دعي الصلاة أيام أقرائك \" وإنما تدع المرأة الصلاة أيام حيضها . وذهب جماعة إلى أنها الأطهار وهو قول زيد بن ثابت وعبد الله ",
        "char_start": 0,
        "char_end": 6575,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_231_chunk00",
        "verse_key": "2:231",
        "text_ar": "قوله تعالى : ( وإذا طلقتم النساء فبلغن أجلهن ) الآية نزلت في رجل من الأنصار يدعى ثابت بن يسار طلق امرأته حتى إذا قرب انقضاء عدتها راجعها ثم طلقها يقصد بذلك مضارتها . .قوله تعالى : ( فبلغن أجلهن ) أي أشرفن على أن يبن بانقضاء العدة ولم يرد حقيقة انقضاء العدة لأن العدة إذا انقضت لم يكن للزوج إمساكها فالبلوغ هاهنا بلوغ مقاربة وفي قوله تعالى بعد هذا ( فبلغن أجلهن فلا تعضلوهن ) حقيقة انقضاء العدة والبلوغ يتناول المعنيين يقال : بلغ المدينة إذا قرب منها وإذا دخلها ) ( فأمسكوهن ) أي راجعوهن ) ( بمعروف ) ",
        "char_start": 0,
        "char_end": 1530,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_239_chunk00",
        "verse_key": "2:239",
        "text_ar": "قوله تعالى : ( فإن خفتم فرجالا ) ( فرجالا ) أي رجالة يقال : راجل ورجال مثل صاحب وصحاب وقائم وقيام ونائم ونيام ( أو ركبانا ) على دوابهم وهو جمع راكب معناه إن لم يمكنكم أن تصلوا قانتين موفين للصلاة حقها لخوف فصلوا مشاة على أرجلكم أو ركبانا على ظهور دوابكم وهذا في حال المقاتلة والمسايفة يصلي حيث كان وجهه راجلا أو راكبا مستقبل القبلة وغير مستقبلها ويومئ بالركوع والسجود ويجعل السجود أخفض من الركوع وكذلك إذا قصده سبع أو غشيه سيل يخاف منه على نفسه فعدا أمامه مصليا بالإيماء يجوز .والصلاة في حال الخوف عل",
        "char_start": 0,
        "char_end": 1096,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_250_chunk00",
        "verse_key": "2:250",
        "text_ar": "ولما برزوا ) يعني طالوت وجنوده يعني المؤمنين ( لجالوت وجنوده ) المشركين ومعنى برزوا صاروا بالبراز من الأرض وهو ما ظهر واستوى ( قالوا ربنا أفرغ علينا ) أنزل واصبب ( صبرا وثبت أقدامنا ) قلوبنا ( وانصرنا على القوم الكافرين",
        "char_start": 0,
        "char_end": 219,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_283_chunk00",
        "verse_key": "2:283",
        "text_ar": "( وإن كنتم على سفر ولم تجدوا كاتبا فرهان مقبوضة ) قرأ ابن كثير وأبو عمرو فرهن بضم الهاء والراء وقرأ الباقون فرهان وهو جمع رهن مثل بغل وبغال وجبل وجبال والرهن جمع الرهان جمع الجمع قاله الفراء والكسائي وقال أبو عبيد وغيره : هو جمع الرهن أيضا مثل سقف وسقف وقال أبو عمرو وإنما قرأنا فرهن ليكون فرقا بينهما وبين رهان الخيل وقرأ عكرمة فرهن بضم الراء وسكون الهاء والتخفيف والتثقيل في الرهن لغتان مثل كتب وكتب ورسل ورسل ومعنى الآية : وإن كنتم على سفر ولم تجدوا آلات الكاتبة فارتهنوا ممن تداينونه رهونا لتكون ",
        "char_start": 0,
        "char_end": 1553,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_020_chunk00",
        "verse_key": "3:20",
        "text_ar": "قوله تعالى : ( فإن حاجوك ) أي خاصموك يا محمد في الدين ، وذلك أن اليهود والنصارى قالوا : لسنا على ما سميتنا به يا محمد إنما اليهودية والنصرانية نسب ، والدين هو الإسلام ونحن عليه فقال الله تعالى ( فقل أسلمت وجهي لله ) أي انقدت لله وحده بقلبي ولساني وجميع جوارحي ، وإنما خص الوجه لأنه أكرم الجوارح من الإنسان وفيه بهاؤه ، فإذا خضع وجهه للشيء خضع له جميع جوارحه ، وقال الفراء : معناه أخلصت عملي لله ( ومن اتبعن ) أي ومن اتبعني أسلم كما أسلمت ، وأثبت نافع وأبو عمرو الياء في قوله تعالى ( اتبعني ) على الأص",
        "char_start": 0,
        "char_end": 1100,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_021_chunk00",
        "verse_key": "3:21",
        "text_ar": "قوله تعالى : ( إن الذين يكفرون بآيات الله ) يجحدون بآيات الله يعني القرآن ، وهم اليهود والنصارى ( ويقتلون النبيين بغير حق ويقتلون الذين يأمرون بالقسط من الناس ) قرأ حمزة : ويقاتلون الذين يأمرون ، قال ابن جريج : كان الوحي يأتي على [ أنبياء ] بني إسرائيل ولم يكن يأتيهم كتاب ، فيذكرون قومهم فيقتلون ، فيقوم رجال ممن اتبعهم وصدقهم فيذكرون قومهم فيقتلون أيضا فهم الذين يأمرون بالقسط من الناس .أخبرنا أبو سعيد الشريحي ، أنا أبو إسحاق الثعلبي ، أنا أبو عبد الله الحسين بن محمد بن فنجويه الدينوري ، أنا أبو ",
        "char_start": 0,
        "char_end": 1421,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_013_chunk00",
        "verse_key": "2:13",
        "text_ar": "يقول [ الله ] تعالي : واذا قيل للمنافقين : ( امنوا كما امن الناس ) اي : كايمان الناس بالله وملايكته وكتبه ورسله والبعث بعد الموت والجنه والنار وغير ذلك ، مما اخبر المومنين به وعنه ، واطيعوا الله ورسوله في امتثال الاوامر وترك الزواجر ( قالوا انومن كما امن السفهاء ) يعنون - لعنهم الله - اصحاب رسول الله صلي الله عليه وسلم ، رضي الله عنهم ، قاله ابو العاليه والسدي في تفسيره ، بسنده عن ابن عباس وابن مسعود وغير واحد من الصحابه ، وبه يقول الربيع بن انس ، وعبد الرحمن بن زيد بن اسلم وغيرهم ، يقولون : انص",
        "char_start": 0,
        "char_end": 1103,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "يقول تعالي : كيف يليق بكم - يا معشر اهل الكتاب ، وانتم تامرون الناس بالبر ، وهو جماع الخير - ان تنسوا انفسكم ، فلا تاتمروا بما تامرون الناس به ، وانتم مع ذلك تتلون الكتاب ، وتعلمون ما فيه علي من قصر في اوامر الله ؟ افلا تعقلون ما انتم صانعون بانفسكم ؛ فتنتبهوا من رقدتكم ، وتتبصروا من عمايتكم . وهذا كما قال عبد الرزاق عن معمر ، عن قتاده في قوله تعالي : ( اتامرون الناس بالبر وتنسون انفسكم ) قال : كان بنو اسراييل يامرون الناس بطاعه الله وبتقواه ، وبالبر ، ويخالفون ، فعيرهم الله ، عز وجل . وكذلك قال",
        "char_start": 0,
        "char_end": 8988,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_075_chunk00",
        "verse_key": "2:75",
        "text_ar": "يقول تعالي : ( افتطمعون ) ايها المومنون ( ان يومنوا لكم ) اي : ينقاد لكم بالطاعه ، هولاء الفرقه الضاله من اليهود ، الذين شاهد اباوهم من الايات البينات ما شاهدوه ثم قست قلوبهم من بعد ذلك ( وقد كان فريق منهم يسمعون كلام الله ثم يحرفونه ) اي : يتاولونه علي غير تاويله ( من بعد ما عقلوه ) اي : فهموه علي الجليه ومع هذا يخالفونه علي بصيره ( وهم يعلمون ) انهم مخطيون فيما ذهبوا اليه من تحريفه وتاويله ؟ وهذا المقام شبيه بقوله تعالي : ( فبما نقضهم ميثاقهم لعناهم وجعلنا قلوبهم قاسيه يحرفون الكلم عن مواضعه )",
        "char_start": 0,
        "char_end": 2751,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_078_chunk00",
        "verse_key": "2:78",
        "text_ar": "يقول تعالي : ( ومنهم اميون ) اي : ومن اهل الكتاب ، قاله مجاهد : والاميون جمع امي ، وهو : الرجل الذي لا يحسن الكتابه ، قاله ابو العاليه ، والربيع ، وقتاده ، وابراهيم النخعي ، وغير واحد وهو ظاهر في قوله تعالي : ( لا يعلمون الكتاب ) [ الا اماني ] ) اي : لا يدرون ما فيه . ولهذا في صفات النبي صلي الله عليه وسلم انه امي ; لانه لم يكن يحسن الكتابه ، كما قال تعالي : ( وما كنت تتلو من قبله من كتاب ولا تخطه بيمينك اذا لارتاب المبطلون ) [ العنكبوت : 48 ] وقال عليه الصلاه والسلام : \" انا امه اميه ، لا نكتب ",
        "char_start": 0,
        "char_end": 2628,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "( ثم انتم هولاء تقتلون انفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالاثم والعدوان وان ياتوكم اساري تفادوهم وهو محرم عليكم اخراجهم ) قال محمد بن اسحاق بن يسار : حدثني محمد بن ابي محمد ، عن سعيد بن جبير او عكرمه عن ابن عباس : ( ثم انتم هولاء تقتلون انفسكم ) الايه ، قال : انبهم الله من فعلهم ، وقد حرم عليهم في التوراه سفك دمايهم وافترض عليهم فيها فداء اسراهم ، فكانوا فريقين : طايفه منهم بنو قينقاع وانهم حلفاء الخزرج ، والنضير ، وقريظه وانهم حلفاء الاوس ، فكانوا اذا كانت بين الاوس والخزرج حرب",
        "char_start": 0,
        "char_end": 3715,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_111_chunk00",
        "verse_key": "2:111",
        "text_ar": "يبين تعالي اغترار اليهود والنصاري بما هم فيه ، حيث ادعت كل طايفه من اليهود والنصاري انه لن يدخل الجنه الا من كان علي ملتها ، كما اخبر الله عنهم في سوره المايده انهم قالوا : ( نحن ابناء الله واحباوه ) [ المايده : 18 ] . فاكذبهم الله تعالي بما اخبرهم انه معذبهم بذنوبهم ، ولو كانوا كما ادعوا لما كان الامر كذلك ، وكما تقدم من دعواهم انه لن تمسهم النار الا اياما معدوده ، ثم ينتقلون الي الجنه . ورد عليهم تعالي في ذلك ، وهكذا قال لهم في هذه الدعوي التي ادعوها بلا دليل ولا حجه ولا بينه ، فقال ( تلك امان",
        "char_start": 0,
        "char_end": 752,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_124_chunk00",
        "verse_key": "2:124",
        "text_ar": "يقول تعالي منبها علي شرف ابراهيم خليله ، عليه السلام وان الله تعالي جعله اماما للناس يقتدي به في التوحيد ، حتي قام بما كلفه الله تعالي به من الاوامر والنواهي ; ولهذا قال : ( واذ ابتلي ابراهيم ربه بكلمات ) اي : واذكر يا محمد لهولاء المشركين واهل الكتابين الذين ينتحلون مله ابراهيم وليسوا عليها ، وانما الذي هو عليها مستقيم فانت والذين معك من المومنين ، اذكر لهولاء ابتلاء الله ابراهيم ، اي : اختباره له بما كلفه به من الاوامر والنواهي ( فاتمهن ) اي : قام بهن كلهن ، كما قال تعالي : ( وابراهيم الذي وفي",
        "char_start": 0,
        "char_end": 13495,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_125_chunk00",
        "verse_key": "2:125",
        "text_ar": "قال العوفي ، عن ابن عباس : قوله تعالي : ( واذ جعلنا البيت مثابه للناس ) يقول : لا يقضون منه وطرا ، ياتونه ، ثم يرجعون الي اهليهم ، ثم يعودون اليه .وقال علي بن ابي طلحه ، عن ابن عباس : ( مثابه للناس ) يقول : يثوبون .رواهما ابن جرير .وقال ابن ابي حاتم : اخبرنا ابي ، اخبرنا عبد الله بن رجاء ، اخبرنا اسراييل ، عن مسلم ، عن مجاهد ، عن ابن عباس ، في قوله تعالي : ( واذ جعلنا البيت مثابه للناس ) قال : يثوبون اليه ثم يرجعون . قال : وروي عن ابي العاليه ، وسعيد بن جبير في روايه وعطاء ، ومجاهد ، والحسن ، وع",
        "char_start": 0,
        "char_end": 18025,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "يقول الله تعالي مرشدا نبيه صلوات الله وسلامه عليه الي درء مجادله المشركين : ( قل اتحاجوننا في الله ) اي : اتناظروننا في توحيد الله والاخلاص له والانقياد ، واتباع اوامره وترك زواجره ( وهو ربنا وربكم ) المتصرف فينا وفيكم ، المستحق لاخلاص الالهيه له وحده لا شريك له ! ( ولنا اعمالنا ولكم اعمالكم ) اي : نحن براء منكم ، وانتم براء منا ، كما قال في الايه الاخري : ( وان كذبوك فقل لي عملي ولكم عملكم انتم برييون مما اعمل وانا بريء مما تعملون ) [ يونس : 41 ] وقال تعالي : ( فان حاجوك فقل اسلمت وجهي لله ومن ",
        "char_start": 0,
        "char_end": 1026,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_161_chunk00",
        "verse_key": "2:161",
        "text_ar": "فصل : لا خلاف في جواز لعن الكفار ، وقد كان عمر بن الخطاب ، رضي الله عنه ، وعمن بعده من الايمه ، يلعنون الكفره في القنوت وغيره ; فاما الكافر المعين ، فقد ذهب جماعه من العلماء الي انه لا يلعن لانا لا ندري بما يختم له ، واستدل بعضهم بهذه الايه : ( ان الذين كفروا وماتوا وهم كفار اوليك عليهم لعنه الله والملايكه والناس اجمعين ) وقالت طايفه اخري : بل يجوز لعن الكافر المعين . واختار ذلك الفقيه ابو بكر بن العربي المالكي ، ولكنه احتج بحديث فيه ضعف ، واستدل غيره بقوله ، عليه السلام ، في صحيح البخاري في قصه",
        "char_start": 0,
        "char_end": 748,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_196_chunk00",
        "verse_key": "2:196",
        "text_ar": "لما ذكر تعالي احكام الصيام وعطف بذكر الجهاد ، شرع في بيان المناسك ، فامر باتمام الحج والعمره ، وظاهر السياق اكمال افعالهما بعد الشروع فيهما ; ولهذا قال بعده : ( فان احصرتم ) اي : صددتم عن الوصول الي البيت ومنعتم من اتمامهما . ولهذا اتفق العلماء علي ان الشروع في الحج والعمره ملزم ، سواء قيل بوجوب العمره او باستحبابها ، كما هما قولان للعلماء . وقد ذكرناهما بدلايلهما في كتابنا \" الاحكام \" مستقصي ولله الحمد والمنه .وقال شعبه ، عن عمرو بن مره ، عن عبد الله بن سلمه ، عن علي : انه قال في هذه الايه : ( ",
        "char_start": 0,
        "char_end": 20422,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_224_chunk00",
        "verse_key": "2:224",
        "text_ar": "يقول تعالي : لا تجعلوا ايمانكم بالله تعالي مانعه لكم من البر وصله الرحم اذا حلفتم علي تركها ، كقوله تعالي : ( ولا ياتل اولو الفضل منكم والسعه ان يوتوا اولي القربي والمساكين والمهاجرين في سبيل الله وليعفوا وليصفحوا الا تحبون ان يغفر الله لكم والله غفور رحيم ) [ النور : 22 ] ، فالاستمرار علي اليمين اثم لصاحبها من الخروج منها بالتكفير . كما قال البخاري :حدثنا اسحاق بن ابراهيم ، اخبرنا عبد الرزاق ، اخبرنا معمر ، عن همام بن منبه ، قال : هذا ما حدثنا ابو هريره عن النبي صلي الله عليه وسلم قال : \" نحن ا",
        "char_start": 0,
        "char_end": 2994,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_225_chunk00",
        "verse_key": "2:225",
        "text_ar": "وقوله : ( لا يواخذكم الله باللغو في ايمانكم اي : لا يعاقبكم ولا يلزمكم بما صدر منكم من الايمان اللاغيه ، وهي التي لا يقصدها الحالف ، بل تجري علي لسانه عاده من غير تعقيد ولا تاكيد ، كما ثبت في الصحيحين من حديث الزهري ، عن حميد بن عبد الرحمن ، عن ابي هريره : ان رسول الله صلي الله عليه وسلم قال : \" من حلف فقال في حلفه : واللات والعزي ، فليقل : لا اله الا الله \" فهذا قاله لقوم حديثي عهد بجاهليه ، قد اسلموا والسنتهم قد الفت ما كانت عليه من الحلف باللات من غير قصد ، فامروا ان يتلفظوا بكلمه الاخلاص ، ك",
        "char_start": 0,
        "char_end": 5016,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_228_chunk00",
        "verse_key": "2:228",
        "text_ar": "هذا الامر من الله سبحانه وتعالي للمطلقات المدخول بهن من ذوات الاقراء ، بان يتربصن بانفسهن ثلاثه قروء ، اي : بان تمكث احداهن بعد طلاق زوجها لها ثلاثه قروء ; ثم تتزوج ان شاءت ، وقد اخرج الايمه الاربعه من هذا العموم الامه اذا طلقت ، فانها تعتد عندهم بقرءين ، لانها علي النصف من الحره ، والقرء لا يتبعض فكمل لها قرءان . ولما رواه ابن جريح عن مظاهر بن اسلم المخزومي المدني ، عن القاسم ، عن عايشه : ان رسول الله صلي الله عليه وسلم قال : \" طلاق الامه تطليقتان وعدتها حيضتان \" .رواه ابو داود ، والترمذي وابن ",
        "char_start": 0,
        "char_end": 7364,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_231_chunk00",
        "verse_key": "2:231",
        "text_ar": "هذا امر من الله عز وجل للرجال اذا طلق احدهم المراه طلاقا له عليها فيه رجعه ، ان يحسن في امرها اذا انقضت عدتها ، ولم يبق منها الا مقدار ما يمكنه فيه رجعتها ، فاما ان يمسكها ، اي : يرتجعها الي عصمه نكاحه بمعروف ، وهو ان يشهد علي رجعتها ، وينوي عشرتها بالمعروف ، او يسرحها ، اي : يتركها حتي تنقضي عدتها ، ويخرجها من منزله بالتي هي احسن ، من غير شقاق ولا مخاصمه ولا تقابح ، قال الله تعالي : ( ولا تمسكوهن ضرارا لتعتدوا ) قال ابن عباس ، ومجاهد ، ومسروق ، والحسن ، وقتاده ، والضحاك ، والربيع ، ومقاتل بن حي",
        "char_start": 0,
        "char_end": 3476,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_239_chunk00",
        "verse_key": "2:239",
        "text_ar": "وقوله : ( فان خفتم فرجالا او ركبانا فاذا امنتم فاذكروا الله كما علمكم ما لم تكونوا تعلمون ) لما امر تعالي عباده بالمحافظه علي الصلوات ، والقيام بحدودها ، وشدد الامر بتاكيدها ذكر الحال التي يشتغل الشخص فيها عن ادايها علي الوجه الاكمل ، وهي حال القتال والتحام الحرب فقال : ( فان خفتم فرجالا او ركبانا ) اي : فصلوا علي اي حال كان ، رجالا او ركبانا : يعني : مستقبلي القبله وغير مستقبليها كما قال مالك ، عن نافع : ان ابن عمر كان اذا سيل عن صلاه الخوف وصفها . ثم قال : فان كان خوف اشد من ذلك صلوا رجالا علي",
        "char_start": 0,
        "char_end": 4382,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_250_chunk00",
        "verse_key": "2:250",
        "text_ar": "اي : لما واجه حزب الايمان وهم قليل من اصحاب طالوت لعدوهم اصحاب جالوت وهم عدد كثير ( قالوا ربنا افرغ علينا صبرا ) اي : انزل علينا صبرا من عندك ( وثبت اقدامنا ) اي : في لقاء الاعداء وجنبنا الفرار والعجز ( وانصرنا علي القوم الكافرين )قال الله تعالي : ( فهزموهم باذن الله ) اي : غلبوهم وقهروهم بنصر الله لهم ( وقتل داود جالوت ) ذكروا في الاسراييليات : انه قتله بمقلاع كان في يده رماه به فاصابه فقتله ، وكان طالوت قد وعده ان قتل جالوت ان يزوجه ابنته ويشاطره نعمته ويشركه في امره فوفي له ثم ال الملك الي دا",
        "char_start": 0,
        "char_end": 2561,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_283_chunk00",
        "verse_key": "2:283",
        "text_ar": "يقول تعالي : ( وان كنتم علي سفر ) اي : مسافرين وتداينتم الي اجل مسمي ( ولم تجدوا كاتبا ) يكتب لكم . قال ابن عباس : او وجدوه ولم يجد قرطاسا او دواه او قلما فرهن مقبوضه ، اي : فليكن بدل الكتابه رهان مقبوضه في يد صاحب الحق .وقد استدل بقوله : ( فرهان مقبوضه ) علي ان الرهن لا يلزم الا بالقبض ، كما هو مذهب الشافعي والجمهور ، واستدل بها اخرون علي انه لا بد ان يكون الرهن مقبوضا في يد المرتهن ، وهو روايه عن الاماماحمد ، وذهب اليه طايفه .واستدل اخرون من السلف بهذه الايه علي انه لا يكون الرهن مشروعا الا في",
        "char_start": 0,
        "char_end": 1839,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_020_chunk00",
        "verse_key": "3:20",
        "text_ar": "ثم قال تعالي : ( فان حاجوك ) اي : جادلوك في التوحيد ( فقل اسلمت وجهي لله ومن اتبعن ) اي : فقل اخلصت عبادتي لله وحده ، لا شريك له ولا ند [ له ] ولا ولد ولا صاحبه له ( ومن اتبعن ) علي ديني ، يقول كمقالتي ، كما قال تعالي : ( قل هذه سبيلي ادعو الي الله علي بصيره انا ومن اتبعني [ وسبحان الله وما انا من المشركين ] ) [ يوسف : 108 ] .ثم قال تعالي امرا لعبده ورسوله محمد صلي الله عليه وسلم ان يدعو الي طريقته ودينه ، والدخول في شرعه وما بعثه الله به الكتابيين من الملتين والاميين من المشركين فقال : ( وقل لل",
        "char_start": 0,
        "char_end": 2356,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_021_chunk00",
        "verse_key": "3:21",
        "text_ar": "هذا ذم من الله تعالي لاهل الكتاب فيما ارتكبوه من الماثم والمحارم في تكذيبهم بايات الله قديما وحديثا ، التي بلغتهم اياها الرسل ، استكبارا عليهم وعنادا لهم ، وتعاظما علي الحق واستنكافا عن اتباعه ، ومع هذا قتلوا من قتلوا من النبيين حين بلغوهم عن الله شرعه ، بغير سبب ولا جريمه منهم اليهم ، الا لكونهم دعوهم الي الحق ( ويقتلون الذين يامرون بالقسط من الناس ) وهذا هو غايه الكبر ، كما قال النبي صلي الله عليه وسلم : \" الكبر بطر الحق وغمط الناس \" .وقال ابن ابي حاتم : حدثنا ابو الزبير الحسن بن علي بن مسلم ا",
        "char_start": 0,
        "char_end": 1717,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_013_chunk00",
        "verse_key": "2:13",
        "text_ar": "«وإذا قيل لهم آمنوا كما آمن الناس» أصحاب النبي «قالوا أنؤمن كما آمن السفهاء» الجهال أي لا نفعل كفعلهم. قال تعالى ردا َعليهم: «ألا إنهم هم السفهاء ولكن لا يعلمون» ذلك.",
        "char_start": 0,
        "char_end": 166,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "«أتأمرون الناس بالبر» بالإيمان بمحمد «وتنسون أنفسكم» تتركونها فلا تأمرونها به «وأنتم تتلون الكتاب» التوراة وفيها الوعيد على مخالفة القول العمل «أفلا تعقلون» سوء فعلكم فترجعون، فجملة النسيان محل الاستفهام الإنكاري.",
        "char_start": 0,
        "char_end": 213,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_075_chunk00",
        "verse_key": "2:75",
        "text_ar": "«أفتطعمون» أيها المؤمنون «أن يؤمنوا لكم» أي اليهود لكم. «وقد كان فريق» طائفة «منهم» أحبارهم «يسمعون كلام الله» في التوراة «ثم يحرّفونه» يغيرونه «من بعد ما عقلوه» فهموه «وهم يعلمون» أنهم مفترون والهمزة للإنكار أي لا تطمعوا فلهم سابقة بالكفر.",
        "char_start": 0,
        "char_end": 240,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_078_chunk00",
        "verse_key": "2:78",
        "text_ar": "«ومنهم» أي اليهود «أميون» عوام «لا يعلمون الكتاب» التوراة «إلا» لكن «أمانيَّ» أكاذيب تلقَّوْها من رؤسائهم فاعتمدوها «وإن» ما «هم» في جحد نبوة النبي وغيره مما يختلقونه «‌إلا يظنون» ظناً ولا علم لهم.",
        "char_start": 0,
        "char_end": 197,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "«ثم أنتم» يا «هؤلاء تقتلون أنفسكم» بقتل بعضكم بعضا «وتخرجون فريقا منكم من ديارهم تَظَّاهَرُونَ» فيه إدغام التاء في الأصل في الظاء، وفي قراءة بالتخفيف على حذفها تتعاونون «عليهم بالإثم» بالمعصية «والعدوان» الظلم «وإن يأتوكم أسارى» وفي قراءة أسرى «تَفْدُوهُمْ» وفي قراءة «تُفَادُوهُمْ» تنقذوهم من الأسر بالمال أو غيره وهو مما عهد إليهم «وهو» أي الشأن «محرَّم عليكم إخراجهم» متصل بقوله وتخرجون والجملة بينهما اعتراض: أي كما حرم ترك الفداء، وكانت قريظةُ حالفوا الأوسَ، والنضيرُ الخزرجَ فكان كل فريق يقاتل ",
        "char_start": 0,
        "char_end": 954,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_111_chunk00",
        "verse_key": "2:111",
        "text_ar": "«وقالوا لن يدخل الجنة إلا من كان هوداً» جمع هائد «أو نصارى» قال ذلك يهود المدينة ونصارى نجران لما تناظروا بين يدي النبي أي قال اليهود لن يدخلها إلا اليهود وقال النصارى لن يدخلها إلا النصارى «تلك» القولة «أمانيهم» شهواتهم الباطلة «قل» لهم «هاتوا برهانكم» حجتكم على ذلك «إن كنتم صادقين» فيه.",
        "char_start": 0,
        "char_end": 289,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_124_chunk00",
        "verse_key": "2:124",
        "text_ar": "«و» اذكر «إذا ابتلى» اختبر «إبراهيم» وفي قراءة إبراهام. «ربُّه بكلمات» بأوامر ونواه كلَّفه بها، قيل هي مناسك الحج، وقيل المضمضة والاستنشاق والسواك وقص الشارب وفرق الرأس وقلم الأظافر ونتف الإبط وحلق العانة والختان والاستنجاء «فأتمهن» أداهن تامات «قال» تعالى له «إني جاعلك للناس إماما» قدوة في الدين «قال ومن ذرِّيتي» أولادي اجعل أئمة «قال لا ينال عهدي» بالإمامة «الظالمين» الكافرين منهم دل على أنه ينال غير الظالم.",
        "char_start": 0,
        "char_end": 413,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_125_chunk00",
        "verse_key": "2:125",
        "text_ar": "«وإذ جعلنا البيت» الكعبة «مثابة للناس» مرجعا يثبون إليه من كل جانب «وأمنا» مأمنا لهم من الظلم والإغارات الواقعة في غيره، كان الرجل يلقى قاتل أبيه فيه فلا يهيجه «واتخذوا» أيها الناس «من مقام إبراهيم» هو الحجر الذي قام عليه عند بناء البيت «مصلى» مكان صلاة بأن تصلوا خلفه ركعتي الطواف، وفي قراءة بفتح الخاء خبر «وعهدنا إلى إبراهيم وإسماعيل» أمرناهما «أن» أي بأن «طهِّرا بيتي» من الأوثان «للطائفين والعاكفين» المقيمين فيه «والركع السجود» جمع راكع وساجد المصلين.",
        "char_start": 0,
        "char_end": 457,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "«قل» لهم «أتحاجوننا» تخاصموننا «في الله» أن اصطفى نبيا من العرب «وهو ربنا وربكم» فله أن يصطفي من عباده ما يشاء «ولنا أعمالنا» نجازى بها «ولكم أعمالكم» تجازون بها فلا يبعد أن يكون في أعمالنا ما نستحق به الإكرام «ونحن له مخلصون» الدين والعمل دونكم فنحن أولى بالاصطفاء، والهمزة للإنكار والجمل الثلاث أحوال.",
        "char_start": 0,
        "char_end": 303,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_161_chunk00",
        "verse_key": "2:161",
        "text_ar": "«إن الذين كفروا وماتوا وهم كفار» حال «أولئك عليهم لعنة الله والملائكة والناس أجمعين» أي هم مستحقون ذلك في الدنيا والآخرة. والناس قيل: عام. وقيل: المؤمنون.",
        "char_start": 0,
        "char_end": 154,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_196_chunk00",
        "verse_key": "2:196",
        "text_ar": "«وأتموا الحج والعمرة لله» أدُّوهما بحقوقهما «فإن أُحصرتم» مُنعتم عن إتمامها بعدوِّ «فما استيسر» تيسَّر «من الهدي» عليكم وهو شاة «ولا تحلقوا رؤوسكم» أي لا تتحللوا «حتى يبلغ الهدي» المذكور «محله» حيث يحل ذبحه وهو مكان الإحصار عند الشافعي فيذبح فيه بنية التحلل ويفرَّق على مساكينه ويحلق وبه يحصل التحلل «فمن كان منكم مريضا أو به أذى من رأسه» كقمل وصداع فحلق في الإحرام «ففدية» عليه «من صيام» ثلاثة أيام «أو صدقة» بثلاثة أصوع من غالب قوت البلد على ستة مساكين «أونسك» أي ذبح شاة وأو للتخيير وألحق به من حل",
        "char_start": 0,
        "char_end": 1623,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_224_chunk00",
        "verse_key": "2:224",
        "text_ar": "«ولا تجعلوا الله» أي الحلف به «عرضة» علة مانعة «لأيمانكم» أي نصيبا لها بأن تكثروا الحلف به «أن» لا «تبروا وتتقوا» فتكره اليمين على ذلك ويسن فيه الحنث ويكفِّر بخلافها على فعل. البر ونحوه فهي طاعة «وتصلحوا بين الناس» المعنى لا تمتنعوا من فعل ما ذكر من البر ونحوه إذا حلفتم عليه بل ائتوه وكفِّروا لأن سبب نزولها الامتناع من ذلك «والله سميع» لأقوالكم «عليم» بأحوالكم.",
        "char_start": 0,
        "char_end": 363,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_225_chunk00",
        "verse_key": "2:225",
        "text_ar": "«لا يؤاخذكم الله باللغو» الكائن «في أيمانكم» وهو ما يسبق إليه اللسان من غير قصد الحلف نحو ألا والله، وبلى و الله فلا إثم فيه ولا كفارة «ولكن يؤاخذكم بما كسبت قلوبكم» أي قصدته من الأيمان إذا حنثتم «والله غفور» لما كان من اللغو «حليم» بتأخير العقوبة عن مستحقها.",
        "char_start": 0,
        "char_end": 259,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_228_chunk00",
        "verse_key": "2:228",
        "text_ar": "«والمطلقات يتربصن» أي لينتظرن «بأنفسهن» عن النكاح «ثلاثة قروءٍ» تمضي من حين الطلاق، جمع قرء بفتح القاف وهو الطهر أو الحيض قولان وهذا في المدخول بهن أما غيرهن فلا عدة عليهن لقوله: «فما لكم عليهن من عدة» وفي غير الآيسة والصغيرة فعدتهن ثلاثة أشهر والحوامل فعدتهن أن يضعن حملهن كما في سورة الطلاق والإماء فعدتهن قَرءان بالسُّنة «ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن» من الولد والحيض «إن كنّ يؤمن بالله واليوم الآخر وبعولتهن» أزواجهن «أحق بردهن» بمراجعتهن ولو أبين «في ذلك» أي في زمن التربص «إن أرا",
        "char_start": 0,
        "char_end": 876,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_231_chunk00",
        "verse_key": "2:231",
        "text_ar": "«وإذا طلقتم النساء فبلغن أجلهن» قاربن انقضاء عدتهن «فأمسكوهن» بأن تراجعوهن «بمعروف» من غير ضرر «أو سرحوهن بمعروف» اتركوهن حتى تنقضي عدتهن «ولا تمسكوهن» بالرجعة «ضرارا» مفعول لأجله «لتعتدوا» عليهن بالإلجاء إلى الافتداء والتطليق وتطويل الحبس «ومن يفعل ذلك فقد ظلم نفسه» بتعريضها إلى عذاب الله «ولا تتخذوا آيات الله هزوا» مهزوءا بها بمخالفتها «واذكروا نعمت الله عليكم» بالإسلام «وما أنزل عليكم من الكتاب» القرآن «والحكمة» ما فيه من الأحكام «يعظكم به» بأن تشكروها بالعمل به «واتقوا الله واعلموا أن الله ب",
        "char_start": 0,
        "char_end": 531,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_239_chunk00",
        "verse_key": "2:239",
        "text_ar": "«فإن خفتم» من عدو أو سيل أو سبع «فرجالا» جمع راجل أي مشاة صلوا «أو ركبانا» جمع راكب أي كيف أمكن مستقبلي القبلة أو غيرها ويومئ بالركوع والسجود «فإذا أمنتم» من الخوف «فاذكروا الله» أي صلّوا «كما علمكم ما لم تكونوا تعلمون» قبل تعليمه من فرائضها وحقوقها والكاف بمعنى مثل وما مصدرية أو موصولة.",
        "char_start": 0,
        "char_end": 288,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_250_chunk00",
        "verse_key": "2:250",
        "text_ar": "«ولما برزوا لجالوت وجنوده» أي ظهروا لقتالهم وتصافّوا «قالوا ربنا أفرغ» أصبب «علينا صبرا وثبت أقدامنا» بتقوية قلوبنا على الجهاد «وانصرنا على القوم الكافرين».",
        "char_start": 0,
        "char_end": 156,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_283_chunk00",
        "verse_key": "2:283",
        "text_ar": "«وإن كنتم على سفر» أي مسافرين وتداينتم «ولم تجدوا كاتبا فَرِهاَنٌ» وفي قراءة فَرهُنٌ جمع رهن «مقبوضة» تستوثقون بها وبينت السنة جواز الرهن في الحضر ووجود الكاتب فالتقيد بما ذكر لأن التوثيق فيه أشد وأفاد قوله مقبوضة اشتراط القبض في الرهن والاكتفاء به من المرتهن ووكيله «فإن أمن بعضكم بعضا» أي الدائن المدين على حقه فلم يرتهن «فليؤد الذي أؤتمن» أي المدين «أمانته» دينه «وليتق الله ربَّه» في أدائه «ولا تكتموا الشهادة» إذا دُعيتم لإقامتها «ومن يكتمها فإنه آثم قلبه» خص بالذكر لأنه محل الشهادة ولأنه إذا أ",
        "char_start": 0,
        "char_end": 586,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_020_chunk00",
        "verse_key": "3:20",
        "text_ar": "«فإن حاجوك» خاصمك الكفار يا محمد في الدين «فقل» لهم «أسلمت وجهي لله» أنقدت له أنا «ومن اتبعن» وخص الوجه بالذكر لشرفه فغيره أولى «وقل للذين أوتوا الكتاب» اليهود والنصارى و «الأميين» مشركي العرب «أأسلمتم» أي أسلموا «فإن أسلموا فقد اهتدوا» من الضلال «وإن تولوا» عن الإسلام «فإنما عليك البلاغ» أي التبليغ للرسالة «والله بصير بالعباد» فيجازيهم بأعمالهم وهذا قبل الأمر بالقتال",
        "char_start": 0,
        "char_end": 370,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_021_chunk00",
        "verse_key": "3:21",
        "text_ar": "«إن الذين يكفرون بآيات الله ويقتلون» وفي قراءة يقاتلون «النبيين بغير حق ويقتلون الذين يأمرون بالقسط» بالعدل «من الناس» وهم اليهود رُوى أنهم قتلوا ثلاثة وأربعين نبياً فنهاهم مائة وسبعون من عبَّادهم فقتلوهم من يومهم «فبشِّرهم» أعلمهم «بعذاب اليم» مؤلم وذكر البشارة تهكم بهم ودخلت الفاء في خبر إن لشبه اسمها الموصول بالشرط.",
        "char_start": 0,
        "char_end": 320,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_013_chunk00",
        "verse_key": "2:13",
        "text_ar": "واذا قيل للمنافقين: امِنُوا -مثل ايمان الصحابه، وهو الايمان بالقلب واللسان والجوارح-، جادَلوا وقالوا: اَنُصَدِّق مثل تصديق ضعاف العقل والراي، فنكون نحن وهم في السَّفَهِ سواء؟ فردَّ الله عليهم بان السَّفَهَ مقصور عليهم، وهم لا يعلمون ان ما هم فيه هو الضلال والخسران.",
        "char_start": 0,
        "char_end": 265,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "ما أقبح حالَكم وحالَ علمائكم حين تأمرون الناس بعمل الخيرات، وتتركون أنفسكم، فلا تأمرونها بالخير العظيم، وهو الإسلام، وأنتم تقرءون التوراة، التي فيها صفات محمد صلى الله عليه وسلم، ووجوب الإيمان به!! أفلا تستعملون عقولكم استعمالا صحيحًا؟",
        "char_start": 0,
        "char_end": 235,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_075_chunk00",
        "verse_key": "2:75",
        "text_ar": "أيها المسلمون أنسيتم أفعال بني إسرائيل، فطمعت نفوسكم أن يصدِّق اليهودُ بدينكم؟ وقد كان علماؤهم يسمعون كلام الله من التوراة، ثم يحرفونه بِصَرْفِه إلى غير معناه الصحيح بعد ما عقلوا حقيقته، أو بتحريف ألفاظه، وهم يعلمون أنهم يحرفون كلام رب العالمين عمدًا وكذبًا.",
        "char_start": 0,
        "char_end": 258,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_078_chunk00",
        "verse_key": "2:78",
        "text_ar": "ومن اليهود جماعة يجهلون القراءة والكتابة، ولا يعلمون التوراة وما فيها من صفات نبي الله ورسوله محمد صلى الله عليه وسلم، وما عندهم من ذلك إلا أكاذيبُ وظنون فاسدة.",
        "char_start": 0,
        "char_end": 160,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "ثم أنتم يا هؤلاء يقتل بعضكم بعضًا، ويُخرج بعضكم بعضًا من ديارهم، ويَتَقَوَّى كل فريق منكم على إخوانه بالأعداء بغيًا وعدوانًا. وأن يأتوكم أسارى في يد الأعداء سعيتم في تحريرهم من الأسر، بدفع الفدية، مع أنه محرم عليكم إخراجهم من ديارهم. ما أقبح ما تفعلون حين تؤمنون ببعض أحكام التوراة وتكفرون ببعضها! فليس جزاء مَن يفعل ذلك منكم إلا ذُلا وفضيحة في الدنيا. ويوم القيامة يردُّهم الله إلى أفظع العذاب في النار. وما الله بغافل عما تعملون.",
        "char_start": 0,
        "char_end": 431,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_111_chunk00",
        "verse_key": "2:111",
        "text_ar": "ادَّعى كلٌّ من اليهود والنصارى أن الجنة خاصة بطائفته لا يدخلها غيرهم، تلك أوهامهم الفاسدة. قل لهم -أيها الرسول-: أحضروا دليلكم على صحة ما تدَّعون إن كنتم صادقين في دعواكم.",
        "char_start": 0,
        "char_end": 171,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_124_chunk00",
        "verse_key": "2:124",
        "text_ar": "واذكر -ايها النبي- حين اختبر الله ابراهيم بما شرع له من تكاليف، فادَّاها وقام بها خير قيام. قال الله له: اني جاعلك قدوه للناس. قال ابراهيم: ربِّ اجعل بعض نسلي ايمه فضلا منك، فاجابه الله سبحانه انه لا تحصل للظالمين الامامهُ في الدين.",
        "char_start": 0,
        "char_end": 232,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_125_chunk00",
        "verse_key": "2:125",
        "text_ar": "واذكر -ايها النبي- حين جعلنا الكعبه مرجعًا للناس، ياتونه، ثم يرجعون الي اهليهم، ثم يعودون اليه، ومجمعًا لهم في الحج والعمره والطواف والصلاه، وامنًا لهم، لا يُغِير عليهم عدو فيه. وقلنا: اتخِذوا من مقام ابراهيم مكانًا للصلاه فيه، وهو الحجر الذي وقف عليه ابراهيم عند بنايه الكعبه. واوحينا الي ابراهيم وابنه اسماعيل: ان طهِّرا بيتي من كل رجس ودنس; للمتعبدين فيه بالطواف حول الكعبه، او الاعتكاف في المسجد، والصلاه فيه.",
        "char_start": 0,
        "char_end": 413,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "قل -أيها الرسول لأهل الكتاب-: أتجادلوننا في توحيد الله والإخلاص له، وهو رب العالمين جميعًا، لا يختص بقوم دون قوم، ولنا أعمالنا ولكم أعمالكم، ونحن لله مخلصو العبادة والطَّاعة لا نشرك به شيئًا، ولا نعبد أحدًا غيره؟",
        "char_start": 0,
        "char_end": 212,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_161_chunk00",
        "verse_key": "2:161",
        "text_ar": "إن الذين جحدوا الإيمان وكتموا الحق، واستمروا على ذلك حتى ماتوا، أولئك عليهم لعنة الله بالطرد من رحمته، وعليهم لعنة الملائكة والناس أجمعين.",
        "char_start": 0,
        "char_end": 138,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_196_chunk00",
        "verse_key": "2:196",
        "text_ar": "وادُّوا الحج والعمره تامَّيْنِ، خالصين لوجه الله تعالي. فان منعكم عن الذهاب لاتمامهما بعد الاحرام بهما مانع كالعدو والمرض، فالواجب عليكم ذَبْحُ ما تيسر لكم من الابل او البقر او الغنم تقربًا الي الله تعالي; لكي تَخْرُجوا من احرامكم بحلق شعر الراس او تقصيره، ولا تحلقوا رووسكم اذا كنتم محصرين حتي ينحر المحصر هديه في الموضع الذي حُصر فيه ثم يحل من احرامه، كما نحر النبي صلي الله عليه وسلم في «الحديبيه» ثم حلق راسه، وغير المحصر لا ينحر الهدي الا في الحرم، الذي هو محله في يوم العيد، اليوم العاشر وما بع",
        "char_start": 0,
        "char_end": 1187,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_224_chunk00",
        "verse_key": "2:224",
        "text_ar": "ولا تجعلوا -ايها المسلمون- حلفكم بالله مانعًا لكم من البر وصله الرحم والتقوي والاصلاح بين الناس: بان تُدْعَوا الي فعل شيء منها، فتحتجوا بانكم اقسمتم بالله الا تفعلوه، بل علي الحالف ان يعدل عن حلفه، ويفعل اعمال البر، ويكفر عن يمينه، ولا يعتاد ذلك. والله سميع لاقوالكم، عليم بجميع احوالكم.",
        "char_start": 0,
        "char_end": 287,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_225_chunk00",
        "verse_key": "2:225",
        "text_ar": "لا يعاقبكم الله بسبب أيمانكم التي تحلفونها بغير قصد، ولكن يعاقبكم بما قصدَتْه قلوبكم. والله غفور لمن تاب إليه، حليم بمن عصاه حيث لم يعاجله بالعقوبة.",
        "char_start": 0,
        "char_end": 148,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_228_chunk00",
        "verse_key": "2:228",
        "text_ar": "والمطلقات ذوات الحيض، يجب أن ينتظرن دون نكاح بعد الطلاق مدة ثلاثة أطهار أو ثلاث حيضات على سبيل العدة; ليتأكدن من فراغ الرحم من الحمل. ولا يجوز لهن تزوج رجل آخر في أثناء هذه العدة حتى تنتهي. ولا يحل لهن أن يخفين ما خلق الله في أرحامهن من الحمل أو الحيض، إن كانت المطلقات مؤمنات حقًا بالله واليوم الآخر. وأزواج المطلقات أحق بمراجعتهن في العدة. وينبغي أن يكون ذلك بقصد الإصلاح والخير، وليس بقصد الإضرار تعذيبًا لهن بتطويل العدة. وللنساء حقوق على الأزواج، مثل التي عليهن، على الوجه المعروف، وللرجال على ا",
        "char_start": 0,
        "char_end": 644,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_231_chunk00",
        "verse_key": "2:231",
        "text_ar": "وإذا طَلَّقتم النساء فقاربن انتهاء عدتهن، فراجعوهن، ونيتكم القيام بحقوقهن على الوجه المستحسن شرعًا وعرفًا، أو اتركوهن حتى تنقضي عدتهن. واحذروا أن تكون مراجعتهن بقصد الإضرار بهن لأجل الاعتداء على حقوقهن. ومن يفعل ذلك فقد ظلم نفسه باستحقاقه العقوبة، ولا تتخذوا آيات الله وأحكامه لعبًا ولهوًا. واذكروا نعمة الله عليكم بالإسلام وتفصيل الأحكام. واذكروا ما أنزل الله عليكم من القرآن والسنة، واشكروا له سبحانه على هذه النعم الجليلة، يُذكِّركم الله بهذا، ويخوفكم من المخالفة، فخافوا الله وراقبوه، واعلموا أن ",
        "char_start": 0,
        "char_end": 559,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_239_chunk00",
        "verse_key": "2:239",
        "text_ar": "فإن خفتم من عدو لكم فصلوا صلاة الخوف ماشين، أو راكبين، على أي هيئة تستطيعونها ولو بالإيماء، أو إلى غير جهة القبلة، فإذا زال خوفكم فصلُّوا صلاة الأمن، واذكروا الله فيها، ولا تنقصوها عن هيئتها الأصلية، واشكروا له على ما علَّمكم من أمور العبادات والأحكام ما لم تكونوا على علم به.",
        "char_start": 0,
        "char_end": 276,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_250_chunk00",
        "verse_key": "2:250",
        "text_ar": "ولما ظهروا لجالوت وجنوده، وراوا الخطر راي العين، فزعوا الي الله بالدعاء والضراعه قايلين: ربنا انزل علي قلوبنا صبرًا عظيمًا، وثبت اقدامنا، واجعلها راسخه في قتال العدو، لا تفر مِن هول الحرب، وانصرنا بعونك وتاييدك علي القوم الكافرين.",
        "char_start": 0,
        "char_end": 230,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_283_chunk00",
        "verse_key": "2:283",
        "text_ar": "وإن كنتم مسافرين ولم تجدوا مَن يكتب لكم فادفعوا إلى صاحب الحق شيئًا يكون عنده ضمانًا لحقِّه إلى أن يردَّ المدينُ ما عليه من دين، فإن وثق بعضكم ببعض فلا حرج في ترك الكتابة والإشهاد والرهن، ويبقى الدَّين أمانة في ذمَّة المدين، عليه أداؤه، وعليه أن يراقب الله فلا يخون صاحبه. فإن أنكر المدين ما عليه من دين، وكان هناك مَن حضر وشهد، فعليه أن يظهر شهادته، ومن أخفى هذه الشهادة فهو صاحب قلب غادر فاجر. والله المُطَّلِع على السرائر، المحيط علمه بكل أموركم، سيحاسبكم على ذلك.",
        "char_start": 0,
        "char_end": 467,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_020_chunk00",
        "verse_key": "3:20",
        "text_ar": "فان جادلك -ايها الرسول- اهل الكتاب في التوحيد بعد ان اقمت الحجه عليهم فقل لهم: انني اخلصت لله وحده فلا اشرك به احدًا، وكذلك من اتبعني من المومنين، اخلصوا لله وانقادوا له. وقل لهم ولمشركي العرب وغيرهم: ان اسلمتم فانتم علي الطريق المستقيم والهدي والحق، وان توليتم فحسابكم علي الله، وليس عليَّ الا البلاغ، وقد ابلغتكم واقمت عليكم الحجه. والله بصير بالعباد، لا يخفي عليه من امرهم شيء.",
        "char_start": 0,
        "char_end": 380,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_021_chunk00",
        "verse_key": "3:21",
        "text_ar": "إن الذين يجحدون بالدلائل الواضحة وما جاء به المرسلون، ويقتلون أنبياء الله ظلمًا بغير حق، ويقتلون الذين يأمرون بالعدل واتباع طريق الأنبياء، فبشِّرهم بعذاب موجع.",
        "char_start": 0,
        "char_end": 159,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_013_chunk00",
        "verse_key": "2:13",
        "text_ar": "قوله تعالى : وإذا قيل لهم آمنوا كما آمن الناس قالوا أنؤمن كما آمن السفهاء ألا إنهم هم السفهاء ولكن لا يعلمونقوله تعالى : وإذا قيل لهم يعني المنافقين في قول مقاتل وغيره . آمنوا كما آمن الناس أي صدقوا بمحمد صلى الله عليه وسلم وشرعه ، كما صدق المهاجرون والمحققون من أهل يثرب .[ ص: 199 ] وألف ( آمنوا ) ألف قطع ; لأنك تقول : يؤمن ، والكاف في موضع نصب ; لأنها نعت لمصدر محذوف ، أي إيمانا كإيمان الناس .قوله تعالى : قالوا أنؤمن كما آمن السفهاء يعني أصحاب محمد صلى الله عليه وسلم ، عن ابن عباس . وعنه أيضا :",
        "char_start": 0,
        "char_end": 1713,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "قوله تعالى : أتأمرون الناس بالبر وتنسون أنفسكم وأنتم تتلون الكتاب أفلا تعقلونفيه تسع مسائل : الأولى : قوله تعالى : أتأمرون الناس بالبر هذا استفهام التوبيخ ، والمراد في قول أهل التأويل علماء اليهود . قال ابن عباس ( كان يهود المدينة يقول الرجل منهم لصهره ولذي قرابته ولمن بينه وبينه رضاع من المسلمين : اثبت على الذي أنت عليه ، وما يأمرك به هذا الرجل يريدون محمدا صلى الله عليه وسلم فإن أمره حق فكانوا يأمرون الناس بذلك ، ولا يفعلونه ) وعن ابن عباس أيضا ( كان الأحبار يأمرون مقلديهم وأتباعهم باتباع التو",
        "char_start": 0,
        "char_end": 8750,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_075_chunk00",
        "verse_key": "2:75",
        "text_ar": "قوله تعالى : أفتطمعون أن يؤمنوا لكم وقد كان فريق منهم يسمعون كلام الله ثم يحرفونه من بعد ما عقلوه وهم يعلمونفيه أربع مسائل :الأولى : قوله تعالى : أفتطمعون أن يؤمنوا لكم هذا استفهام فيه معنى الإنكار ، كأنه أيأسهم من إيمان هذه الفرقة من اليهود ، أي إن كفروا فلهم سابقة في ذلك . والخطاب لأصحاب النبي صلى الله عليه وسلم . وذلك أن الأنصار كان لهم حرص على إسلام اليهود للحلف والجوار الذي كان بينهم . وقيل : الخطاب للنبي صلى الله عليه وسلم خاصة ، عن ابن عباس . أي لا تحزن على تكذيبهم إياك ، وأخبره أنهم من أ",
        "char_start": 0,
        "char_end": 3521,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_078_chunk00",
        "verse_key": "2:78",
        "text_ar": "قوله تعالى : ومنهم أميون لا يعلمون الكتاب إلا أماني وإن هم إلا يظنونفيه أربع مسائل :الأولى : قوله تعالى : ومنهم أميون أي من اليهود . وقيل : من اليهود والمنافقين أميون ، أي من لا يكتب ولا يقرأ ، واحدهم أمي ، منسوب إلى الأمة الأمية التي هي على أصل ولادة أمهاتها لم تتعلم الكتابة ولا قراءتها ، ومنه قوله عليه السلام : إنا أمة أمية لا نكتب ولا [ ص: 7 ] نحسب الحديث . وقد قيل لهم إنهم أميون لأنهم لم يصدقوا بأم الكتاب ، عن ابن عباس . وقال أبو عبيدة : إنما قيل لهم أميون لنزول الكتاب عليهم ، كأنهم نسبوا إل",
        "char_start": 0,
        "char_end": 4021,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "قوله تعالى : ثم أنتم هؤلاء تقتلون أنفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالإثم والعدوان وإن يأتوكم أسارى تفادوهم وهو محرم عليكم إخراجهم أفتؤمنون ببعض الكتاب وتكفرون ببعض فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا ويوم القيامة يردون إلى أشد العذاب وما الله بغافل عما تعملون أولئك الذين اشتروا الحياة الدنيا بالآخرة فلا يخفف عنهم العذاب ولا هم ينصرونقوله تعالى : ثم أنتم هؤلاء أنتم في موضع رفع بالابتداء ، ولا يعرب ; لأنه مضمر . وضمت التاء من أنتم لأنها كانت مفتوحة إذا خاطبت واحدا ",
        "char_start": 0,
        "char_end": 5797,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_111_chunk00",
        "verse_key": "2:111",
        "text_ar": "قوله تعالى : وقالوا لن يدخل الجنة إلا من كان هودا أو نصارى تلك أمانيهم قل هاتوا برهانكم إن كنتم صادقينقوله تعالى : وقالوا لن يدخل الجنة إلا من كان هودا أو نصارى المعنى : وقالت اليهود لن يدخل الجنة إلا من كان يهوديا . وقالت النصارى لن يدخل الجنة إلا من كان نصرانيا . وأجاز الفراء أن يكون هودا بمعنى يهوديا ، حذف منه الزائد ، وأن يكون جمع هائد . وقال الأخفش سعيد : إلا من كان جعل كان واحدا على لفظ من ، ثم قال هودا فجمع ; لأن معنى من جمع . ويجوز تلك أمانيهم وتقدم الكلام في هذا ، والحمد لله .قوله تعالى",
        "char_start": 0,
        "char_end": 898,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_124_chunk00",
        "verse_key": "2:124",
        "text_ar": "قوله تعالى : وإذ ابتلى إبراهيم ربه بكلمات فأتمهن قال إني جاعلك للناس إماما قال ومن ذريتي قال لا ينال عهدي الظالمينفيه ثلاثة وعشرون مسألة الأولى : لما جرى ذكر الكعبة والقبلة اتصل ذلك بذكر إبراهيم عليه السلام ، وأنه الذي بنى البيت ، فكان من حق اليهود - وهم من نسل إبراهيم - ألا يرغبوا عن دينه . والابتلاء : الامتحان والاختبار ، ومعناه أمر وتعبد . وإبراهيم تفسيره بالسريانية فيما ذكر الماوردي ، وبالعربية فيما ذكر ابن عطية : أب رحيم . قال السهيلي : وكثيرا ما يقع الاتفاق بين السرياني والعربي أو يقاربه ف",
        "char_start": 0,
        "char_end": 22391,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_125_chunk00",
        "verse_key": "2:125",
        "text_ar": "قوله تعالى : وإذ جعلنا البيت مثابة للناس وأمنا واتخذوا من مقام إبراهيم مصلى وعهدنا إلى إبراهيم وإسماعيل أن طهرا بيتي للطائفين والعاكفين والركع السجودقوله تعالى : وإذ جعلنا البيت مثابة للناس وأمنا فيه مسألتان :الأولى : قوله تعالى : جعلنا بمعنى صيرنا لتعديه إلى مفعولين ، وقد تقدم . البيت يعني الكعبة . مثابة أي مرجعا ، يقال : ثاب يثوب مثابا ومثابة وثؤوبا وثوبانا . فالمثابة مصدر وصف به ويراد به الموضع الذي يثاب إليه ، أي يرجع إليه . قال ورقة بن نوفل في الكعبة :مثابا لأفناء القبائل كلها تخب إليها الي",
        "char_start": 0,
        "char_end": 10817,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "قوله تعالى : قل أتحاجوننا في الله وهو ربنا وربكم ولنا أعمالنا ولكم أعمالكم ونحن له مخلصونقال الحسن : كانت المحاجة أن قالوا : نحن أولى بالله منكم ; لأنا أبناء الله وأحباؤه . وقيل : لتقدم آبائنا وكتبنا ; ولأنا لم نعبد الأوثان . فمعنى الآية : قل لهم يا محمد ، أي قل لهؤلاء اليهود والنصارى الذين زعموا أنهم أبناء الله وأحباؤه وادعوا أنهم أولى بالله منكم لقدم آبائهم وكتبهم : أتحاجوننا أي أتجاذبوننا الحجة على دعواكم والرب واحد ، وكل مجازى بعمله ، فأي تأثير لقدم الدين . ومعنى في الله أي في دينه والقرب من",
        "char_start": 0,
        "char_end": 1710,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_161_chunk00",
        "verse_key": "2:161",
        "text_ar": "قوله تعالى : إن الذين كفروا وماتوا وهم كفار أولئك عليهم لعنة الله والملائكة والناس أجمعينفيه ثلاث مسائل :الأولى : قوله تعالى : وهم كفار الواو واو الحال . قال ابن العربي : قال لي كثير من أشياخي إن الكافر المعين لا يجوز لعنه ; لأن حاله عند الموافاة لا تعلم ، وقد شرط الله تعالى [ ص: 177 ] في هذه الآية في إطلاق اللعنة : الموافاة على الكفر ، وأما ما روي عن النبي صلى الله عليه وسلم أنه لعن أقواما بأعيانهم من الكفار فإنما كان ذلك لعلمه بمآلهم . قال ابن العربي : والصحيح عندي جواز لعنه لظاهر حاله ولجواز ",
        "char_start": 0,
        "char_end": 3651,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_196_chunk00",
        "verse_key": "2:196",
        "text_ar": "وأتموا الحج والعمرة لله فإن أحصرتم فما استيسر من الهدي ولا تحلقوا رءوسكم حتى يبلغ الهدي محله فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك فإذا أمنتم فمن تمتع بالعمرة إلى الحج فما استيسر من الهدي فمن لم يجد فصيام ثلاثة أيام في الحج وسبعة إذا رجعتم تلك عشرة كاملة ذلك لمن لم يكن أهله حاضري المسجد الحرام واتقوا الله واعلموا أن الله شديد العقاب قوله تعالى : وأتموا الحج والعمرة لله فيها سبع مسائل :الأولى : اختلف العلماء في المعنى المراد بإتمام الحج والعمرة لله ، فقيل : أداؤهما وال",
        "char_start": 0,
        "char_end": 37095,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_224_chunk00",
        "verse_key": "2:224",
        "text_ar": "قوله تعالى : ولا تجعلوا الله عرضة لأيمانكم أن تبروا وتتقوا وتصلحوا بين الناس والله سميع عليم[ ص: 92 ] فيه أربع مسائل : الأولى : قال العلماء : لما أمر الله تعالى بالإنفاق وصحبة الأيتام والنساء بجميل المعاشرة قال : لا تمتنعوا عن شيء من المكارم تعللا بأنا حلفنا ألا نفعل كذا ، قال معناه ابن عباس والنخعي ومجاهد والربيع وغيرهم . قال سعيد بن جبير : ( هو الرجل يحلف ألا يبر ولا يصل ولا يصلح بين الناس ، فيقال له : بر ، فيقول : قد حلفت ) . وقال بعض المتأولين : المعنى ولا تحلفوا بالله كاذبين إذا أردتم البر ",
        "char_start": 0,
        "char_end": 3001,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_225_chunk00",
        "verse_key": "2:225",
        "text_ar": "قوله تعالى : لا يؤاخذكم الله باللغو في أيمانكم ولكن يؤاخذكم بما كسبت قلوبكم والله غفور حليمفيه أربع مسائل :الأولى : قوله تعالى : ( باللغو ) اللغو : مصدر لغا يلغو ويلغى ، ولغي يلغى لغا إذا أتى بما لا يحتاج إليه في الكلام ، أو بما لا خير فيه ، أو بما يلغي إثمه ، وفي الحديث : إذا قلت لصاحبك والإمام يخطب يوم الجمعة أنصت فقد لغوت . ولغة أبي هريرة \" فقد لغيت \" وقال الشاعر :ورب أسراب حجيج كظم عن اللغا ورفث التكلموقال آخر :ولست بمأخوذ بلغو تقوله إذا لم تعمد عاقدات العزائمالثانية : واختلف العلماء في اليم",
        "char_start": 0,
        "char_end": 5185,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_228_chunk00",
        "verse_key": "2:228",
        "text_ar": "والمطلقات يتربصن بأنفسهن ثلاثة قروء ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن إن كن يؤمن بالله واليوم الآخر وبعولتهن أحق بردهن في ذلك إن أرادوا إصلاحا ولهن مثل الذي عليهن بالمعروف وللرجال عليهن درجة والله عزيز حكيمقوله تعالى : والمطلقات يتربصن بأنفسهن ثلاثة قروء فيه خمس مسائل : الأولى : قوله تعالى : والمطلقات لما ذكر الله تعالى الإيلاء وأن الطلاق قد يقع فيه بين تعالى حكم المرأة بعد التطليق . وفي كتاب أبي داود والنسائي عن ابن عباس قال في قول الله تعالى : والمطلقات يتربصن بأنفسهن ثلاثة قروء الآي",
        "char_start": 0,
        "char_end": 22282,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_231_chunk00",
        "verse_key": "2:231",
        "text_ar": "وإذا طلقتم النساء فبلغن أجلهن فأمسكوهن بمعروف أو سرحوهن بمعروف ولا تمسكوهن ضرارا لتعتدوا ومن يفعل ذلك فقد ظلم نفسه ولا تتخذوا آيات الله هزوا واذكروا نعمة الله عليكم وما أنزل عليكم من الكتاب والحكمة يعظكم به واتقوا الله واعلموا أن الله بكل شيء عليم[ ص: 143 ] فيه ست مسائل :الأولى : قوله تعالى : فبلغن أجلهن معنى \" بلغن \" قاربن ، بإجماع من العلماء ، ولأن المعنى يضطر إلى ذلك ؛ لأنه بعد بلوغ الأجل لا خيار له في الإمساك ، وهو في الآية التي بعدها بمعنى التناهي ؛ لأن المعنى يقتضي ذلك ، فهو حقيقة في الثان",
        "char_start": 0,
        "char_end": 4586,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_239_chunk00",
        "verse_key": "2:239",
        "text_ar": "قوله تعالى : فإن خفتم فرجالا أو ركبانا فإذا أمنتم فاذكروا الله كما علمكم ما لم تكونوا تعلمون فيه تسع مسائل : الأولى : قوله تعالى : فإن خفتم من الخوف الذي هو الفزع . ( فرجالا ) أي فصلوا رجالا . ( أو ركبانا ) معطوف عليه . والرجال جمع راجل أو رجل من قولهم : رجل الإنسان [ ص: 204 ] يرجل رجلا إذا عدم المركوب ومشى على قدميه ، فهو رجل وراجل ورجل - ( بضم الجيم ) وهي لغة أهل الحجاز ، يقولون : مشى فلان إلى بيت الله حافيا رجلا ، - حكاه الطبري وغيره - ورجلان ورجيل ورجل ، ويجمع على رجال ورجلى ورجال ورجالة ورج",
        "char_start": 0,
        "char_end": 4881,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_250_chunk00",
        "verse_key": "2:250",
        "text_ar": "قوله تعالى : ولما برزوا لجالوت وجنوده قالوا ربنا أفرغ علينا صبرا وثبت أقدامنا وانصرنا على القوم الكافرين\" برزوا \" صاروا في البراز وهو الأفيح من الأرض المتسع . وكان جالوت أمير العمالقة وملكهم ، ظله ميل . ويقال : إن البربر من نسله ، وكان فيما روي في ثلاثمائة ألف فارس . وقال عكرمة : في تسعين ألفا ، ولما رأى المؤمنون كثرة عدوهم تضرعوا إلى ربهم ، وهذا كقوله : وكأين من نبي قاتل معه ربيون كثير إلى قوله وما كان قولهم إلا أن قالوا ربنا اغفر لنا ذنوبنا الآية . وكان رسول الله صلى الله عليه وسلم إذا لقي الع",
        "char_start": 0,
        "char_end": 741,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_283_chunk00",
        "verse_key": "2:283",
        "text_ar": "قوله تعالى : وإن كنتم على سفر ولم تجدوا كاتبا فرهان مقبوضة فإن أمن بعضكم بعضا فليؤد الذي اؤتمن أمانته وليتق الله ربه ولا تكتموا الشهادة ومن يكتمها فإنه آثم قلبه والله بما تعملون عليمفيه أربع وعشرون مسألة :الأولى : لما ذكر الله تعالى الندب إلى الإشهاد والكتب لمصلحة حفظ الأموال والأديان ، عقب ذلك بذكر حال الأعذار المانعة من الكتب ، وجعل لها الرهن ، ونص من [ ص: 369 ] أحوال العذر على السفر الذي هو غالب الأعذار ، لا سيما في ذلك الوقت لكثرة الغزو ، ويدخل في ذلك بالمعنى كل عذر . فرب وقت يتعذر فيه الكات",
        "char_start": 0,
        "char_end": 23460,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_020_chunk00",
        "verse_key": "3:20",
        "text_ar": "قوله تعالى : فإن حاجوك فقل أسلمت وجهي لله ومن اتبعن وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ والله بصير بالعباد قوله تعالى : فإن حاجوك فقل أسلمت وجهي لله أي جادلوك بالأقاويل المزورة والمغالطات ، فأسند أمرك إلى ما كلفت من الإيمان والتبليغ وعلى الله نصرك . وقوله وجهي بمعنى ذاتي ; ومنه الحديث سجد وجهي للذي خلقه وصوره . وقيل : الوجه هنا بمعنى القصد ; كما تقول : خرج فلان في وجه كذا . وقد تقدم هذا المعنى في البقرة [ ص: 44 ] مستوفى ; والأول أولى . وعبر ب",
        "char_start": 0,
        "char_end": 1709,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_021_chunk00",
        "verse_key": "3:21",
        "text_ar": "قوله تعالى : إن الذين يكفرون بآيات الله ويقتلون النبيين بغير حق ويقتلون الذين يأمرون بالقسط من الناس فبشرهم بعذاب أليمفيه ست مسائل ( الأولى ) قوله تعالى : إن الذين يكفرون بآيات الله ويقتلون النبيين قال أبو العباس المبرد : كان ناس من بني إسرائيل جاءهم النبيون يدعونهم إلى الله - عز وجل - فقتلوهم ، فقام أناس من بعدهم من المؤمنين فأمروهم بالإسلام فقتلوهم ; ففيهم نزلت هذه الآية . وكذلك قال معقل بن أبي مسكين : كانت الأنبياء صلوات الله عليهم تجيء إلى بني إسرائيل بغير كتاب فيقتلونهم ، فيقوم قوم ممن اتبع",
        "char_start": 0,
        "char_end": 6114,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_013_chunk00",
        "verse_key": "2:13",
        "text_ar": "اي: اذا قيل للمنافقين امنوا كما امن الناس, اي: كايمان الصحابه رضي الله عنهم، وهو الايمان بالقلب واللسان, قالوا بزعمهم الباطل: انومن كما امن السفهاء؟ يعنون - قبحهم الله - الصحابه رضي الله عنهم, بزعمهم ان سفههم اوجب لهم الايمان, وترك الاوطان, ومعاداه الكفار، والعقل عندهم يقتضي ضد ذلك, فنسبوهم الي السفه; وفي ضمنه انهم هم العقلاء ارباب الحجي والنهي. فرد الله ذلك عليهم, واخبر انهم هم السفهاء علي الحقيقه, لان حقيقه السفه جهل الانسان بمصالح نفسه, وسعيه فيما يضرها, وهذه الصفه منطبقه عليهم وصادقه عليهم، ",
        "char_start": 0,
        "char_end": 707,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "{ اَتَاْمُرُونَ النَّاسَ بِالْبِرِّ } اي: بالايمان والخير { وَتَنْسَوْنَ اَنْفُسَكُمْ } اي: تتركونها عن امرها بذلك، والحال: { وَاَنْتُمْ تَتْلُونَ الْكِتَابَ اَفَلَا تَعْقِلُونَ } واسمي العقل عقلا لانه يعقل به ما ينفعه من الخير, وينعقل به عما يضره، وذلك ان العقل يحث صاحبه ان يكون اول فاعل لما يامر به, واول تارك لما ينهي عنه، فمن امر غيره بالخير ولم يفعله, او نهاه عن الشر فلم يتركه, دل علي عدم عقله وجهله, خصوصا اذا كان عالما بذلك, قد قامت عليه الحجه. وهذه الايه, وان كانت نزلت في سبب بني اسراييل, ",
        "char_start": 0,
        "char_end": 1159,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_075_chunk00",
        "verse_key": "2:75",
        "text_ar": "هذا قطع لاطماع المومنين من ايمان اهل الكتاب, اي: فلا تطمعوا في ايمانهم وحالتهم لا تقتضي الطمع فيهم, فانهم كانوا يحرفون كلام الله من بعد ما عقلوه وعلموه, فيضعون له معاني ما ارادها الله, ليوهموا الناس انها من عند الله, وما هي من عند الله، فاذا كانت هذه حالهم في كتابهم الذي يرونه شرفهم ودينهم يصدون به الناس عن سبيل الله, فكيف يرجي منهم ايمان لكم؟! فهذا من ابعد الاشياء.",
        "char_start": 0,
        "char_end": 368,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_078_chunk00",
        "verse_key": "2:78",
        "text_ar": "{ وَمِنْهُمْ } اي: من اهل الكتاب { اُمِّيُّونَ } اي: عوام, ليسوا من اهل العلم، { لَا يَعْلَمُونَ الْكِتَابَ اِلَّا اَمَانِيَّ } اي: ليس لهم حظ من كتاب الله الا التلاوه فقط, وليس عندهم خبر بما عند الاولين الذين يعلمون حق المعرفه حالهم, وهولاء انما معهم ظنون وتقاليد لاهل العلم منهم. فذكر في هذه الايات علماءهم, وعوامهم, ومنافقيهم, ومن لم ينافق منهم, فالعلماء منهم متمسكون بما هم عليه من الضلال، والعوام مقلدون لهم, لا بصيره عندهم فلا مطمع لكم في الطايفتين.",
        "char_start": 0,
        "char_end": 455,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "تفسير الايات من 84 ال 85 وهذا الفعل المذكور في هذه الايه, فعل للذين كانوا في زمن الوحي بالمدينه، وذلك ان الاوس والخزرج - وهم الانصار - كانوا قبل مبعث النبي صلي الله عليه وسلم مشركين, وكانوا يقتتلون علي عاده الجاهليه، فنزلت عليهم الفرق الثلاث من فرق اليهود, بنو قريظه, وبنو النضير, وبنو قينقاع، فكل فرقه منهم حالفت فرقه من اهل المدينه. فكانوا اذا اقتتلوا اعان اليهودي حليفه علي مقاتليه الذين تعينهم الفرقه الاخري من اليهود, فيقتل اليهودي اليهودي, ويخرجه من دياره اذا حصل جلاء ونهب، ثم اذا وضعت الحرب ا",
        "char_start": 0,
        "char_end": 1250,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_111_chunk00",
        "verse_key": "2:111",
        "text_ar": "أي: قال اليهود: لن يدخل الجنة إلا من كان هودا، وقالت النصارى: لن يدخل الجنة إلا من كان نصارى، فحكموا لأنفسهم بالجنة وحدهم, وهذا مجرد أماني غير مقبولة, إلا بحجة وبرهان, فأتوا بها إن كنتم صادقين، وهكذا كل من ادعى دعوى, لا بد أن يقيم البرهان على صحة دعواه، وإلا, فلو قلبت عليه دعواه, وادعى مدع عكس ما ادعى بلا برهان لكان لا فرق بينهما، فالبرهان هو الذي يصدق الدعاوى أو يكذبها، ولما لم يكن بأيديهم برهان, علم كذبهم بتلك الدعوى.",
        "char_start": 0,
        "char_end": 423,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_124_chunk00",
        "verse_key": "2:124",
        "text_ar": "يخبر تعالي, عن عبده وخليله, ابراهيم عليه السلام, المتفق علي امامته وجلالته, الذي كُلٌّ من طوايف اهل الكتاب تدعيه, بل وكذلك المشركون: ان الله ابتلاه وامتحنه بكلمات, اي: باوامر ونواهٍ, كما هي عاده الله في ابتلايه لعباده, ليتبين الكاذب الذي لا يثبت عند الابتلاء, والامتحان من الصادق, الذي ترتفع درجته, ويزيد قدره, ويزكو عمله, ويخلص ذهبه، وكان من اجلِّهم في هذا المقام, الخليل عليه السلام. فاتم ما ابتلاه الله به, واكمله ووفاه, فشكر الله له ذلك, ولم يزل الله شكورا فقال: { اِنِّي جَاعِلُكَ لِلنَّاسِ اِمَ",
        "char_start": 0,
        "char_end": 1449,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_125_chunk00",
        "verse_key": "2:125",
        "text_ar": "ثم ذكر تعالي, نموذجا باقيا دالا علي امامه ابراهيم, وهو هذا البيت الحرام الذي جعل قصده, ركنا من اركان الاسلام, حاطا للذنوب والاثام. وفيه من اثار الخليل وذريته, ما عرف به امامته, وتذكرت به حالته فقال: { وَاِذْ جَعَلْنَا الْبَيْتَ مَثَابَهً لِلنَّاسِ } اي: مرجعا يثوبون اليه, لحصول منافعهم الدينيه والدنيويه, يترددون اليه, ولا يقضون منه وطرا، { و } جعله { اَمْنًا } يامن به كل احد, حتي الوحش, وحتي الجمادات كالاشجار. ولهذا كانوا في الجاهليه - علي شركهم - يحترمونه اشد الاحترام, ويجد احدهم قاتل ابيه في ا",
        "char_start": 0,
        "char_end": 1720,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "المحاجه هي: المجادله بين اثنين فاكثر, تتعلق بالمسايل الخلافيه, حتي يكون كل من الخصمين يريد نصره قوله, وابطال قول خصمه، فكل واحد منهما, يجتهد في اقامه الحجه علي ذلك، والمطلوب منها, ان تكون بالتي هي احسن, باقرب طريق يرد الضال الي الحق, ويقيم الحجه علي المعاند, ويوضح الحق, ويبين الباطل، فان خرجت عن هذه الامور, كانت مماراه, ومخاصمه لا خير فيها, واحدثت من الشر ما احدثت، فكان اهل الكتاب, يزعمون انهم اولي بالله من المسلمين, وهذا مجرد دعوي, تفتقر الي برهان ودليل. فاذا كان رب الجميع واحداً, ليس رباً لكم ",
        "char_start": 0,
        "char_end": 1094,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_161_chunk00",
        "verse_key": "2:161",
        "text_ar": "واما من كفر واستمر علي كفره حتي مات ولم يرجع الي ربه, ولم ينب اليه, ولم يتب عن قريب فاوليك { عَلَيْهِمْ لَعْنَهُ اللَّهِ وَالْمَلَايِكَهِ وَالنَّاسِ اَجْمَعِينَ } لانه لما صار كفرهم وصفا ثابتا, صارت اللعنه عليهم وصفا ثابتا لا تزول, لان الحكم يدور مع علته, وجودا وعدما. و { خَالِدِينَ فِيهَا } اي: في اللعنه, او في العذاب وهما متلازمان { لَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ } بل عذابهم دايم شديد مستمر { وَلَا هُمْ يُنْظَرُونَ } اي: يمهلون, لان وقت الامهال وهو الدنيا قد مضي, ولم يبق لهم عذر فيعتذرون.",
        "char_start": 0,
        "char_end": 498,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_196_chunk00",
        "verse_key": "2:196",
        "text_ar": "يستدل بقوله تعالي{ وَاَتِمُّوا الْحَجَّ وَالْعُمْرَهَ } علي امور: احدها: وجوب الحج والعمره, وفرضيتهما. الثاني: وجوب اتمامهما باركانهما, وواجباتهما, التي قد دل عليها فعل النبي صلي الله عليه وسلم وقوله: \" خذوا عني مناسككم \" الثالث: ان فيه حجه لمن قال بوجوب العمره. الرابع: ان الحج والعمره يجب اتمامهما بالشروع فيهما, ولو كانا نفلا. الخامس: الامر باتقانهما واحسانهما, وهذا قدر زايد علي فعل ما يلزم لهما. السادس: وفيه الامر باخلاصهما لله تعالي. السابع: انه لا يخرج المحرم بهما بشيء من الاشياء حتي يكملهما",
        "char_start": 0,
        "char_end": 3695,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_224_chunk00",
        "verse_key": "2:224",
        "text_ar": "المقصود من اليمين، والقسم تعظيم المقسم به, وتاكيد المقسم عليه، وكان الله تعالي قد امر بحفظ الايمان, وكان مقتضي ذلك حفظها في كل شيء، ولكن الله تعالي استثني من ذلك اذا كان البر باليمين, يتضمن ترك ما هو احب اليه، فنهي عباده ان يجعلوا ايمانهم عرضه, اي: مانعه وحايله عن ان يبروا: ان يفعلوا خيرا, او يتقوا شرا, او يصلحوا بين الناس، فمن حلف علي ترك واجب وجب حنثه, وحرم اقامته علي يمينه، ومن حلف علي ترك مستحب, استحب له الحنث، ومن حلف علي فعل محرم, وجب الحنث, او علي فعل مكروه استحب الحنث، واما المباح فينبغي",
        "char_start": 0,
        "char_end": 939,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_225_chunk00",
        "verse_key": "2:225",
        "text_ar": "اي لا يواخذكم بما يجري علي السنتكم من الايمان اللاغيه، التي يتكلم بها العبد، من غير قصد منه ولا كسب قلب, ولكنها جرت علي لسانه كقول الرجل في عرض كلامه: \" لا والله \" و \" بلي والله \" وكحلفه علي امر ماض, يظن صدق نفسه، وانما المواخذه علي ما قصده القلب. وفي هذا دليل علي اعتبار المقاصد في الاقوال, كما هي معتبره في الافعال. { والله غفور } لمن تاب اليه, { حليم } بمن عصاه, حيث لم يعاجله بالعقوبه, بل حلم عنه وستر, وصفح مع قدرته عليه, وكونه بين يديه.",
        "char_start": 0,
        "char_end": 442,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_228_chunk00",
        "verse_key": "2:228",
        "text_ar": "اي: النساء اللاتي طلقهن ازواجهن { يَتَرَبَّصْنَ بِاَنْفُسِهِنَّ } اي: ينتظرن ويعتددن مده { ثَلَاثَهَ قُرُوءٍ } اي: حِيَضٍ, او اطهار علي اختلاف العلماء في المراد بذلك, مع انَّ الصحيح انَّ القرء, الحيض, ولهذه العدهِ عِدّهُ حِكَمٍ، منها: العلم ببراءه الرحم, اذا تكررت عليها ثلاثه الاقراء, علم انه ليس في رحمها حمل, فلا يفضي الي اختلاط الانساب، ولهذا اوجب تعالي عليهن الاخبار عن { مَا خَلَقَ اللَّهُ فِي اَرْحَامِهِنَّ } وحرم عليهن, كتمان ذلك, من حمل او حيض, لان كتمان ذلك, يفضي الي مفاسد كثيره، فكتمان ا",
        "char_start": 0,
        "char_end": 3722,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_231_chunk00",
        "verse_key": "2:231",
        "text_ar": "ثم قال تعالي: { وَاِذَا طَلَّقْتُمُ النِّسَاءَ } اي: طلاقا رجعيا بواحده او ثنتين. { فَبَلَغْنَ اَجَلَهُنَّ } اي: قاربن انقضاء عدتهن. { فَاَمْسِكُوهُنَّ بِمَعْرُوفٍ اَوْ سَرِّحُوهُنَّ بِمَعْرُوفٍ } اي: اما ان تراجعوهن, ونيتكم القيام بحقوقهن, او تتركوهن بلا رجعه ولا اضرار, ولهذا قال: { وَلَا تُمْسِكُوهُنَّ ضِرَارًا } اي: مضاره بهن { لِتَعْتَدُوا } في فعلكم هذا الحلال, الي الحرام، فالحلال: الامساك بمعروف والحرام: المضاره، { وَمَنْ يَفْعَلْ ذَلِكَ فَقَدْ ظَلَمَ نَفْسَهُ } ولو كان الحق يعود للمخلوق ف",
        "char_start": 0,
        "char_end": 1844,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_239_chunk00",
        "verse_key": "2:239",
        "text_ar": "{ فَاِنْ خِفْتُمْ } لم يذكر ما يخاف منه ليشمل الخوف من كافر وظالم وسبع، وغير ذلك من انواع المخاوف، اي: ان خفتم بصلاتكم علي تلك الصفه فصلوها { رِجَالًا } اي: ماشين علي اقدامكم، { اَوْ رُكْبَانًا } علي الخيل والابل وغيرها، ويلزم علي ذلك ان يكونوا مستقبلي القبله وغير مستقبليها، وفي هذا زياده التاكيد علي المحافظه علي وقتها حيث امر بذلك ولو مع الاخلال بكثير من الاركان والشروط، وانه لا يجوز تاخيرها عن وقتها ولو في هذه الحاله الشديده، فصلاتها علي تلك الصوره احسن وافضل بل اوجب من صلاتها مطمينا خارج الوق",
        "char_start": 0,
        "char_end": 750,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_250_chunk00",
        "verse_key": "2:250",
        "text_ar": "ولهذا لما برزوا لجالوت وجنوده { قالوا } جميعهم { ربنا افرغ علينا صبرا } اي: قو قلوبنا، واوزعنا الصبر، وثبت اقدامنا عن التزلزل والفرار، وانصرنا علي القوم الكافرين.",
        "char_start": 0,
        "char_end": 162,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_283_chunk00",
        "verse_key": "2:283",
        "text_ar": "اي: ان كنتم مسافرين { ولم تجدوا كاتبا } يكتب بينكم ويحصل به التوثق { فرهان مقبوضه } اي: يقبضها صاحب الحق وتكون وثيقه عنده حتي ياتيه حقه، ودل هذا علي ان الرهن غير المقبوضه لا يحصل منها التوثق، ودل ايضا علي ان الراهن والمرتهن لو اختلفا في قدر ما رهنت به، كان القول قول المرتهن، ووجه ذلك ان الله جعل الرهن عوضا عن الكتابه في توثق صاحب الحق، فلولا ان قول المرتهن مقبول في قدر الذي رهنت به لم يحصل المعني المقصود، ولما كان المقصود بالرهن التوثق جاز حضرا وسفرا، وانما نص الله علي السفر، لانه في مظنه الحاجه",
        "char_start": 0,
        "char_end": 1299,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_020_chunk00",
        "verse_key": "3:20",
        "text_ar": "ثم امر تعالي رسوله صلي الله عليه وسلم عند محاجه النصاري وغيرهم ممن يفضل غير دين الاسلام عليه ان يقول لهم: قد { اسلمت وجهي لله ومن اتبعن } اي: انا ومن اتبعني قد اقررنا وشهدنا واسلمنا وجوهنا لربنا، وتركنا ما سوي دين الاسلام، وجزمنا ببطلانه، ففي هذا تاييس لمن طمع فيكم، وتجديد لدينكم عند ورود الشبهات، وحجه علي من اشتبه عليه الامر، لانه قد تقدم ان الله استشهد علي توحيده باهل العلم من عباده ليكونوا حجه علي غيرهم، وسيد اهل العلم وافضلهم واعلمهم هو نبينا محمد صلي الله عليه وسلم، ثم من بعده اتباعه علي اخ",
        "char_start": 0,
        "char_end": 1157,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_021_chunk00",
        "verse_key": "3:21",
        "text_ar": "هولاء الذين اخبر الله عنهم في هذه الايه، اشد الناس جرما واي: جرم اعظم من الكفر بايات الله التي تدل دلاله قاطعه علي الحق الذي من كفر بها فهو في غايه الكفر والعناد ويقتلون انبياء الله الذين حقهم اوجب الحقوق علي العباد بعد حق الله، الذين اوجب الله طاعتهم والايمان بهم، وتعزيرهم، وتوقيرهم، ونصرهم وهولاء قابلوهم بضد ذلك، ويقتلون ايضا الذين يامرون الناس بالقسط الذي هو العدل، وهو الامر بالمعروف والنهي عن المنكر الذي حقيقته احسان الي المامور ونصح له، فقابلوهم شر مقابله، فاستحقوا بهذه الجنايات المنكرات اش",
        "char_start": 0,
        "char_end": 617,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_013_chunk00",
        "verse_key": "2:13",
        "text_ar": "القول في تاويل قول الله جل ثناوه: وَاِذَا قِيلَ لَهُمْ امِنُوا كَمَا امَنَ النَّاسُقال ابو جعفر: وتاويل قوله: (واذا قيل لهم امنوا كما امن الناس) يعني: واذا قيل لهولاء الذين وَصَفهم الله ونعتَهم بانهم يقولون: امَنَّا بِاللَّهِ وَبِالْيَوْمِ الاخِرِ وَمَا هُمْ بِمُوْمِنِينَ صَدِّقوا بمحمد وبما جاء به من عند الله، كما صدق به الناس. ويعني بـِ \" الناس \": المومنين الذين امنوا بمحمد ونبوته وما جاء به من عند الله. كما-:343- حدثنا ابو كُريب, قال: حدثنا عثمان بن سعيد, عن بشر بن عُماره, عن ابي رَوْق, عن ال",
        "char_start": 0,
        "char_end": 5420,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "القول في تاويل قوله تعالي : اَتَاْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ اَنْفُسَكُمْقال ابو جعفر: اختلف اهل التاويل في معني البر الذي كان المخاطبون بهذه الايه يامرون الناس به وينسون انفسهم, بعد اجماع جميعهم علي ان كل طاعه لله فهي تسمي \" برا \". فروي عن ابن عباس ما:-840- حدثنا به ابن حميد, قال: حدثنا سلمه, عن ابن اسحاق, عن محمد بن ابي محمد, عن عكرمه, او عن سعيد بن جبير, عن ابن عباس: ( اَتَاْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ اَنْفُسَكُمْ وَاَنْتُمْ تَتْلُونَ الْكِتَابَ اَفَلا تَعْقِلُونَ ",
        "char_start": 0,
        "char_end": 5231,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_075_chunk00",
        "verse_key": "2:75",
        "text_ar": "القول في تاويل قوله تعالي : اَفَتَطْمَعُونَ اَنْ يُوْمِنُوا لَكُمْقال ابو جعفر: يعني بقوله جل ثناوه: (افتطمعون) يا اصحاب محمد, اي: افترجون يا معشر المومنين بمحمد صلي الله عليه وسلم، والمصدقين ما جاءكم به من عند الله، ان يومن لكم يهود بني اسراييل؟* * *ويعني بقوله: (ان يومنوا لكم)، ان يصدقوكم بما جاءكم به نبيكم صلي الله عليه وسلم محمد من عند ربكم، كما:-1326 - حُدثت عن عمار بن الحسن, عن ابن ابي جعفر, عن ابيه, عن الربيع في قوله (افتطمعون ان يومنوا لكم)، يعني اصحاب محمد صلي الله عليه وسلم،\" ان يومنوا",
        "char_start": 0,
        "char_end": 7442,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_078_chunk00",
        "verse_key": "2:78",
        "text_ar": "القول في تاويل قوله تعالي : وَمِنْهُمْ اُمِّيُّونَقال ابو جعفر: يعني بقوله جل ثناوه: (ومنهم اميون)، ومن هولاء -اليهود الذين قص الله قصصهم في هذه الايات, واياس اصحاب رسول الله صلي الله عليه وسلم من ايمانهم فقال لهم: اَفَتَطْمَعُونَ اَنْ يُوْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِنْهُمْ يَسْمَعُونَ كَلامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِنْ بَعْدِ مَا عَقَلُوهُ ، وهم اذا لقوكم قالوا: امنا، كما:-1352 - حدثنا المثني قال، حدثنا ادم قال، حدثنا ابو جعفر, عن الربيع, عن ابي العاليه: (ومنهم اميون)، يعني: من ا",
        "char_start": 0,
        "char_end": 15842,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "القول في تاويل قوله تعالي : ثُمَّ اَنْتُمْ هَوُلاءِ تَقْتُلُونَ اَنْفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِنْكُمْ مِنْ دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِمْ بِالاِثْمِ وَالْعُدْوَانِقال ابو جعفر: ويتجه في قوله: (ثم انتم هولاء) وجهان. احدهما ان يكون اريد به: ثم انتم يا هولاء, فترك \" يا \" استغناء بدلاله الكلام عليه, كما قال: يُوسُفُ اَعْرِضْ عَنْ هَذَا [ يوسف: 29]، وتاويله: يا يوسف اعرض عن هذا. فيكون معني الكلام حينيذ: ثم انتم يا معشر يهود بني اسراييل - بعد اقراركم بالميثاق الذي اخذته عليكم: لا تسفكون دم",
        "char_start": 0,
        "char_end": 18866,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_111_chunk00",
        "verse_key": "2:111",
        "text_ar": "وَقَالُوا لَنْ يَدْخُلَ الْجَنَّهَ اِلَّا مَنْ كَانَ هُودًا اَوْ نَصَارَيالْقَوْل فِي تَاْوِيل قَوْله تَعَالَي : { وَقَالُوا لَنْ يَدْخُل الْجَنَّه الَّا مَنْ كَانَ هُودًا اَوْ نَصَارَي } يَعْنِي جَلّ ثَنَاوُهُ بِقَوْلِهِ : { وَقَالُوا } وَقَالَتْ الْيَهُود وَالنَّصَارَي : { لَنْ يَدْخُل الْجَنَّه } . فَاِنْ قَالَ قَايِل : وَكَيْف جَمَعَ الْيَهُود وَالنَّصَارَي فِي هَذَا الْخَبَر مَعَ اخْتِلَاف مَقَالَه الْفَرِيقَيْنِ , وَالْيَهُود تَدْفَع النَّصَارَي عَنْ اَنْ يَكُون لَهَا فِي ثَوَاب اللَّه نَص",
        "char_start": 0,
        "char_end": 5168,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_124_chunk00",
        "verse_key": "2:124",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذِ ابْتَلَي اِبْرَاهِيمَ رَبُّهُ بِكَلِمَاتٍقال ابو جعفر: يعني جل ثناوه بقوله: (واذ ابتلي)، واذا اختبر.* * *يقال منه: \" ابتليت فلانا ابتليه ابتلاء \"، ومنه قول الله عز وجل: وَابْتَلُوا الْيَتَامَي [سوره النساء: 6]، يعني به: اختبروهم. (18) .* * *وكان اختبار الله تعالي ذكره ابراهيم، اختبارا بفرايض فرضها عليه, وامر امره به. وذلك هو \" الكلمات \" التي اوحاهن اليه، وكلفه العمل بهن، امتحانا منه له واختبارا.* * *ثم اختلف اهل التاويل في صفه \" الكلمات \" التي ابتلي الله بها اب",
        "char_start": 0,
        "char_end": 26713,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_125_chunk00",
        "verse_key": "2:125",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذْ جَعَلْنَا الْبَيْتَ مَثَابَهً لِلنَّاسِقال ابو جعفر: اما قوله: \" واذ جعلنا البيت مثابه \"، فانه عطف ب \" اذ \" علي قوله: وَاِذِ ابْتَلَي اِبْرَاهِيمَ رَبُّهُ بِكَلِمَاتٍ . وقوله: وَاِذِ ابْتَلَي اِبْرَاهِيمَ معطوف علي قوله: يَا بَنِي اِسْرَايِيلَ اذْكُرُوا نِعْمَتِيَ ، واذكروا \" اذ ابتلي ابراهيم ربه \",\" واذ جعلنا البيت مثابه \".* * *و \" البيت \" الذي جعله الله مثابه للناس، هو البيت الحرام.* * *واما \" المثابه \"، فان اهل العربيه مختلفون في معناها, والسبب الذي من اجله ",
        "char_start": 0,
        "char_end": 27220,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "القول في تاويل قوله تعالي : قُلْ اَتُحَاجُّونَنَا فِي اللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَا اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْ وَنَحْنُ لَهُ مُخْلِصُونَ (139)قال ابو جعفر: يعني تعالي ذكره بقوله: \" قُلْ اتُحاجُّونَنا في الله \"، قل يا محمد = لمعاشر اليهود والنصاري، الذين قالوا لك ولاصحابك: كُونُوا هُودًا اَوْ نَصَارَي تَهْتَدُوا , وزعموا ان دينهم خيرٌ من دينكم, وكتابهم خير من كتابكم، لانه كان قبلَ كتابكم, وزعموا انهم من اجل ذلك اولي بالله منكم = : \" اتحاجوننا في الله وهو رَبنا وربكم \", بيده",
        "char_start": 0,
        "char_end": 2260,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_161_chunk00",
        "verse_key": "2:161",
        "text_ar": "القول في تاويل قوله تعالي : اِنَّ الَّذِينَ كَفَرُوا وَمَاتُوا وَهُمْ كُفَّارٌ اُولَيِكَ عَلَيْهِمْ لَعْنَهُ اللَّهِ وَالْمَلايِكَهِ وَالنَّاسِ اَجْمَعِينَ (161)قال ابو جعفر: يعني تعالي ذكره بقوله: \" انّ الذين كفروا \"، ان الذين جَحدوا نبوه محمد صلي الله عليه وسلم وكذبوا به = من اليهود والنصاري وساير اهل الملل، والمشركين من عَبده الاوثان =\" وماتوا وهم كفار \"، يعني: وماتوا وهم علي جُحودهم ذلك وتكذيبهم محمدًا صلي الله عليه وسلم،\" اوليك عَليهم لَعنهُ الله والملايكه \", يعني: فاوليك الذين كفروا وماتوا",
        "char_start": 0,
        "char_end": 3272,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_196_chunk00",
        "verse_key": "2:196",
        "text_ar": "واتموا الحج والعمره للهالقول في تاويل قوله تعالي : { واتموا الحج والعمره لله } اختلف اهل التاويل في تاويل ذلك , فقال بعضهم : معني ذلك اتموا الحج بمناسكه وسنته , واتموا العمره بحدودها وسننها . ذكر من قال ذلك : 2599 - حدثني عبيد بن اسماعيل الهباري , قال . ثنا عبد الله بن نمير , عن الاعمش , عن ابراهيم , عن علقمه : { واتموا الحج والعمره لله } قال : هو في قراءه عبد الله : { واقيموا الحج والعمره الي البيت } قال : لا تجاوزوا بالعمره البيت . قال ابراهيم : فذكرت ذلك لسعيد بن جبير , فقال : كذلك قال ابن عب",
        "char_start": 0,
        "char_end": 38427,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_224_chunk00",
        "verse_key": "2:224",
        "text_ar": "القول في تاويل قوله تعالي : وَلا تَجْعَلُوا اللَّهَ عُرْضَهً لاَيْمَانِكُمْ اَنْ تَبَرُّوا وَتَتَّقُوا وَتُصْلِحُوا بَيْنَ النَّاسِقال ابو جعفر : اختلف اهل التاويل في تاويل قوله: \" ولا تجعلوا الله عرضه لايمانكم \" .فقال بعضهم: معناه: ولا تجعلوه عِلَّه لايمانكم، وذلك اذا سيل احدكم الشيء من الخير والاصلاح بين الناس قال: \" عليّ يمين بالله الا افعل ذلك \" - او \" قد حلفت بالله ان لا افعله \"، فيعتلّ في تركه فعل الخير والاصلاح بين الناس بالحلف بالله.* ذكر من قال ذلك:&; 4-420 &;4351 - حدثنا الحسن بن يحيي،",
        "char_start": 0,
        "char_end": 11484,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_225_chunk00",
        "verse_key": "2:225",
        "text_ar": "لا يواخذكم الله باللغو في ايمانكمالقول في تاويل قوله تعالي : { لا يواخذكم الله باللغو في ايمانكم } اختلف اهل التاويل في تاويل قوله : { لا يواخذكم الله باللغو في ايمانكم } وفي معني اللغو . فقال بعضهم في معناه : لا يواخذكم الله بما سبقتكم به السنتكم من الايمان علي عجله وسرعه , فيوجب عليكم به كفاره اذا لم تقصدوا الحلف واليمين , وذلك كقول القايل : فعل هذا والله , او افعله والله , او لا افعله والله , علي سبوق المتكلم بذلك لسانه بما وصل به كلامه من اليمين . ذكر من قال ذلك : 3499 - حدثني اسحاق بن ابراه",
        "char_start": 0,
        "char_end": 29543,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_228_chunk00",
        "verse_key": "2:228",
        "text_ar": "والمطلقات يتربصن بانفسهن ثلاثه قروءالقول في تاويل قوله تعالي : { والمطلقات يتربصن بانفسهن ثلاثه قروء } يعني تعالي ذكره . والمطلقات اللواتي طلقن بعد ابتناء ازواجهن بهن , وافضايهم اليهن اذا كن ذوات حيض وطهر , يتربصن بانفسهن عن نكاح الازواج ثلاثه قروء . واختلف اهل التاويل في تاويل القرء الذي عناه الله بقوله : { يتربصن بانفسهن ثلاثه قروء } فقال بعضهم : هو الحيض . ذكر من قال ذلك : 3699 - حدثني محمد بن عمرو , قال : ثنا ابو عاصم , قال : ثنا عيسي , عن ابن ابي نجيح , عن مجاهد في قول الله : { والمطلقات يت",
        "char_start": 0,
        "char_end": 37817,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_231_chunk00",
        "verse_key": "2:231",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذَا طَلَّقْتُمُ النِّسَاءَ فَبَلَغْنَ اَجَلَهُنَّ فَاَمْسِكُوهُنَّ بِمَعْرُوفٍ اَوْ سَرِّحُوهُنَّ بِمَعْرُوفٍ وَلا تُمْسِكُوهُنَّ ضِرَارًا لِتَعْتَدُواقال ابو جعفر: يعني تعالي ذكره بذلك: \" واذا طلقتم \"، ايها الرجال نساءكم =\" فبلغن اجلهن \", يعني: ميقاتهن الذي وقته لهن، من انقضاء الاقراء الثلاثه، ان كانت من اهل القرء، (1) وانقضاء الاشهر, ان كانت من اهل الشهور=\" فامسكوهن \"، يقول: فراجعوهن ان اردتم رجعتهن في الطلقه التي فيها رجعه: وذلك اما في التطليقه الواحده او التطل",
        "char_start": 0,
        "char_end": 14901,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_239_chunk00",
        "verse_key": "2:239",
        "text_ar": "القول في تاويل قوله تعالي : فَاِنْ خِفْتُمْ فَرِجَالا اَوْ رُكْبَانًاقال ابو جعفر: يعني تعالي ذكره بذلك: وقوموا لله في صلاتكم مطيعين له= لما قد بيناه من معناه= فان خفتم من عدو لكم، ايها الناس, تخشونهم علي انفسكم في حال التقايكم معهم ان تصلوا قياما علي ارجلكم بالارض قانتين لله= فصلوا \" رجالا \"، مشاه علي ارجلكم, وانتم في حربكم وقتالكم وجهاد عدوكم=\" او ركبانا \"، علي ظهور دوابكم, فان ذلك يجزيكم حينيذ من القيام منكم، قانتين. (112)* * *ولما قلنا من ان معني ذلك كذلك, جاز نصب \" الرجال \" بالمعني المحذوف.",
        "char_start": 0,
        "char_end": 20826,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_250_chunk00",
        "verse_key": "2:250",
        "text_ar": "القول في تاويل قوله تعالي : وَلَمَّا بَرَزُوا لِجَالُوتَ وَجُنُودِهِ قَالُوا رَبَّنَا اَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَي الْقَوْمِ الْكَافِرِينَ (250)قال ابو جعفر: يعني تعالي ذكره بقوله : \" ولما برزوا لجالوت وجنوده \"، ولما برز طالوت وجنوده لجالوت وجنوده.* * *ومعني قوله: \" برزوا \" صاروا بالبراز من الارض, وهو ما ظهر منها واستوي. ولذلك قيل للرجل القاضي حاجته: \" تبرز \"، لان الناس قديما في الجاهليه، انما كانوا يقضون حاجتهم في البراز من الارض. وذلك كما قيل: (37) \" تغو",
        "char_start": 0,
        "char_end": 1048,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_283_chunk00",
        "verse_key": "2:283",
        "text_ar": "القول في تاويل قوله تعالي : وَاِنْ كُنْتُمْ عَلَي سَفَرٍ وَلَمْ تَجِدُوا كَاتِبًا فَرِهَانٌ مَقْبُوضَهٌقال ابو جعفر: اختلفت القراه في قراءه ذلك.فقراته القراه في الامصار جميعًا(كَاتِبًا)، بمعني: ولم تجدوا من يكتب لكم كتابَ الدَّين الذي تداينتموه الي اجل مسمًّي،\" فرهان مقبوضه \".* * *وقرا جماعهٌ من المتقدمين: ( وَلَمْ تَجِدُوا كَاتِبًا )، بمعني: ولم يكن لكم الي اكتتاب كتاب الدين سبيلٌ، اما بتعذّر الدواه والصحيفه، واما بتعذر الكاتب وان وجدتم الدواه والصحيفه.* * *والقراءه التي لا يجوز غيرها عندنا هي ",
        "char_start": 0,
        "char_end": 9494,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_020_chunk00",
        "verse_key": "3:20",
        "text_ar": "القول في تاويل قوله : فَاِنْ حَاجُّوكَ فَقُلْ اَسْلَمْتُ وَجْهِيَ لِلَّهِ وَمَنِ اتَّبَعَنِقال ابو جعفر: يعني بذلك جل ثناوه: فان حاجَّك: يا محمد، النفرُ من نصاري اهل نجران في امر عيسي صلوات الله عليه، فخاصموك فيه بالباطل، (44) فقل: انقدت لله وحده بلساني وقلبي وجميع جوارحي. وانما خَصّ جل ذكره بامره بان يقول: \" اسلمت وجهي لله \"، لان الوجه اكرمُ جوارح ابن ادم عليه، وفيه بهاوه وتعظيمه، فاذا خضع وجهه لشيء، فقد خضع له الذي هو دونه في الكرامه عليه من جوارح بدنه. (45)* * *واما قوله: \" ومن اتبعني\"، فانه ",
        "char_start": 0,
        "char_end": 4414,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_021_chunk00",
        "verse_key": "3:21",
        "text_ar": "القول في تاويل قوله : اِنَّ الَّذِينَ يَكْفُرُونَ بِايَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ حَقٍّقال ابو جعفر: يعني بقوله جل ثناوه: (54) \" ان الذين يكفرون بايات الله \"، اي: يجحدون حجج الله واعلامه فيكذبون بها، من اهل الكتابين التوراه والانجيل، كما:-6776 - حدثني ابن حميد قال، حدثنا سلمه، عن ابن اسحاق، عن محمد بن جعفر بن الزبير قال: ثم جمع اهل الكتابين جميعًا، وذكر ما احدثوا وابتدعوا، &; 6-284 &; من اليهود والنصاري فقال: \" انّ الذين يكفرون بايات الله ويقتلون النبيين بغير حقّ\" الي قوله:",
        "char_start": 0,
        "char_end": 5820,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [],
  "incoming_edges": [],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [],
    "internal_external": {
      "value": "ظاهر",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_EXTERNAL_BEH_SOC_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 50,
    "quran_direct_count": 0,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 0,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.764,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.684006Z",
  "schema_version": "1.0.0"
}