{
  "behavior_id": "BEH_EMO_GRIEF",
  "label_ar": "الحزن",
  "label_en": "Grief",
  "category": "emotional",
  "roots": [
    "ح-ز-ن"
  ],
  "stems": [],
  "synonyms_ar": [
    "حزين",
    "يحزنون",
    "حزنا",
    "محزونين",
    "الأسى"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:38",
      "text_ar": "قُلْنَا ٱهْبِطُوا۟ مِنْهَا جَمِيعًا ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى فَمَن تَبِعَ هُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:62",
      "text_ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَعَمِلَ صَـٰلِحًا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:112",
      "text_ar": "بَلَىٰ مَنْ أَسْلَمَ وَجْهَهُۥ لِلَّهِ وَهُوَ مُحْسِنٌ فَلَهُۥٓ أَجْرُهُۥ عِندَ رَبِّهِۦ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:262",
      "text_ar": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ ثُمَّ لَا يُتْبِعُونَ مَآ أَنفَقُوا۟ مَنًّا وَلَآ أَذًى ۙ لَّهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:274",
      "text_ar": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُم بِٱلَّيْلِ وَٱلنَّهَارِ سِرًّا وَعَلَانِيَةً فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:277",
      "text_ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:139",
      "text_ar": "وَلَا تَهِنُوا۟ وَلَا تَحْزَنُوا۟ وَأَنتُمُ ٱلْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:153",
      "text_ar": "إِذْ تُصْعِدُونَ وَلَا تَلْوُۥنَ عَلَىٰٓ أَحَدٍ وَٱلرَّسُولُ يَدْعُوكُمْ فِىٓ أُخْرَىٰكُمْ فَأَثَـٰبَكُمْ غَمًّۢا بِغَمٍّ لِّكَيْلَا تَحْزَنُوا۟ عَلَىٰ مَا فَاتَكُمْ وَلَا مَآ أَصَـٰبَكُمْ ۗ وَٱللَّهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:170",
      "text_ar": "فَرِحِينَ بِمَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضْلِهِۦ وَيَسْتَبْشِرُونَ بِٱلَّذِينَ لَمْ يَلْحَقُوا۟ بِهِم مِّنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:176",
      "text_ar": "وَلَا يَحْزُنكَ ٱلَّذِينَ يُسَـٰرِعُونَ فِى ٱلْكُفْرِ ۚ إِنَّهُمْ لَن يَضُرُّوا۟ ٱللَّهَ شَيْـًٔا ۗ يُرِيدُ ٱللَّهُ أَلَّا يَجْعَلَ لَهُمْ حَظًّا فِى ٱلْـَٔاخِرَةِ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:41",
      "text_ar": "يَـٰٓأَيُّهَا ٱلرَّسُولُ لَا يَحْزُنكَ ٱلَّذِينَ يُسَـٰرِعُونَ فِى ٱلْكُفْرِ مِنَ ٱلَّذِينَ قَالُوٓا۟ ءَامَنَّا بِأَفْوَٰهِهِمْ وَلَمْ تُؤْمِن قُلُوبُهُمْ ۛ وَمِنَ ٱلَّذِينَ هَادُوا۟ ۛ سَمَّـٰعُونَ لِلْكَذِبِ سَمَّـٰعُونَ لِقَوْمٍ ءَاخَرِينَ لَمْ يَأْتُوكَ ۖ يُحَرِّفُونَ ٱلْكَلِمَ مِنۢ بَعْدِ مَوَاضِعِهِۦ ۖ يَقُولُونَ إِنْ أُوتِيتُمْ هَـٰذَا فَخُذُوهُ وَإِن لَّمْ تُؤْتَوْهُ فَٱحْذَرُوا۟ ۚ وَمَن يُرِدِ ٱللَّهُ فِتْنَتَهُۥ فَلَن تَمْلِكَ لَهُۥ مِنَ ٱللَّهِ شَيْـًٔا ۚ أُو۟لَـٰٓئِكَ ٱلَّذِينَ لَمْ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمْ ۚ لَهُمْ فِى ٱلدُّنْيَا خِزْىٌ ۖ وَلَهُمْ فِى ٱلْـَٔاخِرَةِ عَذَابٌ عَظِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:69",
      "text_ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلصَّـٰبِـُٔونَ وَٱلنَّصَـٰرَىٰ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَعَمِلَ صَـٰلِحًا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "6:33",
      "text_ar": "قَدْ نَعْلَمُ إِنَّهُۥ لَيَحْزُنُكَ ٱلَّذِى يَقُولُونَ ۖ فَإِنَّهُمْ لَا يُكَذِّبُونَكَ وَلَـٰكِنَّ ٱلظَّـٰلِمِينَ بِـَٔايَـٰتِ ٱللَّهِ يَجْحَدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "6:48",
      "text_ar": "وَمَا نُرْسِلُ ٱلْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَ ۖ فَمَنْ ءَامَنَ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:35",
      "text_ar": "يَـٰبَنِىٓ ءَادَمَ إِمَّا يَأْتِيَنَّكُمْ رُسُلٌ مِّنكُمْ يَقُصُّونَ عَلَيْكُمْ ءَايَـٰتِى ۙ فَمَنِ ٱتَّقَىٰ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:49",
      "text_ar": "أَهَـٰٓؤُلَآءِ ٱلَّذِينَ أَقْسَمْتُمْ لَا يَنَالُهُمُ ٱللَّهُ بِرَحْمَةٍ ۚ ٱدْخُلُوا۟ ٱلْجَنَّةَ لَا خَوْفٌ عَلَيْكُمْ وَلَآ أَنتُمْ تَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:40",
      "text_ar": "إِلَّا تَنصُرُوهُ فَقَدْ نَصَرَهُ ٱللَّهُ إِذْ أَخْرَجَهُ ٱلَّذِينَ كَفَرُوا۟ ثَانِىَ ٱثْنَيْنِ إِذْ هُمَا فِى ٱلْغَارِ إِذْ يَقُولُ لِصَـٰحِبِهِۦ لَا تَحْزَنْ إِنَّ ٱللَّهَ مَعَنَا ۖ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَيْهِ وَأَيَّدَهُۥ بِجُنُودٍ لَّمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ ٱلَّذِينَ كَفَرُوا۟ ٱلسُّفْلَىٰ ۗ وَكَلِمَةُ ٱللَّهِ هِىَ ٱلْعُلْيَا ۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:92",
      "text_ar": "وَلَا عَلَى ٱلَّذِينَ إِذَا مَآ أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَآ أَجِدُ مَآ أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوا۟ وَّأَعْيُنُهُمْ تَفِيضُ مِنَ ٱلدَّمْعِ حَزَنًا أَلَّا يَجِدُوا۟ مَا يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:62",
      "text_ar": "أَلَآ إِنَّ أَوْلِيَآءَ ٱللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:65",
      "text_ar": "وَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّ ٱلْعِزَّةَ لِلَّهِ جَمِيعًا ۚ هُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "12:13",
      "text_ar": "قَالَ إِنِّى لَيَحْزُنُنِىٓ أَن تَذْهَبُوا۟ بِهِۦ وَأَخَافُ أَن يَأْكُلَهُ ٱلذِّئْبُ وَأَنتُمْ عَنْهُ غَـٰفِلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "12:84",
      "text_ar": "وَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَـٰٓأَسَفَىٰ عَلَىٰ يُوسُفَ وَٱبْيَضَّتْ عَيْنَاهُ مِنَ ٱلْحُزْنِ فَهُوَ كَظِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "12:86",
      "text_ar": "قَالَ إِنَّمَآ أَشْكُوا۟ بَثِّى وَحُزْنِىٓ إِلَى ٱللَّهِ وَأَعْلَمُ مِنَ ٱللَّهِ مَا لَا تَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "15:88",
      "text_ar": "لَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوَٰجًا مِّنْهُمْ وَلَا تَحْزَنْ عَلَيْهِمْ وَٱخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:127",
      "text_ar": "وَٱصْبِرْ وَمَا صَبْرُكَ إِلَّا بِٱللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِى ضَيْقٍ مِّمَّا يَمْكُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "19:24",
      "text_ar": "فَنَادَىٰهَا مِن تَحْتِهَآ أَلَّا تَحْزَنِى قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "20:40",
      "text_ar": "إِذْ تَمْشِىٓ أُخْتُكَ فَتَقُولُ هَلْ أَدُلُّكُمْ عَلَىٰ مَن يَكْفُلُهُۥ ۖ فَرَجَعْنَـٰكَ إِلَىٰٓ أُمِّكَ كَىْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ ۚ وَقَتَلْتَ نَفْسًا فَنَجَّيْنَـٰكَ مِنَ ٱلْغَمِّ وَفَتَنَّـٰكَ فُتُونًا ۚ فَلَبِثْتَ سِنِينَ فِىٓ أَهْلِ مَدْيَنَ ثُمَّ جِئْتَ عَلَىٰ قَدَرٍ يَـٰمُوسَىٰ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "21:103",
      "text_ar": "لَا يَحْزُنُهُمُ ٱلْفَزَعُ ٱلْأَكْبَرُ وَتَتَلَقَّىٰهُمُ ٱلْمَلَـٰٓئِكَةُ هَـٰذَا يَوْمُكُمُ ٱلَّذِى كُنتُمْ تُوعَدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "27:70",
      "text_ar": "وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُن فِى ضَيْقٍ مِّمَّا يَمْكُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "28:7",
      "text_ar": "وَأَوْحَيْنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِى ٱلْيَمِّ وَلَا تَخَافِى وَلَا تَحْزَنِىٓ ۖ إِنَّا رَآدُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ ٱلْمُرْسَلِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "28:8",
      "text_ar": "فَٱلْتَقَطَهُۥٓ ءَالُ فِرْعَوْنَ لِيَكُونَ لَهُمْ عَدُوًّا وَحَزَنًا ۗ إِنَّ فِرْعَوْنَ وَهَـٰمَـٰنَ وَجُنُودَهُمَا كَانُوا۟ خَـٰطِـِٔينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "28:13",
      "text_ar": "فَرَدَدْنَـٰهُ إِلَىٰٓ أُمِّهِۦ كَىْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ أَنَّ وَعْدَ ٱللَّهِ حَقٌّ وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "29:33",
      "text_ar": "وَلَمَّآ أَن جَآءَتْ رُسُلُنَا لُوطًا سِىٓءَ بِهِمْ وَضَاقَ بِهِمْ ذَرْعًا وَقَالُوا۟ لَا تَخَفْ وَلَا تَحْزَنْ ۖ إِنَّا مُنَجُّوكَ وَأَهْلَكَ إِلَّا ٱمْرَأَتَكَ كَانَتْ مِنَ ٱلْغَـٰبِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "31:23",
      "text_ar": "وَمَن كَفَرَ فَلَا يَحْزُنكَ كُفْرُهُۥٓ ۚ إِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُم بِمَا عَمِلُوٓا۟ ۚ إِنَّ ٱللَّهَ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "33:51",
      "text_ar": "تُرْجِى مَن تَشَآءُ مِنْهُنَّ وَتُـْٔوِىٓ إِلَيْكَ مَن تَشَآءُ ۖ وَمَنِ ٱبْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ۚ ذَٰلِكَ أَدْنَىٰٓ أَن تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَآ ءَاتَيْتَهُنَّ كُلُّهُنَّ ۚ وَٱللَّهُ يَعْلَمُ مَا فِى قُلُوبِكُمْ ۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "35:34",
      "text_ar": "وَقَالُوا۟ ٱلْحَمْدُ لِلَّهِ ٱلَّذِىٓ أَذْهَبَ عَنَّا ٱلْحَزَنَ ۖ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "36:76",
      "text_ar": "فَلَا يَحْزُنكَ قَوْلُهُمْ ۘ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "39:61",
      "text_ar": "وَيُنَجِّى ٱللَّهُ ٱلَّذِينَ ٱتَّقَوْا۟ بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ ٱلسُّوٓءُ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "41:30",
      "text_ar": "إِنَّ ٱلَّذِينَ قَالُوا۟ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَـٰمُوا۟ تَتَنَزَّلُ عَلَيْهِمُ ٱلْمَلَـٰٓئِكَةُ أَلَّا تَخَافُوا۟ وَلَا تَحْزَنُوا۟ وَأَبْشِرُوا۟ بِٱلْجَنَّةِ ٱلَّتِى كُنتُمْ تُوعَدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "43:68",
      "text_ar": "يَـٰعِبَادِ لَا خَوْفٌ عَلَيْكُمُ ٱلْيَوْمَ وَلَآ أَنتُمْ تَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "46:13",
      "text_ar": "إِنَّ ٱلَّذِينَ قَالُوا۟ رَبُّنَا ٱللَّهُ ثُمَّ ٱسْتَقَـٰمُوا۟ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "58:10",
      "text_ar": "إِنَّمَا ٱلنَّجْوَىٰ مِنَ ٱلشَّيْطَـٰنِ لِيَحْزُنَ ٱلَّذِينَ ءَامَنُوا۟ وَلَيْسَ بِضَآرِّهِمْ شَيْـًٔا إِلَّا بِإِذْنِ ٱللَّهِ ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "وقوله تعالى : ( قلنا اهبطوا منها جميعا ) يعني هؤلاء الأربعة . وقيل : الهبوط الأول من الجنة إلى السماء الدنيا والهبوط ( الآخر ) من السماء الدنيا إلى الأرض ( فإما يأتينكم ) أي فإن يأتكم يا ذرية آدم ( مني هدى ) أي رشد وبيان شريعة وقيل كتاب ورسول ( فمن تبع هداي فلا خوف عليهم ولا هم يحزنون ) قرأ يعقوب : فلا خوف بالفتح في كل القرآن والآخرون بالضم والتنوين فلا خوف عليهم فيما يستقبلون هم ] ( ولا هم يحزنون ) على ما خلفوا . وقيل لا خوف عليهم في الدنيا ولا هم يحزنون في الآخرة.",
        "char_start": 0,
        "char_end": 470,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "( إن الذين آمنوا والذين هادوا ) يعني اليهود سموا به لقولهم إنا هدنا إليك أي ملنا إليك وقيل لأنهم هادوا أي تابوا عن عبادة العجل وقيل لأنهم مالوا عن دين الإسلام وعن دين موسى عليه السلام وقال أبو عمرو بن العلاء : لأنهم يتهودون أي يتحركون عند قراءة التوراة ويقولون : إن السماوات والأرض تحركت حين آتى الله موسى التوراة ( والنصارى ) سموا به لقول الحواريين : نحن أنصار الله ، وقال مقاتل : لأنهم نزلوا قرية يقال لها ناصرة وقيل لاعتزائهم إلى نصرة وهي قرية كان ينزلها عيسى عليه السلام( والصابئين ) قرأ أهل المد",
        "char_start": 0,
        "char_end": 2581,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "ثم قال رداً عليهم: {بلى من أسلم وجهه} أي ليس الأمر كما قالوا، بل الحكم للإسلام وإنما يدخل الجنة من أسلم وجهه{لله} أي أخلص دينه لله، وقيل: أخلص عبادته لله، وقيل: خضع وتواضع لله.وأصل الإسلام : الاستسلام والخضوع، وخص الوجه لأنه إذا جاد بوجهه في السجود لم يبخل بسائر جوارحه.{وهو محسن} في عمله، وقيل: مؤمن، وقيل: مخلص.{فله أجره عند ربه ولا خوف عليهم ولا هم يحزنون}.",
        "char_start": 0,
        "char_end": 360,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "قوله تعالى : ( الذين ينفقون أموالهم في سبيل الله ) قال الكلبي : نزلت هذه الآية في عثمان بن عفان وعبد الرحمن بن عوف رضي الله تعالى عنهما جاء عبد الرحمن بأربعة آلاف درهم صدقة إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله كانت عندي ثمانية آلاف فأمسكت منها لنفسي وعيالي أربعة آلاف درهم وأربعة آلاف أقرضتها ربي فقال له رسول الله صلى الله عليه وسلم : بارك الله فيما أمسكت لك وفيما أعطيت وأما عثمان فجهز جيش المسلمين في غزوة تبوك بألف بعير بأقتابها وأحلاسها فنزلت فيهما هذه الآية .وقال عبد الرحمن بن ",
        "char_start": 0,
        "char_end": 1308,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "( الذين ينفقون أموالهم بالليل والنهار سرا وعلانية ) روي عن مجاهد عن ابن عباس رضي الله عنهما قال : نزلت هذه الآية في علي بن أبي طالب رضي الله عنه كانت عنده أربعة دراهم لا يملك غيرها فتصدق بدرهم ليلا وبدرهم نهارا وبدرهم سرا وبدرهم علانية .وعن الضحاك عن ابن عباس رضي الله عنهم قال لما نزلت ( للفقراء الذين أحصروا في سبيل الله ) بعث عبد الرحمن بن عوف بدنانير كثيرة إلى أصحاب الصفة ، وبعث علي بن أبي طالب رضي الله عنه في جوف الليل بوسق من تمر فأنزل الله تعالى فيهما ( الذين ينفقون أموالهم بالليل والنهار )",
        "char_start": 0,
        "char_end": 1293,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "\" إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون \".",
        "char_start": 0,
        "char_end": 110,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_139_chunk00",
        "verse_key": "3:139",
        "text_ar": "قوله تعالى : \" ولا تهنوا ولا تحزنوا\"، هذا حث لأصحاب النبي صلى الله عليه وسلم على الجهاد، زيادةً على ما أصابهم من القتل والجراح يوم أحد، يقول الله تعالى : ولا تهنوا أي: لا تضعفوا ولا تجبنوا عن جهاد أعدائكم بما نالكم من القتل والجرح، وكان قد قتل يومئذ خمسة منهم: حمزة بن عبد المطلب ومصعب بن عمير، وقتل من الأنصار سبعون رجلاً.\"ولا تحزنوا\" فإنكم \"وأنتم الأعلون\" أي تكون لكم العاقبة بالنصرة والظفر، \"إن كنتم مؤمنين\" يعني:إذ كنتم مؤمنين: أي:لأنكم مؤمنين، قال ابن عباس رضي الله عنهما: لما انهزم أصحاب رسول ا",
        "char_start": 0,
        "char_end": 995,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_153_chunk00",
        "verse_key": "3:153",
        "text_ar": "( إذ تصعدون ) يعني : ولقد عفا عنكم إذ تصعدون هاربين ، وقرأ أبو عبد الرحمن السلمي والحسن وقتادة ( تصعدون ) بفتح التاء والعين والقراءة المعروفة بضم التاء وكسر العين .والإصعاد : السير في مستوى الأرض والصعود : الارتفاع على الجبال والسطوح ، قال أبو حاتم : يقال أصعدت إذا مضيت حيال وجهك وصعدت إذا ارتقيت في جبل أو غيره ، وقال المبرد : أصعد إذا أبعد في الذهاب ، وكلتا القراءتين صواب فقد كان يومئذ من المنهزمين مصعد وصاعد وقال المفضل : صعد وأصعد وصعد بمعنى واحد .( ولا تلوون على أحد ) أي : لا تعرجون ولا تقيم",
        "char_start": 0,
        "char_end": 2062,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "( فرحين بما آتاهم الله من فضله ) رزقه وثوابه ، ( ويستبشرون ) ويفرحون ( بالذين لم يلحقوا بهم من خلفهم ) من إخوانهم الذين تركوهم أحياء في الدنيا على مناهج الإيمان والجهاد لعلمهم أنهم إذا استشهدوا ولحقوا بهم ونالوا من الكرامة ما نالوا فهم لذلك مستبشرون ، ( ألا خوف عليهم ولا هم يحزنون ) .",
        "char_start": 0,
        "char_end": 285,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_176_chunk00",
        "verse_key": "3:176",
        "text_ar": "قوله عز وجل : ( ولا يحزنك ) قرأ نافع \" يحزنك \" بضم الياء وكسر الزاي ، وكذلك جميع القرآن إلا قوله ( لا يحزنهم الفزع الأكبر ) ضده أبو جعفر وهما لغتان : حزن يحزن وأحزن يحزن إلا أن اللغة الغالبة حزن يحزن ، ( الذين يسارعون في الكفر ) قال الضحاك : هم كفار قريش وقال غيره : هم المنافقون يسارعون في الكفر بمظاهرة الكفار . ( إنهم لن يضروا الله شيئا ) بمسارعتهم في الكفر ، ( يريد الله ألا يجعل لهم حظا في الآخرة ) نصيبا في ثواب الآخرة ، فلذلك خذلهم حتى سارعوا في الكفر ، ( ولهم عذاب عظيم )",
        "char_start": 0,
        "char_end": 479,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_041_chunk00",
        "verse_key": "5:41",
        "text_ar": "قوله تعالى : ( يا أيها الرسول لا يحزنك الذين يسارعون في الكفر ) أي : في موالاة الكفار فإنهم لم يعجزوا الله ، ( من الذين قالوا آمنا بأفواههم ولم تؤمن قلوبهم ) وهم المنافقون ، ( ومن الذين هادوا ) يعني : اليهود ، ( سماعون ) أي : قوم سماعون ، ( للكذب ) أي : قائلون للكذب ، كقول المصلي : سمع الله لمن حمده ، أي : قبل الله ، وقيل : سماعون لأجل الكذب ، أي يسمعون منك ليكذبوا عليك ، وذلك أنهم كانوا يسمعون من الرسول صلى الله عليه وسلم ثم يخرجون ويقولون سمعنا منه كذا ولم يسمعوا ذلك منه ، ( سماعون لقوم آخرين ",
        "char_start": 0,
        "char_end": 5623,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "( إن الذين آمنوا والذين هادوا والصابئون والنصارى ) وكان حقه : ) ( والصابئين ) وقد ذكرنا في سورة البقرة وجه ارتفاعه . وقال سيبويه : فيه تقديم وتأخير تقديره : إن الذين آمنوا والذين هادوا والنصارى من آمن بالله إلى آخر الآية ، والصابئون كذلك ، وقوله : ( إن الذين آمنوا ) أي : باللسان ، وقوله : ( من آمن بالله ) أي : بالقلب ، وقيل : الذين آمنوا على حقيقة الإيمان ( من آمن بالله ) أي : ثبت على الإيمان ، ( واليوم الآخر وعمل صالحا فلا خوف عليهم ولا هم يحزنون )",
        "char_start": 0,
        "char_end": 453,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_033_chunk00",
        "verse_key": "6:33",
        "text_ar": "قوله عز وجل : ( قد نعلم إنه ليحزنك الذي يقولون ) قال السدي : التقى الأخنس بن شريق وأبو جهل بن هشام ، فقال الأخنس لأبي جهل يا أبا الحكم أخبرني عن محمد أصادق هو أم كاذب؟ فإنه ليس هاهنا أحد يسمع كلامك غيري ، قال أبو جهل : والله إن محمدا لصادق ، وما كذب محمد قط ، ولكن إذا ذهب بنو قصي باللواء والسقاية والحجابة والندوة والنبوة فماذا يكون لسائر قريش؟ فأنزل الله عز وجل هذه الآية .وقال ناجية بن كعب : قال أبو جهل للنبي صلى الله عليه وسلم لا نتهمك ولا نكذبك ، ولكنا نكذب الذي جئت به ، فأنزل الله تعالى : ( ق",
        "char_start": 0,
        "char_end": 991,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "قوله عز وجل : ( وما نرسل المرسلين إلا مبشرين ومنذرين فمن آمن وأصلح ) العمل ، ( فلا خوف عليهم ) حين يخاف أهل النار ، ( ولا هم يحزنون ) إذا حزنوا .",
        "char_start": 0,
        "char_end": 145,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "قوله تعالى : ( يابني آدم إما يأتينكم رسل منكم ) أي : أن يأتيكم . قيل : أراد جميع الرسل . وقال مقاتل : أراد بقوله : ( يا بني آدم ) مشركي العرب وبالرسل محمدا - صلى الله عليه وسلم - وحده ، ( يقصون عليكم آياتي ) قال ابن عباس : فرائضي وأحكامي ، ( فمن اتقى وأصلح ) أي : اتقى الشرك وأصلح عمله . وقيل : أخلص ما بينه وبين ربه ( فلا خوف عليهم ) إذا خاف الناس ، ( ولا هم يحزنون ) أي : إذا حزنوا .",
        "char_start": 0,
        "char_end": 385,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_049_chunk00",
        "verse_key": "7:49",
        "text_ar": "( أهؤلاء الذين أقسمتم ) حلفتم ، ( لا ينالهم الله برحمة ) أي : حلفتم أنهم لا يدخلون الجنة . ثم يقال لأهل الأعراف : ( ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون ) وفيه قول آخر : أن أصحاب الأعراف إذا قالوا لأهل النار ما قالوا ، قال لهم أهل النار : إن دخل أولئك الجنة وأنتم لم تدخلوها . فيعيرونهم بذلك ، ويقسمون أنهم يدخلون النار ، فتقول الملائكة الذين حبسوا أصحاب الأعراف على الصراط لأهل النار : أهؤلاء ، يعني : أصحاب الأعراف ، الذين أقسمتم يا أهل النار أنهم لا ينالهم الله برحمة ، ثم قالت الملائكة لأصحا",
        "char_start": 0,
        "char_end": 573,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_040_chunk00",
        "verse_key": "9:40",
        "text_ar": "قوله تعالى : ( إلا تنصروه فقد نصره الله ) هذا إعلام من الله عز وجل أنه المتكفل بنصر رسوله وإعزاز دينه ، أعانوه أو لم يعينوه ، وأنه قد نصره عند قلة الأولياء ، وكثرة الأعداء ، فكيف به اليوم وهو في كثرة من العدد والعدد؟ ( إذ أخرجه الذين كفروا ) من مكة حين مكروا به وأرادوا تبيينه وهموا بقتله ، ( ثاني اثنين ) أي هو أحد الاثنين ، والاثنان : أحدهما رسول الله صلى الله عليه وسلم ، والآخر أبو بكر الصديق رضي الله عنه ، ( إذ هما في الغار ) وهو نقب في جبل ثور بمكة ، ( إذ يقول لصاحبه لا تحزن إن الله معنا ) قا",
        "char_start": 0,
        "char_end": 9097,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_092_chunk00",
        "verse_key": "9:92",
        "text_ar": "قوله تعالى : ( ولا على الذين إذا ما أتوك لتحملهم ) معناه : أنه لا سبيل على الأولين ولا على هؤلاء الذين أتوك وهم سبعة نفر سموا البكائين : معقل بن يسار ، وصخر ابن خنساء ، وعبد الله بن كعب الأنصاري ، وعلبة بن زيد الأنصاري ، وسالم بن عمير ، وثعلبة بن غنمة وعبد الله بن مغفل المزني ، أتوا رسول الله صلى الله عليه وسلم فقالوا : يا رسول الله إن الله قد ندبنا إلى الخروج معك فاحملنا .واختلفوا في قوله : ( لتحملهم ) قال ابن عباس : سألوه أن يحملهم على الدواب .وقيل سألوه أن يحملهم على الخفاف المرفوعة والنعال ا",
        "char_start": 0,
        "char_end": 673,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_010_062_chunk00",
        "verse_key": "10:62",
        "text_ar": "قوله تعالى : ( ألا إن أولياء الله لا خوف عليهم ولا هم يحزنون ) واختلفوا فيمن يستحق هذا الاسم . قال بعضهم : هم الذين ذكرهم الله تعالى فقال :",
        "char_start": 0,
        "char_end": 139,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_010_065_chunk00",
        "verse_key": "10:65",
        "text_ar": "( ولا يحزنك قولهم ) يعني : قول المشركين ، تم الكلام هاهنا ثم ابتدأ ، فقال : ( إن العزة لله ) يعني الغلبة والقدرة لله ( جميعا ) هو ناصرك ، وناصر دينك ، والمنتقم منهم .قال سعيد بن المسيب : إن العزة لله جميعا يعني : أن الله يعز من يشاء ، كما قال في آية أخرى : \" ولله العزة ولرسوله وللمؤمنين \" ( المنافقون - 8 ) ، وعزة الرسول والمؤمنين بالله فهي كلها لله .( هو السميع العليم ) .",
        "char_start": 0,
        "char_end": 374,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "قول تعالي مخبرا عما انذر به ادم وزوجته وابليس حتي اهبطهم من الجنه ، والمراد الذريه - انه سينزل الكتب ، ويبعث الانبياء والرسل ؛ كما قال ابو العاليه : الهدي : الانبياء والرسل والبيان ، وقال مقاتل بن حيان : الهدي : محمد صلي الله عليه وسلم . وقال الحسن : الهدي القران . وهذان القولان صحيحان ، وقول ابي العاليه اعم .( فمن تبع هداي ) اي : من اقبل علي ما انزلت به الكتب وارسلت به الرسل ( فلا خوف عليهم ) اي : فيما يستقبلونه من امر الاخره ( ولا هم يحزنون ) علي ما فاتهم من امور الدنيا ، كما قال في سوره \" طه ",
        "char_start": 0,
        "char_end": 738,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "لما بين [ الله ] تعالي حال من خالف اوامره وارتكب زواجره ، وتعدي في فعل ما لا اذن فيه وانتهك المحارم ، وما احل بهم من النكال ، نبه تعالي علي ان من احسن من الامم السالفه واطاع ، فان له جزاء الحسني ، وكذلك الامر الي قيام الساعه ؛ كل من اتبع الرسول النبي الامي فله السعاده الابديه ، ولا خوف عليهم فيما يستقبلونه ، ولا هم يحزنون علي ما يتركونه ويخلفونه ، كما قال تعالي : ( الا ان اولياء الله لا خوف عليهم ولا هم يحزنون ) [ يونس : 62 ] وكما تقول الملايكه للمومنين عند الاحتضار في قوله : ( ان الذين قالوا رب",
        "char_start": 0,
        "char_end": 6181,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "ثم قال تعالي : ( بلي من اسلم وجهه لله وهو محسن ) اي : من اخلص العمل لله وحده لا شريك له ، كما قال تعالي : ( فان حاجوك فقل اسلمت وجهي لله ومن اتبعن ) الايه [ ال عمران : 20 ] .وقال ابو العاليه والربيع : ( بلي من اسلم وجهه لله ) يقول : من اخلص لله .وقال سعيد بن جبير : ( بلي من اسلم ) اخلص ، ( وجهه ) قال : دينه ، ( وهو محسن ) اي : متبع فيه الرسول صلي الله عليه وسلم . فان للعمل المتقبل شرطين ، احدهما : ان يكون خالصا لله وحده والاخر : ان يكون صوابا موافقا للشريعه . فمتي كان خالصا ولم يكن صوابا لم يتقب",
        "char_start": 0,
        "char_end": 1932,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "يمدح تعالي الذين ينفقون اموالهم في سبيل الله ، ثم لا يتبعون ما انفقوا من الخيرات والصدقات منا علي من اعطوه ، فلا يمنون علي احد ، ولا يمنون به لا بقول ولا فعل .وقوله : ( ولا اذي ) اي : لا يفعلون مع من احسنوا اليه مكروها يحبطون به ما سلف من الاحسان . ثم وعدهم تعالي الجزاء الجزيل علي ذلك ، فقال : ( لهم اجرهم عند ربهم ) اي : ثوابهم علي الله ، لا علي احد سواه ( ولا خوف عليهم ) اي : فيما يستقبلونه من اهوال يوم القيامه ( ولا هم يحزنون ) اي : [ علي ] ما خلفوه من الاولاد وما فاتهم من الحياه الدنيا وزهرته",
        "char_start": 0,
        "char_end": 561,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "وقوله : ( الذين ينفقون اموالهم بالليل والنهار سرا وعلانيه فلهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون ) هذا مدح منه تعالي للمنفقين في سبيله ، وابتغاء مرضاته في جميع الاوقات من ليل او نهار ، والاحوال من سر وجهار ، حتي ان النفقه علي الاهل تدخل في ذلك ايضا ، كما ثبت في الصحيحين ان رسول الله صلي الله عليه وسلم قال لسعد بن ابي وقاص حين عاده مريضا عام الفتح ، وفي روايه عام حجه الوداع : \" وانك لن تنفق نفقه تبتغي بها وجه الله الا ازددت بها درجه ورفعه ، حتي ما تجعل في في امراتك \" .وقال الامام احمد : ",
        "char_start": 0,
        "char_end": 1790,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "ثم قال تعالي مادحا للمومنين بربهم ، المطيعين امره ، المودين شكره ، المحسنين الي خلقه في اقامه الصلاه وايتاء الزكاه ، مخبرا عما اعد لهم من الكرامه ، وانهم يوم القيامه من التبعات امنون ، فقال : ( ان الذين امنوا وعملوا الصالحات واقاموا الصلاه واتوا الزكاه لهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون )",
        "char_start": 0,
        "char_end": 301,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_139_chunk00",
        "verse_key": "3:139",
        "text_ar": "ثم قال مسليا للمومنين : ( ولا تهنوا ) اي : لا تضعفوا بسبب ما جري ( ولا تحزنوا وانتم الاعلون ان كنتم مومنين ) اي العاقبه والنصره لكم ايها المومنون .",
        "char_start": 0,
        "char_end": 147,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_153_chunk00",
        "verse_key": "3:153",
        "text_ar": "وقوله : ( اذ تصعدون ولا تلوون علي احد ) اي : صرفكم عنهم ( اذ تصعدون ) اي : في الجبل هاربين من اعدايكم .وقرا الحسن وقتاده : ( اذ تصعدون ) اي : في الجبل ( ولا تلوون علي احد ) اي : وانتم لا تلوون علي احد من الدهش والخوف والرعب ( والرسول يدعوكم في اخراكم ) اي : وهو قد خلفتموه وراء ظهوركم يدعوكم الي ترك الفرار من الاعداء ، والي الرجعه والعوده والكره .قال السدي : لما شد المشركون علي المسلمين باحد فهزموهم ، دخل بعضهم المدينه ، وانطلق بعضهم فوق الجبل الي الصخره فقاموا عليها ، وجعل الرسول صلي الله عليه و",
        "char_start": 0,
        "char_end": 13722,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "وقوله : ( فرحين بما اتاهم الله [ من فضله ويستبشرون بالذين لم يلحقوا بهم من خلفهم الا خوف عليهم ولا هم يحزنون ] ) اي : الشهداء الذين قتلوا في سبيل الله احياء عند الله ، وهم فرحون مما هم فيه من النعمه والغبطه ، ومستبشرون باخوانهم الذين يقتلون بعدهم في سبيل الله انهم يقدمون عليهم ، وانهم لا يخافون مما امامهم ولا يحزنون علي ما تركوه وراءهم .قال محمد بن اسحاق ( ويستبشرون ) اي : ويسرون بلحوق من خلفهم من اخوانهم علي ما مضوا عليه من جهادهم ، ليشركوهم فيما هم فيه من ثواب الله الذي اعطاهم .[ و ] قال السدي",
        "char_start": 0,
        "char_end": 1363,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_176_chunk00",
        "verse_key": "3:176",
        "text_ar": "يقول تعالي لنبيه صلي الله عليه وسلم : ( ولا يحزنك الذين يسارعون في الكفر ) وذلك من شده حرصه علي الناس كان يحزنه مبادره الكفار الي المخالفه والعناد والشقاق ، فقال تعالي : ولا يحزنك ذلك ( انهم لن يضروا الله شييا يريد الله الا يجعل لهم حظا في الاخره ) اي : حكمته فيهم انه يريد بمشييته وقدرته الا يجعل لهم نصيبا في الاخره ( ولهم عذاب عظيم ) .",
        "char_start": 0,
        "char_end": 338,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_041_chunk00",
        "verse_key": "5:41",
        "text_ar": "نزلت هذه الايات الكريمات في المسارعين في الكفر ، الخارجين عن طاعه الله ورسوله ، المقدمين اراءهم واهواءهم علي شرايع الله ، عز وجل ( من الذين قالوا امنا بافواههم ولم تومن قلوبهم ) اي : اظهروا الايمان بالسنتهم ، وقلوبهم خراب خاويه منه ، وهولاء هم المنافقون . ( ومن الذين هادوا ) اعداء الاسلام واهله . وهولاء كلهم ( سماعون للكذب ) اي : يستجيبون له ، منفعلون عنه ( سماعون لقوم اخرين لم ياتوك ) اي : يستجيبون لاقوام اخرين لا ياتون مجلسك يا محمد . وقيل : المراد انهم يتسمعون الكلام ، وينهونه الي اقوام اخرين",
        "char_start": 0,
        "char_end": 15368,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "ثم قال : ( ان الذين امنوا ) وهم : المسلمون ( والذين هادوا ) وهم : حمله التوراه ( والصابيون ) - لما طال الفصل حسن العطف بالرفع . والصابيون : طايفه بين النصاري والمجوس ليس لهم دين . قاله مجاهد وعنه : بين اليهود والمجوس . وقال سعيد بن جبير : بين اليهود والنصاري وعن الحسن [ والحكم ] انهم كالمجوس . وقال قتاده : هم قوم يعبدون الملايكه ، ويصلون الي غير القبله ، ويقرءون الزبور . وقال وهب بن منبه : هم قوم يعرفون الله وحده ، وليست لهم شريعه يعملون بها ، ولم يحدثوا كفرا .وقال ابن وهب : اخبرني ابن ابي الزنا",
        "char_start": 0,
        "char_end": 1056,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_033_chunk00",
        "verse_key": "6:33",
        "text_ar": "يقول تعالي مسليا لنبيه - صلي الله عليه وسلم - ، في تكذيب قومه له ومخالفتهم اياه : ( قد نعلم انه ليحزنك الذي يقولون ) اي : قد احطنا علما بتكذيب قومك لك ، وحزنك وتاسفك عليهم ( فلا تذهب نفسك عليهم حسرات ) [ فاطر : 8 ] كما قال تعالي في الايه الاخري : ( لعلك باخع نفسك الا يكونوا مومنين ) [ الشعراء : 3 ] ( فلعلك باخع نفسك علي اثارهم ان لم يومنوا بهذا الحديث اسفا ) [ الكهف : 7 ]وقوله : ( فانهم لا يكذبونك ولكن الظالمين بايات الله يجحدون ) اي : لا يتهمونك بالكذب في نفس الامر ( ولكن الظالمين بايات الله يج",
        "char_start": 0,
        "char_end": 3392,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "وقوله : ( وما نرسل المرسلين الا مبشرين ومنذرين ) اي : مبشرين عباد الله المومنين بالخيرات ومنذرين من كفر بالله النقمات والعقوبات . ولهذا قال [ سبحانه وتعالي ] ( فمن امن واصلح ) اي : فمن امن قلبه بما جاءوا به واصلح عمله باتباعه اياهم ( فلا خوف عليهم ) اي : بالنسبه الي ما يستقبلونه ( ولا هم يحزنون ) اي : بالنسبه الي ما فاتهم وتركوه وراء ظهورهم من امر الدنيا وصنيعها ، الله وليهم فيما خلفوه ، وحافظهم فيما تركوه .",
        "char_start": 0,
        "char_end": 411,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "ثم انذر تعالي بني ادم بانه سيبعث اليهم رسلا يقصون عليهم اياته ، وبشر وحذر فقال : ( فمن اتقي واصلح ) اي : ترك المحرمات وفعل الطاعات ( فلا خوف عليهم ولا هم يحزنون)",
        "char_start": 0,
        "char_end": 161,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_049_chunk00",
        "verse_key": "7:49",
        "text_ar": "( اهولاء الذين اقسمتم لا ينالهم الله برحمه ) قال علي بن ابي طلحه ، عن ابن عباس : يعني : اصحاب الاعراف ( ادخلوا الجنه لا خوف عليكم ولا انتم تحزنون ) .وقال ابن جرير : حدثني محمد بن سعد ، حدثني ابي ، حدثني عمي ، حدثني ابي ، عن ابيه ، عن ابن عباس : ( قالوا ما اغني عنكم جمعكم وما كنتم تستكبرون ) الايه ، قال : فلما قالوا لهم الذي قضي الله ان يقولوا - يعني اصحاب الاعراف لاهل الجنه واهل النار - قال الله تعالي لاهل التكبر والاموال : ( اهولاء الذين اقسمتم لا ينالهم الله برحمه ادخلوا الجنه لا خوف عليكم ولا",
        "char_start": 0,
        "char_end": 2379,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_040_chunk00",
        "verse_key": "9:40",
        "text_ar": "يقول تعالي : ( الا تنصروه ) اي : تنصروا رسوله ، فان الله ناصره ومويده وكافيه وحافظه ، كما تولي نصره ( اذ اخرجه الذين كفروا ثاني اثنين ) [ اذ هما في الغار ] ) اي : عام الهجره ، لما هم المشركون بقتله او حبسه او نفيه ، فخرج منهم هاربا صحبه صديقه وصاحبه ابي بكر بن ابي قحافه ، فلجا الي غار ثور ثلاثه ايام ليرجع الطلب الذين خرجوا في اثارهم ، ثم يسيرا نحو المدينه ، فجعل ابو بكر - رضي الله عنه - يجزع ان يطلع عليهم احد ، فيخلص الي الرسول - عليه السلام - منهم اذي ، فجعل النبي - صلي الله عليه وسلم - يسكنه و",
        "char_start": 0,
        "char_end": 1599,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_092_chunk00",
        "verse_key": "9:92",
        "text_ar": "وقال مجاهد في قوله : ( ولا علي الذين اذا ما اتوك لتحملهم ) نزلت في بني مقرن من مزينه .وقال محمد بن كعب : كانوا سبعه نفر ، من بني عمرو بن عوف : سالم بن عمير ، ومن بني واقف : هرمي بن عمرو ، ومن بني مازن بن النجار : عبد الرحمن بن كعب - ويكني ابا ليلي - ومن بني المعلي : [ سلمان بن صخر ، ومن بني حارثه : عبد الرحمن بن يزيد ابو عبله ، وهو الذي تصدق بعرضه فقبله الله منه ] ، ومن بني سلمه : عمرو بن عنمه وعبد الله بن عمرو المزني .وقال محمد بن اسحاق في سياق غزوه تبوك : ثم ان رجالا من المسلمين اتوا رسول الله",
        "char_start": 0,
        "char_end": 1786,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_010_062_chunk00",
        "verse_key": "10:62",
        "text_ar": "يخبر تعالي ان اولياءه هم الذين امنوا وكانوا يتقون ، كما فسرهم ربهم ، فكل من كان تقيا كان لله وليا : انه ( لا خوف عليهم ) [ اي ] فيما يستقبلون من اهوال القيامه ، ( ولا هم يحزنون ) علي ما وراءهم في الدنيا .وقال عبد الله بن مسعود ، وابن عباس ، وغير واحد من السلف : اولياء الله الذين اذا رءوا ذكر الله .وقد ورد هذا في حديث مرفوع كما قال البزار :حدثنا علي بن حرب الرازي ، حدثنا محمد بن سعيد بن سابق ، حدثنا يعقوب بن عبد الله الاشعري - وهو القمي - عن جعفر بن ابي المغيره ، عن سعيد بن جبير ، عن ابن عباس قال",
        "char_start": 0,
        "char_end": 1770,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_010_065_chunk00",
        "verse_key": "10:65",
        "text_ar": "قول تعالي لرسوله صلي الله عليه وسلم : ( ولا يحزنك ) قول هولاء المشركين ، واستعن بالله عليهم ، وتوكل عليه ؛ فان العزه لله جميعا ، اي : جميعها له ولرسوله وللمومنين ، ( هو السميع العليم ) اي : السميع لاقوال عباده العليم باحوالهم .",
        "char_start": 0,
        "char_end": 227,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "«قلنا اهبطوا منها» من الجنة «جميعاً» كرره ليعطف عليه «فإما» فيه إدغام نون إن الشرطية في ما الزائدة «يأتينكم مني هدىً» كتاب ورسول «فمن تبع هداي» فآمن بي وعمل بطاعتي «فلا خوف عليهم ولا هم يحزنون» في الآخرة بأن يدخلوا الجنة.",
        "char_start": 0,
        "char_end": 221,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "«إن الذين آمنوا» بالأنبياء من قبل «والذين هادوا» هم اليهود «والنصارى والصابئين» طائفة من اليهود أو النصارى «من آمن» منهم «بالله واليوم الآخر» في زمن نبينا «وعمل صالحاً» بشريعته «فلهم أجرهم» أي ثواب أعمالهم «عند ربهم ولا خوف عليهم ولا هم يحزنون» رُوعي في ضمير آمن وعمل لفظ من وفيما بعده معناها.",
        "char_start": 0,
        "char_end": 293,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "«بلى» يدخل الجنة غيرهم «من أسلم وجهه لله» أي انقاد لأمره. وخص الوجه لأنه أشرف الأعضاء فغيره أولى «وهو محسن» موحد «فله أجره عند ربِّه» أي ثواب عمله الجنة «ولا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 193,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "«الذين ينفقون أموالهم في سبيل الله ثم لا يُتبِعون ما أنفقوا مَنًّا» على المنفق عليه بقولهم مثلا: قد أحسنت إليه وجبرت حاله «ولا أذًى» له بذكر ذلك إلى من لا يجب وقوفه عليه ونحو «لهم أجرهم» ثواب إنفاقهم «عند ربهم ولا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 249,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "«الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربَّهم ولا خوف عليهم ولا هم يحزنون».",
        "char_start": 0,
        "char_end": 100,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "«إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون».",
        "char_start": 0,
        "char_end": 108,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_139_chunk00",
        "verse_key": "3:139",
        "text_ar": "«ولا تهنوا» تضعفوا عن قتال الكفار «ولا تحزنوا» على ما أصابكم بأحد «وأنتم الأعلون» بالغلبة عليهم «إن كنتم مؤمنين» حقا وجوابه دل عليه مجموع ما قبله.",
        "char_start": 0,
        "char_end": 146,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_153_chunk00",
        "verse_key": "3:153",
        "text_ar": "اذكروا «إذ تصعدون» تبعدون في الأرض هاربين «ولا تلوون» تعرجون «على أحد والرسولُ يدعوكم في أخراكم» أي من ورائكم يقول إليَّ عباد الله «فأثابكم» فجازاكم «غمّاً» بالهزيمة «بغمٍّ» بسبب غمِّكم للرسول بالمخالفة وقيل الباء بمعنى على، أي مضاعفا على غم فوت الغنيمة «لكيلا» متعلق بعفا أو بأثابكم فلا زائدة «تحزنوا على ما فاتكم» من الغنيمة «ولا ما أصابكم» من القتل والهزيمة «والله خبير بما تعملون».",
        "char_start": 0,
        "char_end": 385,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "«فرحين» حال من ضمير يُرزقون «بما آتاهم الله من فضله و» هم «يستبشرون» يفرحون «بالذين لم يلحقوا بهم من خلفهم» من إخوانهم المؤمنين ويبدل من الذين «أ» نْ أي بأن «لا خوف عليهم» أي الذين لم يلحقوا بهم «ولا هم يحزنون» في الآخرة المعنى يفرحون بأمنهم وفرحهم.",
        "char_start": 0,
        "char_end": 249,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_176_chunk00",
        "verse_key": "3:176",
        "text_ar": "«ولا يُحْزِنْكَ» بضم الياء وكسر الزاي وبفتحها وضم الزاي من أحزنه «الذين يسارعون في الكفر» يقعون فيه سريعا بنصرته وهم أهل مكة أو المنافقون أي لا تهتم لكفرهم «إنَّهمُ لن يضروا الله شيئا» بفعلهم وإنما يضرون أنفسهم «يريد الله ألا يجعل لهم حظّا» نصيبا «في الآخرة» أي الجنة فلذلك خذلهم الله «ولهم عذاب عظيم» في النار.",
        "char_start": 0,
        "char_end": 311,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_041_chunk00",
        "verse_key": "5:41",
        "text_ar": "«يا أيها الرسول لا يَحزنك» صنع «الذين يسارعون في الكفر» يقعون فيه بسرعة أي يظهرونه إذا وجدوا فرصة «من» للبيان «الذين قالوا آمنا بأفوههم» بألسنتهم متعلق بقالوا «ولم تؤمن قلوبهم» وهم المنافقون «ومن الذين هادوا» قوم «سماعون للكذب» الذي افترته أحبارهم سماع قبول «سماعون» منك «لقوم» لأجل قوم «آخرين» من اليهود «لم يأتوك» وهم أهل خيبر زنى فيهم محصنان فكرهوا رجمهما فبعثوا قريظة ليسألوا النبي صلى الله عليه وسلم عن حكمهما «يحرفون الكلم» الذي في التوراة كآية الرجم «من بعد مواضعه» التي وضعه الله عليها أي يبد",
        "char_start": 0,
        "char_end": 851,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "«إن الذين آمنوا والذين هادوا» هم اليهود مبتدأ «والصابئون» فرقة منهم «والنصارى» ويبدل من المبتدأ «من آمن» منهم «بالله واليوم الآخر وعمل صالحا فلا خوف عليهم ولا هم يحزنون» في الآخرة خبر المبتدأ ودال على خبر إن.",
        "char_start": 0,
        "char_end": 208,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_033_chunk00",
        "verse_key": "6:33",
        "text_ar": "«قد» للتحقيق «نعلم إنه» أي الشأن «ليحزنك الذي يقولون» لك من التكذيب «فإنهم لا يكذِّبونك» في السر لعلمهم أنك صادق وفي قراءة بالتخفيف أي لا ينسبونك إلى الكذب «ولكن الظالمين» وضعه موضع المضمر «يآيات الله» القرآن «يجحدون» يكذبون.",
        "char_start": 0,
        "char_end": 225,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "«وما نرسل المرسلين إلا مبشِّرين» من آمن بالجنة «ومنذرين» من كفر بالنار «فمن آمن» بهم «وأصلح» عمله «فلا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 138,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "«يابني آدم إمَّا» فيه إدغام نون إن الشرطية في ما المزيدة «يأتينكم رسل منكم يقصُّون عليكم آياتي فمن اتقى» الشرك «وأصلح» عمله «فلا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 164,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_049_chunk00",
        "verse_key": "7:49",
        "text_ar": "«أهؤلاء الذين أقسمتم لا ينالهم الله برحمة» قد قيل لهم «ادخلوا الجنة لا خوف عليكم ولا أنتم تحزنون» وقرئ: أُدخِلوا بالبناء للمفعول ودخلوا فجملة النفي حال أي مقولا لهم بذلك.",
        "char_start": 0,
        "char_end": 170,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_040_chunk00",
        "verse_key": "9:40",
        "text_ar": "«إلاّ تنصروه» أي النبيَّ صلى الله عليه وسلم «فقد نصره الله إذ» حين «أخرجه الذين كفروا» من مكة أي الجؤوه إلى الخروج لما أرادوا قتله أو حبسه أو نفيه بدار الندوة «ثاني اثنين» حال أي أحد اثنين والآخر أبو بكر - المعنى نصره الله في مثل تلك الحالة فلا يخذله في غيرها - «إذ» بدل من إذ قبله «هما في الغار» نقب في جبل ثور «إذ» بدل ثان «يقول لصاحبه» أبي بكر وقد قال له لما رأى أقدام المشركين لو نظر أحدهم تحت قدميه لأبصرنا «لا تحزن إن الله معنا» بنصره «فأنزل الله سكينته» طمأنينته «عليه» قيل على النبي * وقيل عل",
        "char_start": 0,
        "char_end": 743,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_092_chunk00",
        "verse_key": "9:92",
        "text_ar": "«ولا على الذين إذا ما أتوك لتحملهم» معك إلى الغزو وهم سبعة من الأنصار وقيل بنو مقرن «قلتَ لا أجد ما أحملكم عليه» حال «تولَّوا» جواب إذا أي انصرفوا «وأعينهم تفيض» تسيل «من» للبيان «الدمع حزنا» لأجل «ألا يجدوا ما ينفقون» في الجهاد.",
        "char_start": 0,
        "char_end": 229,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_010_062_chunk00",
        "verse_key": "10:62",
        "text_ar": "«ألا إن أولياء الله لا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 58,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_010_065_chunk00",
        "verse_key": "10:65",
        "text_ar": "«ولا يحزنك قولهم» لك لست مرسلا وغيره «إن» استئناف «العزة» القوة «لله جميعا هو السميع» للقول «العليم» بالفعل فيجازيهم وينصرك.",
        "char_start": 0,
        "char_end": 124,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "قال الله لهم: اهبطوا من الجنه جميعًا، وسياتيكم انتم وذرياتكم المتعاقبه ما فيه هدايتكم الي الحق. فمن عمل بها فلا خوف عليهم فيما يستقبلونه من امر الاخره ولا هم يحزنون علي ما فاتهم من امور الدنيا.",
        "char_start": 0,
        "char_end": 193,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "إن المؤمنين من هذه الأمة، الذين صدَّقوا بالله ورسله، وعملوا بشرعه، والذين كانوا قبل بعثة محمد صلى الله عليه وسلم من الأمم السالفة من اليهود، والنصارى، والصابئين -وهم قوم باقون على فطرتهم، ولا دين مقرر لهم يتبعونه- هؤلاء جميعًا إذا صدَّقوا بالله تصديقًا صحيحًا خالصًا، وبيوم البعث والجزاء، وعملوا عملا مرضيًا عند الله، فثوابهم ثابت لهم عند ربهم، ولا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على ما فاتهم من أمور الدنيا. وأما بعد بعثة محمد صلى الله عليه وسلم خاتمًا للنبيين والمرسلين إلى ا",
        "char_start": 0,
        "char_end": 565,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "ليس الأمر كما زعموا أنَّ الجنة تختص بطائفة دون غيرها، وإنما يدخل الجنَّة مَن أخلص لله وحده لا شريك له، وهو متبع للرسول محمد صلى الله عليه وسلم في كل أقواله وأعماله. فمن فعل ذلك فله ثواب عمله عند ربه في الآخرة، وهو دخول الجنة، وهم لا يخافون فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 312,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "الذين يخرجون أموالهم في الجهاد وأنواع الخير، ثم لا يتبعون ما أنفقوا من الخيرات مَنّاً على مَن أعطَوه ولا أذى بقول أو فِعْلٍ يشعره بالتفضل عليه، لهم ثوابهم العظيم عند ربهم، ولا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على شيء فاتهم في هذه الدنيا.",
        "char_start": 0,
        "char_end": 258,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "الذين يُخْرجون أموالهم مرضاة لله ليلا ونهارًا مسرِّين ومعلنين، فلهم أجرهم عند ربهم، ولا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا. ذلك التشريع الإلهي الحكيم هو منهاج الإسلام في الإنفاق لما فيه مِن سدِّ حاجة الفقراء في كرامة وعزة، وتطهير مال الأغنياء، وتحقيق التعاون على البر والتقوى; ابتغاء وجه الله دون قهر أو إكراه.",
        "char_start": 0,
        "char_end": 357,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "إن الذين صدقوا الله ورسوله، وعملوا الأعمال الطيبة، وأدَّوا الصلاة كما أمر الله ورسوله، وأخرجوا زكاة أموالهم، لهم ثواب عظيم خاص بهم عند ربهم ورازقهم، ولا يلحقهم خوف في آخرتهم، ولا حزن على ما فاتهم من حظوظ دنياهم.",
        "char_start": 0,
        "char_end": 211,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_139_chunk00",
        "verse_key": "3:139",
        "text_ar": "ولا تضْعُفوا -ايها المومنون- عن قتال عدوكم، ولا تحزنوا لما اصابكم في «اُحد» ، وانتم الغالبون والعاقبه لكم، ان كنتم مصدقين بالله ورسوله متَّبعين شرعه.",
        "char_start": 0,
        "char_end": 149,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_153_chunk00",
        "verse_key": "3:153",
        "text_ar": "اذكروا -يا أصحاب محمد صلى الله عليه وسلم- ما كان مِن أمركم حين أخذتم تصعدون الجبل هاربين من أعدائكم، ولا تلتفتون إلى أحد لِمَا اعتراكم من الدهشة والخوف والرعب، ورسول الله صلى الله عليه وسلم ثابت في الميدان يناديكم من خلفكم قائلا إليَّ عبادَ الله، وأنتم لا تسمعون ولا تنظرون، فكان جزاؤكم أن أنزل الله بكم ألمًا وضيقًا وغمًّا; لكي لا تحزنوا على ما فاتكم من نصر وغنيمة، ولا ما حلَّ بكم من خوف وهزيمة. والله خبير بجميع أعمالكم، لا يخفى عليه منها شيء.",
        "char_start": 0,
        "char_end": 446,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "لقد عَمَّتهم السعادة حين مَنَّ الله عليهم، فأعطاهم مِن عظيم جوده وواسع كرمه من النعيم والرضا ما تَقَرُّ به أعينهم، وهم يفرحون بإخوانهم المجاهدين الذين فارقوهم وهم أحياء; ليفوزوا كما فازوا، لِعِلْمِهم أنهم سينالون من الخير الذي نالوه، إذا استشهدوا في سبيل الله مخلصين له، وأن لا خوف عليهم فيما يستقبلون من أمور الآخرة، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 360,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_176_chunk00",
        "verse_key": "3:176",
        "text_ar": "لا يُدْخِل الحزنَ إلى قلبك -أيها الرسول- هؤلاء الكفارُ بمسارعتهم في الجحود والضلال، إنهم بذلك لن يضروا الله، إنما يضرون أنفسهم بحرمانها حلاوة الإيمان وعظيم الثواب، يريد الله ألا يجعل لهم ثوابًا في الآخرة; لأنهم انصرفوا عن دعوة الحق، ولهم عذاب شديد.",
        "char_start": 0,
        "char_end": 248,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_041_chunk00",
        "verse_key": "5:41",
        "text_ar": "يا ايها الرسول لا يحزنك الذين يسارعون في جحود نبوتك من المنافقين الذين اظهروا الاسلام وقلوبهم خاليه منه، فاني ناصرك عليهم. ولا يحزنك تسرُّع اليهود الي انكار نبوتك، فانهم قوم يستمعون للكذب، ويقبلون ما يَفْتَريه احبارُهم، ويستجيبون لقوم اخرين لا يحضرون مجلسك، وهولاء الاخرون يُبَدِّلون كلام الله من بعد ما عَقَلوه، ويقولون: ان جاءكم من محمد ما يوافق الذي بدَّلناه وحرَّفناه من احكام التوراه فاعملوا به، وان جاءكم منه ما يخالفه فاحذروا قبوله، والعمل به. ومن يشا الله ضلالته فلن تستطيع -ايها الرسول- دَفْ",
        "char_start": 0,
        "char_end": 665,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "ان الذين امنوا (وهم المسلمون) واليهود، -والصابيون كذلك (وهم قوم باقون علي فطرتهم، ولا دين مقرر لهم يتبعونه) - والنصاري (وهم اتباع المسيح) من امن منهم بالله الايمان الكامل، وهو توحيد الله والتصديق بمحمد صلي الله عليه وسلم وبما جاء به، وامن باليوم الاخر، وعمل العمل الصالح، فلا خوف عليهم من اهوال يوم القيامه، ولا هم يحزنون علي ما تركوه وراءهم في الدنيا.",
        "char_start": 0,
        "char_end": 352,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_033_chunk00",
        "verse_key": "6:33",
        "text_ar": "إنا نعلم إنه ليُدْخل الحزنَ إلى قلبك تكذيبُ قومك لك في الظاهر، فاصبر واطمئن; فإنهم لا يكذبونك في قرارة أنفسهم، بل يعتقدون صدقك، ولكنهم لظلمهم وعدوانهم يجحدون البراهين الواضحة على صدقك، فيكذبونك فيما جئت به.",
        "char_start": 0,
        "char_end": 206,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "وما نرسل رسلنا إلا مبشرين أهل طاعتنا بالنعيم المقيم، ومنذرين أهل المعصية بالعذاب الأليم، فمن آمن وصدَّق الرسل وعمل صالحًا فأولئك لا يخافون عند لقاء ربهم، ولا يحزنون على شيء فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 194,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "يا بني آدم إذا جاءكم رسلي من أقوامكم، يتلون عليكم آيات كتابي، ويبينون لكم البراهين على صدق ما جاؤوكم به فأطيعوهم، فإنه من اتقى سخطي وأصلح عمله فلا خوف عليهم يوم القيامة من عقاب الله تعالى، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 231,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_049_chunk00",
        "verse_key": "7:49",
        "text_ar": "أهؤلاء الضعفاء والفقراء من أهل الجنة الذين أقسمتم في الدنيا أن الله لا يشملهم يوم القيامة برحمة، ولن يدخلهم الجنة؟ ادخلوا الجنة يا أصحاب الأعراف فقد غُفِرَ لكم، لا خوف عليكم من عذاب الله، ولا أنتم تحزنون على ما فاتكم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 232,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_040_chunk00",
        "verse_key": "9:40",
        "text_ar": "يا معشر اصحاب رسول الله صلي الله عليه وسلم ان لا تنفروا معه ايها المومنون اذا استَنْفَركم، وان لا تنصروه; فقد ايده الله ونصره يوم اخرجه الكفار من قريش من بلده (مكه) ، وهو ثاني اثنين (هو وابو بكر الصديق رضي الله عنه) والجووهما الي نقب في جبل ثور بـ «مكه» ، فمكثا فيه ثلاث ليال، اذ يقول لصاحبه (ابي بكر) لما راي منه الخوف عليه: لا تحزن ان الله معنا بنصره وتاييده، فانزل الله الطمانينه في قلب رسول الله صلي الله عليه وسلم، واعانه بجنود لم يرها احد من البشر وهم الملايكه، فانجاه الله من عدوه واذل الله اع",
        "char_start": 0,
        "char_end": 685,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_092_chunk00",
        "verse_key": "9:92",
        "text_ar": "وكذلك لا اثم علي الذين اذا ما جاووك يطلبون ان تعينهم بحملهم الي الجهاد قلت لهم: لا اجد ما احملكم عليه من الدوابِّ، فانصرفوا عنك، وقد فاضت اعينهم دَمعًا اسفًا علي ما فاتهم من شرف الجهاد وثوابه; لانهم لم يجدوا ما ينفقون، وما يحملهم لو خرجوا للجهاد في سبيل الله.",
        "char_start": 0,
        "char_end": 259,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_010_062_chunk00",
        "verse_key": "10:62",
        "text_ar": "ألا إن أولياء الله لا خوف عليهم في الآخرة من عقاب الله، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 98,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_010_065_chunk00",
        "verse_key": "10:65",
        "text_ar": "ولا يحزنك -أيها الرسول- قول المشركين في ربهم وافتراؤهم عليه وإشراكهم معه الأوثان والأصنام; فإن الله تعالى هو المتفرد بالقوة الكاملة والقدرة التامة في الدنيا والآخرة، وهو السميع لأقوالهم، العليم بنياتهم وأفعالهم.",
        "char_start": 0,
        "char_end": 211,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "قوله تعالى قلنا اهبطوا منها جميعا فإما يأتينكم مني هدى فمن تبع هداي فلا خوف عليهم ولا هم يحزنونقوله تعالى : قلنا اهبطوا كرر الأمر على جهة التغليظ وتأكيده ، كما تقول لرجل : قم قم . وقيل : كرر الأمر لما علق بكل أمر منهما حكما غير حكم الآخر فعلق بالأول العداوة وبالثاني إتيان الهدى . وقيل : الهبوط الأول من الجنة إلى السماء والثاني من السماء إلى الأرض ، وعلى هذا يكون فيه دليل على أن الجنة في السماء السابعة كما دل عليه حديث الإسراء على ما يأتي .\" جميعا \" نصب على الحال وقال وهب بن منبه : لما هبط آدم عل",
        "char_start": 0,
        "char_end": 3383,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "قوله تعالى : إن الذين آمنوا والذين هادوا والنصارى والصابئين من آمن بالله واليوم الآخر وعمل صالحا فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنونفيه ثماني مسائل : الأولى : قوله تعالى : إن الذين آمنوا أي : صدقوا بمحمد صلى الله عليه وسلم . وقال سفيان : المراد المنافقون . كأنه قال : الذين آمنوا في ظاهر أمرهم ، فلذلك قرنهم باليهود والنصارى والصابئين ، ثم بين حكم من آمن بالله واليوم الآخر من جميعهم .الثانية : قوله تعالى : والذين هادوا معناه صاروا يهودا ، نسبوا إلى يهوذا وهو أكبر ولد يعقوب عليه السلام ",
        "char_start": 0,
        "char_end": 5066,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "ثم قال تعالى : بلى ردا عليهم وتكذيبا لهم ، أي ليس كما تقولون . وقيل : إن بلى محمولة على المعنى ، كأنه قيل أما يدخل الجنة أحد ؟ فقيل : بلى من أسلم وجهه لله ومعنى أسلم استسلم وخضع . وقيل : أخلص عمله . وخص الوجه بالذكر لكونه أشرف ما يرى من الإنسان ; ولأنه موضع الحواس ، وفيه يظهر العز والذل . والعرب تخبر بالوجه عن جملة الشيء . ويصح أن يكون الوجه في هذه الآية المقصد . وهو محسن جملة في موضع الحال ، وعاد الضمير في وجهه وله على لفظ من وكذلك أجره وعاد في عليهم على المعنى ، وكذلك في يحزنون وقد تقدم .",
        "char_start": 0,
        "char_end": 495,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "قوله تعالى : الذين ينفقون أموالهم في سبيل الله ثم لا يتبعون ما أنفقوا منا ولا أذى لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنونفيه ثلاث مسائل :الأولى : قوله تعالى : الذين ينفقون أموالهم في سبيل الله قيل : إنها نزلت في عثمان بن عفان رضي الله عنه . قال عبد الرحمن بن سمرة : جاء عثمان بألف دينار في جيش العسرة فصبها في حجر رسول الله صلى الله عليه وسلم فرأيته يدخل يده فيها ويقلبها ويقول : ما ضر ابن عفان ما عمل بعد اليوم اللهم لا تنس هذا اليوم لعثمان . وقال أبو سعيد الخدري : رأيت النبي صلى الله عليه و",
        "char_start": 0,
        "char_end": 3820,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون فيه مسألة واحدة روي عن ابن عباس وأبي ذر وأبي أمامة وأبي الدرداء وعبد الله بن بشر الغافقي والأوزاعي أنها نزلت في علف الخيل المربوطة في سبيل الله . وذكر ابن سعد في الطبقات قال : أخبرت عن محمد بن شعيب بن شابور قال : أنبأنا سعيد بن سنان عن يزيد بن عبد الله بن عريب عن أبيه عن جده عريب أن رسول الله صلى الله عليه وسلم سئل عن قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم",
        "char_start": 0,
        "char_end": 1206,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "وقد تقدم القول في قوله تعالى : إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة وخص الصلاة والزكاة بالذكر وقد تضمنها عمل الصالحات تشريفا لهما وتنبيها على قدرهما إذ هما رأس الأعمال ؛ الصلاة في أعمال البدن ، والزكاة في أعمال المال .",
        "char_start": 0,
        "char_end": 240,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_139_chunk00",
        "verse_key": "3:139",
        "text_ar": "قوله تعالى : ولا تهنوا ولا تحزنوا وأنتم الأعلون إن كنتم مؤمنين[ ص: 206 ] عزاهم وسلاهم بما نالهم يوم أحد من القتل والجراح ، وحثهم على قتال عدوهم ونهاهم عن العجز والفشل فقال ولا تهنوا أي لا تضعفوا ولا تجبنوا يا أصحاب محمد عن جهاد أعدائكم لما أصابكم . ولا تحزنوا على ظهورهم ، ولا على ما أصابكم من الهزيمة والمصيبة . وأنتم الأعلون أي لكم تكون العاقبة بالنصر والظفر إن كنتم مؤمنين أي بصدق وعدي . وقيل : \" إن \" بمعنى \" إذ \" . قال ابن عباس : انهزم أصحاب رسول الله - صلى الله عليه وسلم - يوم أحد فبينا هم كذل",
        "char_start": 0,
        "char_end": 1415,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_153_chunk00",
        "verse_key": "3:153",
        "text_ar": "قوله تعالى : إذ تصعدون ولا تلوون على أحد والرسول يدعوكم في أخراكم فأثابكم غما بغم لكيلا تحزنوا على ما فاتكم ولا ما أصابكم والله خبير بما تعملون[ ص: 226 ] إذ متعلق بقوله : ولقد عفا عنكم . وقراءة العامة تصعدون بضم التاء وكسر العين . وقرأ أبو رجاء العطاردي وأبو عبد الرحمن السلمي والحسن وقتادة بفتح التاء والعين ، يعني تصعدون الجبل . وقرأ ابن محيصن وشبل \" إذ يصعدون ولا يلوون \" بالياء فيهما . وقرأ الحسن \" تلون \" بواو واحدة . وروى أبو بكر بن عياش عن عاصم \" ولا تلوون \" بضم التاء ; وهي لغة شاذة ذكرها الن",
        "char_start": 0,
        "char_end": 3874,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "و فرحين نصب في موضع الحال من [ ص: 259 ] المضمر في يرزقون . ويجوز في الكلام \" فرحون \" على النعت لأحياء . وهو من الفرح بمعنى السرور . والفضل في هذه الآية هو النعيم المذكور . وقرأ ابن السميقع \" فارحين \" بالألف وهما لغتان ، كالفره والفاره ، والحذر والحاذر ، والطمع والطامع ، والبخل والباخل . قال النحاس : ويجوز في غير القرآن رفعه ، يكون نعتا لأحياء .قوله تعالى : ويستبشرون بالذين لم يلحقوا بهم من خلفهم المعنى لم يلحقوا بهم في الفضل ، وإن كان لهم فضل . وأصله من البشرة ; لأن الإنسان إذا فرح ظهر أثر السرو",
        "char_start": 0,
        "char_end": 1129,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_176_chunk00",
        "verse_key": "3:176",
        "text_ar": "قوله تعالى : ولا يحزنك الذين يسارعون في الكفر إنهم لن يضروا الله شيئا يريد الله ألا يجعل لهم حظا في الآخرة ولهم عذاب عظيمقوله تعالى : ولا يحزنك الذين يسارعون في الكفر هؤلاء قوم أسلموا ثم ارتدوا خوفا من المشركين ; فاغتم النبي - صلى الله عليه وسلم - فأنزل الله عز وجل : ولا يحزنك الذين يسارعون في الكفر . وقال الكلبي : يعني به المنافقين ورؤساء اليهود ; كتموا صفة النبي - صلى الله عليه وسلم - في الكتاب [ ص: 267 ] فنزلت . ويقال : إن أهل الكتاب لما لم يؤمنوا شق ذلك على رسول الله - صلى الله عليه وسلم - ;",
        "char_start": 0,
        "char_end": 2920,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_041_chunk00",
        "verse_key": "5:41",
        "text_ar": "يا أيها الرسول لا يحزنك الذين يسارعون في الكفر من الذين قالوا آمنا بأفواههم ولم تؤمن قلوبهم ومن الذين هادوا سماعون للكذب سماعون لقوم آخرين لم يأتوك يحرفون الكلم من بعد مواضعه يقولون إن أوتيتم هذا فخذوه وإن لم تؤتوه فاحذروا ومن يرد الله فتنته فلن تملك له من الله شيئا أولئك الذين لم يرد الله أن يطهر قلوبهم لهم في الدنيا خزي ولهم في الآخرة عذاب عظيمفيه ثمان مسائل : الأولى : قوله تعالى : يا أيها الرسول لا يحزنك الآية في سبب نزولها ثلاثة أقوال : قيل نزلت في بني قريظة والنضير ; قتل قرظي نضيريا وكان بن",
        "char_start": 0,
        "char_end": 10598,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "قوله تعالى : إن الذين آمنوا والذين هادوا والصابئون والنصارى من آمن بالله واليوم الآخر وعمل صالحا فلا خوف عليهم ولا هم يحزنونتقدم الكلام في هذا كله فلا معنى لإعادته . والذين هادوا معطوف ، وكذا والصابئون معطوف على المضمر في هادوا في قول الكسائي والأخفش . قال النحاس : سمعت الزجاج يقول : وقد ذكر له قول الأخفش والكسائي : هذا خطأ من جهتين ; إحداهما أن المضمر المرفوع يقبح العطف عليه حتى يؤكد . والجهة الأخرى أن المعطوف [ ص: 182 ] شريك المعطوف عليه فيصير المعنى أن الصابئين قد دخلوا في اليهودية وهذا محال ",
        "char_start": 0,
        "char_end": 1393,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_033_chunk00",
        "verse_key": "6:33",
        "text_ar": "قوله تعالى : قد نعلم إنه ليحزنك الذي يقولون فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدونقوله تعالى : قد نعلم إنه ليحزنك الذي يقولون كسرت إن لدخول اللام . قال أبو ميسرة : إن رسول الله صلى الله عليه وسلم مر بأبي جهل وأصحابه فقالوا : يا محمد ، والله ما نكذبك وإنك عندنا لصادق ، ولكن نكذب ما جئت به ; فنزلت هذه الآية فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون",
        "char_start": 0,
        "char_end": 365,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "قوله تعالى : وما نرسل المرسلين إلا مبشرين ومنذرين فمن آمن وأصلح فلا خوف عليهم ولا هم يحزنون .قوله تعالى : وما نرسل المرسلين إلا مبشرين ومنذرين أي : بالترغيب والترهيب . قال الحسن : مبشرين بسعة الرزق في الدنيا والثواب في الآخرة ; يدل على ذلك قوله تعالى : ولو أن أهل القرى آمنوا واتقوا لفتحنا عليهم بركات من السماء والأرض . ومعنى منذرين مخوفين عقاب الله ; فالمعنى : إنما أرسلنا المرسلين لهذا لا لما يقترح عليهم من الآيات ، وإنما يأتون من الآيات بما تظهر معه براهينهم وصدقهم . فمن آمن وأصلح فلا خوف عليهم",
        "char_start": 0,
        "char_end": 531,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "قوله : يابني آدم إما يأتينكم رسل منكم يقصون عليكم آياتي فمن اتقى وأصلح فلا خوف عليهم ولا هم يحزنون والذين كذبوا بآياتنا واستكبروا عنها أولئك أصحاب النار هم فيها خالدونقوله تعالى يابني آدم إما يأتينكم رسل منكم شرط . ودخلت النون توكيدا لدخول ما . وقيل : \" ما \" صلة ، أي إن يأتكم . أخبر أنه يرسل إليهم الرسل منهم لتكون إجابتهم أقرب . والقصص إتباع الحديث بعضه بعضا .آياتي أي فرائضي وأحكامي .فمن اتقى وأصلح شرط وما بعده جوابه ، وهو جواب الأول . أي وأصلح منكم ما بيني وبينه .فلا خوف عليهم ولا هم يحزنون دلي",
        "char_start": 0,
        "char_end": 730,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_049_chunk00",
        "verse_key": "7:49",
        "text_ar": "أهؤلاء الذين إشارة إلى قوم من المؤمنين الفقراء ; كبلال وسلمان وخباب وغيرهم .أقسمتم في الدنيا لا ينالهم الله في الآخرة برحمة يوبخونهم بذلك .وزيدوا غما وحسرة بأن قالوا لهم ادخلوا الجنة وقرأ عكرمة ( دخلوا الجنة ) بغير ألف والدال مفتوحة . وقرأ طلحة بن مصرف ( أدخلوا الجنة ) بكسر الخاء على أنه فعل ماض . ودلت الآية على أن أصحاب الأعراف ملائكة أو أنبياء ; فإن قولهم ذلك إخبار عن الله - تعالى - ومن جعل أصحاب الأعراف المذنبين كان آخر قولهم لأصحاب النار وما كنتم تستكبرون ويكون أهؤلاء الذين إلى آخر الآية من ",
        "char_start": 0,
        "char_end": 788,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_040_chunk00",
        "verse_key": "9:40",
        "text_ar": "قوله تعالى إلا تنصروه فقد نصره الله إذ أخرجه الذين كفروا ثاني اثنين إذ هما في الغار إذ يقول لصاحبه لا تحزن إن الله معنا فأنزل الله سكينته عليه وأيده بجنود لم تروها وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا والله عزيز حكيمفيه إحدى عشرة مسألة :الأولى : قوله تعالى إلا تنصروه يقول : تعينوه بالنفر معه في غزوة تبوك . عاتبهم الله بعد انصراف نبيه عليه السلام من تبوك . قال النقاش : هذه أول آية نزلت من سورة ( براءة ) والمعنى : إن تركتم نصره فالله يتكفل به ، إذ قد نصره الله في مواطن القلة وأظهره عل",
        "char_start": 0,
        "char_end": 10369,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_092_chunk00",
        "verse_key": "9:92",
        "text_ar": "وَلَا عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَا أَجِدُ مَا أَحْمِلُكُمْ عَلَيْهِروي أن الآية نزلت في عرباض بن سارية .وقيل : نزلت في عائذ بن عمرو .وقيل : نزلت في بني مقرن - وعلى هذا جمهور المفسرين - وكانوا سبعة إخوة , كلهم صحبوا النبي صلى الله عليه وسلم , وليس في الصحابة سبعة إخوة غيرهم , وهم النعمان ومعقل وعقيل وسويد وسنان وسابع لم يسم بنو مقرن المزنيون سبعة إخوة هاجروا وصحبوا رسول الله صلى الله عليه وسلم ولم يشاركهم - فيما ذكره ابن عبد البر وجماعة - في هذه المكرمة غيرهم .وقد ",
        "char_start": 0,
        "char_end": 3376,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_010_062_chunk00",
        "verse_key": "10:62",
        "text_ar": "قوله تعالى ألا إن أولياء الله لا خوف عليهم ولا هم يحزنونقوله تعالى ألا إن أولياء الله لا خوف عليهم أي في الآخرة . ولا هم يحزنون لفقد الدنيا . وقيل : لا خوف عليهم ولا هم يحزنون أي من تولاه الله تعالى وتولى حفظه وحياطته ورضي عنه فلا يخاف يوم القيامة ولا يحزن ; قال الله تعالى : إن الذين سبقت لهم منا الحسنى أولئك عنها أي عن جهنم ( مبعدون ) إلى قوله لا يحزنهم الفزع الأكبر [ ص: 267 ] وروى سعيد بن جبير أن رسول الله صلى الله عليه وسلم سئل : من أولياء الله ؟ فقال : الذين يذكر الله برؤيتهم . وقال عمر بن ا",
        "char_start": 0,
        "char_end": 1222,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_010_065_chunk00",
        "verse_key": "10:65",
        "text_ar": "قوله تعالى ولا يحزنك قولهم إن العزة لله جميعا هو السميع العليمقوله تعالى ولا يحزنك قولهم أي لا يحزنك افتراؤهم وتكذيبهم لك ،ثم ابتدأ فقال : إن العزة لله أي القوة الكاملة والغلبة الشاملة والقدرة التامة لله وحده ; فهو ناصرك ومعينك ومانعك .( جميعا ) نصب على الحال ، ولا يعارض هذا قوله : ولله العزة ولرسوله وللمؤمنين فإن كل عزة بالله فهي كلها لله ; قال الله سبحانه : سبحان ربك رب العزة عما يصفون .هو السميع العليم السميع لأقوالهم وأصواتهم ، العليم بأعمالهم وأفعالهم وجميع حركاتهم .",
        "char_start": 0,
        "char_end": 476,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "كرر الاهباط, ليرتب عليه ما ذكر وهو قوله: { فَاِمَّا يَاْتِيَنَّكُمْ مِنِّي هُدًي } اي: ايَّ وقت وزمان جاءكم مني -يا معشر الثقلين- هدي, اي: رسول وكتاب يهديكم لما يقربكم مني, ويدنيكم مني; ويدنيكم من رضايي، { فمن تبع هداي } منكم, بان امن برسلي وكتبي, واهتدي بهم, وذلك بتصديق جميع اخبار الرسل والكتب, والامتثال للامر والاجتناب للنهي، { فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ } وفي الايه الاخري: { فَمَنِ اتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشْقَي } فرتب علي اتباع هداه اربعه اشياء: نفي الخوف وا",
        "char_start": 0,
        "char_end": 936,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "ثم قال تعالي حاكما بين الفرق الكتابيه: { اِنَّ الَّذِينَ امَنُوا وَالَّذِينَ هَادُوا وَالنَّصَارَي وَالصَّابِيِينَ مَنْ امَنَ بِاللَّهِ وَالْيَوْمِ الْاخِرِ وَعَمِلَ صَالِحًا فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ } وهذا الحكم علي اهل الكتاب خاصه, لان الصابيين, الصحيح انهم من جمله فرق النصاري، فاخبر الله ان المومنين من هذه الامه, واليهود والنصاري, والصابيين من امن بالله واليوم الاخر, وصدقوا رسلهم, فان لهم الاجر العظيم والامن, ولا خوف عليهم ولا هم يحزن",
        "char_start": 0,
        "char_end": 1256,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "واخبر ان من قدح في النسخ فقد قدح في ملكه وقدرته فقال: الم تعلم ان الله علي كل شيء قدير .",
        "char_start": 0,
        "char_end": 88,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "اي: الذين ينفقون اموالهم في طاعه الله وسبيله، ولا يتبعونها بما ينقصها ويفسدها من المن بها علي المنفق عليه بالقلب او باللسان، بان يعدد عليه احسانه ويطلب منه مقابلته، ولا اذيه له قوليه او فعليه، فهولاء لهم اجرهم اللايق بهم ولا خوف عليهم ولا هم يحزنون، فحصل لهم الخير واندفع عنهم الشر لانهم عملوا عملا خالصا لله سالما من المفسدات.",
        "char_start": 0,
        "char_end": 327,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "ثم ذكر حاله المتصدقين في جميع الاوقات علي جميع الاحوال فقال: { الذين ينفقون اموالهم في سبيل الله } اي: طاعته وطريق مرضاته، لا في المحرمات والمكروهات وشهوات انفسهم { بالليل والنهار سرا وعلانيه فلهم اجرهم عند ربهم } اي: اجر عظيم من خير عند الرب الرحيم { ولا خوف عليهم } اذا خاف المقصرون { ولا هم يحزنون } اذا حزن المفرطون، ففازوا بحصول المقصود المطلوب، ونجوا من الشرور والمرهوب،",
        "char_start": 0,
        "char_end": 376,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "لما ذكر اكله الربا وكان من المعلوم انهم لو كانوا مومنين ايمانا ينفعهم لم يصدر منهم ما صدر ذكر حاله المومنين واجرهم، وخاطبهم بالايمان، ونهاهم عن اكل الربا ان كانوا مومنين، وهولاء هم الذين يقبلون موعظه ربهم وينقادون لامره، وامرهم ان يتقوه، ومن جمله تقواه ان يذروا ما بقي من الربا اي: المعاملات الحاضره الموجوده، واما ما سلف، فمن اتعظ عفا الله عنه ما سلف، واما من لم ينزجر بموعظه الله ولم يقبل نصيحته فانه مشاق لربه محارب له، وهو عاجز ضعيف ليس له يدان في محاربه العزيز الحكيم الذي يمهل للظالم ولا يهمله ",
        "char_start": 0,
        "char_end": 681,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_139_chunk00",
        "verse_key": "3:139",
        "text_ar": "يقول تعالي مشجعا لعباده المومنين، ومقويا لعزايمهم ومنهضا لهممهم: { ولا تهنوا ولا تحزنوا } اي: ولا تهنوا وتضعفوا في ابدانكم، ولا تحزنوا في قلوبكم، عندما اصابتكم المصيبه، وابتليتم بهذه البلوي، فان الحزن في القلوب، والوهن علي الابدان، زياده مصيبه عليكم، وعون لعدوكم عليكم، بل شجعوا قلوبكم وصبروها، وادفعوا عنها الحزن وتصلبوا علي قتال عدوكم، وذكر تعالي انه لا ينبغي ولا يليق بهم الوهن والحزن، وهم الاعلون في الايمان، ورجاء نصر الله وثوابه، فالمومن المتيقن ما وعده الله من الثواب الدنيوي والاخروي لا ينبغي",
        "char_start": 0,
        "char_end": 558,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_153_chunk00",
        "verse_key": "3:153",
        "text_ar": "يذكرهم تعالي حالهم في وقت انهزامهم عن القتال، ويعاتبهم علي ذلك، فقال: { اذ تصعدون } اي: تجدون في الهرب { ولا تلوون علي احد } اي: لا يلوي احد منكم علي احد، ولا ينظر اليه، بل ليس لكم هم الا الفرار والنجاء عن القتال. والحال انه ليس عليكم خطر كبير، اذ لستم اخر الناس مما يلي الاعداء، ويباشر الهيجاء، بل { الرسول يدعوكم في اخراكم } اي: مما يلي القوم يقول: \"اليَّ عباد الله\" فلم تلتفتوا اليه، ولا عرجتم عليه، فالفرار نفسه موجب للوم، ودعوه الرسول الموجبه لتقديمه علي النفس، اعظم لوما بتخلفكم عنها، { فاثابكم",
        "char_start": 0,
        "char_end": 1107,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "{ فرحين بما اتاهم الله من فضله } اي: مغتبطين بذلك، قد قرت به عيونهم، وفرحت به نفوسهم، وذلك لحسنه وكثرته، وعظمته، وكمال اللذه في الوصول اليه، وعدم المنغص، فجمع الله لهم بين نعيم البدن بالرزق، ونعيم القلب والروح بالفرح بما اتاهم من فضله: فتم لهم النعيم والسرور، وجعلوا { يستبشرون بالذين لم يلحقوا بهم من خلفهم } اي: يبشر بعضهم بعضا، بوصول اخوانهم الذين لم يلحقوا بهم، وانهم سينالون ما نالوا، { الا خوف عليهم ولا هم يحزنون } اي: يستبشرون بزوال المحذور عنهم وعن اخوانهم المستلزم كمال السرور",
        "char_start": 0,
        "char_end": 486,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_176_chunk00",
        "verse_key": "3:176",
        "text_ar": "كان النبي صلي الله عليه وسلم حريصا علي الخلق، مجتهدا في هدايتهم، وكان يحزن اذا لم يهتدوا، قال الله تعالي: { ولا يحزنك الذين يسارعون في الكفر } من شده رغبتهم فيه، وحرصهم عليه { انهم لن يضروا الله شييا } فالله ناصر دينه، ومويد رسوله، ومنفذ امره من دونهم، فلا تبالهم ولا تحفل بهم، انما يضرون ويسعون في ضرر انفسهم، بفوات الايمان في الدنيا، وحصول العذاب الاليم في الاخري، من هوانهم علي الله وسقوطهم من عينه، وارادته ان لا يجعل لهم نصيبا في الاخره من ثوابه. خذلهم فلم يوفقهم لما وفق له اولياءه ومن اراد به ",
        "char_start": 0,
        "char_end": 599,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_041_chunk00",
        "verse_key": "5:41",
        "text_ar": "كان الرسول صلي الله عليه وسلم من شده حرصه علي الخلق يشتد حزنه لمن يظهر الايمان، ثم يرجع الي الكفر، فارشده الله تعالي، الي انه لا ياسي ولا يحزن علي امثال هولاء. فان هولاء لا في العير ولا في النفير. ان حضروا لم ينفعوا، وان غابوا لم يفقدوا، ولهذا قال مبينا للسبب الموجب لعدم الحزن عليهم - فقال: { مِنَ الَّذِينَ قَالُوا امَنَّا بِاَفْوَاهِهِمْ وَلَمْ تُوْمِن قُلُوبُهُمْ } فان الذين يوسي ويحزن عليهم، من كان معدودا من المومنين، وهم المومنون ظاهرا وباطنا, وحاشا لله ان يرجع هولاء عن دينهم ويرتدوا، فان ال",
        "char_start": 0,
        "char_end": 2088,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "يخبر تعالي عن اهل الكتب من اهل القران والتوراه والانجيل، ان سعادتهم ونجاتهم في طريق واحد، واصل واحد، وهو الايمان بالله واليوم الاخر [والعمل الصالح] فمن امن منهم بالله واليوم الاخر، فله النجاه، ولا خوف عليهم فيما يستقبلونه من الامور المخوفه، ولا هم يحزنون علي ما خلفوا منها. وهذا الحكم المذكور يشمل ساير الازمنه.",
        "char_start": 0,
        "char_end": 311,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_033_chunk00",
        "verse_key": "6:33",
        "text_ar": "اي: قد نعلم ان الذي يقول المكذبون فيك يحزنك ويسوءك، ولم نامرك بما امرناك به من الصبر الا لتحصل لك المنازل العاليه والاحوال الغاليه. فلا تظن ان قولهم صادر عن اشتباه في امرك، وشك فيك. { فَاِنَّهُمْ لَا يُكَذِّبُونَكَ } لانهم يعرفون صدقك، ومدخلك ومخرجك، وجميع احوالك، حتي انهم كانوا يسمونه -قبل البعثه- الامين. { وَلَكِنَّ الظَّالِمِينَ بِايَاتِ اللَّهِ يَجْحَدُونَ } اي: فان تكذيبهم لايات الله التي جعلها الله علي يديك .",
        "char_start": 0,
        "char_end": 418,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "يذكر تعالي، زبده ما ارسل به المرسلين؛ انه البشاره والنذاره، وذلك مستلزم لبيان المبشر والمبشر به، والاعمال التي اذا عملها العبد، حصلت له البشاره. والمنذر والمنذر به، والاعمال التي من عملها، حقت عليه النذاره. ولكن الناس انقسموا -بحسب اجابتهم لدعوتهم وعدمها - الي قسمين: { فَمَنْ امَنَ وَاَصْلَحَ } اي: امن بالله وملايكته، وكتبه، ورسله واليوم الاخر، واصلح ايمانه واعماله ونيته { فَلَا خَوْفٌ عَلَيْهِمْ } فيما يستقبل { وَلَا هُمْ يَحْزَنُونَ } علي ما مضي.",
        "char_start": 0,
        "char_end": 452,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "لما اخرج اللّه بني ادم من الجنه، ابتلاهم بارسال الرسل وانزال الكتب عليهم يقصون عليهم ايات اللّه ويبينون لهم احكامه، ثم ذكر فضل من استجاب لهم، وخسار من لم يستجب لهم فقال: { فَمَنِ اتَّقَي } ما حرم اللّه، من الشرك والكباير والصغاير، { وَاَصْلَحَ } اعماله الظاهره والباطنه { فَلَا خَوْفٌ عَلَيْهِمْ } من الشر الذي قد يخافه غيرهم { وَلَا هُمْ يَحْزَنُونَ } علي ما مضي، واذا انتفي الخوف والحزن حصل الامن التام، والسعاده، والفلاح الابدي.",
        "char_start": 0,
        "char_end": 431,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_049_chunk00",
        "verse_key": "7:49",
        "text_ar": "ثم اشاروا لهم الي اناس من اهل الجنه كانوا في الدنيا فقراء ضعفاء يستهزي بهم اهل النار، فقالوا لاهل النار: { اَهَوُلَاءِ } الذين ادخلهم اللّه الجنه { الَّذِينَ اَقْسَمْتُمْ لَا يَنَالُهُمُ اللَّهُ بِرَحْمَهٍ } احتقارا لهم وازدراء واعجابا بانفسكم، قد حنثتم في ايمانكم، وبدا لكم من اللّه ما لم يكن لكم في حساب، { ادْخُلُوا الْجَنَّهَ } بما كنتم تعملون، اي: قيل لهولاء الضعفاء اكراما واحتراما: ادخلوا الجنه باعمالكم الصالحه { لَا خَوْفٌ عَلَيْكُمْ } فيما يستقبل من المكاره { وَلَا اَنْتُمْ تَحْزَنُونَ } ع",
        "char_start": 0,
        "char_end": 1068,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_040_chunk00",
        "verse_key": "9:40",
        "text_ar": "اي‏:‏ الا تنصروا رسوله محمدًا ـ صلي الله عليه وسلم ـ فاللّه غني عنكم، لا تضرونه شييا، فقد نصره في اقل ما يكون واذله ‏{‏اِذْ اَخْرَجَهُ الَّذِينَ كَفَرُوا‏}‏ من مكه لما هموا بقتله، وسعوا في ذلك، وحرصوا اشد الحرص، فالجووه الي ان يخرج‏.‏ ‏{‏ثَانِيَ اثْنَيْنِ‏}‏ اي‏:‏ هو وابو بكر الصديق رضي اللّه عنه‏.‏ ‏{‏اِذْ هُمَا فِي الْغَارِ‏}‏ اي‏:‏ لما هربا من مكه، لجا الي غار ثور في اسفل مكه، فمكثا فيه ليبرد عنهما الطلب‏.‏ فهما في تلك الحاله الحرجه الشديده المشقه، حين انتشر الاعداء من كل جانب يطلبونهما ليقتل",
        "char_start": 0,
        "char_end": 2804,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_092_chunk00",
        "verse_key": "9:92",
        "text_ar": "‏{‏وَلَا عَلَي الَّذِينَ اِذَا مَا اَتَوْكَ لِتَحْمِلَهُمْ‏}‏ فلم يصادفوا عندك شييا ‏{‏قُلْتَ‏}‏ لهم معتذرا‏:‏ ‏{‏لَا اَجِدُ مَا اَحْمِلُكُمْ عَلَيْهِ تَوَلَّوْا وَاَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا اَلَّا يَجِدُوا مَا يُنْفِقُونَ‏}‏ فانهم عاجزون باذلون لانفسهم، وقد صدر منهم من الحزن والمشقه ما ذكره اللّه عنهم‏.‏ فهولاء لا حرج عليهم، واذا سقط الحرج عنهم، عاد الامر الي اصله، وهو ان من نوي الخير، واقترن بنيته الجازمه سَعْيٌ فيما يقدر عليه، ثم لم يقدر، فانه ينزل منزله الفاعل التام‏.‏",
        "char_start": 0,
        "char_end": 494,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_010_062_chunk00",
        "verse_key": "10:62",
        "text_ar": "يخبر تعالي عن اوليايه واحبايه، ويذكر اعمالهم واوصافهم، وثوابهم فقال‏:‏ ‏{‏اَلَا اِنَّ اَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ‏}‏ فيما يستقبلونه مما امامهم من المخاوف والاهوال‏.‏ ‏{‏وَلَا هُمْ يَحْزَنُونَ‏}‏ علي ما اسلفوا، لانهم لم يسلفوا الا صالح الاعمال، واذا كانوا لا خوف عليهم ولا هم يحزنون، ثبت لهم الامن والسعاده، والخير الكثير الذي لا يعلمه الا الله تعالي‏.‏",
        "char_start": 0,
        "char_end": 366,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_010_065_chunk00",
        "verse_key": "10:65",
        "text_ar": "اي‏:‏ ولا يحزنك قول المكذبين فيك من الاقوال التي يتوصلون بها الي القدح فيك، وفي دينك فان اقوالهم لا تعزهم، ولا تضرك شييًا‏.‏ ‏{‏اِنَّ الْعِزَّهَ لِلَّهِ جَمِيعًا‏}‏ يوتيها من يشاء، ويمنعها ممن يشاء‏.‏ قال تعالي‏:‏ ‏{‏مَنْ كَانَ يُرِيدُ الْعِزَّهَ فَلِلَّهِ الْعِزَّهُ جَمِيعًا‏}‏ اي‏:‏ فليطلبها بطاعته، بدليل قوله بعده‏:‏ ‏{‏اِلَيْهِ يَصْعَدُ الْكَلِمُ الطَّيِّبُ وَالْعَمَلُ الصَّالِحُ يَرْفَعُهُ‏}‏ ومن المعلوم، انك علي طاعه الله، وان العزه لك ولاتباعك من الله ‏{‏وَلِلَّهِ الْعِزَّهُ وَلِرَسُولِهِ",
        "char_start": 0,
        "char_end": 840,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "القول في تاويل قوله تعالي: قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًاقال ابو جعفر: وقد ذكرنا القول في تاويل قوله: \" قلنا اهبطوا منها جميعًا \" فيما مضي، (1) فلا حاجه بنا الي اعادته، اذْ كان معناه في هذا الموضع، هو معناه في ذلك الموضع.793- وقد حدثني يعقوب بن ابراهيم قال: حدثنا هشيم، قال: اخبرنا اسماعيل بن سالم، عن ابي صالح، في قوله : \" اهبطوا منها جميعًا \"، قال: ادم وحواء والحيه وابليس. (2)القول في تاويل قوله تعالي ذكره: فَاِمَّا يَاْتِيَنَّكُمْ مِنِّي هُدًيقال ابو جعفر: وتاويل قوله: \" فاما ياتينكم \"، فان",
        "char_start": 0,
        "char_end": 5554,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "القول في تاويل قوله تعالي : اِنَّ الَّذِينَ امَنُوا وَالَّذِينَ هَادُواقال ابو جعفر: اما \" الذين امنوا \"، فهم المصدقون رسول الله فيما اتاهم به من الحق من عند الله, وايمانهم بذلك، تصديقهم به - علي ما قد بيناه فيما مضي من كتابنا هذا. (1)* * *واما \" الذين هادوا \", فهم اليهود. ومعني: \" هادوا \"، تابوا. يقال منه: \" هاد القوم يهودون هودا وهاده \" . (2) وقيل: انما سميت اليهود \" يهود \"، من اجل قولهم: اِنَّا هُدْنَا اِلَيْكَ . [سوره الاعراف: 156].1094 - حدثنا القاسم قال، حدثنا الحسين قال، حدثني حجاج, عن اب",
        "char_start": 0,
        "char_end": 18756,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "بَلَي مَنْ اَسْلَمَ وَجْهَهُ لِلَّهِالْقَوْل فِي تَاْوِيل قَوْله تَعَالَي : { بَلَي مَنْ اَسْلَمَ وَجْهه لِلَّهِ } يَعْنِي بِقَوْلِهِ جَلّ ثَنَاوُهُ : { بَلَي مَنْ اَسْلَمَ } اَنَّهُ لَيْسَ كَمَا قَالَ الزَّاعِمُونَ { لَنْ يَدْخُل الْجَنَّه الَّا مَنْ كَانَ هُودًا اَوْ نَصَارَي } وَلَكِنْ مَنْ اَسْلَمَ وَجْهه لِلَّهِ وَهُوَ مُحْسِن , فَهُوَ الَّذِي يَدْخُلهَا وَيُنَعَّم فِيهَا . كَمَا : 1498 - حَدَّثَنِي مُوسَي , قَالَ : ثنا عَمْرو , قَالَ : ثنا اَسْبَاط , عَنْ السُّدِّيّ , قَالَ : اَخْبَرَهُمْ ",
        "char_start": 0,
        "char_end": 4166,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "القول في تاويل قوله : الَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ ثُمَّ لا يُتْبِعُونَ مَا اَنْفَقُوا مَنًّا وَلا اَذًي لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (262)قال ابو جعفر: يعني تعالي ذكره بذلك: المعطيَ ماله المجاهدين في سبيل الله معونهً لهم علي جهاد اعداء الله. يقول تعالي ذكره: الذين يعينون المجاهدين في سبيل الله بالانفاق عليهم وفي حَمُولاتهم, وغير ذلك من مونهم, (71) . ثم لم يتْبع نفقته التي انفقها عليهم منًّا عليهم بانفاق ذلك عليهم، ولا",
        "char_start": 0,
        "char_end": 5125,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "القول في تاويل قوله تعالي : الَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلانِيَهً فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (274)[قال ابو جعفر]:..........................................................................................................................................................* * *6232 - حدثنا يعقوب بن ابراهيم، قال: حدثنا معتمر، عن ايمن بن نابل، قال: حدثني شيخ من غافق: ان ابا الدرداء كان ينظر الي الخيل مربوطه",
        "char_start": 0,
        "char_end": 3085,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "القول في تاويل قوله تعالي : اِنَّ الَّذِينَ امَنُوا وَعَمِلُوا الصَّالِحَاتِ وَاَقَامُوا الصَّلاهَ وَاتَوُا الزَّكَاهَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (277)قال ابو جعفر: وهذا خبر من الله عز وجل بان الذين امنوا = يعني الذين صدقوا بالله وبرسوله، وبما جاء به من عند ربهم، من تحريم الربا واكله، وغير ذلك من ساير شرايع دينه =\" وعملوا الصالحات \" التي امرهم الله عز وجل بها، والتي نَدَبهم اليها =\" واقاموا الصلاه \" المفروضه بحدودها، وادّوها بسُنَنها =\" واتوا ",
        "char_start": 0,
        "char_end": 1165,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_139_chunk00",
        "verse_key": "3:139",
        "text_ar": "القول في تاويل قوله : وَلا تَهِنُوا وَلا تَحْزَنُوا وَاَنْتُمُ الاَعْلَوْنَ اِنْ كُنْتُمْ مُوْمِنِينَ (139)قال ابو جعفر: وهذا من الله تعالي ذكره تعزيهٌ لاصحاب رسول الله صلي الله عليه وسلم علي ما اصابهم من الجراح والقتل باحد.قال: \" ولا تهنوا ولا تحزنوا \"، يا اصحاب محمد، يعني: ولا تضعفوا بالذي نالكم من عدوكم باحد، من القتل والقروح - عن جهاد عدوكم وحربهم.* * *=من قول القايل: \" وهنَ فلان في هذا الامر فهو يهنُ وَهْنًا \".* * *=\" ولا تحزنوا \"، ولا تاسوْا فتجزعوا علي ما اصابكم من المصيبه يوميذ، فانكم \" ",
        "char_start": 0,
        "char_end": 3373,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_153_chunk00",
        "verse_key": "3:153",
        "text_ar": "القول في تاويل قوله : اِذْ تُصْعِدُونَ وَلا تَلْوُونَ عَلَي اَحَدٍ وَالرَّسُولُ يَدْعُوكُمْ فِي اُخْرَاكُمْقال ابو جعفر: يعني بذلك جل ثناوه: ولقد عفا عنكم، ايها المومنون، اذ لم يستاصلكم، اهلاكًا منه جمعكم بذنوبكم وهربكم =\" اذ تصعدون ولا تلوون علي احد \".* * *واختلفت القراه في قراءه ذلك.فقراه عامه قراه الحجاز والعراق والشام سوي الحسن البصري: ( اِذْ تُصْعِدُونَ ) بضم \" التاء \" وكسر \" العين \". وبه القراءه عندنا، لاجماع الحجه من القراه علي القراءه به، واستنكارهم ما خالفه.* * *وروي عن الحسن البصري انه",
        "char_start": 0,
        "char_end": 24189,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "القول في تاويل قوله تعالي : وَيَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِمْ مِنْ خَلْفِهِمْ اَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (170)قال ابو جعفر: يعني بذلك تعالي ذكره: ويفرحون بمن لم يلحق بهم من اخوانهم الذين فارقوهم وهم احياء في الدنيا علي مناهجهم من جهاد اعداء الله مع رسوله، لعلمهم بانهم ان استشهدوا فلحقوا بهم صاروا من كرامه الله الي مثل الذي صاروا هم اليه، فهم لذلك مستبشرون بهم، فرحون انهم اذا صاروا كذلك &; 7-396 &; =\" لا خوف عليهم ولا هم يحزنون \"، يعني بذلك: (43) لا خوف عليهم،",
        "char_start": 0,
        "char_end": 3298,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_176_chunk00",
        "verse_key": "3:176",
        "text_ar": "القول في تاويل قوله : وَلا يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ اِنَّهُمْ لَنْ يَضُرُّوا اللَّهَ شَيْيًاقال ابو جعفر: يقول جل ثناوه: ولا يحزنك، يا محمد كفر الذين يسارعون في الكفر مرتدِّين علي اعقابهم من اهل النفاق، (16) فانهم لن يضروا الله بمسارعتهم في الكفر شييًا، وكما انّ مسارعتهم لو سارعوا الي الايمان لم تكن بنافعته، (17) كذلك مسارعتهم الي الكفر غير ضارَّته. كما:-8262 - حدثني محمد بن عمرو قال، حدثنا ابو عاصم، عن عيسي، عن ابن ابي نجيح، عن مجاهد، في قوله: \" ولا يحزنك الذين يسارعون في",
        "char_start": 0,
        "char_end": 1507,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_041_chunk00",
        "verse_key": "5:41",
        "text_ar": "القول في تاويل قوله عز ذكره : يَا اَيُّهَا الرَّسُولُ لا يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ مِنَ الَّذِينَ قَالُوا امَنَّا بِاَفْوَاهِهِمْ وَلَمْ تُوْمِنْ قُلُوبُهُمْقال ابو جعفر: اختلف اهل التاويل فيمن عني بهذه الايه.فقال بعضهم: نـزلت في ابي لُبابه بن عبد المنذر، بقوله لبني قريظه حين حاصرهم النبيّ صلي الله عليه وسلم: \" انما هو الذَّبح، فلا تنـزلوا علي حكم سعد \".ذكر من قال ذلك:11918 - حدثني محمد بن الحسين قال، حدثنا احمد بن مفضل قال، حدثنا اسباط، عن السدي: \" لا يحزنك الذين يسارعون ف",
        "char_start": 0,
        "char_end": 25455,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "القول في تاويل قوله : اِنَّ الَّذِينَ امَنُوا وَالَّذِينَ هَادُوا وَالصَّابِيُونَ وَالنَّصَارَي مَنْ امَنَ بِاللَّهِ وَالْيَوْمِ الاخِرِ وَعَمِلَ صَالِحًا فَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (69)قال ابو جعفر: يقول تعالي ذكره: ان الذين صدّقوا الله ورسوله، وهم اهل الاسلام=\" والذين هادوا \"، وهم اليهود (42) = \" والصابيون \"، وقد بينا امرهم (43) =\" والنصاري من امن منهم بالله واليوم الاخر \"، فصدّق بالبعث بعد الممات=\" وعمل \"، من العمل=\" صالحًا \" لمعاده \" فلا خوف عليهم \"، فيما قَدِموا عليه من اه",
        "char_start": 0,
        "char_end": 1198,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_033_chunk00",
        "verse_key": "6:33",
        "text_ar": "القول في تاويل قوله : قَدْ نَعْلَمُ اِنَّهُ لَيَحْزُنُكَ الَّذِي يَقُولُونَ فَاِنَّهُمْ لا يُكَذِّبُونَكَ وَلَكِنَّ الظَّالِمِينَ بِايَاتِ اللَّهِ يَجْحَدُونَ (33)قال ابو جعفر: يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم: \" قد نعلم \"، يا محمد، انه ليحزنك الذي يقول المشركون, وذلك قولهم له: انه كذّاب =\" فانهم لا يكذبونك \" .* * *واختلفت القراه في قراءه ذلك[فقراته جماعه من اهل الكوفه: (فَانَّهُمْ لا يُكْذِبونَكَ) بالتخفيف]، (21) بمعني: انهم لا يُكْذِبونك فيما اتيتهم به من وحي الله, ولا يدفعون ان ي",
        "char_start": 0,
        "char_end": 6190,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "القول في تاويل قوله : وَمَا نُرْسِلُ الْمُرْسَلِينَ اِلا مُبَشِّرِينَ وَمُنْذِرِينَ فَمَنْ امَنَ وَاَصْلَحَ فَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (48)قال ابو جعفر: يقول تعالي ذكره: وما نرسل رسلنا الا ببشاره اهل الطاعه لنا بالجنه والفوز المبين يوم القيامه, جزاءً منَّا لهم علي طاعتنا (14) = وبانذار من عصَانا وخالف امرنا, عقوبتنا اياه علي معصيتنا يوم القيامه, جزاءً منا علي معصيتنا, لنعذر اليه فيهلك ان هلك عن بينه (15) =\" فمن امن واصلح \"، يقول: فمن صدَّق من ارسلنا اليه من رسلنا انذارهم اياه, ",
        "char_start": 0,
        "char_end": 937,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "القول في تاويل قوله : يَا بَنِي ادَمَ اِمَّا يَاْتِيَنَّكُمْ رُسُلٌ مِنْكُمْ يَقُصُّونَ عَلَيْكُمْ ايَاتِي فَمَنِ اتَّقَي وَاَصْلَحَ فَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (35)قال ابو جعفر: يقول تعالي ذكره معرِّفًا خلقه ما اعدَّ لحزبه واهل طاعته والايمان به وبرسوله, وما اعدّ لحزب الشيطان واوليايه والكافرين به وبرسله: (يا بني ادم اما ياتينكم رسل منكم)، يقول: ان يجيكم رسلي الذين ارسلهم اليكم بدعايكم الي طاعتي، والانتهاء الي امري ونهيي =\" منكم \", يعني: من انفسكم, ومن عشايركم وقبايلكم =(يقصون ",
        "char_start": 0,
        "char_end": 2626,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_049_chunk00",
        "verse_key": "7:49",
        "text_ar": "القول في تاويل قوله : اَهَوُلاءِ الَّذِينَ اَقْسَمْتُمْ لا يَنَالُهُمُ اللَّهُ بِرَحْمَهٍ ادْخُلُوا الْجَنَّهَ لا خَوْفٌ عَلَيْكُمْ وَلا اَنْتُمْ تَحْزَنُونَ (49)قال ابو جعفر: اختلف اهل التاويل في المعنيِّين بهذا الكلام.فقال بعضهم: هذا قِيل الله لاهل النار، توبيخًا علي ما كان من قِيلهم في الدنيا، لاهل الاعراف، عند ادخاله اصحابَ الاعراف الجنه.* ذكر من قال ذلك:14743 - حدثني المثني قال، حدثنا عبد الله بن صالح قال، حدثني معاويه، عن علي، عن ابن عباس قال: \" اصحاب الاعراف \" ، رجال كانت لهم ذنوب عظام، و",
        "char_start": 0,
        "char_end": 5728,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_040_chunk00",
        "verse_key": "9:40",
        "text_ar": "القول في تاويل قوله : اِلا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ اِذْ اَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ اِذْ هُمَا فِي الْغَارِ اِذْ يَقُولُ لِصَاحِبِهِ لا تَحْزَنْ اِنَّ اللَّهَ مَعَنَاقال ابو جعفر: وهذا اعلامٌ من الله اصحابَ رسوله صلي الله عليه وسلم انّه المتوكّل بنصر رسوله علي اعداء دينه واظهاره عليهم دونهم, اعانوه او لم يعينوه, = وتذكيرٌ منه لهم فعلَ ذلك به, وهو من العدد في قله، والعدوُّ في كثره, فكيف به وهو من العدد في كثره، والعدو في قله؟يقول لهم جل ثناوه: الا تنفروا، ايها المو",
        "char_start": 0,
        "char_end": 6918,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_092_chunk00",
        "verse_key": "9:92",
        "text_ar": "القول في تاويل قوله : وَلا عَلَي الَّذِينَ اِذَا مَا اَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لا اَجِدُ مَا اَحْمِلُكُمْ عَلَيْهِ تَوَلَّوْا وَاَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا اَلا يَجِدُوا مَا يُنْفِقُونَ (92)قال ابو جعفر: يقول تعالي ذكره: ولا سبيل ايضًا علي النفر الذين اذا ما جاءوك، لتحملهم، يسالونك الحُمْلان، ليبلغوا الي مغزاهم لجهاد اعداءِ الله معك، يا محمد, قلت لهم: لا اجد حَمُولهً احملكم عليها =(تولوا)، يقول: ادبروا عنك, (25) =(واعينهم تفيض من الدمع حزنًا)، وهم يبكون من حزن علي انهم لا يج",
        "char_start": 0,
        "char_end": 3527,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_010_062_chunk00",
        "verse_key": "10:62",
        "text_ar": "القول في تاويل قوله تعالي : اَلا اِنَّ اَوْلِيَاءَ اللَّهِ لا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (62)قال ابو جعفر: يقول تعالي ذكره: الا ان انصار الله لا خوف عليهم في الاخره من عقاب الله، لان الله رضي عنهم فامنهم من عقابه ، ولا هم يحزنون علي ما فاتهم من الدنيا.* * *و \" الاولياء \" جمع \" ولي\"، وهو النصير، وقد بينا ذلك بشواهده. (1)* * *واختلف اهل التاويل فيمن يستحق هذا الاسم.فقال بعضهم: هم قومٌ يُذْكَرُ الله لرويتهم ، لما عليهم من سيما الخير والاخبات.*ذكر من قال ذلك:17703- حدثنا ابو كريب وابن و",
        "char_start": 0,
        "char_end": 7707,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_010_065_chunk00",
        "verse_key": "10:65",
        "text_ar": "القول في تاويل قوله تعالي : وَلا يَحْزُنْكَ قَوْلُهُمْ اِنَّ الْعِزَّهَ لِلَّهِ جَمِيعًا هُوَ السَّمِيعُ الْعَلِيمُ (65)قال ابو جعفر: يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم: لا يحزنكَ ، يا محمد ، قول هولاء المشركين في ربهم ما يقولون، واشراكهم معه الاوثان والاصنام (50) ، فانّ العزه لله جميعًا، يقول تعالي ذكره: فان الله هو المنفرد بعزه الدنيا والاخره ، لا شريك له فيها، وهو المنتقم من هولاء المشركين القايلين فيه من القول الباطل ما يقولون، فلا ينصرهم عند انتقامه منهم احدٌ، لانه لا يُعَازُّه ش",
        "char_start": 0,
        "char_end": 1242,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "28:8",
          "source": "saadi",
          "chunk_id": "saadi_028_008_chunk00",
          "char_start": 79,
          "char_end": 243,
          "relevance": "direct"
        },
        {
          "verse_key": "28:8",
          "source": "saadi",
          "chunk_id": "saadi_028_008_chunk00",
          "char_start": 80,
          "char_end": 243,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 24,
      "evidence_refs": [
        {
          "verse_key": "2:62",
          "source": "tabari",
          "chunk_id": "tabari_002_062_chunk09",
          "char_start": 261,
          "char_end": 423,
          "relevance": "direct"
        },
        {
          "verse_key": "2:262",
          "source": "tabari",
          "chunk_id": "tabari_002_262_chunk00",
          "char_start": 101,
          "char_end": 263,
          "relevance": "direct"
        },
        {
          "verse_key": "3:54",
          "source": "baghawi",
          "chunk_id": "baghawi_003_054_chunk02",
          "char_start": 592,
          "char_end": 754,
          "relevance": "direct"
        },
        {
          "verse_key": "5:26",
          "source": "saadi",
          "chunk_id": "saadi_005_026_chunk00",
          "char_start": 792,
          "char_end": 954,
          "relevance": "direct"
        },
        {
          "verse_key": "5:41",
          "source": "qurtubi",
          "chunk_id": "qurtubi_005_041_chunk10",
          "char_start": 0,
          "char_end": 159,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_ANGEL",
      "target_label_ar": "ملك",
      "target_label_en": "Angel",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 7,
      "evidence_refs": [
        {
          "verse_key": "3:128",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_128_chunk01",
          "char_start": 17,
          "char_end": 179,
          "relevance": "direct"
        },
        {
          "verse_key": "10:26",
          "source": "tabari",
          "chunk_id": "tabari_010_026_chunk11",
          "char_start": 342,
          "char_end": 504,
          "relevance": "direct"
        },
        {
          "verse_key": "12:89",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_012_089_chunk00",
          "char_start": 77,
          "char_end": 239,
          "relevance": "direct"
        },
        {
          "verse_key": "12:96",
          "source": "baghawi",
          "chunk_id": "baghawi_012_096_chunk00",
          "char_start": 581,
          "char_end": 743,
          "relevance": "direct"
        },
        {
          "verse_key": "19:24",
          "source": "tabari",
          "chunk_id": "tabari_019_024_chunk01",
          "char_start": 552,
          "char_end": 714,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_ARROGANCE",
      "target_label_ar": "الكبر",
      "target_label_en": "Arrogance",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "74:18",
          "source": "baghawi",
          "chunk_id": "baghawi_074_018_chunk00",
          "char_start": 745,
          "char_end": 907,
          "relevance": "direct"
        },
        {
          "verse_key": "74:18",
          "source": "qurtubi",
          "chunk_id": "qurtubi_074_018_chunk00",
          "char_start": 563,
          "char_end": 725,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 5,
      "evidence_refs": [
        {
          "verse_key": "18:24",
          "source": "tabari",
          "chunk_id": "tabari_018_024_chunk00",
          "char_start": 490,
          "char_end": 653,
          "relevance": "direct"
        },
        {
          "verse_key": "29:33",
          "source": "jalalayn",
          "chunk_id": "jalalayn_029_033_chunk00",
          "char_start": 0,
          "char_end": 122,
          "relevance": "direct"
        },
        {
          "verse_key": "29:33",
          "source": "jalalayn",
          "chunk_id": "jalalayn_029_033_chunk00",
          "char_start": 0,
          "char_end": 122,
          "relevance": "direct"
        },
        {
          "verse_key": "29:33",
          "source": "muyassar",
          "chunk_id": "muyassar_029_033_chunk00",
          "char_start": 0,
          "char_end": 149,
          "relevance": "direct"
        },
        {
          "verse_key": "29:33",
          "source": "muyassar",
          "chunk_id": "muyassar_029_033_chunk00",
          "char_start": 0,
          "char_end": 149,
          "relevance": "direct"
        }
      ],
      "confidence": 0.94
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 8,
      "evidence_refs": [
        {
          "verse_key": "5:41",
          "source": "tabari",
          "chunk_id": "tabari_005_041_chunk09",
          "char_start": 314,
          "char_end": 476,
          "relevance": "direct"
        },
        {
          "verse_key": "9:40",
          "source": "tabari",
          "chunk_id": "tabari_009_040_chunk01",
          "char_start": 602,
          "char_end": 764,
          "relevance": "direct"
        },
        {
          "verse_key": "12:86",
          "source": "qurtubi",
          "chunk_id": "qurtubi_012_086_chunk00",
          "char_start": 290,
          "char_end": 452,
          "relevance": "direct"
        },
        {
          "verse_key": "16:128",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_016_128_chunk00",
          "char_start": 245,
          "char_end": 407,
          "relevance": "direct"
        },
        {
          "verse_key": "16:128",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_016_128_chunk00",
          "char_start": 275,
          "char_end": 437,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_UNDERSTANDING",
      "target_label_ar": "الفقه",
      "target_label_en": "Understanding",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "12:89",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_012_089_chunk00",
          "char_start": 77,
          "char_end": 239,
          "relevance": "direct"
        },
        {
          "verse_key": "74:18",
          "source": "baghawi",
          "chunk_id": "baghawi_074_018_chunk00",
          "char_start": 745,
          "char_end": 907,
          "relevance": "direct"
        },
        {
          "verse_key": "74:18",
          "source": "qurtubi",
          "chunk_id": "qurtubi_074_018_chunk00",
          "char_start": 563,
          "char_end": 725,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_CONTENTMENT",
      "target_label_ar": "الرضا",
      "target_label_en": "Contentment",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "12:84",
          "source": "qurtubi",
          "chunk_id": "qurtubi_012_084_chunk01",
          "char_start": 6,
          "char_end": 168,
          "relevance": "direct"
        },
        {
          "verse_key": "25:74",
          "source": "baghawi",
          "chunk_id": "baghawi_025_074_chunk00",
          "char_start": 439,
          "char_end": 601,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_DISBELIEF",
      "target_label_ar": "الكفر",
      "target_label_en": "Disbelief",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 5,
      "evidence_refs": [
        {
          "verse_key": "5:41",
          "source": "qurtubi",
          "chunk_id": "qurtubi_005_041_chunk10",
          "char_start": 7,
          "char_end": 169,
          "relevance": "direct"
        },
        {
          "verse_key": "5:41",
          "source": "tabari",
          "chunk_id": "tabari_005_041_chunk09",
          "char_start": 125,
          "char_end": 287,
          "relevance": "direct"
        },
        {
          "verse_key": "6:35",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_035_chunk00",
          "char_start": 761,
          "char_end": 923,
          "relevance": "direct"
        },
        {
          "verse_key": "9:47",
          "source": "tabari",
          "chunk_id": "tabari_009_047_chunk03",
          "char_start": 0,
          "char_end": 146,
          "relevance": "direct"
        },
        {
          "verse_key": "35:8",
          "source": "baghawi",
          "chunk_id": "baghawi_035_008_chunk00",
          "char_start": 768,
          "char_end": 930,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_FAITH",
      "target_label_ar": "الإيمان",
      "target_label_en": "Faith",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "7:35",
          "source": "tabari",
          "chunk_id": "tabari_007_035_chunk00",
          "char_start": 69,
          "char_end": 231,
          "relevance": "direct"
        },
        {
          "verse_key": "25:27",
          "source": "saadi",
          "chunk_id": "saadi_025_027_chunk00",
          "char_start": 27,
          "char_end": 162,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_HAJJ",
      "target_label_ar": "الحج",
      "target_label_en": "Pilgrimage",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "94:5",
          "source": "qurtubi",
          "chunk_id": "qurtubi_094_005_chunk01",
          "char_start": 653,
          "char_end": 815,
          "relevance": "direct"
        },
        {
          "verse_key": "94:6",
          "source": "qurtubi",
          "chunk_id": "qurtubi_094_006_chunk01",
          "char_start": 653,
          "char_end": 815,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "16:59",
          "source": "qurtubi",
          "chunk_id": "qurtubi_016_059_chunk00",
          "char_start": 133,
          "char_end": 297,
          "relevance": "direct"
        },
        {
          "verse_key": "16:59",
          "source": "qurtubi",
          "chunk_id": "qurtubi_016_059_chunk00",
          "char_start": 134,
          "char_end": 297,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 9,
      "evidence_refs": [
        {
          "verse_key": "2:62",
          "source": "tabari",
          "chunk_id": "tabari_002_062_chunk09",
          "char_start": 261,
          "char_end": 423,
          "relevance": "direct"
        },
        {
          "verse_key": "5:41",
          "source": "tabari",
          "chunk_id": "tabari_005_041_chunk20",
          "char_start": 55,
          "char_end": 217,
          "relevance": "direct"
        },
        {
          "verse_key": "7:164",
          "source": "tabari",
          "chunk_id": "tabari_007_164_chunk27",
          "char_start": 21,
          "char_end": 183,
          "relevance": "direct"
        },
        {
          "verse_key": "10:63",
          "source": "tabari",
          "chunk_id": "tabari_010_063_chunk00",
          "char_start": 263,
          "char_end": 425,
          "relevance": "direct"
        },
        {
          "verse_key": "10:65",
          "source": "tabari",
          "chunk_id": "tabari_010_065_chunk00",
          "char_start": 133,
          "char_end": 295,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "CSQ_ADHAB",
      "target_label_ar": "العذاب",
      "target_label_en": "Punishment",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:9",
          "source": "saadi",
          "chunk_id": "saadi_002_009_chunk00",
          "char_start": 534,
          "char_end": 698,
          "relevance": "direct"
        },
        {
          "verse_key": "2:9",
          "source": "saadi",
          "chunk_id": "saadi_002_009_chunk00",
          "char_start": 535,
          "char_end": 698,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "CSQ_JANNAH",
      "target_label_ar": "الجنة",
      "target_label_en": "Paradise",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "3:169",
          "source": "tabari",
          "chunk_id": "tabari_003_169_chunk08",
          "char_start": 142,
          "char_end": 304,
          "relevance": "direct"
        },
        {
          "verse_key": "46:9",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_046_009_chunk03",
          "char_start": 75,
          "char_end": 237,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "ORG_CHEST",
      "target_label_ar": "صدر",
      "target_label_en": "Chest",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "29:33",
          "source": "jalalayn",
          "chunk_id": "jalalayn_029_033_chunk00",
          "char_start": 0,
          "char_end": 122,
          "relevance": "direct"
        },
        {
          "verse_key": "29:33",
          "source": "jalalayn",
          "chunk_id": "jalalayn_029_033_chunk00",
          "char_start": 0,
          "char_end": 122,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "ORG_EYE",
      "target_label_ar": "عين",
      "target_label_en": "Eye",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 13,
      "evidence_refs": [
        {
          "verse_key": "3:19",
          "source": "tabari",
          "chunk_id": "tabari_003_019_chunk00",
          "char_start": 66,
          "char_end": 228,
          "relevance": "direct"
        },
        {
          "verse_key": "3:128",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_128_chunk01",
          "char_start": 17,
          "char_end": 179,
          "relevance": "direct"
        },
        {
          "verse_key": "12:93",
          "source": "tabari",
          "chunk_id": "tabari_012_093_chunk00",
          "char_start": 409,
          "char_end": 571,
          "relevance": "direct"
        },
        {
          "verse_key": "19:26",
          "source": "qurtubi",
          "chunk_id": "qurtubi_019_026_chunk00",
          "char_start": 284,
          "char_end": 446,
          "relevance": "direct"
        },
        {
          "verse_key": "19:26",
          "source": "qurtubi",
          "chunk_id": "qurtubi_019_026_chunk00",
          "char_start": 298,
          "char_end": 460,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_FACE",
      "target_label_ar": "وجه",
      "target_label_en": "Face",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 5,
      "evidence_refs": [
        {
          "verse_key": "2:31",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_031_chunk04",
          "char_start": 449,
          "char_end": 611,
          "relevance": "direct"
        },
        {
          "verse_key": "3:19",
          "source": "tabari",
          "chunk_id": "tabari_003_019_chunk00",
          "char_start": 66,
          "char_end": 228,
          "relevance": "direct"
        },
        {
          "verse_key": "5:69",
          "source": "tabari",
          "chunk_id": "tabari_005_069_chunk00",
          "char_start": 422,
          "char_end": 584,
          "relevance": "direct"
        },
        {
          "verse_key": "9:114",
          "source": "tabari",
          "chunk_id": "tabari_009_114_chunk30",
          "char_start": 240,
          "char_end": 402,
          "relevance": "direct"
        },
        {
          "verse_key": "18:1",
          "source": "qurtubi",
          "chunk_id": "qurtubi_018_001_chunk05",
          "char_start": 404,
          "char_end": 566,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_FOOT",
      "target_label_ar": "رجل",
      "target_label_en": "Foot",
      "edge_type": "OPPOSITE_OF",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:38",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_038_chunk02",
          "char_start": 669,
          "char_end": 831,
          "relevance": "direct"
        },
        {
          "verse_key": "5:41",
          "source": "qurtubi",
          "chunk_id": "qurtubi_005_041_chunk09",
          "char_start": 613,
          "char_end": 777,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "ORG_HEART",
      "target_label_ar": "قلب",
      "target_label_en": "Heart",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "9:40",
          "source": "muyassar",
          "chunk_id": "muyassar_009_040_chunk00",
          "char_start": 258,
          "char_end": 420,
          "relevance": "direct"
        },
        {
          "verse_key": "9:40",
          "source": "saadi",
          "chunk_id": "saadi_009_040_chunk03",
          "char_start": 136,
          "char_end": 298,
          "relevance": "direct"
        },
        {
          "verse_key": "25:74",
          "source": "baghawi",
          "chunk_id": "baghawi_025_074_chunk00",
          "char_start": 439,
          "char_end": 601,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_SOUL",
      "target_label_ar": "نفس",
      "target_label_en": "Soul",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "9:118",
          "source": "muyassar",
          "chunk_id": "muyassar_009_118_chunk00",
          "char_start": 120,
          "char_end": 284,
          "relevance": "direct"
        },
        {
          "verse_key": "9:118",
          "source": "muyassar",
          "chunk_id": "muyassar_009_118_chunk00",
          "char_start": 121,
          "char_end": 284,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "ORG_SOUL",
      "target_label_ar": "نفس",
      "target_label_en": "Soul",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "20:40",
          "source": "qurtubi",
          "chunk_id": "qurtubi_020_040_chunk01",
          "char_start": 87,
          "char_end": 249,
          "relevance": "direct"
        },
        {
          "verse_key": "20:40",
          "source": "qurtubi",
          "chunk_id": "qurtubi_020_040_chunk01",
          "char_start": 113,
          "char_end": 275,
          "relevance": "direct"
        },
        {
          "verse_key": "25:7",
          "source": "qurtubi",
          "chunk_id": "qurtubi_025_007_chunk01",
          "char_start": 236,
          "char_end": 398,
          "relevance": "direct"
        },
        {
          "verse_key": "28:7",
          "source": "tabari",
          "chunk_id": "tabari_028_007_chunk00",
          "char_start": 460,
          "char_end": 622,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    }
  ],
  "incoming_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 36,
      "evidence_refs": [
        {
          "verse_key": "2:284",
          "source": "tabari",
          "chunk_id": "tabari_002_284_chunk20",
          "char_start": 55,
          "char_end": 217,
          "relevance": "direct"
        },
        {
          "verse_key": "3:14",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_014_chunk04",
          "char_start": 4,
          "char_end": 166,
          "relevance": "direct"
        },
        {
          "verse_key": "3:19",
          "source": "tabari",
          "chunk_id": "tabari_003_019_chunk00",
          "char_start": 0,
          "char_end": 144,
          "relevance": "direct"
        },
        {
          "verse_key": "3:134",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_003_134_chunk05",
          "char_start": 598,
          "char_end": 760,
          "relevance": "direct"
        },
        {
          "verse_key": "3:153",
          "source": "muyassar",
          "chunk_id": "muyassar_003_153_chunk00",
          "char_start": 172,
          "char_end": 334,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "OPPOSITE_OF",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "2:62",
          "source": "saadi",
          "chunk_id": "saadi_002_062_chunk00",
          "char_start": 386,
          "char_end": 548,
          "relevance": "direct"
        },
        {
          "verse_key": "9:81",
          "source": "saadi",
          "chunk_id": "saadi_009_081_chunk00",
          "char_start": 221,
          "char_end": 385,
          "relevance": "direct"
        },
        {
          "verse_key": "9:82",
          "source": "qurtubi",
          "chunk_id": "qurtubi_009_082_chunk00",
          "char_start": 528,
          "char_end": 690,
          "relevance": "direct"
        }
      ],
      "confidence": 0.76
    },
    {
      "target_id": "AGT_ANGEL",
      "target_label_ar": "ملك",
      "target_label_en": "Angel",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 11,
      "evidence_refs": [
        {
          "verse_key": "3:52",
          "source": "tabari",
          "chunk_id": "tabari_003_052_chunk02",
          "char_start": 450,
          "char_end": 612,
          "relevance": "direct"
        },
        {
          "verse_key": "9:92",
          "source": "baghawi",
          "chunk_id": "baghawi_009_092_chunk00",
          "char_start": 564,
          "char_end": 673,
          "relevance": "direct"
        },
        {
          "verse_key": "9:92",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_009_092_chunk01",
          "char_start": 97,
          "char_end": 259,
          "relevance": "direct"
        },
        {
          "verse_key": "9:92",
          "source": "jalalayn",
          "chunk_id": "jalalayn_009_092_chunk00",
          "char_start": 100,
          "char_end": 226,
          "relevance": "direct"
        },
        {
          "verse_key": "9:92",
          "source": "saadi",
          "chunk_id": "saadi_009_092_chunk00",
          "char_start": 56,
          "char_end": 218,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_RIGHTEOUS",
      "target_label_ar": "صالح",
      "target_label_en": "Righteous",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 6,
      "evidence_refs": [
        {
          "verse_key": "2:62",
          "source": "tabari",
          "chunk_id": "tabari_002_062_chunk09",
          "char_start": 62,
          "char_end": 224,
          "relevance": "direct"
        },
        {
          "verse_key": "2:62",
          "source": "tabari",
          "chunk_id": "tabari_002_062_chunk09",
          "char_start": 77,
          "char_end": 239,
          "relevance": "direct"
        },
        {
          "verse_key": "2:62",
          "source": "tabari",
          "chunk_id": "tabari_002_062_chunk09",
          "char_start": 83,
          "char_end": 245,
          "relevance": "direct"
        },
        {
          "verse_key": "5:69",
          "source": "tabari",
          "chunk_id": "tabari_005_069_chunk00",
          "char_start": 303,
          "char_end": 465,
          "relevance": "direct"
        },
        {
          "verse_key": "7:93",
          "source": "tabari",
          "chunk_id": "tabari_007_093_chunk00",
          "char_start": 586,
          "char_end": 748,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_DOUBT",
      "target_label_ar": "الشك",
      "target_label_en": "Doubt",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "12:111",
          "source": "saadi",
          "chunk_id": "saadi_012_111_chunk19",
          "char_start": 469,
          "char_end": 631,
          "relevance": "direct"
        },
        {
          "verse_key": "12:111",
          "source": "saadi",
          "chunk_id": "saadi_012_111_chunk19",
          "char_start": 483,
          "char_end": 645,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "6:35",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_035_chunk00",
          "char_start": 640,
          "char_end": 802,
          "relevance": "direct"
        },
        {
          "verse_key": "21:83",
          "source": "baghawi",
          "chunk_id": "baghawi_021_083_chunk07",
          "char_start": 607,
          "char_end": 769,
          "relevance": "direct"
        },
        {
          "verse_key": "21:83",
          "source": "tabari",
          "chunk_id": "tabari_021_083_chunk30",
          "char_start": 716,
          "char_end": 878,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_EMO_PATIENCE",
      "target_label_ar": "الصبر",
      "target_label_en": "Patience",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 7,
      "evidence_refs": [
        {
          "verse_key": "12:111",
          "source": "saadi",
          "chunk_id": "saadi_012_111_chunk19",
          "char_start": 469,
          "char_end": 631,
          "relevance": "direct"
        },
        {
          "verse_key": "12:111",
          "source": "saadi",
          "chunk_id": "saadi_012_111_chunk19",
          "char_start": 483,
          "char_end": 645,
          "relevance": "direct"
        },
        {
          "verse_key": "16:127",
          "source": "baghawi",
          "chunk_id": "baghawi_016_127_chunk00",
          "char_start": 0,
          "char_end": 117,
          "relevance": "direct"
        },
        {
          "verse_key": "16:127",
          "source": "qurtubi",
          "chunk_id": "qurtubi_016_127_chunk00",
          "char_start": 99,
          "char_end": 261,
          "relevance": "direct"
        },
        {
          "verse_key": "16:127",
          "source": "tabari",
          "chunk_id": "tabari_016_127_chunk00",
          "char_start": 60,
          "char_end": 222,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_FIN_HOARDING",
      "target_label_ar": "البخل",
      "target_label_en": "Hoarding/Miserliness",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:68",
          "source": "tabari",
          "chunk_id": "tabari_005_068_chunk05",
          "char_start": 349,
          "char_end": 511,
          "relevance": "direct"
        },
        {
          "verse_key": "5:68",
          "source": "tabari",
          "chunk_id": "tabari_005_068_chunk05",
          "char_start": 380,
          "char_end": 542,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_FIN_HOARDING",
      "target_label_ar": "البخل",
      "target_label_en": "Hoarding/Miserliness",
      "edge_type": "OPPOSITE_OF",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "9:81",
          "source": "saadi",
          "chunk_id": "saadi_009_081_chunk00",
          "char_start": 221,
          "char_end": 385,
          "relevance": "direct"
        },
        {
          "verse_key": "28:8",
          "source": "tabari",
          "chunk_id": "tabari_028_008_chunk03",
          "char_start": 269,
          "char_end": 433,
          "relevance": "direct"
        }
      ],
      "confidence": 0.64
    },
    {
      "target_id": "BEH_PHY_STANDING",
      "target_label_ar": "القيام",
      "target_label_en": "Standing",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "3:106",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_106_chunk00",
          "char_start": 526,
          "char_end": 688,
          "relevance": "direct"
        },
        {
          "verse_key": "3:106",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_106_chunk00",
          "char_start": 533,
          "char_end": 695,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_SPEECH_LYING",
      "target_label_ar": "الكذب",
      "target_label_en": "Lying",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "6:34",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_034_chunk00",
          "char_start": 10,
          "char_end": 172,
          "relevance": "direct"
        },
        {
          "verse_key": "94:5",
          "source": "qurtubi",
          "chunk_id": "qurtubi_094_005_chunk01",
          "char_start": 602,
          "char_end": 764,
          "relevance": "direct"
        },
        {
          "verse_key": "94:6",
          "source": "qurtubi",
          "chunk_id": "qurtubi_094_006_chunk01",
          "char_start": 602,
          "char_end": 764,
          "relevance": "direct"
        }
      ],
      "confidence": 0.53
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 12,
      "evidence_refs": [
        {
          "verse_key": "2:62",
          "source": "baghawi",
          "chunk_id": "baghawi_002_062_chunk02",
          "char_start": 712,
          "char_end": 867,
          "relevance": "direct"
        },
        {
          "verse_key": "2:62",
          "source": "tabari",
          "chunk_id": "tabari_002_062_chunk09",
          "char_start": 62,
          "char_end": 224,
          "relevance": "direct"
        },
        {
          "verse_key": "2:62",
          "source": "tabari",
          "chunk_id": "tabari_002_062_chunk09",
          "char_start": 77,
          "char_end": 239,
          "relevance": "direct"
        },
        {
          "verse_key": "2:62",
          "source": "tabari",
          "chunk_id": "tabari_002_062_chunk09",
          "char_start": 83,
          "char_end": 245,
          "relevance": "direct"
        },
        {
          "verse_key": "5:26",
          "source": "tabari",
          "chunk_id": "tabari_005_026_chunk12",
          "char_start": 554,
          "char_end": 716,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "STRENGTHENS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "12:69",
          "source": "tabari",
          "chunk_id": "tabari_012_069_chunk02",
          "char_start": 557,
          "char_end": 721,
          "relevance": "direct"
        },
        {
          "verse_key": "33:51",
          "source": "tabari",
          "chunk_id": "tabari_033_051_chunk09",
          "char_start": 311,
          "char_end": 475,
          "relevance": "direct"
        },
        {
          "verse_key": "58:10",
          "source": "tabari",
          "chunk_id": "tabari_058_010_chunk00",
          "char_start": 252,
          "char_end": 416,
          "relevance": "direct"
        }
      ],
      "confidence": 0.61
    },
    {
      "target_id": "CSQ_BALAA",
      "target_label_ar": "البلاء",
      "target_label_en": "Trial/Affliction",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "21:83",
          "source": "baghawi",
          "chunk_id": "baghawi_021_083_chunk07",
          "char_start": 607,
          "char_end": 769,
          "relevance": "direct"
        },
        {
          "verse_key": "21:83",
          "source": "tabari",
          "chunk_id": "tabari_021_083_chunk30",
          "char_start": 716,
          "char_end": 878,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "CSQ_FAQR",
      "target_label_ar": "الفقر",
      "target_label_en": "Poverty",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "19:26",
          "source": "qurtubi",
          "chunk_id": "qurtubi_019_026_chunk00",
          "char_start": 222,
          "char_end": 384,
          "relevance": "direct"
        },
        {
          "verse_key": "19:26",
          "source": "qurtubi",
          "chunk_id": "qurtubi_019_026_chunk00",
          "char_start": 241,
          "char_end": 403,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "CSQ_NAAR",
      "target_label_ar": "النار",
      "target_label_en": "Hellfire",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "7:49",
          "source": "qurtubi",
          "chunk_id": "qurtubi_007_049_chunk00",
          "char_start": 624,
          "char_end": 786,
          "relevance": "direct"
        },
        {
          "verse_key": "39:61",
          "source": "baghawi",
          "chunk_id": "baghawi_039_061_chunk00",
          "char_start": 217,
          "char_end": 379,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "ORG_EYE",
      "target_label_ar": "عين",
      "target_label_en": "Eye",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 21,
      "evidence_refs": [
        {
          "verse_key": "3:14",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_014_chunk04",
          "char_start": 4,
          "char_end": 166,
          "relevance": "direct"
        },
        {
          "verse_key": "9:91",
          "source": "qurtubi",
          "chunk_id": "qurtubi_009_091_chunk04",
          "char_start": 607,
          "char_end": 769,
          "relevance": "direct"
        },
        {
          "verse_key": "9:91",
          "source": "qurtubi",
          "chunk_id": "qurtubi_009_091_chunk06",
          "char_start": 482,
          "char_end": 644,
          "relevance": "direct"
        },
        {
          "verse_key": "9:92",
          "source": "baghawi",
          "chunk_id": "baghawi_009_092_chunk00",
          "char_start": 564,
          "char_end": 673,
          "relevance": "direct"
        },
        {
          "verse_key": "9:92",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_009_092_chunk01",
          "char_start": 97,
          "char_end": 259,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_FACE",
      "target_label_ar": "وجه",
      "target_label_en": "Face",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "2:38",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_038_chunk02",
          "char_start": 643,
          "char_end": 805,
          "relevance": "direct"
        },
        {
          "verse_key": "2:112",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_112_chunk00",
          "char_start": 382,
          "char_end": 495,
          "relevance": "direct"
        },
        {
          "verse_key": "21:104",
          "source": "tabari",
          "chunk_id": "tabari_021_104_chunk03",
          "char_start": 239,
          "char_end": 401,
          "relevance": "direct"
        },
        {
          "verse_key": "24:64",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_024_064_chunk00",
          "char_start": 313,
          "char_end": 475,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_FOOT",
      "target_label_ar": "رجل",
      "target_label_en": "Foot",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "3:52",
          "source": "tabari",
          "chunk_id": "tabari_003_052_chunk02",
          "char_start": 450,
          "char_end": 612,
          "relevance": "direct"
        },
        {
          "verse_key": "3:127",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_127_chunk00",
          "char_start": 223,
          "char_end": 385,
          "relevance": "direct"
        },
        {
          "verse_key": "48:29",
          "source": "saadi",
          "chunk_id": "saadi_048_029_chunk03",
          "char_start": 307,
          "char_end": 469,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_HEART",
      "target_label_ar": "قلب",
      "target_label_en": "Heart",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "48:29",
          "source": "saadi",
          "chunk_id": "saadi_048_029_chunk03",
          "char_start": 307,
          "char_end": 469,
          "relevance": "direct"
        },
        {
          "verse_key": "56:65",
          "source": "qurtubi",
          "chunk_id": "qurtubi_056_065_chunk00",
          "char_start": 559,
          "char_end": 721,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "ORG_SOUL",
      "target_label_ar": "نفس",
      "target_label_en": "Soul",
      "edge_type": "CAUSES",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "39:15",
          "source": "saadi",
          "chunk_id": "saadi_039_015_chunk00",
          "char_start": 203,
          "char_end": 367,
          "relevance": "direct"
        },
        {
          "verse_key": "39:15",
          "source": "saadi",
          "chunk_id": "saadi_039_015_chunk00",
          "char_start": 204,
          "char_end": 367,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "ORG_SOUL",
      "target_label_ar": "نفس",
      "target_label_en": "Soul",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:284",
          "source": "tabari",
          "chunk_id": "tabari_002_284_chunk20",
          "char_start": 55,
          "char_end": 217,
          "relevance": "direct"
        },
        {
          "verse_key": "18:10",
          "source": "tabari",
          "chunk_id": "tabari_018_010_chunk10",
          "char_start": 141,
          "char_end": 303,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "ORG_SOUL",
      "target_label_ar": "نفس",
      "target_label_en": "Soul",
      "edge_type": "OPPOSITE_OF",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "9:81",
          "source": "saadi",
          "chunk_id": "saadi_009_081_chunk00",
          "char_start": 221,
          "char_end": 385,
          "relevance": "direct"
        },
        {
          "verse_key": "28:8",
          "source": "tabari",
          "chunk_id": "tabari_028_008_chunk03",
          "char_start": 269,
          "char_end": 433,
          "relevance": "direct"
        }
      ],
      "confidence": 0.64
    }
  ],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [
      {
        "value": "ORG_HEART",
        "citation_type": "rule",
        "confidence": 0.9,
        "citation_ref": "RULE_EMOTION_HEART"
      }
    ],
    "internal_external": {
      "value": "باطن",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_INTERNAL_BEH_EMO_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 42,
    "quran_direct_count": 42,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 45,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.914,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.104347Z",
  "schema_version": "1.0.0"
}