{
  "behavior_id": "BEH_FIN_FAIR_TRADE",
  "label_ar": "التجارة العادلة",
  "label_en": "Fair Trade",
  "category": "financial",
  "roots": [
    "ت-ج-ر"
  ],
  "stems": [],
  "synonyms_ar": [
    "تجارة",
    "يتاجرون",
    "التجار"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:25",
      "text_ar": "وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ كُلَّمَا رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍ رِّزْقًا ۙ قَالُوا۟ هَـٰذَا ٱلَّذِى رُزِقْنَا مِن قَبْلُ ۖ وَأُتُوا۟ بِهِۦ مُتَشَـٰبِهًا ۖ وَلَهُمْ فِيهَآ أَزْوَٰجٌ مُّطَهَّرَةٌ ۖ وَهُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:164",
      "text_ar": "إِنَّ فِى خَلْقِ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَـٰفِ ٱلَّيْلِ وَٱلنَّهَارِ وَٱلْفُلْكِ ٱلَّتِى تَجْرِى فِى ٱلْبَحْرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٍ فَأَحْيَا بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍ وَتَصْرِيفِ ٱلرِّيَـٰحِ وَٱلسَّحَابِ ٱلْمُسَخَّرِ بَيْنَ ٱلسَّمَآءِ وَٱلْأَرْضِ لَـَٔايَـٰتٍ لِّقَوْمٍ يَعْقِلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:266",
      "text_ar": "أَيَوَدُّ أَحَدُكُمْ أَن تَكُونَ لَهُۥ جَنَّةٌ مِّن نَّخِيلٍ وَأَعْنَابٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ لَهُۥ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَأَصَابَهُ ٱلْكِبَرُ وَلَهُۥ ذُرِّيَّةٌ ضُعَفَآءُ فَأَصَابَهَآ إِعْصَارٌ فِيهِ نَارٌ فَٱحْتَرَقَتْ ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْـَٔايَـٰتِ لَعَلَّكُمْ تَتَفَكَّرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:282",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا تَدَايَنتُم بِدَيْنٍ إِلَىٰٓ أَجَلٍ مُّسَمًّى فَٱكْتُبُوهُ ۚ وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌۢ بِٱلْعَدْلِ ۚ وَلَا يَأْبَ كَاتِبٌ أَن يَكْتُبَ كَمَا عَلَّمَهُ ٱللَّهُ ۚ فَلْيَكْتُبْ وَلْيُمْلِلِ ٱلَّذِى عَلَيْهِ ٱلْحَقُّ وَلْيَتَّقِ ٱللَّهَ رَبَّهُۥ وَلَا يَبْخَسْ مِنْهُ شَيْـًٔا ۚ فَإِن كَانَ ٱلَّذِى عَلَيْهِ ٱلْحَقُّ سَفِيهًا أَوْ ضَعِيفًا أَوْ لَا يَسْتَطِيعُ أَن يُمِلَّ هُوَ فَلْيُمْلِلْ وَلِيُّهُۥ بِٱلْعَدْلِ ۚ وَٱسْتَشْهِدُوا۟ شَهِيدَيْنِ مِن رِّجَالِكُمْ ۖ فَإِن لَّمْ يَكُونَا رَجُلَيْنِ فَرَجُلٌ وَٱمْرَأَتَانِ مِمَّن تَرْضَوْنَ مِنَ ٱلشُّهَدَآءِ أَن تَضِلَّ إِحْدَىٰهُمَا فَتُذَكِّرَ إِحْدَىٰهُمَا ٱلْأُخْرَىٰ ۚ وَلَا يَأْبَ ٱلشُّهَدَآءُ إِذَا مَا دُعُوا۟ ۚ وَلَا تَسْـَٔمُوٓا۟ أَن تَكْتُبُوهُ صَغِيرًا أَوْ كَبِيرًا إِلَىٰٓ أَجَلِهِۦ ۚ ذَٰلِكُمْ أَقْسَطُ عِندَ ٱللَّهِ وَأَقْوَمُ لِلشَّهَـٰدَةِ وَأَدْنَىٰٓ أَلَّا تَرْتَابُوٓا۟ ۖ إِلَّآ أَن تَكُونَ تِجَـٰرَةً حَاضِرَةً تُدِيرُونَهَا بَيْنَكُمْ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَلَّا تَكْتُبُوهَا ۗ وَأَشْهِدُوٓا۟ إِذَا تَبَايَعْتُمْ ۚ وَلَا يُضَآرَّ كَاتِبٌ وَلَا شَهِيدٌ ۚ وَإِن تَفْعَلُوا۟ فَإِنَّهُۥ فُسُوقٌۢ بِكُمْ ۗ وَٱتَّقُوا۟ ٱللَّهَ ۖ وَيُعَلِّمُكُمُ ٱللَّهُ ۗ وَٱللَّهُ بِكُلِّ شَىْءٍ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:15",
      "text_ar": "قُلْ أَؤُنَبِّئُكُم بِخَيْرٍ مِّن ذَٰلِكُمْ ۚ لِلَّذِينَ ٱتَّقَوْا۟ عِندَ رَبِّهِمْ جَنَّـٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا وَأَزْوَٰجٌ مُّطَهَّرَةٌ وَرِضْوَٰنٌ مِّنَ ٱللَّهِ ۗ وَٱللَّهُ بَصِيرٌۢ بِٱلْعِبَادِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:136",
      "text_ar": "أُو۟لَـٰٓئِكَ جَزَآؤُهُم مَّغْفِرَةٌ مِّن رَّبِّهِمْ وَجَنَّـٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ وَنِعْمَ أَجْرُ ٱلْعَـٰمِلِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:195",
      "text_ar": "فَٱسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّى لَآ أُضِيعُ عَمَلَ عَـٰمِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ بَعْضُكُم مِّنۢ بَعْضٍ ۖ فَٱلَّذِينَ هَاجَرُوا۟ وَأُخْرِجُوا۟ مِن دِيَـٰرِهِمْ وَأُوذُوا۟ فِى سَبِيلِى وَقَـٰتَلُوا۟ وَقُتِلُوا۟ لَأُكَفِّرَنَّ عَنْهُمْ سَيِّـَٔاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ثَوَابًا مِّنْ عِندِ ٱللَّهِ ۗ وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلثَّوَابِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:198",
      "text_ar": "لَـٰكِنِ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ لَهُمْ جَنَّـٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا نُزُلًا مِّنْ عِندِ ٱللَّهِ ۗ وَمَا عِندَ ٱللَّهِ خَيْرٌ لِّلْأَبْرَارِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:13",
      "text_ar": "تِلْكَ حُدُودُ ٱللَّهِ ۚ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدْخِلْهُ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ وَذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:29",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَأْكُلُوٓا۟ أَمْوَٰلَكُم بَيْنَكُم بِٱلْبَـٰطِلِ إِلَّآ أَن تَكُونَ تِجَـٰرَةً عَن تَرَاضٍ مِّنكُمْ ۚ وَلَا تَقْتُلُوٓا۟ أَنفُسَكُمْ ۚ إِنَّ ٱللَّهَ كَانَ بِكُمْ رَحِيمًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:57",
      "text_ar": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدْخِلُهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًا ۖ لَّهُمْ فِيهَآ أَزْوَٰجٌ مُّطَهَّرَةٌ ۖ وَنُدْخِلُهُمْ ظِلًّا ظَلِيلًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:122",
      "text_ar": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدْخِلُهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًا ۖ وَعْدَ ٱللَّهِ حَقًّا ۚ وَمَنْ أَصْدَقُ مِنَ ٱللَّهِ قِيلًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:12",
      "text_ar": "وَلَقَدْ أَخَذَ ٱللَّهُ مِيثَـٰقَ بَنِىٓ إِسْرَٰٓءِيلَ وَبَعَثْنَا مِنْهُمُ ٱثْنَىْ عَشَرَ نَقِيبًا ۖ وَقَالَ ٱللَّهُ إِنِّى مَعَكُمْ ۖ لَئِنْ أَقَمْتُمُ ٱلصَّلَوٰةَ وَءَاتَيْتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِى وَعَزَّرْتُمُوهُمْ وَأَقْرَضْتُمُ ٱللَّهَ قَرْضًا حَسَنًا لَّأُكَفِّرَنَّ عَنكُمْ سَيِّـَٔاتِكُمْ وَلَأُدْخِلَنَّكُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۚ فَمَن كَفَرَ بَعْدَ ذَٰلِكَ مِنكُمْ فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:85",
      "text_ar": "فَأَثَـٰبَهُمُ ٱللَّهُ بِمَا قَالُوا۟ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ وَذَٰلِكَ جَزَآءُ ٱلْمُحْسِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:119",
      "text_ar": "قَالَ ٱللَّهُ هَـٰذَا يَوْمُ يَنفَعُ ٱلصَّـٰدِقِينَ صِدْقُهُمْ ۚ لَهُمْ جَنَّـٰتٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًا ۚ رَّضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "6:6",
      "text_ar": "أَلَمْ يَرَوْا۟ كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ مَّكَّنَّـٰهُمْ فِى ٱلْأَرْضِ مَا لَمْ نُمَكِّن لَّكُمْ وَأَرْسَلْنَا ٱلسَّمَآءَ عَلَيْهِم مِّدْرَارًا وَجَعَلْنَا ٱلْأَنْهَـٰرَ تَجْرِى مِن تَحْتِهِمْ فَأَهْلَكْنَـٰهُم بِذُنُوبِهِمْ وَأَنشَأْنَا مِنۢ بَعْدِهِمْ قَرْنًا ءَاخَرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:43",
      "text_ar": "وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ تَجْرِى مِن تَحْتِهِمُ ٱلْأَنْهَـٰرُ ۖ وَقَالُوا۟ ٱلْحَمْدُ لِلَّهِ ٱلَّذِى هَدَىٰنَا لِهَـٰذَا وَمَا كُنَّا لِنَهْتَدِىَ لَوْلَآ أَنْ هَدَىٰنَا ٱللَّهُ ۖ لَقَدْ جَآءَتْ رُسُلُ رَبِّنَا بِٱلْحَقِّ ۖ وَنُودُوٓا۟ أَن تِلْكُمُ ٱلْجَنَّةُ أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:24",
      "text_ar": "قُلْ إِن كَانَ ءَابَآؤُكُمْ وَأَبْنَآؤُكُمْ وَإِخْوَٰنُكُمْ وَأَزْوَٰجُكُمْ وَعَشِيرَتُكُمْ وَأَمْوَٰلٌ ٱقْتَرَفْتُمُوهَا وَتِجَـٰرَةٌ تَخْشَوْنَ كَسَادَهَا وَمَسَـٰكِنُ تَرْضَوْنَهَآ أَحَبَّ إِلَيْكُم مِّنَ ٱللَّهِ وَرَسُولِهِۦ وَجِهَادٍ فِى سَبِيلِهِۦ فَتَرَبَّصُوا۟ حَتَّىٰ يَأْتِىَ ٱللَّهُ بِأَمْرِهِۦ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْفَـٰسِقِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:72",
      "text_ar": "وَعَدَ ٱللَّهُ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا وَمَسَـٰكِنَ طَيِّبَةً فِى جَنَّـٰتِ عَدْنٍ ۚ وَرِضْوَٰنٌ مِّنَ ٱللَّهِ أَكْبَرُ ۚ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:89",
      "text_ar": "أَعَدَّ ٱللَّهُ لَهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:100",
      "text_ar": "وَٱلسَّـٰبِقُونَ ٱلْأَوَّلُونَ مِنَ ٱلْمُهَـٰجِرِينَ وَٱلْأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحْسَـٰنٍ رَّضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ وَأَعَدَّ لَهُمْ جَنَّـٰتٍ تَجْرِى تَحْتَهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَآ أَبَدًا ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:9",
      "text_ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ يَهْدِيهِمْ رَبُّهُم بِإِيمَـٰنِهِمْ ۖ تَجْرِى مِن تَحْتِهِمُ ٱلْأَنْهَـٰرُ فِى جَنَّـٰتِ ٱلنَّعِيمِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "11:35",
      "text_ar": "أَمْ يَقُولُونَ ٱفْتَرَىٰهُ ۖ قُلْ إِنِ ٱفْتَرَيْتُهُۥ فَعَلَىَّ إِجْرَامِى وَأَنَا۠ بَرِىٓءٌ مِّمَّا تُجْرِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "11:42",
      "text_ar": "وَهِىَ تَجْرِى بِهِمْ فِى مَوْجٍ كَٱلْجِبَالِ وَنَادَىٰ نُوحٌ ٱبْنَهُۥ وَكَانَ فِى مَعْزِلٍ يَـٰبُنَىَّ ٱرْكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلْكَـٰفِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "13:35",
      "text_ar": "مَّثَلُ ٱلْجَنَّةِ ٱلَّتِى وُعِدَ ٱلْمُتَّقُونَ ۖ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ أُكُلُهَا دَآئِمٌ وَظِلُّهَا ۚ تِلْكَ عُقْبَى ٱلَّذِينَ ٱتَّقَوا۟ ۖ وَّعُقْبَى ٱلْكَـٰفِرِينَ ٱلنَّارُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "14:17",
      "text_ar": "يَتَجَرَّعُهُۥ وَلَا يَكَادُ يُسِيغُهُۥ وَيَأْتِيهِ ٱلْمَوْتُ مِن كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ ۖ وَمِن وَرَآئِهِۦ عَذَابٌ غَلِيظٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "14:23",
      "text_ar": "وَأُدْخِلَ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ ۖ تَحِيَّتُهُمْ فِيهَا سَلَـٰمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "14:32",
      "text_ar": "ٱللَّهُ ٱلَّذِى خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَأَخْرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزْقًا لَّكُمْ ۖ وَسَخَّرَ لَكُمُ ٱلْفُلْكَ لِتَجْرِىَ فِى ٱلْبَحْرِ بِأَمْرِهِۦ ۖ وَسَخَّرَ لَكُمُ ٱلْأَنْهَـٰرَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:31",
      "text_ar": "جَنَّـٰتُ عَدْنٍ يَدْخُلُونَهَا تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ لَهُمْ فِيهَا مَا يَشَآءُونَ ۚ كَذَٰلِكَ يَجْزِى ٱللَّهُ ٱلْمُتَّقِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "18:31",
      "text_ar": "أُو۟لَـٰٓئِكَ لَهُمْ جَنَّـٰتُ عَدْنٍ تَجْرِى مِن تَحْتِهِمُ ٱلْأَنْهَـٰرُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ وَيَلْبَسُونَ ثِيَابًا خُضْرًا مِّن سُندُسٍ وَإِسْتَبْرَقٍ مُّتَّكِـِٔينَ فِيهَا عَلَى ٱلْأَرَآئِكِ ۚ نِعْمَ ٱلثَّوَابُ وَحَسُنَتْ مُرْتَفَقًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "20:76",
      "text_ar": "جَنَّـٰتُ عَدْنٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ وَذَٰلِكَ جَزَآءُ مَن تَزَكَّىٰ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "21:81",
      "text_ar": "وَلِسُلَيْمَـٰنَ ٱلرِّيحَ عَاصِفَةً تَجْرِى بِأَمْرِهِۦٓ إِلَى ٱلْأَرْضِ ٱلَّتِى بَـٰرَكْنَا فِيهَا ۚ وَكُنَّا بِكُلِّ شَىْءٍ عَـٰلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "22:14",
      "text_ar": "إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۚ إِنَّ ٱللَّهَ يَفْعَلُ مَا يُرِيدُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "22:23",
      "text_ar": "إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ وَلُؤْلُؤًا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "22:65",
      "text_ar": "أَلَمْ تَرَ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِى ٱلْأَرْضِ وَٱلْفُلْكَ تَجْرِى فِى ٱلْبَحْرِ بِأَمْرِهِۦ وَيُمْسِكُ ٱلسَّمَآءَ أَن تَقَعَ عَلَى ٱلْأَرْضِ إِلَّا بِإِذْنِهِۦٓ ۗ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "24:37",
      "text_ar": "رِجَالٌ لَّا تُلْهِيهِمْ تِجَـٰرَةٌ وَلَا بَيْعٌ عَن ذِكْرِ ٱللَّهِ وَإِقَامِ ٱلصَّلَوٰةِ وَإِيتَآءِ ٱلزَّكَوٰةِ ۙ يَخَافُونَ يَوْمًا تَتَقَلَّبُ فِيهِ ٱلْقُلُوبُ وَٱلْأَبْصَـٰرُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "25:10",
      "text_ar": "تَبَارَكَ ٱلَّذِىٓ إِن شَآءَ جَعَلَ لَكَ خَيْرًا مِّن ذَٰلِكَ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ وَيَجْعَل لَّكَ قُصُورًۢا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "29:58",
      "text_ar": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ لَنُبَوِّئَنَّهُم مِّنَ ٱلْجَنَّةِ غُرَفًا تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا ۚ نِعْمَ أَجْرُ ٱلْعَـٰمِلِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "30:46",
      "text_ar": "وَمِنْ ءَايَـٰتِهِۦٓ أَن يُرْسِلَ ٱلرِّيَاحَ مُبَشِّرَٰتٍ وَلِيُذِيقَكُم مِّن رَّحْمَتِهِۦ وَلِتَجْرِىَ ٱلْفُلْكُ بِأَمْرِهِۦ وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "31:31",
      "text_ar": "أَلَمْ تَرَ أَنَّ ٱلْفُلْكَ تَجْرِى فِى ٱلْبَحْرِ بِنِعْمَتِ ٱللَّهِ لِيُرِيَكُم مِّنْ ءَايَـٰتِهِۦٓ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "35:29",
      "text_ar": "إِنَّ ٱلَّذِينَ يَتْلُونَ كِتَـٰبَ ٱللَّهِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقْنَـٰهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَـٰرَةً لَّن تَبُورَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "36:38",
      "text_ar": "وَٱلشَّمْسُ تَجْرِى لِمُسْتَقَرٍّ لَّهَا ۚ ذَٰلِكَ تَقْدِيرُ ٱلْعَزِيزِ ٱلْعَلِيمِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "38:36",
      "text_ar": "فَسَخَّرْنَا لَهُ ٱلرِّيحَ تَجْرِى بِأَمْرِهِۦ رُخَآءً حَيْثُ أَصَابَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "39:20",
      "text_ar": "لَـٰكِنِ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ لَهُمْ غُرَفٌ مِّن فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ وَعْدَ ٱللَّهِ ۖ لَا يُخْلِفُ ٱللَّهُ ٱلْمِيعَادَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "43:51",
      "text_ar": "وَنَادَىٰ فِرْعَوْنُ فِى قَوْمِهِۦ قَالَ يَـٰقَوْمِ أَلَيْسَ لِى مُلْكُ مِصْرَ وَهَـٰذِهِ ٱلْأَنْهَـٰرُ تَجْرِى مِن تَحْتِىٓ ۖ أَفَلَا تُبْصِرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "45:12",
      "text_ar": "ٱللَّهُ ٱلَّذِى سَخَّرَ لَكُمُ ٱلْبَحْرَ لِتَجْرِىَ ٱلْفُلْكُ فِيهِ بِأَمْرِهِۦ وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ وَلَعَلَّكُمْ تَشْكُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "47:12",
      "text_ar": "إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ وَٱلَّذِينَ كَفَرُوا۟ يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ ٱلْأَنْعَـٰمُ وَٱلنَّارُ مَثْوًى لَّهُمْ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "48:5",
      "text_ar": "لِّيُدْخِلَ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا وَيُكَفِّرَ عَنْهُمْ سَيِّـَٔاتِهِمْ ۚ وَكَانَ ذَٰلِكَ عِندَ ٱللَّهِ فَوْزًا عَظِيمًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "48:17",
      "text_ar": "لَّيْسَ عَلَى ٱلْأَعْمَىٰ حَرَجٌ وَلَا عَلَى ٱلْأَعْرَجِ حَرَجٌ وَلَا عَلَى ٱلْمَرِيضِ حَرَجٌ ۗ وَمَن يُطِعِ ٱللَّهَ وَرَسُولَهُۥ يُدْخِلْهُ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ وَمَن يَتَوَلَّ يُعَذِّبْهُ عَذَابًا أَلِيمًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "54:14",
      "text_ar": "تَجْرِى بِأَعْيُنِنَا جَزَآءً لِّمَن كَانَ كُفِرَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "قوله تعالى : ( وبشر الذين آمنوا ) أي أخبر والبشارة كل خبر صدق تتغير به بشرة الوجه ويستعمل في الخير والشر وفي الخير أغلب ( وعملوا الصالحات ) أي الفعلات الصالحات يعني المؤمنين الذين هم من أهل الطاعات قال عثمان بن عفان رضي الله عنه ( وعملوا الصالحات ) أي أخلصوا الأعمال كما قال \" فليعمل عملا صالحا \" ( 110 - الكهف ) أي خاليا من الرياء . قال معاذ : العمل الصالح الذي فيه أربعة أشياء . العلم والنية والصبر والإخلاص . ( أن لهم جنات ) جمع الجنة والجنة البستان الذي فيه أشجار مثمرة سميت بها لاجتنانها وتسترها",
        "char_start": 0,
        "char_end": 878,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "فأنزل الله عز وجل {إن في خلق السموات والأرض} ذكر السماوات بلفظ الجمع والأرض بلفظ الواحد لأن كل سماء ليست من جنس واحد بل من جنس آخر، والأرضون كلها من جنس واحد وهو التراب، فالآية في السماوات سمكها وارتفاعها من غير عمد ولا علاقة وما ترى فيها من الشمس والقمر والنجوم، والآية في الأرض مدها وبسطها وسعتها وماترى فيها من الأشجار والأنهار والجبال والبحار والجواهر والنبات.قوله تعالى: {واختلاف الليل والنهار} أي تعاقبهما في الذهاب والمجيء يخلف أحدهما صاحبه إذا ذهب أحدهما جاء الآخر خلفه أي بعده نظيره قوله تعا",
        "char_start": 0,
        "char_end": 2645,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_266_chunk00",
        "verse_key": "2:266",
        "text_ar": "( أيود أحدكم أن تكون له جنة من نخيل وأعناب تجري من تحتها الأنهار ) هذه الآية متصلة بقوله تعالى : \" يا أيها الذين آمنوا لا تبطلوا صدقاتكم بالمن والأذى \" [ قوله أيود يعني : أيحب أحدكم أن تكون له جنة أي بستان من نخيل وأعناب تجري من تحتها الأنهار ] .( له فيها من كل الثمرات وأصابه الكبر وله ذرية ضعفاء ) أولاد صغار ضعاف عجزة ( فأصابها إعصار ) الريح العاصف التي ترتفع إلى السماء كأنها عمود وجمعه أعاصير ( فيه نار فاحترقت ) هذا مثل ضربه الله لعمل المنافق والمرائي يقول : عمله في حسنه كحسن الجنة ينتفع به كم",
        "char_start": 0,
        "char_end": 1441,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_282_chunk00",
        "verse_key": "2:282",
        "text_ar": "قوله تعالى : ( يا أيها الذين آمنوا إذا تداينتم بدين إلى أجل مسمى ) قال ابن عباس رضي الله عنهما لما حرم الله الربا أباح السلم وقال : أشهد أن السلف المضمون إلى أجل مسمى قد أحله الله تعالى في كتابه وأذن فيه ثم قال \" يا أيها الذين آمنوا إذا تداينتم بدين إلى أجل مسمى فاكتبوه \" .قوله : ( إذا تداينتم ) أي تعاملتم بالدين يقال : داينته إذا عاملته بالدين وإنما قال ( بدين ) بعد قوله تداينتم لأن المداينة قد تكون مجازاة وقد تكون معاطاة فقيده بالدين ليعرف المراد من اللفظ وقيل : ذكره تأكيدا كقوله تعالى : \" ولا",
        "char_start": 0,
        "char_end": 7767,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_015_chunk00",
        "verse_key": "3:15",
        "text_ar": "قوله تعالى ( قل أؤنبئكم بخير من ذلكم للذين اتقوا عند ربهم جنات تجري من تحتها الأنهار خالدين فيها وأزواج مطهرة ورضوان من الله ) قرأه العامة بكسر الراء ، وروى أبو بكر عن عاصم بضم الراء ، وهما لغتان كالعدوان والعدوان .أخبرنا عبد الواحد بن أحمد المليحي ، أنا أحمد بن عبد الله النعيمي ، أنا محمد بن يوسف ، أنا محمد بن إسماعيل ، أنا يحيى بن سليمان ، حدثني ابن وهب ، حدثني مالك عن زيد بن أسلم عن عطاء بن يسار عن أبي سعيد الخدري رضي الله عنه قال : قال النبي صلى الله عليه وسلم \" إن الله تبارك وتعالى يقول لأه",
        "char_start": 0,
        "char_end": 777,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_136_chunk00",
        "verse_key": "3:136",
        "text_ar": "( أولئك جزاؤهم مغفرة من ربهم وجنات تجري من تحتها الأنهار خالدين فيها ونعم أجر العاملين ) ثواب المطيعين . أخبرنا عبد الواحد بن أحمد المليحي ، أنا أبو منصور السمعاني ، أخبرنا أبو جعفر الرياني ، أنا حميد بن زنجويه ، أنا عفان بن مسلم ، أنا أبو عوانة ، أنا عثمان بن المغيرة عن علي بن ربيعة الأسدي ، عن أسماء بن الحكم الفزاري ، قال : سمعت عليا رضي الله عنه يقول : إني كنت رجلا إذا سمعت من رسول الله صلى الله عليه وسلم حديثا ينفعني الله منه بما شاء أن ينفعني وإذا حدثني أحد من أصحابه استحلفته فإذا حلف لي صد",
        "char_start": 0,
        "char_end": 2251,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_195_chunk00",
        "verse_key": "3:195",
        "text_ar": "قوله تعالى : ( فاستجاب لهم ربهم أني ) أي : بأني ، ( لا أضيع ) لا أحبط ، ( عمل عامل منكم ) أيها المؤمنون ( من ذكر أو أنثى ) قال مجاهد : قالت أم سلمة يا رسول الله إني أسمع الله يذكر الرجال في الهجرة ولا يذكر النساء فأنزل الله تعالى هذه الآية ( بعضكم من بعض ) قال الكلبي : في الدين والنصرة والموالاة ، وقيل : كلكم من آدم وحواء ، وقال الضحاك : رجالكم شكل نسائكم ونساؤكم شكل رجالكم في الطاعة ، كما قال : \" والمؤمنون والمؤمنات بعضهم أولياء بعض \" ( التوبة - 71 ) .( فالذين هاجروا وأخرجوا من ديارهم وأوذوا في",
        "char_start": 0,
        "char_end": 1150,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_198_chunk00",
        "verse_key": "3:198",
        "text_ar": "( لكن الذين اتقوا ربهم لهم جنات تجري من تحتها الأنهار خالدين فيها نزلا ) جزاء وثوابا ، ( من عند الله ) نصب على التفسير وقيل : جعل ذلك نزلا ( وما عند الله خير للأبرار ) من متاع الدنيا .أخبرنا عبد الواحد المليحي ، أنا أحمد بن عبد الله النعيمي ، أنا محمد بن يوسف ، أنا محمد بن إسماعيل ، أنا عبد العزيز بن عبد الله ، أنا سليمان بن بلال ، عن يحيى بن سعيد ، عن عبيد بن حنين أنه سمع ابن عباس رضي الله عنهما قال : قال عمر بن الخطاب رضي الله عنه : جئت فإذا رسول الله صلى الله عليه وسلم في مشربة وإنه لعلى حصير",
        "char_start": 0,
        "char_end": 767,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_013_chunk00",
        "verse_key": "4:13",
        "text_ar": "( تلك حدود الله ) يعني : ما ذكر من الفروض المحدودة ، ( ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار خالدين فيها وذلك الفوز العظيم )",
        "char_start": 0,
        "char_end": 139,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_029_chunk00",
        "verse_key": "4:29",
        "text_ar": "قوله تعالى : ( يا أيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل ) بالحرام ، يعني : بالربا والقمار والغصب والسرقة والخيانة ونحوها ، وقيل : هو العقود الفاسدة ( إلا أن تكون تجارة ) ، قرأ أهل الكوفة ( تجارة ) نصب على خبر كان ، أي : إلا أن تكون الأموال تجارة ، وقرأ الآخرون بالرفع ، أي : إلا أن تقع تجارة ، ( عن تراض منكم ) أي : بطيبة نفس كل واحد منكم .وقيل : هو أن يجيز كل واحد من المتبايعين صاحبه بعد البيع ، فيلزم ، وإلا فلهما الخيار ما لم يتفرقا لما أخبرنا أبو الحسن السرخسي ، أخبرنا زاهر بن أحمد ،",
        "char_start": 0,
        "char_end": 1980,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_057_chunk00",
        "verse_key": "4:57",
        "text_ar": "( والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدا لهم فيها أزواج مطهرة وندخلهم ظلا ظليلا ) كنينا لا تنسخه الشمس ولا يؤذيهم حر ولا برد .",
        "char_start": 0,
        "char_end": 168,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_122_chunk00",
        "verse_key": "4:122",
        "text_ar": "قوله تعالى : ( والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار ) أي : من تحت الغرف والمساكن ، ( خالدين فيها أبدا وعد الله حقا ومن أصدق من الله قيلا )",
        "char_start": 0,
        "char_end": 165,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_012_chunk00",
        "verse_key": "5:12",
        "text_ar": "قوله عز وجل : ( ولقد أخذ الله ميثاق بني إسرائيل وبعثنا منهم اثني عشر نقيبا ) وذلك أن الله عز وجل وعد موسى عليه السلام أن يورثه وقومه الأرض المقدسة وهي الشام ، وكان يسكنها الكنعانيون الجبارون ، فلما استقرت لبني إسرائيل الدار بمصر أمرهم الله تعالى بالسير إلى أريحاء من أرض الشام وهي الأرض المقدسة ، وكانت لها ألف قرية في كل قرية ألف بستان ، وقال : يا موسى إني كتبتها لكم دارا وقرارا فاخرج إليها وجاهد من فيها من العدو فإني ناصرك عليهم ، وخذ من قومك اثني عشر نقيبا من كل سبط نقيبا يكون كفيلا على قومه با",
        "char_start": 0,
        "char_end": 2530,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_085_chunk00",
        "verse_key": "5:85",
        "text_ar": "( فأثابهم الله ) أعطاهم الله ، ( بما قالوا جنات تجري من تحتها الأنهار خالدين فيها ) وإنما أنجح قولهم وعلق الثواب بالقول لاقترانه بالإخلاص ، بدليل قوله : ( وذلك جزاء المحسنين ) يعني : الموحدين المؤمنين ، وقوله من قبل : \" ترى أعينهم تفيض من الدمع مما عرفوا من الحق \" يدل على أن الإخلاص والمعرفة بالقلب مع القول يكون إيمانا .",
        "char_start": 0,
        "char_end": 322,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_119_chunk00",
        "verse_key": "5:119",
        "text_ar": "(قال الله هذا يوم ينفع الصادقين صدقهم ) قرأ نافع ( يوم ) بنصب الميم ، يعني : تكون هذه الأشياء في يوم ، فحذف في فانتصب ، وقرأ الآخرون بالرفع على أنه خبر ( هذا ) أي : ينفع الصادقين في الدنيا صدقهم في الآخرة ، ولو كذبوا ختم الله على أفواههم ونطقت به جوارحهم فافتضحوا ، وقيل : أرادوا بالصادقين النبيين .وقال الكلبي : ينفع المؤمنين إيمانهم ، قال قتادة : متكلمان لا يخطئان يوم القيامة عيسى عليه السلام ، وهو ما قص الله عز وجل ، وعدو الله إبليس ، وهو قوله : \" وقال الشيطان لما قضي الأمر \" ، الآية ، فصدق عدو",
        "char_start": 0,
        "char_end": 821,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_006_chunk00",
        "verse_key": "6:6",
        "text_ar": "قوله عز وجل : ( ألم يروا كم أهلكنا من قبلهم من قرن ) يعني : الأمم الماضية ، والقرن : الجماعة من الناس ، وجمعه قرون ، وقيل : القرن مدة من الزمان ، يقال ثمانون سنة ، وقيل : ستون سنة ، وقيل : أربعون سنة ، وقيل : ثلاثون سنة ، ويقال : مائة سنة ، لما روي أن النبي صلى الله عليه وسلم قال لعبد الله بن بسر المازني : \" إنك تعيش قرنا \" ، فعاش مائة سنةفيكون معناه على هذه الأقاويل من أهل قرن ، ( مكناهم في الأرض ما لم نمكن لكم ) أي : أعطيناهم ما لم نعطكم ، وقال ابن عباس : أمهلناهم في العمر مثل قوم نوح وعاد وثم",
        "char_start": 0,
        "char_end": 1071,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_043_chunk00",
        "verse_key": "7:43",
        "text_ar": "( ونزعنا ) وأخرجنا ، ( ما في صدورهم من غل ) من غش وعداوة كانت بينهم في الدنيا فجعلناهم إخوانا على سرر متقابلين لا يحسد بعضهم بعضا على شيء خص الله به بعضهم . ( تجري من تحتهم الأنهار ) روى الحسن عن علي رضي الله عنه قال : فينا والله أهل بدر نزلت : ( ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين ) .وقال علي رضي الله عنه أيضا : إني لأرجو أن أكون أنا وعثمان وطلحة والزبير من الذين قال لهم الله - عز وجل - : ( ونزعنا ما في صدورهم من غل )أخبرنا عبد الواحد المليحي أنبأنا أحمد بن عبد الله النعيمي أنبأنا",
        "char_start": 0,
        "char_end": 2338,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_024_chunk00",
        "verse_key": "9:24",
        "text_ar": "ثم قال تعالى : ( قل ) يا محمد للمتخلفين عن الهجرة : ( إن كان آباؤكم ) وذلك أنه لما نزلت الآية الأولى قال الذين أسلموا ولم يهاجروا : إن نحن هاجرنا ضاعت أموالنا وذهبت تجاراتنا وخربت دورنا وقطعنا أرحامنا ، فنزل : ( قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم وعشيرتكم ) قرأ أبو بكر عن عاصم : \" عشيراتكم \" بالألف على الجمع ، والآخرون بلا ألف على التوحيد ، لأن جمع العشيرة عشائر ( وأموال اقترفتموها ) اكتسبتموها ( وتجارة تخشون كسادها ومساكن ترضونها ) أي : تستطيبونها يعني القصور والمنازل ، ( أحب إليكم من ",
        "char_start": 0,
        "char_end": 712,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_072_chunk00",
        "verse_key": "9:72",
        "text_ar": "( وعد الله المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ومساكن طيبة ) منازل طيبة ، ( في جنات عدن ) أي : بساتين خلد وإقامة ، يقال : عدن بالمكان إذا أقام به .قال ابن مسعود : هي بطنان الجنة ، أي : وسطها .قال عبد الله بن عمرو بن العاص : إن في الجنة قصرا يقال له : \" عدن \" حوله البروج والمروج ، له خمسة آلاف باب لا يدخله إلا نبي أو صديق أو شهيد .وقال الحسن : قصر من ذهب لا يدخله إلا نبي أو صديق أو شهيد أو حكم عدل .وقال عطاء بن السائب : \" عدن \" نهر في الجنة جنانه على حافتيه .وقال مقاتل والكل",
        "char_start": 0,
        "char_end": 1190,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_089_chunk00",
        "verse_key": "9:89",
        "text_ar": "\"أعد الله لهم جنات تجري من تحتها الأنهار خالدين فيها ذلك الفوز العظيم\".",
        "char_start": 0,
        "char_end": 71,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "لما ذكر تعالي ما اعده لاعدايه من الاشقياء الكافرين به وبرسله من العذاب والنكال ، عطف بذكر حال اوليايه من السعداء المومنين به وبرسله ، الذين صدقوا ايمانهم باعمالهم الصالحه ، وهذا معني تسميه القران مثاني علي اصح اقوال العلماء ، كما سنبسطه في موضعه ، وهو ان يذكر الايمان ويتبعه بذكر الكفر ، او عكسه ، او حال السعداء ثم الاشقياء ، او عكسه . وحاصله ذكر الشيء ومقابله . واما ذكر الشيء ونظيره فذاك التشابه ، كما سنوضحه ان شاء الله ؛ فلهذا قال تعالي : ( وبشر الذين امنوا وعملوا الصالحات ان لهم جنات تجري من ت",
        "char_start": 0,
        "char_end": 4934,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "ثم ذكر الدليل علي تفرده بالالهيه [ بتفرده ] بخلق السماوات والارض وما فيهما ، وما بين ذلك مما ذرا وبرا من المخلوقات الداله علي وحدانيته ، فقال : ( ان في خلق السماوات والارض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس وما انزل الله من السماء من ماء فاحيا به الارض بعد موتها وبث فيها من كل دابه وتصريف الرياح والسحاب المسخر بين السماء والارض لايات لقوم يعقلون ) يقول تعالي : ( ان في خلق السماوات والارض ) تلك في [ لطافتها و ] ارتفاعها واتساعها وكواكبها السياره والثوابت ودوران فلكها ،",
        "char_start": 0,
        "char_end": 4294,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_266_chunk00",
        "verse_key": "2:266",
        "text_ar": "قال البخاري عند تفسير هذه الايه : حدثنا ابراهيم بن موسي ، حدثنا هشام هو ابن يوسف عن ابن جريج : سمعت عبد الله بن ابي مليكه ، يحدث عن ابن عباس ، وسمعت اخاه ابا بكر بن ابي مليكه يحدث عن عبيد بن عمير قال : قال عمر بن الخطاب يوما لاصحاب النبي صلي الله عليه وسلم : فيمن ترون هذه الايه نزلت : ( ايود احدكم ان تكون له جنه من نخيل واعناب ) ؟ قالوا : الله اعلم . فغضب عمر فقال : قولوا : نعلم او لا نعلم . فقال ابن عباس : في نفسي منها شيء يا امير المومنين . فقال عمر : يا ابن اخي ، قل ولا تحقر نفسك . فقال ابن ع",
        "char_start": 0,
        "char_end": 2214,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_282_chunk00",
        "verse_key": "2:282",
        "text_ar": "هذه الايه الكريمه اطول ايه في القران العظيم ، وقد قال الامام ابو جعفر بن جرير :حدثنا يونس ، اخبرنا ابن وهب ، اخبرني يونس ، عن ابن شهاب قال ، حدثني سعيد بن المسيب : انه بلغه ان احدث القران بالعرش ايه الدين .وقال الامام احمد : حدثنا عفان ، حدثنا حماد بن سلمه ، عن علي بن زيد ، عن يوسف بن مهران ، عن ابن عباس انه قال : لما نزلت ايه الدين قال رسول الله صلي الله عليه وسلم : \" ان اول من جحد ادم ، عليه السلام ، ان الله لما خلق ادم ، مسح ظهره فاخرج منه ما هو ذاري الي يوم القيامه ، فجعل يعرض ذريته عليه ، ف",
        "char_start": 0,
        "char_end": 12584,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_015_chunk00",
        "verse_key": "3:15",
        "text_ar": "ولهذا قال تعالي : ( قل اونبيكم بخير من ذلكم ) اي : قل يا محمد للناس : ااخبركم بخير مما زين للناس في هذه الحياه الدنيا من زهرتها ونعيمها ، الذي هو زايل لا محاله . ثم اخبر عن ذلك ، فقال : ( للذين اتقوا عند ربهم جنات تجري من تحتها الانهار ) اي : تنخرق بين جوانبها وارجايها الانهار ، من انواع الاشربه ، من العسل واللبن والخمر والماء وغير ذلك ، مما لا عين رات ، ولا اذن سمعت ، ولا خطر علي قلب بشر .( خالدين فيها ) اي : ماكثين فيها ابد الاباد لا يبغون عنها حولا .( وازواج مطهره ) اي : من الدنس ، والخبث ، و",
        "char_start": 0,
        "char_end": 841,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_136_chunk00",
        "verse_key": "3:136",
        "text_ar": "ثم قال تعالي - بعد وصفهم بما وصفهم به - : ( اوليك جزاوهم مغفره من ربهم وجنات ) اي : جزاوهم علي هذه الصفات مغفره من الله وجنات ( تجري من تحتها الانهار ) اي : من انواع المشروبات ( خالدين فيها ) اي : ماكثين فيها ( ونعم اجر العاملين ) يمدح تعالي الجنه .",
        "char_start": 0,
        "char_end": 249,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_195_chunk00",
        "verse_key": "3:195",
        "text_ar": "يقول تعالي : ( فاستجاب لهم ربهم ) اي : فاجابهم ربهم ، كما قال الشاعر :وداع دعا يا من يجيب الي الندي فلم يستجبه عند ذاك مجيبقال سعيد بن منصور : حدثنا سفيان ، عن عمرو بن دينار ، عن سلمه ، رجل من ال ام سلمه ، قال : قالت ام سلمه : يا رسول الله ، لا نسمع الله ذكر النساء في الهجره بشيء ؟ فانزل الله [ عز وجل ] ( فاستجاب لهم ربهم اني لا اضيع عمل عامل منكم من ذكر او انثي ) الي اخر الايه . وقالت الانصار : هي اول ظعينه قدمت علينا .وقد رواه الحاكم في مستدركه من حديث سفيان بن عيينه ، ثم قال : صحيح علي شرط ال",
        "char_start": 0,
        "char_end": 2710,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_198_chunk00",
        "verse_key": "3:198",
        "text_ar": "وهكذا لما ذكر حال الكفار في الدنيا وذكر مالهم الي النار قال بعده : \" ( لكن الذين اتقوا ربهم لهم جنات تجري من تحتها الانهار خالدين فيها نزلا ) اي : ضيافه من عند الله ( وما عند الله خير للابرار )وقال ابن مردويه : حدثنا احمد بن نصر اخبرنا ابو طاهر سهل بن عبد الله ، انبانا هشام بن عمار ، انبانا سعيد بن يحيي ، انبانا عبيد الله بن الوليد الوصافي عن محارب بن دثار ، عن عبد الله بن عمرو بن العاص ، عن النبي صلي الله عليه وسلم قال : \" انما سموا الابرار لانهم بروا الاباء والابناء ، كما ان لوالديك عليك حقا ،",
        "char_start": 0,
        "char_end": 1737,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_013_chunk00",
        "verse_key": "4:13",
        "text_ar": "اي : هذه الفرايض والمقادير التي جعلها الله للورثه بحسب قربهم من الميت واحتياجهم اليه وفقدهم له عند عدمه ، هي حدود الله فلا تعتدوها ولا تجاوزوها; ولهذا قال : ( ومن يطع الله ورسوله ) اي : فيها ، فلم يزد بعض الورثه ولم ينقص بعضا بحيله ووسيله ، بل تركهم علي حكم الله وفريضته وقسمته ( يدخله جنات تجري من تحتها الانهار خالدين فيها وذلك الفوز العظيم.",
        "char_start": 0,
        "char_end": 343,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_029_chunk00",
        "verse_key": "4:29",
        "text_ar": "نهي تبارك وتعالي عباده المومنين عن ان ياكلوا اموال بعضهم بعضا بالباطل ، اي : بانواع المكاسب التي هي غير شرعيه ، كانواع الربا والقمار ، وما جري مجري ذلك من ساير صنوف الحيل ، وان ظهرت في غالب الحكم الشرعي مما يعلم الله ان متعاطيها انما يريد الحيله علي الربا ، حتي قال ابن جرير :حدثني ابن المثني ، حدثنا عبد الوهاب ، حدثنا داود ، عن عكرمه ، عن ابن عباس - في الرجل يشتري من الرجل الثوب فيقول : ان رضيته اخذته والا رددته ورددت معه درهما - قال : هو الذي قال الله عز وجل : ( ولا تاكلوا اموالكم بينكم بالباطل",
        "char_start": 0,
        "char_end": 5388,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_057_chunk00",
        "verse_key": "4:57",
        "text_ar": "وقوله : ( والذين امنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الانهار خالدين فيها ابدا ) هذا اخبار عن مال السعداء في جنات عدن ، التي تجري فيها الانهار في جميع فجاجها ومحالها وارجايها حيث شاووا واين ارادوا ، وهم خالدون فيها ابدا ، لا يحولون ولا يزولون ولا يبغون عنها حولا .وقوله : ( لهم فيها ازواج مطهره ) اي : من الحيض والنفاس والاذي . والاخلاق الرذيله ، والصفات الناقصه ، كما قال ابن عباس : مطهره من الاقذار والاذي . وكذا قال عطاء ، والحسن ، والضحاك ، والنخعي ، وابو صالح ، وعطيه ، والسدي .وقال ",
        "char_start": 0,
        "char_end": 940,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_122_chunk00",
        "verse_key": "4:122",
        "text_ar": "( والذين امنوا وعملوا الصالحات ) اي : صدقت قلوبهم وعملت جوارحهم بما امروا به من الخيرات ، وتركوا ما نهوا عنه من المنكرات ( سندخلهم جنات تجري من تحتها الانهار ) اي : يصرفونها حيث شاووا واين شاووا ( خالدين فيها ابدا ) اي : بلا زوال ولا انتقال ( وعد الله حقا ) اي : هذا وعد من الله ووعد الله معلوم حقيقه انه واقع لا محاله ، ولهذا اكده بالمصدر الدال علي تحقيق الخبر ، وهو قوله : ( حقا ) ثم قال ( ومن اصدق من الله قيلا ) اي : لا احد اصدق منه قولا وخبرا ، لا اله الا هو ، ولا رب سواه . وكان رسول الله صلي ا",
        "char_start": 0,
        "char_end": 676,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_012_chunk00",
        "verse_key": "5:12",
        "text_ar": "لما امر [ الله ] تعالي عباده المومنين بالوفاء بعهده وميثاقه ، الذي اخذه عليهم علي لسان عبده ورسوله محمد صلي الله عليه وسلم ، وامرهم بالقيام بالحق والشهاده بالعدل ، وذكرهم نعمه عليهم الظاهره والباطنه ، فيما هداهم له من الحق والهدي ، شرع يبين لهم كيف اخذ العهود والمواثيق علي من كان قبلهم من اهل الكتابين : اليهود والنصاري فلما نقضوا عهوده ومواثيقه اعقبهم ذلك لعنا منه لهم ، وطردا عن بابه وجنابه ، وحجابا لقلوبهم عن الوصول الي الهدي ودين الحق ، وهو العلم النافع والعمل الصالح ، فقال تعالي : ( ولقد اخذ ",
        "char_start": 0,
        "char_end": 4939,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_085_chunk00",
        "verse_key": "5:85",
        "text_ar": "ولهذا قال تعالي ههنا : ( فاثابهم الله بما قالوا جنات تجري من تحتها الانهار ) اي : فجازاهم علي ايمانهم وتصديقهم واعترافهم بالحق ( جنات تجري من تحتها الانهار خالدين فيها ) اي : ساكنين فيها ابدا ، لا يحولون ولا يزولون ( وذلك جزاء المحسنين ) اي : في اتباعهم الحق وانقيادهم له حيث كان ، واين كان ، ومع من كان .",
        "char_start": 0,
        "char_end": 305,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_119_chunk00",
        "verse_key": "5:119",
        "text_ar": "يقول تعالي مجيبا لعبده ورسوله عيسي ابن مريم فيما انهاه اليه من التبري من النصاري الملحدين ، الكاذبين علي الله وعلي رسوله ، ومن رد المشييه فيهم الي ربه ، عز وجل ، فعند ذلك يقول تعالي : ( هذا يوم ينفع الصادقين صدقهم )قال الضحاك ، عن ابن عباس يقول : يوم ينفع الموحدين توحيدهم .( لهم جنات تجري من تحتها الانهار خالدين فيها ابدا ) اي : ماكثين فيها لا يحولون ولا يزولون ، رضي الله عنهم ورضوا عنه ، كما قال تعالي : ( ورضوان من الله اكبر ) [ التوبه : 72 ] .وسياتي ما يتعلق بتلك الايه من الحديث .وقد روي ابن ا",
        "char_start": 0,
        "char_end": 1059,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_006_chunk00",
        "verse_key": "6:6",
        "text_ar": "ثم قال تعالي واعظا ومحذرا لهم ان يصيبهم من العذاب والنكال الدنيوي ما حل باشباههم ونظرايهم من القرون السالفه الذين كانوا اشد منهم قوه ، واكثر جمعا ، واكثر اموالا واولادا واستغلالا للارض وعماره لها ، فقال ( الم يروا كم اهلكنا من قبلهم من قرن مكناهم في الارض ما لم نمكن لكم ) اي : من الاموال والاولاد والاعمار ، والجاه العريض ، والسعه والجنود ( وارسلنا السماء عليهم مدرارا ) اي : شييا بعد شيء ( وجعلنا الانهار تجري من تحتهم ) اي : اكثرنا عليهم امطار السماء وينابيع الارض ، اي : استدراجا واملاء لهم ( فاه",
        "char_start": 0,
        "char_end": 916,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_043_chunk00",
        "verse_key": "7:43",
        "text_ar": "وقال السدي في قوله : ( ونزعنا ما في صدورهم من غل تجري من تحتهم الانهار ) الايه : ان اهل الجنه اذا سبقوا الي الجنه فبلغوا ، وجدوا عند بابها شجره في اصل ساقها عينان ، فشربوا من احداهما ، فينزع ما في صدورهم من غل ، فهو \" الشراب الطهور \" ، واغتسلوا من الاخري ، فجرت عليهم \" نضره النعيم \" فلم يشعثوا ولم يشحبوا بعدها ابدا .وقد روي ابو اسحاق ، عن عاصم ، عن امير المومنين علي بن ابي طالب نحوا من ذلك كما سياتي في قوله تعالي : ( وسيق الذين اتقوا ربهم الي الجنه زمرا ) [ الزمر : 73 ] ان شاء الله ، وبه الثقه و",
        "char_start": 0,
        "char_end": 1484,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_024_chunk00",
        "verse_key": "9:24",
        "text_ar": "ثم امر تعالي رسوله ان يتوعد من اثر اهله وقرابته وعشيرته علي الله وعلي رسوله وجهاد في سبيله ، فقال : ( قل ان كان اباوكم وابناوكم واخوانكم وازواجكم وعشيرتكم واموال اقترفتموها ) اي : اكتسبتموها وحصلتموها ( وتجاره تخشون كسادها ومساكن ترضونها ) اي : تحبونها لطيبها وحسنها ، اي : ان كانت هذه الاشياء ( احب اليكم من الله ورسوله وجهاد في سبيله فتربصوا ) اي : فانتظروا ماذا يحل بكم من عقابه ونكاله بكم ؛ ولهذا قال : ( حتي ياتي الله بامره والله لا يهدي القوم الفاسقين )وقال الامام احمد : حدثنا قتيبه بن سعيد ، ",
        "char_start": 0,
        "char_end": 1628,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_072_chunk00",
        "verse_key": "9:72",
        "text_ar": "يخبر تعالي بما اعده للمومنين به والمومنات من الخيرات والنعيم المقيم في ( جنات تجري من تحتها الانهار خالدين فيها ) اي : ماكثين فيها ابدا ، ( ومساكن طيبه ) اي : حسنه البناء ، طيبه القرار ، كما جاء في الصحيحين من حديث ابي عمران الجوني ، عن ابي بكر بن ابي موسي عبد الله بن قيس الاشعري ، عن ابيه قال : قال رسول الله - صلي الله عليه وسلم - : جنتان من ذهب انيتهما وما فيهما ، وجنتان من فضه انيتهما وما فيهما ، وما بين القوم وبين ان ينظروا الي ربهم الا رداء الكبرياء علي وجهه في جنه عدن .وبه قال : قال رسول ا",
        "char_start": 0,
        "char_end": 5179,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_089_chunk00",
        "verse_key": "9:89",
        "text_ar": "لما ذكر تعالي ذنب المنافقين وبين ثناءه علي المومنين وما لهم في اخرتهم فقال \" لكن الرسول والذين امنوا معه جاهدوا \" الي اخر الايتين من بيان حالهم ومالهم وقال \" واوليك لهم الخيرات \" اي في الدار الاخره في جنات الفردوس والدرجات العلي.",
        "char_start": 0,
        "char_end": 229,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "«وَبَشِّر» أخبر «الذين آمنوا» صَّدقوا بالله «وعملوا الصالحات» من الفروض والنوافل «أن» أي بأن «لهم جناتِ» حدائق ذات أشجار ومساكن «تجري من تحتها» أي تحت أشجارها وقصورها «الأنهار» أي المياه فيها، والنهر الموضع الذي يجري فيه الماء لأن الماء ينهره أي يحفره وإسناد الجري إليه مجاز «كلما رزقوا منها» أطعموا من تلك الجنات. «من ثمرة رزقاً قالوا هذا الذي» أي مثل ما «رزقنا من قبل» أي قبله في الجنة لتشابه ثمارها بقرينة «وأُتوا به» أي جيئوا بالرزق «متشابهاً» يشبه بعضه بعضا لونا ويختلف طعما «ولهم فيها أزواج» من",
        "char_start": 0,
        "char_end": 761,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "إن في خلق السماوات والأرض» وما فيهما من العجائب «واختلاف الليل والنهار» بالذهاب والمجيء والزيادة والنقصان «والفلك» السفن «التي تجري في البحر» ولا ترسب موقرة «بما ينفع الناس» من التجارات والحمل «وما أنزل الله من السماء من ماء» مطر «فأحيا به الأرض» بالنبات «بعد موتها» يبسها «وبث» فرق ونشربه «فيها من كل دابة» لأنهم ينمون بالخصب الكائن عنه «وتصريف الرياح» تقليبها جنوبا وشمالا حارة وباردة «والسحاب» الغيم «المسخَّر» المذلَّل بأمر الله تعالى يسير إلى حيث شاء الله «بين السماء والأرض» بلا علاقة «لآيات» د",
        "char_start": 0,
        "char_end": 547,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_266_chunk00",
        "verse_key": "2:266",
        "text_ar": "«أيَوَدُّ» أيحب «أحدكم أن تكون له جنة» بستان «من نخيل وأعناب تجري من تحتها الأنهار له فيها» ثمر «من كل الثمرات و» قد «أصابه الكبر» فضعف من الكبر عن الكسب «وله ذُرِّيةٌ ضعفاء» أولاد صغار لا يقدرون عليه «فأصابها إعصار» ريح شديدة «فيه نار فاحترقت» ففقدها أحوج ما كان إليها وبقي هو وأولاده عجزة متحيرين لا حيلة لهم وهذا تمثيل لنفقة المرائي والمانّ في ذهابها وعدم نفعها أحوج ما يكون إليها في الآخرة والاستفهام بمعنى النفي، وعن ابن عباس هو الرجل عمل بالطاعات ثم بعث له الشيطان فعمل بالمعاصي حتى أحرق أعماله",
        "char_start": 0,
        "char_end": 569,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_282_chunk00",
        "verse_key": "2:282",
        "text_ar": "«يا أيها الذين آمنوا إذا تداينتم» تعاملتم «بدين» كسلم وقرض «إلى أجل مسمى» معلوم «فاكتبوه» استيثاقا ودفعا للنزاع «وليكتب» كتاب الدين «بينكم كاتب بالعدل» بالحق في كتابته لا يزيد في المال والأجل ولا ينقص «ولا يأب» يمتنع «كاتب» من «أن يكتب» إذا دُعي إليها «كما علَّمه الله» أي فضله بالكتابة فلا يبخل بها والكاف متعلقة بيأب «فليكتب» تأكيد «وليملل» على الكاتب «الذي عليه الحق» الدين لأنه المشهود عليه فيقر ليعلم ما عليه «وليتق الله ربه» في إملائه «ولا يبخس» ينقص «منه» أي الحق «شيئا فإن كان الذي عليه الحق ",
        "char_start": 0,
        "char_end": 2023,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_015_chunk00",
        "verse_key": "3:15",
        "text_ar": "«قل» يا محمد لقومك «أؤنبِّئكم» أخبركم «بخير من ذلكم» المذكور من الشهوات استفهام تقرير «للذين اتقوا» الشرك «عند ربهم» خبر مبتدأُه «جنات تجري من تحتها الأنهار خالدين» أي مقدرين الخلود «فيها» إذا دخلوها «وأزواج مطهرة» من الحيض وغيره مما يستقذر «ورضوان» بكسر أوله وضمه لغتان أي رضا كثير «من الله والله بصير» عالم «بالعباد» فيجازي كلاً منهم بعمله.",
        "char_start": 0,
        "char_end": 342,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_136_chunk00",
        "verse_key": "3:136",
        "text_ar": "«أولئك جزاؤهم مغفرة من ربهم وجنات تجري من تحتها الأنهار خالدين فيها» حال مقدرة، أي مقدرين الخلود فيها إذا دخلوها «ونعم أجر العاملين» بالطاعة هذا الأجر.",
        "char_start": 0,
        "char_end": 151,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_195_chunk00",
        "verse_key": "3:195",
        "text_ar": "«فاستجاب لهم ربهم» دعاءهم «أنِّي» أي بأني «لا أضيع عمل عامل منكم من ذكر أو أنثى بعضكم» كائن «من بعض» أي الذكور من الإناث وبالعكس والجملة مؤكدة لما قبلها أي هم سواء في المجازاة بالأعمال وترك تضييعها، نزلت لما قالت أم سلمة يا رسول الله إني لا أسمع ذكر النساء في الهجرة بشيء «فالذين هاجروا» من مكة إلى المدينة «وأخرجوا من ديارهم وأوذوا في سبيلي» ديني «وقاتلوا» الكفار «وَقُتِلُوا» بالتخفيف والتشديد وفي قراءة بتقديمه «لأكفِّرنَّ عنهم سيئاتهم» أسترها بالمغفرة «ولأدخلنهم جنات تجري من تحتها الأنهار ثوابا»",
        "char_start": 0,
        "char_end": 595,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_198_chunk00",
        "verse_key": "3:198",
        "text_ar": "«لكن الذين اتقوا ربَّهم لهم جنات تجري من تحتها الأنهار خالدين» أي مقدرين بالخلود «فيها نُزُلا» وهو ما يعد للضيف ونصبه على الحال من جَنَّاتٍ والعامل فيها معنى الظرف «من عند الله وما عند الله» من الثواب «خير للأبرار» من متاع الدنيا.",
        "char_start": 0,
        "char_end": 230,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_013_chunk00",
        "verse_key": "4:13",
        "text_ar": "«تلك» الأحكام المذكورة من أمر اليتامى وما بعده «حدود الله» شرائعه التي حدَّها لعباده ليعملوا بها ولا يتعدوها «ومن يطع الله ورسوله» فيما حكم به «يدخله» بالياء والنون التفاتا «جنات تجري من تحتها الأنهار خالدين فيها وذلك الفوز العظيم».",
        "char_start": 0,
        "char_end": 232,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_029_chunk00",
        "verse_key": "4:29",
        "text_ar": "«يا أيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل» بالحرام في الشرع كالربا والغصب «إلا» لكن «أن تكون» تقع «تجارة» وفي قراءة بالنصب أن تكون الأموال أموال تجارة صادرة «عن تراضى منكم» وطيب نفس فلكم أن تأكلوها «ولا تقتلوا أنفسكم» بارتكاب ما يؤدي إلى هلاكها أيّا كان في الدنيا أو الآخرة بقرينة «إن الله كان بكم رحيما» في منعه لكم من ذلك.",
        "char_start": 0,
        "char_end": 335,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_057_chunk00",
        "verse_key": "4:57",
        "text_ar": "«والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدا لهم فيها أزواج مطهرة» من الحيض وكل قذر «وندخلهم ظلا ظليلا» دائما لا تنسخه شمس وهو ظل الجنة,",
        "char_start": 0,
        "char_end": 173,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_122_chunk00",
        "verse_key": "4:122",
        "text_ar": "«والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدا وعد الله حقا» أي وعدهم الله ذلك وحقه حقا «ومن» أي لا أحد «أصدق من الله قيلا» أي قولا.",
        "char_start": 0,
        "char_end": 167,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_012_chunk00",
        "verse_key": "5:12",
        "text_ar": "«ولقد أخذ الله ميثاق بني إسرائيل» بما يذكر بعد «وبعثنا» فيه التفات عن الغيبة أقمنا «منهم اثني عشر نقيبا» من كل سبط نقيب يكون كفيلا على قومه بالوفاء بالعهد توثقة عليهم «وقال» لهم «الله إنِّي معكم» بالعون والنصرة «لئن» لام قسم «أقمتم الصلاة وآتيتم الزكاة وآمنتم برسلي وعزَّرتموهم» نصرتموهم «وأقرضتم الله قرضا حسنا» بالإنفاق في سبيله «لأكفرنَّ عنكم سيئآتكم ولأدخلنكم جنات تجري من تحتها الأنهار فمن كفر بعد ذلك» الميثاق «منكم فقد ضل سواء السبيل» أخطأ طريق الحق. والسواء في الأصل الوسط فنقضوا الميثاق قال ",
        "char_start": 0,
        "char_end": 506,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_085_chunk00",
        "verse_key": "5:85",
        "text_ar": "«فأثابهم الله بما قالوا جنات تجري من تحتها الأنهار خالدين فيها وذلك جزاء المحسنين» بالإيمان.",
        "char_start": 0,
        "char_end": 92,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_119_chunk00",
        "verse_key": "5:119",
        "text_ar": "«قال الله هذا» أي يوم القيامة «يوم ينفع الصادقين» في الدنيا كعيسى «صدقهم» لأنه يوم الجزاء «لهم جنات تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم» بطاعته «ورضوا عنه» بثوابه «ذلك الفوز العظيم» ولا ينفع الكاذبين في الدنيا صدقهم فيه كالكفار لما يؤمنون عند رؤية العذاب.",
        "char_start": 0,
        "char_end": 272,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_006_chunk00",
        "verse_key": "6:6",
        "text_ar": "«ألم يروا» في أسفارهم إلى الشام وغيرها «كم» خبرية بمعنى كثيرا «أهلكنا من قبلهم من قرن» أمة من الأمم الماضية «مكَّناهم» أعطيناهم مكانا «في الأرض» بالقوة والسعة «ما لم نمكن» نعط «لكم» فيه التفات عن الغيبة «وأرسلنا السماء» المطر «عليهم مدرارا» متتابعا «وجعلنا الأنهار تجري من تحتهم» تحت مساكنهم «فأهلكناهم بذنوبهم» بتكذيبهم الأنبياء «وأنشأنا من بعدهم قرنا آخرين».",
        "char_start": 0,
        "char_end": 360,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_043_chunk00",
        "verse_key": "7:43",
        "text_ar": "«ونزعنا ما في صدورهم من غل» حقد كان بينهم في الدنيا «تجري من تحتهم» تحت قصورهم «الأنهار وقالوا» عند الاستقرار في منازلهم «الحمد لله الذي هدانا لهذا» العمل الذي هذا جزاؤه «وما كنا لنهتدي لولا أن هدانا الله» حذف جواب لولا لدلالة ما قبله عليه «لقد جاءت رسل ربنا بالحق ونودوا أن» مخففة أي أنه أو مفسرة في المواضع الخمسة «تلكم الجنة أورثتموها بما كنتم تعملون».",
        "char_start": 0,
        "char_end": 355,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_024_chunk00",
        "verse_key": "9:24",
        "text_ar": "«قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم وعشيرتكم» أقرباؤكم وفي قراءة عشيرتكم «وأموال اقترفتموها» اكتسبتموها «وتجارة تخشون كسادها» عدم نفادها «ومساكن ترضونها أحبَّ إليكم من الله ورسوله وجهادِ في سبيله» فقعدتم لأجله عن الهجرة والجهاد «فتربَّصوا» انتظروا «حتى يأتي الله بأمره» تهديد لهم «والله لا يهدي القوم الفاسقين».",
        "char_start": 0,
        "char_end": 320,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_072_chunk00",
        "verse_key": "9:72",
        "text_ar": "«وعد الله المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ومساكن طيبة في جنات عدن» إقامة «ورضوانُُ من الله أكبر» أعظم من ذلك كله «ذلك هو الفوز العظيم».",
        "char_start": 0,
        "char_end": 161,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_089_chunk00",
        "verse_key": "9:89",
        "text_ar": "«أعد الله لهم جنات تجري من تحتها الأنهار خالدين فيها ذلك الفوز العظيم».",
        "char_start": 0,
        "char_end": 71,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "واخبر -ايها الرسول- اهل الايمان والعمل الصالح خبرًا يملوهم سرورًا، بان لهم في الاخره حدايق عجيبه، تجري الانهار تحت قصورها العاليه واشجارها الظليله. كلَّما رزقهم الله فيها نوعًا من الفاكهه اللذيذه قالوا: قد رَزَقَنا الله هذا النوع من قبل، فاذا ذاقوه وجدوه شييًا جديدًا في طعمه ولذته، وان تشابه مع سابقه في اللون والمنظر والاسم. ولهم في الجنَّات زوجات مطهَّرات من كل الوان الدنس الحسيِّ كالبول والحيض، والمعنوي كالكذب وسوء الخُلُق. وهم في الجنه ونعيمها دايمون، لا يموتون فيها ولا يخرجون منها.",
        "char_start": 0,
        "char_end": 490,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "إن في خلق السماوات بارتفاعها واتساعها، والأرض بجبالها وسهولها وبحارها، وفي اختلاف الليل والنهار من الطول والقصر، والظلمة والنور، وتعاقبهما بأن يخلف كل منهما الآخر، وفي السفن الجارية في البحار، التي تحمل ما ينفع الناس، وما أنزل الله من السماء من ماء المطر، فأحيا به الأرض، فصارت مخضرَّة ذات بهجة بعد أن كانت يابسة لا نبات فيها، وما نشره الله فيها من كل ما دبَّ على وجه الأرض، وما أنعم به عليكم من تقليب الرياح وتوجيهها، والسحاب المُسيَّر بين السماء والأرض، إن في كل الدلائل السابقة لآياتٍ على وحدانية ",
        "char_start": 0,
        "char_end": 601,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_266_chunk00",
        "verse_key": "2:266",
        "text_ar": "أيرغب الواحد منكم أن يكون له بستان فيه النخيل والأعناب، تجري من تحت أشجارِه المياه العذبة، وله فيه من كل ألوان الثمرات، وقد بلغ الكِبَر، ولا يستطيع أن يغرس مثل هذا الغرس، وله أولاد صغار في حاجة إلى هذا البستان وفي هذه الحالة هبَّت عليه ريح شديدة، فيها نار محرقة فأحرقته; وهكذا حال غير المخلصين في نفقاتهم، يأتون يوم القيامة ولا حسنة لهم. وبمثل هذا البيان يبيِّن الله لكم ما ينفعكم; كي تتأملوا، فتخلصوا نفقاتكم لله.",
        "char_start": 0,
        "char_end": 414,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_282_chunk00",
        "verse_key": "2:282",
        "text_ar": "يا من آمنتم بالله واتبعتم رسوله محمدًا صلى الله عليه وسلم إذا تعاملتم بدَيْن إلى وقت معلوم فاكتبوه; حفظًا للمال ودفعًا للنزاع. ولْيقُم بالكتابة رجل أمين ضابط، ولا يمتنع مَن علَّمه الله الكتابة عن ذلك، ولْيقم المدين بإملاء ما عليه من الدَّيْن، وليراقب ربه، ولا ينقص من دينه شيئا. فإن كان المدين محجورًا عليه لتبذيره وإسرافه، أو كان صغيرًا أو مجنونًا، أو لا يستطيع النطق لخرس به أو عدم قدرة كاملة على الكلام، فليتولَّ الإملاء عن المدين القائم بأمره، واطلبوا شهادة رجلين مسلمَيْن بالِغَيْن عاقلَيْن من أ",
        "char_start": 0,
        "char_end": 1451,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_015_chunk00",
        "verse_key": "3:15",
        "text_ar": "قل -ايها الرسول-: ااخبركم بخير مما زُيِّن للنَّاس في هذه الحياه الدنيا، لمن راقب الله وخاف عقابه جنات تجري من تحت قصورها واشجارها الانهار، خالدين فيها، ولهم فيها ازواج مطهرات من الحيض والنفاس وسوء الخلق، ولهم اعظم من ذلك: رضوان من الله. والله مطَّلِع علي سراير خلقه، عالم باحوالهم، وسيجازيهم علي ذلك.",
        "char_start": 0,
        "char_end": 300,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_136_chunk00",
        "verse_key": "3:136",
        "text_ar": "أولئك الموصوفون بتلك الصفات العظيمة جزاؤهم أن يستر الله ذنوبهم، ولهم جنات تجري من تحت أشجارها وقصورها المياه العذبة، خالدين فيها لا يخرجون منها أبدًا. ونِعْمَ أجر العاملين المغفرة والجنة.",
        "char_start": 0,
        "char_end": 187,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_195_chunk00",
        "verse_key": "3:195",
        "text_ar": "فأجاب الله دعاءهم بأنه لا يضيع جهد مَن عمل منهم عملا صالحًا ذكرًا كان أو أنثى، وهم في أُخُوَّة الدين وقَبول الأعمال والجزاء عليها سواء، فالذين هاجروا رغبةً في رضا الله تعالى، وأُخرجوا من ديارهم، وأوذوا في طاعة ربهم وعبادتهم إيّاه، وقاتلوا وقُتِلوا في سبيل الله لإعلاء كلمته، ليسترنَّ الله عليهم ما ارتكبوه من المعاصي، كما سترها عليهم في الدنيا، فلا يحاسبهم عليها، وليدخلنَّهم جنات تجري من تحت قصورها وأشجارها الأنهار جزاء من عند الله، والله عنده حسن الثواب.",
        "char_start": 0,
        "char_end": 457,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_198_chunk00",
        "verse_key": "3:198",
        "text_ar": "لكن الذين خافوا ربهم، وامتثلوا أوامره، واجتنبوا نواهيه، قد أعدَّ الله لهم جنات تجري من تحت أشجارها الأنهار، هي منزلهم الدائم لا يخرجون منه. وما عد الله أعظم وأفضل لأهل الطاعة مما يتقلب فيه الذين كفروا من نعيم الدنيا.",
        "char_start": 0,
        "char_end": 216,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_013_chunk00",
        "verse_key": "4:13",
        "text_ar": "تلك الأحكام الإلهية التي شرعها الله في اليتامى والنساء والمواريث، شرائعه الدالة على أنها مِن عند الله العليم الحكيم. ومَن يطع الله ورسوله فيما شرع لعباده من هذه الأحكام وغيرها، يدخله جنات كثيرة الأشجار والقصور، تجري من تحتها الأنهار بمياهها العذبة، وهم باقون في هذا النعيم، لا يخرجون منه، وذلك الثواب هو الفلاح العظيم.",
        "char_start": 0,
        "char_end": 318,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_029_chunk00",
        "verse_key": "4:29",
        "text_ar": "يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، لا يحل لكم أن يأكل بعضكم مال بعض بغير حق، إلا أن يكون وَفْقَ الشرع والكسب الحلال عن تراض منكم، ولا يقتل بعضكم بعضًا فتهلكوا أنفسكم بارتكاب محارم الله ومعاصيه. إن الله كان بكم رحيمًا في كل ما أمركم به، ونهاكم عنه.",
        "char_start": 0,
        "char_end": 260,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_057_chunk00",
        "verse_key": "4:57",
        "text_ar": "والذين اطمأنت قلوبهم بالإيمان بالله تعالى والتصديق برسالة رسوله محمد صلى الله عليه وسلم، واستقاموا على الطاعة، سندخلهم جنات تجري من تحتها الأنهار، ينعمون فيها أبدًا ولا يخرجون منها، ولهم فيها أزواج طهرها الله مِن كل أذى، وندخلهم ظلا كثيفًا ممتدًا في الجنة.",
        "char_start": 0,
        "char_end": 256,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_122_chunk00",
        "verse_key": "4:122",
        "text_ar": "والذين صَدَقوا في إيمانهم بالله تعالى، وأتبعوا الإيمان بالأعمال الصالحة سيدخلهم الله -بفضله- جنات تجري من نحت أشجارها الأنهار ماكثين فيها أبدًا، وعدا من الله تعالى الذي لا يخلف وعده. ولا أحد أصدق من الله تعالى في قوله ووعده.",
        "char_start": 0,
        "char_end": 224,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_012_chunk00",
        "verse_key": "5:12",
        "text_ar": "ولقد اخذ الله العهد الموكَّد علي بني اسراييل ان يخلصوا له العباده وحده، وامر الله موسي ان يجعل عليهم اثني عشر عريفًا بعدد فروعهم، ياخذون عليهم العهد بالسمع والطاعه لله ولرسوله ولكتابه، وقال الله لبني اسراييل: اني معكم بحفظي ونصري، لين اقمتم الصلاه، واعطيتم الزكاه المفروضه مستحقيها، وصدَّقتم برسلي فيما اخبروكم به ونصرتموهم، وانفقتم في سبيلي، لاكفِّرنَّ عنكم سيياتكم، ولادْخِلَنَّكُم جناتٍ تجري من تحت قصورها واشجارها الانهار، فمن جحد هذا الميثاق منكم فقد عدل عن طريق الحق الي طريق الضلال.",
        "char_start": 0,
        "char_end": 489,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_085_chunk00",
        "verse_key": "5:85",
        "text_ar": "فجزاهم الله بما قالوا من الاعتزاز بإيمانهم بالإسلام، وطلبهم أن يكونوا مع القوم الصالحين، جنات تجري من تحت قصورها وأشجارها الأنهار، ماكثين فيها لا يخرجون منها، ولا يُحوَّلون عنها، وذلك جزاء إحسانهم في القول والعمل.",
        "char_start": 0,
        "char_end": 213,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_119_chunk00",
        "verse_key": "5:119",
        "text_ar": "قال الله تعالي لعيسي عليه السلام يوم القيامه: هذا يوم الجزاء الذي ينفع الموحدين توحيدهم ربهم، وانقيادهم لشرعه، وصدقهم في نياتهم واقوالهم واعمالهم، لهم جنات تجري من تحت قصورها واشجارها الانهار، ماكثين فيها ابدًا، رضي الله عنهم فقبل حسناتهم، ورضوا عنه بما اعطاهم من جزيل ثوابه. ذلك الجزاء والرضا منه عليهم هو الفوز العظيم.",
        "char_start": 0,
        "char_end": 320,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_006_chunk00",
        "verse_key": "6:6",
        "text_ar": "ألم يعلم هؤلاء الذين يجحدون وحدانية الله تعالى واستحقاقه وحده العبادة، ويكذبون رسوله محمدًا صلى الله عليه وسلم ما حلَّ بالأمم المكذبة قبلهم من هلاك وتدمير، وقد مكنَّاهم في الأرض ما لم نمكن لكم أيها الكافرون، وأنعمنا عليهم بإنزال الأمطار وجريان الأنهار من تحت مساكنهم؛ استدراجًا وإملاءً لهم، فكفروا بنعم الله وكذبوا الرسل، فأهلكناهم بسبب ذنونهم، وأنشأنا من بعدهم أممًا أخرى خلفوهم في عمارة الأرض؟",
        "char_start": 0,
        "char_end": 395,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_043_chunk00",
        "verse_key": "7:43",
        "text_ar": "واذهب الله تعالي ما في صدور اهل الجنه من حقد وضغاين، ومن كمال نعيمهم ان الانهار تجري في الجنه من تحت غرفهم ومنازلهم. وقال اهل الجنه حينما دخلوها: الحمد لله الذي وفَّقنا للعمل الصالح الذي اكسبنا ما نحن فيه من النعيم، وما كنا لنوفَّق الي سلوك الطريق المستقيم لولا اَنْ هدانا الله سبحانه لسلوك هذا الطريق، ووفَّقنا للثبات عليه، لقد جاءت رسل ربنا بالحق من الاخبار بوعد اهل طاعته ووعيد اهل معصيته، ونُودوا تهنيه لهم واكرامًا: ان تلكم الجنه اورثكم الله اياها برحمته، وبما قدَّمتموه من الايمان والعمل الصالح",
        "char_start": 0,
        "char_end": 501,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_024_chunk00",
        "verse_key": "9:24",
        "text_ar": "قل -يا ايها الرسول- للمومنين: ان فَضَّلتم الاباء والابناء والاخوان والزوجات والقرابات والاموال التي جمعتموها والتجاره التي تخافون عدم رواجها والبيوت الفارهه التي اقمتم فيها، ان فَضَّلتم ذلك علي حب الله ورسوله والجهاد في سبيله فانتظروا عقاب الله ونكاله بكم. والله لا يوفق الخارجين عن طاعته.",
        "char_start": 0,
        "char_end": 289,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_072_chunk00",
        "verse_key": "9:72",
        "text_ar": "وعد الله المؤمنين والمؤمنات بالله ورسوله جنات تجري من تحت قصورها وأشجارها الأنهار ماكثين فيها أبدًا، لا يزول عنهم نعيمها، ومساكن حسنة البناء طيبة القرار في جنات إقامة، ورضوان من الله أكبر وأعظم مما هم فيه من النعيم. ذلك الوعد بثواب الآخرة هو الفلاح العظيم.",
        "char_start": 0,
        "char_end": 256,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_089_chunk00",
        "verse_key": "9:89",
        "text_ar": "أعدَّ الله لهم يوم القيامة جنات تجري مِن تحت قصورها وأشجارها الأنهار ماكثين فيها أبدًا. وذلك هو الفلاح العظيم.",
        "char_start": 0,
        "char_end": 110,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "قوله تعالى : وبشر الذين آمنوا وعملوا الصالحات أن لهم جنات تجري من تحتها الأنهار كلما رزقوا منها من ثمرة رزقا قالوا هذا الذي رزقنا من قبل وأتوا به متشابها ولهم فيها أزواج مطهرة وهم فيها خالدون قوله تعالى : وبشر الذين آمنوا فيه ثلاث مسائل :الأولى : لما ذكر الله عز وجل جزاء الكافرين ذكر جزاء المؤمنين أيضا . والتبشير الإخبار بما يظهر أثره على البشرة - وهي ظاهر الجلد - لتغيرها بأول خبر يرد عليك ، ثم الغالب أن يستعمل في السرور مقيدا بالخير المبشر به ، وغير مقيد أيضا . ولا يستعمل في الغم والشر إلا مقيد",
        "char_start": 0,
        "char_end": 5273,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "قوله تعالى : إن في خلق السماوات والأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس وما أنزل الله من السماء من ماء فأحيا به الأرض بعد موتها وبث فيها من كل دابة وتصريف الرياح والسحاب المسخر بين السماء والأرض لآيات لقوم يعقلون فيه أربع عشرة مسألة :الأولى : قال عطاء : لما نزلت وإلهكم إله واحد قالت كفار قريش : كيف يسع الناس إله واحد ، فنزلت إن في خلق السماوات والأرض . ورواه سفيان عن أبيه عن أبي الضحى قال : لما نزلت وإلهكم إله واحد قالوا هل من دليل على ذلك ؟ فأنزل الله تعالى إن في خ",
        "char_start": 0,
        "char_end": 18648,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_266_chunk00",
        "verse_key": "2:266",
        "text_ar": "قوله تعالى : أيود أحدكم أن تكون له جنة من نخيل وأعناب تجري من تحتها الأنهار له فيها من كل الثمرات وأصابه الكبر وله ذرية ضعفاء فأصابها إعصار فيه نار فاحترقت كذلك يبين الله لكم الآيات لعلكم تتفكرونقوله تعالى : أيود أحدكم أن تكون له جنة من نخيل وأعناب الآية . حكى الطبري عن السدي أن هذه الآية مثل آخر لنفقة الرياء ، ورجح هو هذا القول .قلت : وروي عن ابن عباس أيضا قال : هذا مثل ضربه الله للمرائين بالأعمال يبطلها يوم القيامة أحوج ما كان إليها ، كمثل رجل كانت له جنة وله أطفال لا ينفعونه فكبر وأصاب الجنة ",
        "char_start": 0,
        "char_end": 4076,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_282_chunk00",
        "verse_key": "2:282",
        "text_ar": "يا أيها الذين آمنوا إذا تداينتم بدين إلى أجل مسمى فاكتبوه وليكتب بينكم كاتب بالعدل ولا يأب كاتب أن يكتب كما علمه الله فليكتب وليملل الذي عليه الحق وليتق الله ربه ولا يبخس منه شيئا فإن كان الذي عليه الحق سفيها أو ضعيفا أو لا يستطيع أن يمل هو فليملل وليه بالعدل واستشهدوا شهيدين من رجالكم فإن لم يكونا رجلين فرجل وامرأتان ممن ترضون من الشهداء أن تضل إحداهما فتذكر إحداهما الأخرى ولا يأب الشهداء إذا ما دعوا ولا تسأموا أن تكتبوه صغيرا أو كبيرا إلى أجله ذلكم أقسط عند الله وأقوم للشهادة وأدنى ألا ترتابوا",
        "char_start": 0,
        "char_end": 37063,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_015_chunk00",
        "verse_key": "3:15",
        "text_ar": "قوله تعالى : قل أؤنبئكم بخير من ذلكم للذين اتقوا عند ربهم جنات تجري من تحتها الأنهار خالدين فيها وأزواج مطهرة ورضوان من الله والله بصير بالعبادمنتهى الاستفهام عند قوله : من ذلكم ، للذين اتقوا خبر مقدم ، وجنات رفع بالابتداء . وقيل : منتهاه عند ربهم ، وجنات على هذا رفع بابتداء مضمر تقديره ذلك جنات . ويجوز على هذا التأويل : \" جنات \" بالخفض بدلا من \" خير \" ولا يجوز ذلك على الأول . قال ابن عطية : وهذه الآية والتي قبلها نظير قوله ، عليه السلام : تنكح المرأة لأربع : لمالها وحسبها وجمالها ودينها ، فاظفر",
        "char_start": 0,
        "char_end": 957,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_136_chunk00",
        "verse_key": "3:136",
        "text_ar": "قوله تعالى : أولئك جزاؤهم مغفرة من ربهم وجنات تجري من تحتها الأنهار خالدين فيها ونعم أجر العاملينرتب تعالى بفضله وكرمه غفران الذنوب لمن أخلص في توبته ولم يصر على ذنبه . ويمكن أن يتصل هذا بقصة أحد ، أي من فر ثم تاب ولم يصر فله مغفرة الله .",
        "char_start": 0,
        "char_end": 238,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_195_chunk00",
        "verse_key": "3:195",
        "text_ar": "فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ أَوْ أُنْثَى أي أجابهم .قال الحسن : ما زالوا يقولون ربنا ربنا حتى استجاب لهم .وقال جعفر الصادق : من حزبه أمر فقال خمس مرات ربنا أنجاه الله مما يخاف وأعطاه ما أراد .قيل : وكيف ذلك ؟ قال : اقرءوا إن شئتم \" الذين يذكرون الله قياما وقعودا وعلى جنوبهم \" إلى قوله : \" إنك لا تخلف الميعاد \" [ آل عمران : 191 - 194 ] .\" أني \" أي بأني .وقرأ عيسى بن عمر \" إني \" بكسر الهمزة , أي فقال : إني .وروى الحاكم أبو عبد الله في صحيحه ",
        "char_start": 0,
        "char_end": 2225,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_198_chunk00",
        "verse_key": "3:198",
        "text_ar": "لَكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا استدراك بعد كلام تقدم فيه معنى النفي ; لأن معنى ما تقدم ليس لهم في تقلبهم في البلاد كبير الانتفاع , لكن المتقون لهم الانتفاع الكبير والخلد الدائم .فموضع \" لكن \" رفع بالابتداء .وقرأ يزيد بن القعقاع \" لكن \" بتشديد النون . نُزُلًا مِنْ عِنْدِ اللَّهِ نزلا مثل ثوابا عند البصريين , وعند الكسائي يكون مصدرا .الفراء : هو مفسر .وقرأ الحسن والنخعي \" نزلا \" بتخفيف الزاي استثقالا لضمتين , وثقله الباقون",
        "char_start": 0,
        "char_end": 1529,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_013_chunk00",
        "verse_key": "4:13",
        "text_ar": "قوله : تلك حدود الله ومن يطع الله ورسوله يدخله جنات تجري من تحتها الأنهار خالدين فيها وذلك الفوز العظيمقوله تعالى : تلك حدود الله وتلك بمعنى هذه ، أي هذه أحكام الله قد بينها لكم لتعرفوها وتعملوا بها .ومن يطع الله ورسوله في قسمة المواريث فيقر بها ويعمل بها كما أمره الله تعالى يدخله جنات تجري من تحتها الأنهار جملة في موضع نصب على النعت لجنات",
        "char_start": 0,
        "char_end": 341,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_029_chunk00",
        "verse_key": "4:29",
        "text_ar": "قوله تعالى : ياأيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم ولا تقتلوا أنفسكم إن الله كان بكم رحيمافيه تسع مسائل :الأولى : قوله تعالى : بالباطل أي بغير حق . ووجوه ذلك تكثر على ما بيناه ؛ وقد قدمنا معناه في البقرة . ومن أكل المال بالباطل بيع العربان ؛ وهو أن يأخذ منك السلعة أو يكتري منك الدابة ويعطيك درهما فما فوقه ، على أنه إن اشتراها أو ركب الدابة فهو من ثمن السلعة أو كراء الدابة ؛ وإن ترك ابتياع السلعة أو كراء الدابة فما أعطاك فهو لك . فهذا لا يصلح ولا يجوز ع",
        "char_start": 0,
        "char_end": 12059,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_057_chunk00",
        "verse_key": "4:57",
        "text_ar": "وقوله في صفة أهل الجنة وندخلهم ظلا ظليلا يعني كثيفا لا شمس فيه . الحسن : وصف بأنه ظليل ؛ لأنه لا يدخله ما يدخل ظل الدنيا من الحر والسموم ونحو ذلك . وقال الضحاك : يعني ظلال الأشجار وظلال قصورها الكلبي : ظلا ظليلا يعني دائما .",
        "char_start": 0,
        "char_end": 224,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_122_chunk00",
        "verse_key": "4:122",
        "text_ar": "ومن أصدق من الله قيلا ابتداء وخبر . ( قيلا ) على البيان ؛ قال قيلا وقولا وقالا ، بمعنى أي لا أحد أصدق من الله . وقد مضى الكلام على ما تضمنته هذه الآي من المعاني والحمد لله .",
        "char_start": 0,
        "char_end": 173,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_012_chunk00",
        "verse_key": "5:12",
        "text_ar": "قوله تعالى : ولقد أخذ الله ميثاق بني إسرائيل وبعثنا منهم اثني عشر نقيبا وقال الله إني معكم لئن أقمتم الصلاة وآتيتم الزكاة وآمنتم برسلي وعزرتموهم وأقرضتم الله قرضا حسنا لأكفرن عنكم سيئاتكم ولأدخلنكم جنات تجري من تحتها الأنهار فمن كفر بعد ذلك منكم فقد ضل سواء السبيلقوله تعالى : ولقد أخذ الله ميثاق بني إسرائيل وبعثنا منهم اثني عشر نقيبا فيه ثلاث مسائل :الأولى : قال ابن عطية : هذه الآيات المتضمنة الخبر عن نقضهم مواثيق الله تعالى تقوي أن الآية المتقدمة في كف الأيدي إنما كانت في بني النضير ، واختلف أه",
        "char_start": 0,
        "char_end": 4215,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_085_chunk00",
        "verse_key": "5:85",
        "text_ar": "قوله تعالى : فأثابهم الله بما قالوا جنات تجري من تحتها الأنهار خالدين فيها وذلك جزاء المحسنينقوله تعالى : فأثابهم الله بما قالوا جنات دليل على إخلاص إيمانهم وصدق مقالهم ; فأجاب الله سؤالهم وحقق طمعهم - وهكذا من خلص إيمانه وصدق يقينه يكون ثوابه الجنة .",
        "char_start": 0,
        "char_end": 251,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_119_chunk00",
        "verse_key": "5:119",
        "text_ar": "قوله تعالى : قال الله هذا يوم ينفع الصادقين صدقهم لهم جنات تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك الفوز العظيمقوله تعالى : قال الله هذا يوم ينفع الصادقين صدقهم أي : صدقهم في الدنيا فأما في [ ص: 293 ] الآخرة فلا ينفع فيها الصدق ، وصدقهم في الدنيا يحتمل أن يكون صدقهم في العمل لله ، ويحتمل أن يكون تركهم الكذب عليه وعلى رسله ، وإنما ينفعهم الصدق في ذلك اليوم وإن كان نافعا في كل الأيام لوقوع الجزاء فيه ، وقيل : المراد صدقهم في الآخرة وذلك في الشهادة لأنبيائهم بالبلاغ ، وفي",
        "char_start": 0,
        "char_end": 2295,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_006_chunk00",
        "verse_key": "6:6",
        "text_ar": "قوله تعالى : ألم يروا كم أهلكنا من قبلهم من قرن مكناهم في الأرض ما لم نمكن لكم وأرسلنا السماء عليهم مدرارا وجعلنا الأنهار تجري من تحتهم فأهلكناهم بذنوبهم وأنشأنا من بعدهم قرنا آخرينقوله تعالى : ألم يروا كم أهلكنا من قبلهم من قرن كم في موضع نصب بأهلكنا لا بقوله ألم يروا لأن لفظ الاستفهام لا يعمل فيه ما قبله ، وإنما يعمل فيه ما بعده ، من [ ص: 303 ] أجل أن له صدر الكلام . والمعنى : ألا يعتبرون بمن أهلكنا من الأمم قبلهم لتكذيبهم أنبياءهم ، أي ألم يعرفوا ذلك ، والقرن الأمة من الناس . والجمع القرون ; ",
        "char_start": 0,
        "char_end": 2146,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_043_chunk00",
        "verse_key": "7:43",
        "text_ar": "قوله تعالى ونزعنا ما في صدورهم من غل تجري من تحتهم الأنهار وقالوا الحمد لله الذي هدانا لهذا وما كنا لنهتدي لولا أن هدانا الله لقد جاءت رسل ربنا بالحق ونودوا أن تلكم الجنة أورثتموها بما كنتم تعملونذكر الله عز وجل فيما ينعم به على أهل الجنة نزع الغل من صدورهم . والنزع : الاستخراج . والغل : الحقد الكامن في الصدر . والجمع غلال . أي أذهبنا في الجنة ما كان في قلوبهم من الغل في الدنيا . قال النبي صلى الله عليه وسلم : الغل على باب الجنة كمبارك الإبل قد نزعه الله من قلوب المؤمنين . وروي عن علي رضي الله ع",
        "char_start": 0,
        "char_end": 2265,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_024_chunk00",
        "verse_key": "9:24",
        "text_ar": "قوله تعالى قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم وعشيرتكم وأموال اقترفتموها وتجارة تخشون كسادها ومساكن ترضونها أحب إليكم من الله ورسوله وجهاد في سبيله فتربصوا حتى يأتي الله بأمره والله لا يهدي القوم الفاسقينلما أمر رسول الله صلى الله عليه وسلم بالهجرة من مكة إلى المدينة جعل الرجل يقول لأبيه والأب لابنه والأخ لأخيه والرجل لزوجته : إنا قد أمرنا بالهجرة ، فمنهم من تسارع لذلك ، ومنهم من أبى أن يهاجر ، فيقول : والله لئن لم تخرجوا إلى دار الهجرة لا أنفعكم ولا أنفق عليكم شيئا أبدا . ومنهم من تتعل",
        "char_start": 0,
        "char_end": 2557,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_072_chunk00",
        "verse_key": "9:72",
        "text_ar": "قوله تعالى وعد الله المؤمنين والمؤمنات جنات تجري من تحتها الأنهار خالدين فيها ومساكن طيبة في جنات عدن ورضوان من الله أكبر ذلك هو الفوز العظيمقوله تعالى وعد الله المؤمنين والمؤمنات جنات أي بساتين تجري من تحتها الأنهار أي من تحت أشجارها وغرفها الأنهار . وقد تقدم في \" البقرة \" أنها تجري منضبطة بالقدرة في غير أخدود . خالدين فيها ومساكن طيبة قصور من الزبرجد والدر [ ص: 129 ] والياقوت ، يفوح طيبها من مسيرة خمسمائة عام . في جنات عدن أي في دار إقامة . يقال : عدن بالمكان إذا أقام به ; ومنه المعدن . وقال ع",
        "char_start": 0,
        "char_end": 950,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_089_chunk00",
        "verse_key": "9:89",
        "text_ar": "والجنات : البساتين .وقد تقدم .",
        "char_start": 0,
        "char_end": 30,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "لما ذكر جزاء الكافرين, ذكر جزاء المومنين, اهل الاعمال الصالحات, علي طريقته تعالي في القران يجمع بين الترغيب والترهيب, ليكون العبد راغبا راهبا, خايفا راجيا فقال: { وَبَشِّرِ } اي: [يا ايها الرسول ومن قام مقامه] { الَّذِينَ امَنُوا } بقلوبهم { وَعَمِلُوا الصَّالِحَاتِ } بجوارحهم, فصدقوا ايمانهم باعمالهم الصالحه. ووصفت اعمال الخير بالصالحات, لان بها تصلح احوال العبد, وامور دينه ودنياه, وحياته الدنيويه والاخرويه, ويزول بها عنه فساد الاحوال, فيكون بذلك من الصالحين, الذين يصلحون لمجاوره الرحمن في جنته",
        "char_start": 0,
        "char_end": 2524,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "اخبر تعالي ان في هذه المخلوقات العظيمه, ايات اي: ادله علي وحدانيه الباري والهيته، وعظيم سلطانه ورحمته وساير صفاته، ولكنها { لِقَوْمٍ يَعْقِلُونَ } اي: لمن لهم عقول يُعملونها فيما خُلِقَتْ له، فعلي حسب ما منّ الله علي عبده من العقل, ينتفع بالايات ويعرفها بعقله وفكره وتدبُّره، ففي { خَلْقِ السَّمَاوَاتِ } في ارتفاعها واتساعها, واحكامها, واتقانها, وما جعل الله فيها من الشمس والقمر, والنجوم, وتنظيمها لمصالح العباد. وفي خلق { الْاَرْضِ } مهادا للخلق, يمكنهم القرار عليها والانتفاع بما عليها, والاعتبار",
        "char_start": 0,
        "char_end": 4723,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_266_chunk00",
        "verse_key": "2:266",
        "text_ar": "وهذا المثل مضروب لمن عمل عملا لوجه الله تعالي من صدقه او غيرها ثم عمل اعمالا تفسده، فمثله كمثل صاحب هذا البستان الذي فيه من كل الثمرات، وخص منها النخل والعنب لفضلهما وكثره منافعهما، لكونهما غذاء وقوتا وفاكهه وحلوي، وتلك الجنه فيها الانهار الجاريه التي تسقيها من غير مونه، وكان صاحبها قد اغتبط بها وسرته، ثم انه اصابه الكبر فضعف عن العمل وزاد حرصه، وكان له ذريه ضعفاء ما فيهم معاونه له، بل هم كل عليه، ونفقته ونفقتهم من تلك الجنه، فبينما هو كذلك اذ اصاب تلك الجنه اعصار وهو الريح القويه التي تستدير ثم",
        "char_start": 0,
        "char_end": 1302,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_282_chunk00",
        "verse_key": "2:282",
        "text_ar": "احتوت هاتان الايتان علي ارشاد الباري عباده في معاملاتهم الي حفظ حقوقهم بالطرق النافعه والاصلاحات التي لا يقترح العقلاء اعلي ولا اكمل منها، فان فيها فوايد كثيره: منها: جواز المعاملات في الديون، سواء كانت ديون سلم او شراء موجلا ثمنه، فكله جايز; لان الله اخبر به عن المومنين، وما اخبر به عن المومنين فانه من مقتضيات الايمان، وقد اقرهم عليه الملك الديان. ومنها: وجوب تسميه الاجل في جميع المداينات وحلول الاجارات. ومنها: انه اذا كان الاجل مجهولا، فانه لا يحل، لانه غرر وخطر، فيدخل في الميسر. ومنها: امره ت",
        "char_start": 0,
        "char_end": 6824,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_015_chunk00",
        "verse_key": "3:15",
        "text_ar": "وتمام ذلك ان الله تعالي اخبر بعدها عن دار القرار ومصير المتقين الابرار، واخبر انها خير من ذلكم المذكور، الا وهي الجنات العاليات ذات المنازل الانيقه والغرف العاليه، والاشجار المتنوعه المثمره بانواع الثمار، والانهار الجاريه علي حسب مرادهم والازواج المطهره من كل قذر ودنس وعيب ظاهر وباطن، مع الخلود الدايم الذي به تمام النعيم، مع الرضوان من الله الذي هو اكبر نعيم، فقس هذه الدار الجليله بتلك الدار الحقيره، ثم اختر لنفسك احسنهما واعرض علي قلبك المفاضله بينهما { والله بصير بالعباد } اي: عالم بما فيهم من",
        "char_start": 0,
        "char_end": 728,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_136_chunk00",
        "verse_key": "3:136",
        "text_ar": "{ اوليك } الموصوفون بتلك الصفات { جزاوهم مغفره من ربهم } تزيل عنهم كل محذور { وجنات تجري من تحتها الانهار } فيها من النعيم المقيم، والبهجه والسرور والبهاء، والخير والسرور، والقصور والمنازل الانيقه العاليات، والاشجار المثمره البهيه، والانهار الجاريات في تلك المساكن الطيبات، { خالدين فيها } لا يحولون عنها، ولا يبغون بها بدلا، ولا يغير ما هم فيه من النعيم، { ونعم اجر العاملين } عملوا لله قليلا فاجروا كثيرا فـ \"عند الصباح يحمد القوم السري\" وعند الجزاء يجد العامل اجره كاملا موفرا. وهذه الايات الكريما",
        "char_start": 0,
        "char_end": 935,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_195_chunk00",
        "verse_key": "3:195",
        "text_ar": "اي: اجاب الله دعاءهم، دعاء العباده، ودعاء الطلب، وقال: اني لا اضيع عمل عامل منكم من ذكر وانثي، فالجميع سيلقون ثواب اعمالهم كاملا موفرا، { بعضكم من بعض } اي: كلكم علي حد سواء في الثواب والعقاب، { فالذين هاجروا واخرجوا من ديارهم واوذوا في سبيلي وقاتلوا وقتلوا } فجمعوا بين الايمان والهجره، ومفارقه المحبوبات من الاوطان والاموال، طلبا لمرضاه ربهم، وجاهدوا في سبيل الله. { لاكفرن عنهم سيياتهم ولادخلنهم جنات تجري من تحتها الانهار ثوابا من عند الله } الذي يعطي عبده الثواب الجزيل علي العمل القليل. { والله",
        "char_start": 0,
        "char_end": 641,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_198_chunk00",
        "verse_key": "3:198",
        "text_ar": "واما المتقون لربهم، المومنون به- فمع ما يحصل لهم من عز الدنيا ونعيمها { لهم جنات تجري من تحتها الانهار خالدين فيها } فلو قدر انهم في دار الدنيا، قد حصل لهم كل بوس وشده، وعناء ومشقه، لكان هذا بالنسبه الي النعيم المقيم، والعيش السليم، والسرور والحبور، والبهجه نزرا يسيرا، ومنحه في صوره محنه، ولهذا قال تعالي: { وما عند الله خير للابرار } وهم الذين برت قلوبهم، فبرت اقوالهم وافعالهم، فاثابهم البر الرحيم من بره اجرا عظيما، وعطاء جسيما، وفوزا دايما.",
        "char_start": 0,
        "char_end": 445,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_013_chunk00",
        "verse_key": "4:13",
        "text_ar": "اي: تلك التفاصيل التي ذكرها في المواريث حدود الله التي يجب الوقوف معها وعدم مجاوزتها، ولا القصور عنها، وفي ذلك دليل علي ان الوصيه للوارث منسوخه بتقديره تعالي انصباء الوارثين. ثم قوله تعالي: { تِلْكَ حُدُودُ اللَّهِ } فالوصيه للوارث بزياده علي حقه يدخل في هذا التعدي، مع قوله صلي الله عليه وسلم: \"لا وصيه لوارث\" ثم ذكر طاعه الله ورسوله ومعصيتهما عموما ليدخل في العموم لزوم حدوده في الفرايض او ترك ذلك فقال: { وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ } بامتثال امرهما الذي اعظمه طاعتهما في التوحيد، ثم الاوامر",
        "char_start": 0,
        "char_end": 869,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_029_chunk00",
        "verse_key": "4:29",
        "text_ar": "ينهي تعالي عباده المومنين ان ياكلوا اموالهم بينهم بالباطل، وهذا يشمل اكلها بالغصوب والسرقات، واخذها بالقمار والمكاسب الردييه. بل لعله يدخل في ذلك اكل مال نفسك علي وجه البطر والاسراف، لان هذا من الباطل وليس من الحق. ثم انه -لما حرم اكلها بالباطل- اباح لهم اكلها بالتجارات والمكاسب الخاليه من الموانع، المشتمله علي الشروط من التراضي وغيره. { وَلَا تَقْتُلُوا اَنْفُسَكُمْ } اي: لا يقتل بعضكم بعضًا، ولا يقتل الانسان نفسه. ويدخل في ذلك الالقاءُ بالنفس الي التهلكه، وفعلُ الاخطار المفضيه الي التلف والهلا",
        "char_start": 0,
        "char_end": 1916,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_057_chunk00",
        "verse_key": "4:57",
        "text_ar": "{ وَالَّذِينَ امَنُوا } اي: بالله وما اوجب الايمانَ به { وَعَمِلُوا الصَّالِحَاتِ } من الواجبات والمستحبات { سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْاَنْهَارُ خَالِدِينَ فِيهَا اَبَدًا لَهُمْ فِيهَا اَزْوَاجٌ مُطَهَّرَهٌ } اي: من الاخلاق الرذيله، والخلْق الذميم، ومما يكون من نساء الدنيا من كل دنس وعيب { وَنُدْخِلُهُمْ ظِلًّا ظَلِيلًا }",
        "char_start": 0,
        "char_end": 347,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_122_chunk00",
        "verse_key": "4:122",
        "text_ar": "اي: { امَنُوا ْ} بالله وملايكته وكتبه ورسله واليوم الاخر، والقَدَر خيره وشره علي الوجه الذي امروا به علما وتصديقا واقرارا. { وَعَمِلُوا الصَّالِحَاتِ ْ} الناشيه عن الايمان؟ وهذا يشمل ساير المامورات من واجب ومستحب، الذي علي القلب، والذي علي اللسان، والذي علي بقيه الجوارح. كل له من الثواب المرتب علي ذلك بحسب حاله ومقامه، وتكميله للايمان والعمل الصالح. ويفوته ما رتب علي ذلك بحسب ما اخل به من الايمان والعمل، وذلك بحسب ما علم من حكمه الله ورحمته، وكذلك وعده الصادق الذي يعرف من تتبع كتاب الله وسنه رسو",
        "char_start": 0,
        "char_end": 1562,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_012_chunk00",
        "verse_key": "5:12",
        "text_ar": "يخبر تعالي انه اخذ علي بني اسراييل الميثاق الثقيل الموكد، وذكر صفه الميثاق واجرهم ان قاموا به، واثمهم ان لم يقوموا به، ثم ذكر انهم ما قاموا به، وذكر ما عاقبهم به، فقال: { وَلَقَدْ اَخَذَ اللَّهُ مِيثَاقَ بَنِي اِسْرَايِيلَ ْ} اي: عهدهم الموكد الغليظ، { وَبَعَثْنَا مِنْهُمُ اثْنَيْ عَشَرَ نَقِيبًا ْ} اي: رييسا وعريفا علي من تحته، ليكون ناظرا عليهم، حاثا لهم علي القيام بما اُمِرُوا به، مطالبا يدعوهم. { وَقَالَ اللَّهُ ْ} للنقباء الذين تحملوا من الاعباء ما تحملوا: { اِنِّي مَعَكُمْ ْ} اي: بالعون وا",
        "char_start": 0,
        "char_end": 1480,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_085_chunk00",
        "verse_key": "5:85",
        "text_ar": "قال الله تعالي: { فَاَثَابَهُمُ اللَّهُ بِمَا قَالُوا } اي: بما تفوهوا به من الايمان ونطقوا به من التصديق بالحق { جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْاَنْهَارُ خَالِدِينَ فِيهَا وَذَلِكَ جَزَاءُ الْمُحْسِنِينَ } وهذه الايات نزلت في النصاري الذين امنوا بمحمد صلي الله عليه وسلم، كالنجاشي وغيره ممن امن منهم. وكذلك لا يزال يوجد فيهم من يختار دين الاسلام، ويتبين له بطلان ما كانوا عليه، وهم اقرب من اليهود والمشركين الي دين الاسلام.",
        "char_start": 0,
        "char_end": 428,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_119_chunk00",
        "verse_key": "5:119",
        "text_ar": "{ قَالَ اللَّهُ } مبينا لحال عباده يوم القيامه، ومَن الفايز منهم ومَن الهالك، ومَن الشقي ومَن السعيد، { هَذَا يَوْمُ يَنْفَعُ الصَّادِقِينَ صِدْقُهُمْ } والصادقون هم الذين استقامت اعمالهم واقوالهم ونياتهم علي الصراط المستقيم والهدْي القويم، فيوم القيامه يجدون ثمره ذلك الصدق، اذا احلهم الله في مقعد صدق عند مليك مقتدر، ولهذا قال: { لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْاَنْهَارُ خَالِدِينَ فِيهَا اَبَدًا رَضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ذَلِكَ الْفَوْزُ الْعَظِيمُ } والكاذبون بضدهم، سيج",
        "char_start": 0,
        "char_end": 547,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_006_chunk00",
        "verse_key": "6:6",
        "text_ar": "ثم امرهم ان يعتبروا بالامم السالفه فقال: { اَلَمْ يَرَوْا كَمْ اَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ } اي: كم تتابع اهلاكنا للامم المكذبين، وامهلناهم قبل ذلك الاهلاك، بان { مَكَّنَّاهُمْ فِي الْاَرْضِ مَا لَمْ نُمَكِّنْ } لهولاء من الاموال والبنين والرفاهيه. { وَاَرْسَلْنَا السَّمَاءَ عَلَيْهِمْ مِدْرَارًا وَجَعَلْنَا الْاَنْهَارَ تَجْرِي مِنْ تَحْتِهِمْ } فينبت لهم بذلك ما شاء الله، من زروع وثمار، يتمتعون بها، ويتناولون منها ما يشتهون، فلم يشكروا الله علي نعمه، بل اقبلوا علي الشهوات، والهتهم ",
        "char_start": 0,
        "char_end": 715,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_043_chunk00",
        "verse_key": "7:43",
        "text_ar": "{ وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ ْ} وهذا من كرمه واحسانه علي اهل الجنه، ان الغل الذي كان موجودا في قلوبهم، والتنافس الذي بينهم، ان اللّه يقلعه ويزيله حتي يكونوا اخوانا متحابين، واخلاء متصافين. قال تعالي: { وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ اِخْوَانًا عَلَي سُرُرٍ مُتَقَابِلِينَ ْ} ويخلق اللّه لهم من الكرامه ما به يحصل لكل واحد منهم الغبطه والسرور، ويري انه لا فوق ما هو فيه من النعيم نعيم. فبهذا يامنون من التحاسد والتباغض، لانه قد فقدت اسبابه. وقوله: { تَجْرِي مِنْ تَحْتِهِمُ",
        "char_start": 0,
        "char_end": 1813,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_024_chunk00",
        "verse_key": "9:24",
        "text_ar": "ولهذا ذكر السبب الموجب لذلك، وهو ان محبه اللّه ورسوله، يتعين تقديمهما علي محبه كل شيء، وجعل جميع الاشياء تابعه لهما فقال‏:‏ ‏{‏قُلْ اِنْ كَانَ ابَاوُكُمْ‏}‏ ومثلهم الامهات ‏{‏وَاَبْنَاوُكُمْ وَاِخْوَانُكُمْ‏}‏ في النسب والعشره ‏{‏وَاَزْوَاجُكُمْ وَعَشِيرَتُكُمْ‏}‏ اي‏:‏ قراباتكم عمومًا ‏{‏وَاَمْوَالٌ اقْتَرَفْتُمُوهَا‏}‏ اي‏:‏ اكتسبتموها وتعبتم في تحصيلها، خصها بالذكر، لانها ارغب عند اهلها، وصاحبها اشد حرصا عليها ممن تاتيه الاموال من غير تعب ولا كَدّ‏.‏ ‏{‏وَتِجَارَهٌ تَخْشَوْنَ كَسَادَهَا‏}‏ اي",
        "char_start": 0,
        "char_end": 1528,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_072_chunk00",
        "verse_key": "9:72",
        "text_ar": "ثم ذكر ما اعد اللّه لهم من الثواب فقال‏:‏ ‏{‏وَعَدَ اللَّهُ الْمُوْمِنِينَ وَالْمُوْمِنَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْاَنْهَارُ‏}‏ جامعه لكل نعيم وفرح، خاليه من كل اذي وترح، تجري من تحت قصورها ودورها واشجارها الانهار الغزيره، المرويه للبساتين الانيقه، التي لا يعلم ما فيها من الخيرات والبركات الا اللّه تعالي‏.‏ ‏{‏خَالِدِينَ فِيهَا‏}‏ لا يبغون عنها حِوَلًا ‏{‏وَمَسَاكِنَ طَيِّبَهً فِي جَنَّاتِ عَدْنٍ‏}‏ قد زخرفت وحسنت واعدت لعباد اللّه المتقين، قد طاب مراها، وطاب منزلها ومقيلها، وجمعت من",
        "char_start": 0,
        "char_end": 1213,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_089_chunk00",
        "verse_key": "9:89",
        "text_ar": "‏{‏اَعَدَّ اللَّهُ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْاَنْهَارُ خَالِدِينَ فِيهَا ذَلِكَ الْفَوْزُ الْعَظِيمُ‏}‏ فتبا لمن لم يرغب بما رغبوا فيه، وخسر دينه ودنياه واخراه، وهذا نظير قوله تعالي ‏{‏قُلْ امِنُوا بِهِ اَوْ لَا تُوْمِنُوا اِنَّ الَّذِينَ اُوتُوا الْعِلْمَ مِنْ قَبْلِهِ اِذَا يُتْلَي عَلَيْهِمْ يَخِرُّونَ لِلْاَذْقَانِ سُجَّدًا‏}‏ وقوله‏:‏ ‏{‏فَاِنْ يَكْفُرْ بِهَا هَوُلَاءِ فَقَدْ وَكَّلْنَا بِهَا قَوْمًا لَيْسُوا بِهَا بِكَافِرِينَ‏}‏‏.‏",
        "char_start": 0,
        "char_end": 458,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "القول في تاويل قوله : وَبَشِّرِ الَّذِينَ امَنُوا وَعَمِلُوا الصَّالِحَاتِ اَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُقال ابو جعفر: اما قوله تعالي: \" وبشِّر \"، فانه يعني: اخبرهم. والبشاره اصلها الخبرُ بما يُسَرُّ به المخبَرُ, اذا كان سابقًا به كل مخبِرٍ سواه.وهذا امر من الله تعالي نبيَّه محمدًا صلي الله عليه وسلم بابلاغ بشارته خلقَه الذين امنوا به وبمحمد صلي الله عليه وسلم وبما جاء به من عند ربه, وصدّقوا ايمانهم ذلك واقرَارهم باعمالهم الصالحه, فقال له: يا محمد، بشِّرْ من صدَّقك انك ",
        "char_start": 0,
        "char_end": 22375,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "القول في المعني الذي من اجله انـزل الله علي نبيه صلي الله عليه وسلم قوله: اِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالاَرْضِ وَاخْتِلافِ اللَّيْلِ وَالنَّهَارِ* * *قال ابو جعفر: اختلف اهل التاويل في السبب الذي من اجله انـزل الله تعالي ذكره هذه الايه علي نَبيّه محمد صلي الله عليه وسلم.* * *فقال بعضهم: انـزلها عليه احتجاجًا له علي اهل الشرك به من عبده الاوثان. وذلك ان الله تعالي ذكره لما انـزل علي نبيه محمد صلي الله عليه وسلم: وَاِلَهُكُمْ اِلَهٌ وَاحِدٌ لا اِلَهَ اِلا هُوَ الرَّحْمَنُ الرَّحِيمُ فتلا ذلك ",
        "char_start": 0,
        "char_end": 14773,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_266_chunk00",
        "verse_key": "2:266",
        "text_ar": "القول في تاويل قوله : اَيَوَدُّ اَحَدُكُمْ اَنْ تَكُونَ لَهُ جَنَّهٌ مِنْ نَخِيلٍ وَاَعْنَابٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ لَهُ فِيهَا مِنْ كُلِّ الثَّمَرَاتِ وَاَصَابَهُ الْكِبَرُ وَلَهُ ذُرِّيَّهٌ ضُعَفَاءُ فَاَصَابَهَا اِعْصَارٌ فِيهِ نَارٌ فَاحْتَرَقَتْقال ابو جعفر: ومعني ذلك: (20) . يَا اَيُّهَا الَّذِينَ امَنُوا لا تُبْطِلُوا صَدَقَاتِكُمْ بِالْمَنِّ وَالاَذَي كَالَّذِي يُنْفِقُ مَالَهُ رِيَاءَ النَّاسِ وَلا يُوْمِنُ بِاللَّهِ وَالْيَوْمِ الاخِرِ فَمَثَلُهُ كَمَثَلِ صَفْوَانٍ عَلَيْه",
        "char_start": 0,
        "char_end": 22089,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_282_chunk00",
        "verse_key": "2:282",
        "text_ar": "يا ايها الذين امنوا اذا تداينتم بدين الي اجلالقول في تاويل قوله تعالي : { يا ايها الذين امنوا اذا تداينتم بدين الي اجل مسمي } يعني بذلك جل ثناوه : يا ايها الذين صدقوا الله ورسوله { اذا تداينتم } يعني اذا تبايعتم بدين او اشتريتم به , او تعاطيتم , او اخذتم به { الي اجل مسمي } يقول : الي وقت معلوم وقتموه بينكم . وقد يدخل في ذلك القرض والسلم في كل ما جاز . السلم شري اجل بيعه يصير دينا علي بايع ما اسلم اليه فيه , ويحتمل بيع الحاضر الجايز بيعه من الاملاك بالاثمان الموجله كل ذلك من الديون الموجله الي ا",
        "char_start": 0,
        "char_end": 38138,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_015_chunk00",
        "verse_key": "3:15",
        "text_ar": "القول في تاويل قوله : قُلْ اَوُنَبِّيُكُمْ بِخَيْرٍ مِنْ ذَلِكُمْ لِلَّذِينَ اتَّقَوْا عِنْدَ رَبِّهِمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا وَاَزْوَاجٌ مُطَهَّرَهٌ وَرِضْوَانٌ مِنَ اللَّهِ وَاللَّهُ بَصِيرٌ بِالْعِبَادِ (15)قال ابو جعفر: يعني جل ثناوه: قل، يا محمد، للناس الذين زُيِّن لهم حب الشهوات من النساء والبنين، وساير ما ذكر ربنا جل ثناوه: \" اونبيكم \"، ااخبركم واعلمكم (87) =\" بخير من ذلكم \"، يعني: بخير وافضل لكم =\" من &; 6-260 &; ذلكم \"، يعني: مما زُيِّن لكم في الد",
        "char_start": 0,
        "char_end": 5317,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_136_chunk00",
        "verse_key": "3:136",
        "text_ar": "القول في تاويل قوله : وَالَّذِينَ اِذَا فَعَلُوا فَاحِشَهً اَوْ ظَلَمُوا اَنْفُسَهُمْ ذَكَرُوا اللَّهَ فَاسْتَغْفَرُوا لِذُنُوبِهِمْ وَمَنْ يَغْفِرُ الذُّنُوبَ اِلا اللَّهُ وَلَمْ يُصِرُّوا عَلَي مَا فَعَلُوا وَهُمْ يَعْلَمُونَ (135)قال ابو جعفر: يعني بقوله جل ثناوه: \" والذين اذا فعلوا فاحشه \"، ان الجنه التي وصف صفتها اعدت للمتقين، المنفقين في السراء والضراء، والذين اذا فعلوا فاحشه. وجميع هذه النعوت من صفه \" المتقين \"، الذين قال تعالي ذكره: وَجَنَّهٍ عَرْضُهَا السَّمَاوَاتُ وَالاَرْضُ اُعِدَّتْ ",
        "char_start": 0,
        "char_end": 14736,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_195_chunk00",
        "verse_key": "3:195",
        "text_ar": "القول في تاويل قوله : فَاسْتَجَابَ لَهُمْ رَبُّهُمْ اَنِّي لا اُضِيعُ عَمَلَ عَامِلٍ مِنْكُمْ مِنْ ذَكَرٍ اَوْ اُنْثَي بَعْضُكُمْ مِنْ بَعْضٍقال ابو جعفر: يعني تعالي ذكره: فاجاب هولاء الداعين= بما وصف من ادعيتهم انهم دعوا به (1) = ربُّهم، باني لا اضيع عمل عامل منكم عمل خيرًا، ذكرًا كان العامل او انثي.* * *وذكر انه قيل لرسول الله صلي الله عليه وسلم: \" ما بال الرجال يُذكرون ولا تذكر النساء في الهجره \"؟ فانـزل الله تبارك وتعالي في ذلك هذه الايه.8367 - حدثنا محمد بن بشار قال، حدثنا مومل قال، حدثنا س",
        "char_start": 0,
        "char_end": 11345,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_198_chunk00",
        "verse_key": "3:198",
        "text_ar": "القول في تاويل قوله : لَكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا نُزُلا مِنْ عِنْدِ اللَّهِ وَمَا عِنْدَ اللَّهِ خَيْرٌ لِلاَبْرَارِ (198)قال ابو جعفر: يعني بقوله جل ثناوه: (23) \" لكن الذين اتقوا ربهم \"، لكن الذين اتقوا الله بطاعته واتّباع مرضاته، في العمل بما امرهم به، واجتناب ما نهاهم عنه=\" لهم جنات \" يعني: بساتين، (24) =\" تجري من تحتها الانهار خالدين فيها \"، يقول: باقين فيها ابدًا. (25) =\" نـزلا من عند الله \"، يعني: انـزالا من الل",
        "char_start": 0,
        "char_end": 3460,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_013_chunk00",
        "verse_key": "4:13",
        "text_ar": "القول في تاويل قوله تعالي : تِلْكَ حُدُودُ اللَّهِ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا وَذَلِكَ الْفَوْزُ الْعَظِيمُ (13)قال ابو جعفر: اختلف اهل التاويل في تاويل قوله: \" تلك حدود الله \". فقال بعضهم: يعني به: تلك شروط الله. (41)*ذكر من قال ذلك:8790 - حدثنا محمد بن الحسين قال، حدثنا احمد بن مفضل قال، حدثنا &; 8-69 &; اسباط، عن السدي: \" تلك حدود الله \"، يقول: شروط الله.* * *وقال اخرون: بل معني ذلك: تلك طاعه الله.* ذكر من قال ذلك",
        "char_start": 0,
        "char_end": 4085,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_029_chunk00",
        "verse_key": "4:29",
        "text_ar": "القول في تاويل قوله : يَا اَيُّهَا الَّذِينَ امَنُوا لا تَاْكُلُوا اَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ اِلا اَنْ تَكُونَ تِجَارَهً عَنْ تَرَاضٍ مِنْكُمْقال ابو جعفر: يعني بقوله جل ثناوه: (3) \" يا ايها الذين امنوا \"، صدّقوا الله ورسوله =\" لا تاكلوا اموالكم بينكم بالباطل \"، يقول: لا ياكل بعضكم اموالَ بعض بما حرّمَ عليه، من الربا والقمار وغير ذلك من الامور التي نهاكم الله عنها (4) =\" الا ان تكون تجارهً\" . كما:-9140 - حدثنا محمد بن الحسين قال، حدثنا احمد بن مفضل قال، حدثنا &; 8-217 &; اسباط، عن ال",
        "char_start": 0,
        "char_end": 20199,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_057_chunk00",
        "verse_key": "4:57",
        "text_ar": "القول في تاويل قوله : وَالَّذِينَ امَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا اَبَدًا لَهُمْ فِيهَا اَزْوَاجٌ مُطَهَّرَهٌ وَنُدْخِلُهُمْ ظِلا ظَلِيلا (57)قال ابو جعفر: يعني بقوله جل ثناوه: \" والذين امنوا وعملوا الصالحات \"، والذين امنوا بالله ورسوله محمد صلي الله عليه وسلم، وصدّقوا بما انـزل الله علي محمد مصدّقًا لما معهم من يهود بني اسراييل وساير الامم غيرهم =\" وعملوا الصالحات \"، يقول: وادّوا ما امرهم الله به من فرايضه، واجتنبوا م",
        "char_start": 0,
        "char_end": 2221,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_122_chunk00",
        "verse_key": "4:122",
        "text_ar": "القول في تاويل قوله : وَالَّذِينَ امَنُوا وَعَمِلُوا الصَّالِحَاتِ سَنُدْخِلُهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا اَبَدًا وَعْدَ اللَّهِ حَقًّا وَمَنْ اَصْدَقُ مِنَ اللَّهِ قِيلا (122)قال ابو جعفر: يعني جل ثناوه بقوله: \" والذين امنوا وعملوا الصالحات \"، والذين صدّقوا الله ورسوله، واقرُّوا له بالوحدانيه، ولرسوله صلي الله عليه وسلم بالنبوه=\" وعملوا الصالحات \"، يقول: وادَّوا فرايض الله التي فرضها عليهم (1) =\" سندخلهم جنات تجري من تحتها الانهار \"، يقول: سوف ندخلهم يوم ال",
        "char_start": 0,
        "char_end": 2591,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_012_chunk00",
        "verse_key": "5:12",
        "text_ar": "القول في تاويل قوله عز ذكره : وَلَقَدْ اَخَذَ اللَّهُ مِيثَاقَ بَنِي اِسْرَايِيلَ وَبَعَثْنَا مِنْهُمُ اثْنَيْ عَشَرَ نَقِيبًاقال ابو جعفر: وهذه الايه انـزلتْ اعلامًا من الله جلّ ثناوه نبيَّه صلي الله عليه وسلم والمومنين به، اخلاقَ الذين همُّوا ببسط ايديهم اليهم من اليهود. كالذي:-11567 - حدثنا الحارث بن محمد قال، حدثنا عبد العزيز قال، حدثنا مبارك، عن الحسن في قوله: \" ولقد اخذ الله ميثاق بني اسراييل \" قال: اليهود من اهل الكتاب.* * *= (29) وان الذي هموا به من الغدر ونقض العهد الذي بينهم وبينه، من ",
        "char_start": 0,
        "char_end": 24989,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_085_chunk00",
        "verse_key": "5:85",
        "text_ar": "القول في تاويل قوله : فَاَثَابَهُمُ اللَّهُ بِمَا قَالُوا جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا وَذَلِكَ جَزَاءُ الْمُحْسِنِينَ (85)قال ابو جعفر: يقول تعالي ذكره: فجزاهم الله بقولهم: \" رَبَّنَا امَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ * وَمَا لَنَا لا نُوْمِنُ بِاللَّهِ وَمَا جَاءَنَا مِنَ الْحَقِّ وَنَطْمَعُ اَنْ يُدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصَّالِحِينَ =\" جنات تجري من تحتها الانهار \"، يعني: بساتين تجري من تحت اشجارها الانهار=\" خالدين فيها \"، يقول: دايمًا فيها مك",
        "char_start": 0,
        "char_end": 1203,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_119_chunk00",
        "verse_key": "5:119",
        "text_ar": "القول في تاويل قوله : قَالَ اللَّهُ هَذَا يَوْمُ يَنْفَعُ الصَّادِقِينَ صِدْقُهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا اَبَدًاقال ابو جعفر: اختلفت القراه في قراءه قوله: \" هذا يوم ينفع الصادقين \". فقرا ذلك بعض اهل الحجاز والمدينه: (هَذَا يَوْمَ يَنْفَعُ الصَّادِقِينَ)، بنصب \" يوم \".* * *وقراه بعض اهل الحجاز وبعض اهل المدينه، وعامه قراه اهل العراق: هَذَا يَوْمُ يَنْفَعُ الصَّادِقِينَ ، برفع \" يوم \". فمن رفعه رفعه ب \" هذا \", وجعل \" يوم \" اسمًا, وان كانت اضافته غير م",
        "char_start": 0,
        "char_end": 4897,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_006_chunk00",
        "verse_key": "6:6",
        "text_ar": "القول في تاويل قوله : اَلَمْ يَرَوْا كَمْ اَهْلَكْنَا مِنْ قَبْلِهِمْ مِنْ قَرْنٍ مَكَّنَّاهُمْ فِي الاَرْضِ مَا لَمْ نُمَكِّنْ لَكُمْ وَاَرْسَلْنَا السَّمَاءَ عَلَيْهِمْ مِدْرَارًا وَجَعَلْنَا الاَنْهَارَ تَجْرِي مِنْ تَحْتِهِمْ فَاَهْلَكْنَاهُمْ بِذُنُوبِهِمْ وَاَنْشَاْنَا مِنْ بَعْدِهِمْ قَرْنًا اخَرِينَ (6)قال ابو جعفر: يقول تعالي ذكره لنبيه محمدٍ صلي الله عليه وسلم: الم يرَ هولاء المكذبون باياتي، الجاحدون نبوّتك, كثرهَ من اهلكت من قبلهم من القُرون = وهم الامم = الذين وطَّات لهم البلادَ والا",
        "char_start": 0,
        "char_end": 2574,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_043_chunk00",
        "verse_key": "7:43",
        "text_ar": "القول في تاويل قوله : وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ تَجْرِي مِنْ تَحْتِهِمُ الاَنْهَارُقال ابو جعفر: يقول تعالي ذكره: واذهبنا من صدور هولاء الذين وَصَف صفتهم، واخبر انهم اصحاب الجنه, ما فيها من حقد وغِمْرٍ وعَداوه كان من بعضهم في الدنيا علي بعض, (43) فجعلهم في الجنه اذا ادخلهموها علي سُرُر متقابلين, لا يحسد بعضهم بعضًا علي شيء خصَّ الله به بعضهم وفضّله من كرامته عليه, تجري من تحتهم انهار الجنه.* * *وبنحو الذي قلنا في ذلك قال اهل التاويل.* ذكر من قال ذلك:14658- حدثنا ابن وكيع قال، حد",
        "char_start": 0,
        "char_end": 12247,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_024_chunk00",
        "verse_key": "9:24",
        "text_ar": "القول في تاويل قوله : قُلْ اِنْ كَانَ ابَاوُكُمْ وَاَبْنَاوُكُمْ وَاِخْوَانُكُمْ وَاَزْوَاجُكُمْ وَعَشِيرَتُكُمْ وَاَمْوَالٌ اقْتَرَفْتُمُوهَا وَتِجَارَهٌ تَخْشَوْنَ كَسَادَهَا وَمَسَاكِنُ تَرْضَوْنَهَا اَحَبَّ اِلَيْكُمْ مِنَ اللَّهِ وَرَسُولِهِ وَجِهَادٍ فِي سَبِيلِهِ فَتَرَبَّصُوا حَتَّي يَاْتِيَ اللَّهُ بِاَمْرِهِ وَاللَّهُ لا يَهْدِي الْقَوْمَ الْفَاسِقِينَ (24)قال ابو جعفر: يقول تبارك وتعالي لنبيه محمد صلي الله عليه وسلم: (قل) يا محمد، للمتخلفين عن الهجره الي دار الاسلام، المقيمين بدار الش",
        "char_start": 0,
        "char_end": 1990,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_072_chunk00",
        "verse_key": "9:72",
        "text_ar": "القول في تاويل قوله : وَعَدَ اللَّهُ الْمُوْمِنِينَ وَالْمُوْمِنَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا وَمَسَاكِنَ طَيِّبَهً فِي جَنَّاتِ عَدْنٍ وَرِضْوَانٌ مِنَ اللَّهِ اَكْبَرُ ذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ (72)قال ابو جعفر: يقول تعالي ذكره: وعد الله الذين صدقوا الله ورسوله، واقرُّوا به وبما جاء به من عند الله، من الرجال والنساء =(جنات تجري من تحتها الانهار)، يقول: بساتين تجري تحت اشجارها الانهار (20) =(خالدين فيها)، يقول: لابثين فيها ابدًا، مقيمين لا يزول عنهم ن",
        "char_start": 0,
        "char_end": 13974,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_089_chunk00",
        "verse_key": "9:89",
        "text_ar": "القول في تاويل قوله : اَعَدَّ اللَّهُ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُ خَالِدِينَ فِيهَا ذَلِكَ الْفَوْزُ الْعَظِيمُ (89)قال ابو جعفر: يقول تعالي ذكره: اعد الله لرسوله محمد صلي الله عليه وسلم وللذين امنوا معه (9) =(جنات), وهي البساتين، (10) تجري من تحت اشجارها الانهار =(خالدين فيها)، يقول: لابثين فيها, لا يموتون فيها, ولا يظعنون عنها (11) =(ذلك الفوز العظيم)، يقول: ذلك النجاء العظيم، والحظّ الجزيل. (12)-------------------الهوامش :(9) انظر تفسير \" اعد \" فيما سلف ص : 31 ، 267 .(1",
        "char_start": 0,
        "char_end": 689,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [],
  "incoming_edges": [],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [],
    "internal_external": {
      "value": "ظاهر",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_EXTERNAL_BEH_FIN_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 50,
    "quran_direct_count": 50,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 0,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.734,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.250291Z",
  "schema_version": "1.0.0"
}