{
  "behavior_id": "BEH_SOC_ORPHAN_HARM",
  "label_ar": "أكل مال اليتيم",
  "label_en": "Harming Orphan",
  "category": "social",
  "roots": [
    "ي-ت-م"
  ],
  "stems": [],
  "synonyms_ar": [
    "يأكلون أموال اليتامى",
    "قهر اليتيم",
    "تقهر اليتيم"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:35",
      "text_ar": "وَقُلْنَا يَـٰٓـَٔادَمُ ٱسْكُنْ أَنتَ وَزَوْجُكَ ٱلْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَـٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّـٰلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:58",
      "text_ar": "وَإِذْ قُلْنَا ٱدْخُلُوا۟ هَـٰذِهِ ٱلْقَرْيَةَ فَكُلُوا۟ مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا وَٱدْخُلُوا۟ ٱلْبَابَ سُجَّدًا وَقُولُوا۟ حِطَّةٌ نَّغْفِرْ لَكُمْ خَطَـٰيَـٰكُمْ ۚ وَسَنَزِيدُ ٱلْمُحْسِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:64",
      "text_ar": "ثُمَّ تَوَلَّيْتُم مِّنۢ بَعْدِ ذَٰلِكَ ۖ فَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَكُنتُم مِّنَ ٱلْخَـٰسِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:83",
      "text_ar": "وَإِذْ أَخَذْنَا مِيثَـٰقَ بَنِىٓ إِسْرَٰٓءِيلَ لَا تَعْبُدُونَ إِلَّا ٱللَّهَ وَبِٱلْوَٰلِدَيْنِ إِحْسَانًا وَذِى ٱلْقُرْبَىٰ وَٱلْيَتَـٰمَىٰ وَٱلْمَسَـٰكِينِ وَقُولُوا۟ لِلنَّاسِ حُسْنًا وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ ثُمَّ تَوَلَّيْتُمْ إِلَّا قَلِيلًا مِّنكُمْ وَأَنتُم مُّعْرِضُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:95",
      "text_ar": "وَلَن يَتَمَنَّوْهُ أَبَدًۢا بِمَا قَدَّمَتْ أَيْدِيهِمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّـٰلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:200",
      "text_ar": "فَإِذَا قَضَيْتُم مَّنَـٰسِكَكُمْ فَٱذْكُرُوا۟ ٱللَّهَ كَذِكْرِكُمْ ءَابَآءَكُمْ أَوْ أَشَدَّ ذِكْرًا ۗ فَمِنَ ٱلنَّاسِ مَن يَقُولُ رَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا وَمَا لَهُۥ فِى ٱلْـَٔاخِرَةِ مِنْ خَلَـٰقٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:223",
      "text_ar": "نِسَآؤُكُمْ حَرْثٌ لَّكُمْ فَأْتُوا۟ حَرْثَكُمْ أَنَّىٰ شِئْتُمْ ۖ وَقَدِّمُوا۟ لِأَنفُسِكُمْ ۚ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّكُم مُّلَـٰقُوهُ ۗ وَبَشِّرِ ٱلْمُؤْمِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:229",
      "text_ar": "ٱلطَّلَـٰقُ مَرَّتَانِ ۖ فَإِمْسَاكٌۢ بِمَعْرُوفٍ أَوْ تَسْرِيحٌۢ بِإِحْسَـٰنٍ ۗ وَلَا يَحِلُّ لَكُمْ أَن تَأْخُذُوا۟ مِمَّآ ءَاتَيْتُمُوهُنَّ شَيْـًٔا إِلَّآ أَن يَخَافَآ أَلَّا يُقِيمَا حُدُودَ ٱللَّهِ ۖ فَإِنْ خِفْتُمْ أَلَّا يُقِيمَا حُدُودَ ٱللَّهِ فَلَا جُنَاحَ عَلَيْهِمَا فِيمَا ٱفْتَدَتْ بِهِۦ ۗ تِلْكَ حُدُودُ ٱللَّهِ فَلَا تَعْتَدُوهَا ۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَأُو۟لَـٰٓئِكَ هُمُ ٱلظَّـٰلِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:233",
      "text_ar": "وَٱلْوَٰلِدَٰتُ يُرْضِعْنَ أَوْلَـٰدَهُنَّ حَوْلَيْنِ كَامِلَيْنِ ۖ لِمَنْ أَرَادَ أَن يُتِمَّ ٱلرَّضَاعَةَ ۚ وَعَلَى ٱلْمَوْلُودِ لَهُۥ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِٱلْمَعْرُوفِ ۚ لَا تُكَلَّفُ نَفْسٌ إِلَّا وُسْعَهَا ۚ لَا تُضَآرَّ وَٰلِدَةٌۢ بِوَلَدِهَا وَلَا مَوْلُودٌ لَّهُۥ بِوَلَدِهِۦ ۚ وَعَلَى ٱلْوَارِثِ مِثْلُ ذَٰلِكَ ۗ فَإِنْ أَرَادَا فِصَالًا عَن تَرَاضٍ مِّنْهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيْهِمَا ۗ وَإِنْ أَرَدتُّمْ أَن تَسْتَرْضِعُوٓا۟ أَوْلَـٰدَكُمْ فَلَا جُنَاحَ عَلَيْكُمْ إِذَا سَلَّمْتُم مَّآ ءَاتَيْتُم بِٱلْمَعْرُوفِ ۗ وَٱتَّقُوا۟ ٱللَّهَ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:246",
      "text_ar": "أَلَمْ تَرَ إِلَى ٱلْمَلَإِ مِنۢ بَنِىٓ إِسْرَٰٓءِيلَ مِنۢ بَعْدِ مُوسَىٰٓ إِذْ قَالُوا۟ لِنَبِىٍّ لَّهُمُ ٱبْعَثْ لَنَا مَلِكًا نُّقَـٰتِلْ فِى سَبِيلِ ٱللَّهِ ۖ قَالَ هَلْ عَسَيْتُمْ إِن كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ أَلَّا تُقَـٰتِلُوا۟ ۖ قَالُوا۟ وَمَا لَنَآ أَلَّا نُقَـٰتِلَ فِى سَبِيلِ ٱللَّهِ وَقَدْ أُخْرِجْنَا مِن دِيَـٰرِنَا وَأَبْنَآئِنَا ۖ فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ تَوَلَّوْا۟ إِلَّا قَلِيلًا مِّنْهُمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّـٰلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:73",
      "text_ar": "وَلَا تُؤْمِنُوٓا۟ إِلَّا لِمَن تَبِعَ دِينَكُمْ قُلْ إِنَّ ٱلْهُدَىٰ هُدَى ٱللَّهِ أَن يُؤْتَىٰٓ أَحَدٌ مِّثْلَ مَآ أُوتِيتُمْ أَوْ يُحَآجُّوكُمْ عِندَ رَبِّكُمْ ۗ قُلْ إِنَّ ٱلْفَضْلَ بِيَدِ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:143",
      "text_ar": "وَلَقَدْ كُنتُمْ تَمَنَّوْنَ ٱلْمَوْتَ مِن قَبْلِ أَن تَلْقَوْهُ فَقَدْ رَأَيْتُمُوهُ وَأَنتُمْ تَنظُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:152",
      "text_ar": "وَلَقَدْ صَدَقَكُمُ ٱللَّهُ وَعْدَهُۥٓ إِذْ تَحُسُّونَهُم بِإِذْنِهِۦ ۖ حَتَّىٰٓ إِذَا فَشِلْتُمْ وَتَنَـٰزَعْتُمْ فِى ٱلْأَمْرِ وَعَصَيْتُم مِّنۢ بَعْدِ مَآ أَرَىٰكُم مَّا تُحِبُّونَ ۚ مِنكُم مَّن يُرِيدُ ٱلدُّنْيَا وَمِنكُم مَّن يُرِيدُ ٱلْـَٔاخِرَةَ ۚ ثُمَّ صَرَفَكُمْ عَنْهُمْ لِيَبْتَلِيَكُمْ ۖ وَلَقَدْ عَفَا عَنكُمْ ۗ وَٱللَّهُ ذُو فَضْلٍ عَلَى ٱلْمُؤْمِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:19",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا يَحِلُّ لَكُمْ أَن تَرِثُوا۟ ٱلنِّسَآءَ كَرْهًا ۖ وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا۟ بِبَعْضِ مَآ ءَاتَيْتُمُوهُنَّ إِلَّآ أَن يَأْتِينَ بِفَـٰحِشَةٍ مُّبَيِّنَةٍ ۚ وَعَاشِرُوهُنَّ بِٱلْمَعْرُوفِ ۚ فَإِن كَرِهْتُمُوهُنَّ فَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًٔا وَيَجْعَلَ ٱللَّهُ فِيهِ خَيْرًا كَثِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:20",
      "text_ar": "وَإِنْ أَرَدتُّمُ ٱسْتِبْدَالَ زَوْجٍ مَّكَانَ زَوْجٍ وَءَاتَيْتُمْ إِحْدَىٰهُنَّ قِنطَارًا فَلَا تَأْخُذُوا۟ مِنْهُ شَيْـًٔا ۚ أَتَأْخُذُونَهُۥ بُهْتَـٰنًا وَإِثْمًا مُّبِينًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:24",
      "text_ar": "وَٱلْمُحْصَنَـٰتُ مِنَ ٱلنِّسَآءِ إِلَّا مَا مَلَكَتْ أَيْمَـٰنُكُمْ ۖ كِتَـٰبَ ٱللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُم مَّا وَرَآءَ ذَٰلِكُمْ أَن تَبْتَغُوا۟ بِأَمْوَٰلِكُم مُّحْصِنِينَ غَيْرَ مُسَـٰفِحِينَ ۚ فَمَا ٱسْتَمْتَعْتُم بِهِۦ مِنْهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَٰضَيْتُم بِهِۦ مِنۢ بَعْدِ ٱلْفَرِيضَةِ ۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:86",
      "text_ar": "وَإِذَا حُيِّيتُم بِتَحِيَّةٍ فَحَيُّوا۟ بِأَحْسَنَ مِنْهَآ أَوْ رُدُّوهَآ ۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَىْءٍ حَسِيبًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:103",
      "text_ar": "فَإِذَا قَضَيْتُمُ ٱلصَّلَوٰةَ فَٱذْكُرُوا۟ ٱللَّهَ قِيَـٰمًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا ٱطْمَأْنَنتُمْ فَأَقِيمُوا۟ ٱلصَّلَوٰةَ ۚ إِنَّ ٱلصَّلَوٰةَ كَانَتْ عَلَى ٱلْمُؤْمِنِينَ كِتَـٰبًا مَّوْقُوتًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:3",
      "text_ar": "حُرِّمَتْ عَلَيْكُمُ ٱلْمَيْتَةُ وَٱلدَّمُ وَلَحْمُ ٱلْخِنزِيرِ وَمَآ أُهِلَّ لِغَيْرِ ٱللَّهِ بِهِۦ وَٱلْمُنْخَنِقَةُ وَٱلْمَوْقُوذَةُ وَٱلْمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسْتَقْسِمُوا۟ بِٱلْأَزْلَـٰمِ ۚ ذَٰلِكُمْ فِسْقٌ ۗ ٱلْيَوْمَ يَئِسَ ٱلَّذِينَ كَفَرُوا۟ مِن دِينِكُمْ فَلَا تَخْشَوْهُمْ وَٱخْشَوْنِ ۚ ٱلْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِى وَرَضِيتُ لَكُمُ ٱلْإِسْلَـٰمَ دِينًا ۚ فَمَنِ ٱضْطُرَّ فِى مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِّإِثْمٍ ۙ فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:5",
      "text_ar": "ٱلْيَوْمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَـٰتُ ۖ وَطَعَامُ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ حِلٌّ لَّكُمْ وَطَعَامُكُمْ حِلٌّ لَّهُمْ ۖ وَٱلْمُحْصَنَـٰتُ مِنَ ٱلْمُؤْمِنَـٰتِ وَٱلْمُحْصَنَـٰتُ مِنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ مِن قَبْلِكُمْ إِذَآ ءَاتَيْتُمُوهُنَّ أُجُورَهُنَّ مُحْصِنِينَ غَيْرَ مُسَـٰفِحِينَ وَلَا مُتَّخِذِىٓ أَخْدَانٍ ۗ وَمَن يَكْفُرْ بِٱلْإِيمَـٰنِ فَقَدْ حَبِطَ عَمَلُهُۥ وَهُوَ فِى ٱلْـَٔاخِرَةِ مِنَ ٱلْخَـٰسِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:6",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا قُمْتُمْ إِلَى ٱلصَّلَوٰةِ فَٱغْسِلُوا۟ وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى ٱلْمَرَافِقِ وَٱمْسَحُوا۟ بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى ٱلْكَعْبَيْنِ ۚ وَإِن كُنتُمْ جُنُبًا فَٱطَّهَّرُوا۟ ۚ وَإِن كُنتُم مَّرْضَىٰٓ أَوْ عَلَىٰ سَفَرٍ أَوْ جَآءَ أَحَدٌ مِّنكُم مِّنَ ٱلْغَآئِطِ أَوْ لَـٰمَسْتُمُ ٱلنِّسَآءَ فَلَمْ تَجِدُوا۟ مَآءً فَتَيَمَّمُوا۟ صَعِيدًا طَيِّبًا فَٱمْسَحُوا۟ بِوُجُوهِكُمْ وَأَيْدِيكُم مِّنْهُ ۚ مَا يُرِيدُ ٱللَّهُ لِيَجْعَلَ عَلَيْكُم مِّنْ حَرَجٍ وَلَـٰكِن يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُۥ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:12",
      "text_ar": "وَلَقَدْ أَخَذَ ٱللَّهُ مِيثَـٰقَ بَنِىٓ إِسْرَٰٓءِيلَ وَبَعَثْنَا مِنْهُمُ ٱثْنَىْ عَشَرَ نَقِيبًا ۖ وَقَالَ ٱللَّهُ إِنِّى مَعَكُمْ ۖ لَئِنْ أَقَمْتُمُ ٱلصَّلَوٰةَ وَءَاتَيْتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِى وَعَزَّرْتُمُوهُمْ وَأَقْرَضْتُمُ ٱللَّهَ قَرْضًا حَسَنًا لَّأُكَفِّرَنَّ عَنكُمْ سَيِّـَٔاتِكُمْ وَلَأُدْخِلَنَّكُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۚ فَمَن كَفَرَ بَعْدَ ذَٰلِكَ مِنكُمْ فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:41",
      "text_ar": "يَـٰٓأَيُّهَا ٱلرَّسُولُ لَا يَحْزُنكَ ٱلَّذِينَ يُسَـٰرِعُونَ فِى ٱلْكُفْرِ مِنَ ٱلَّذِينَ قَالُوٓا۟ ءَامَنَّا بِأَفْوَٰهِهِمْ وَلَمْ تُؤْمِن قُلُوبُهُمْ ۛ وَمِنَ ٱلَّذِينَ هَادُوا۟ ۛ سَمَّـٰعُونَ لِلْكَذِبِ سَمَّـٰعُونَ لِقَوْمٍ ءَاخَرِينَ لَمْ يَأْتُوكَ ۖ يُحَرِّفُونَ ٱلْكَلِمَ مِنۢ بَعْدِ مَوَاضِعِهِۦ ۖ يَقُولُونَ إِنْ أُوتِيتُمْ هَـٰذَا فَخُذُوهُ وَإِن لَّمْ تُؤْتَوْهُ فَٱحْذَرُوا۟ ۚ وَمَن يُرِدِ ٱللَّهُ فِتْنَتَهُۥ فَلَن تَمْلِكَ لَهُۥ مِنَ ٱللَّهِ شَيْـًٔا ۚ أُو۟لَـٰٓئِكَ ٱلَّذِينَ لَمْ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمْ ۚ لَهُمْ فِى ٱلدُّنْيَا خِزْىٌ ۖ وَلَهُمْ فِى ٱلْـَٔاخِرَةِ عَذَابٌ عَظِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:58",
      "text_ar": "وَإِذَا نَادَيْتُمْ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوًا وَلَعِبًا ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:92",
      "text_ar": "وَأَطِيعُوا۟ ٱللَّهَ وَأَطِيعُوا۟ ٱلرَّسُولَ وَٱحْذَرُوا۟ ۚ فَإِن تَوَلَّيْتُمْ فَٱعْلَمُوٓا۟ أَنَّمَا عَلَىٰ رَسُولِنَا ٱلْبَلَـٰغُ ٱلْمُبِينُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:105",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ عَلَيْكُمْ أَنفُسَكُمْ ۖ لَا يَضُرُّكُم مَّن ضَلَّ إِذَا ٱهْتَدَيْتُمْ ۚ إِلَى ٱللَّهِ مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "6:46",
      "text_ar": "قُلْ أَرَءَيْتُمْ إِنْ أَخَذَ ٱللَّهُ سَمْعَكُمْ وَأَبْصَـٰرَكُمْ وَخَتَمَ عَلَىٰ قُلُوبِكُم مَّنْ إِلَـٰهٌ غَيْرُ ٱللَّهِ يَأْتِيكُم بِهِ ۗ ٱنظُرْ كَيْفَ نُصَرِّفُ ٱلْـَٔايَـٰتِ ثُمَّ هُمْ يَصْدِفُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "6:94",
      "text_ar": "وَلَقَدْ جِئْتُمُونَا فُرَٰدَىٰ كَمَا خَلَقْنَـٰكُمْ أَوَّلَ مَرَّةٍ وَتَرَكْتُم مَّا خَوَّلْنَـٰكُمْ وَرَآءَ ظُهُورِكُمْ ۖ وَمَا نَرَىٰ مَعَكُمْ شُفَعَآءَكُمُ ٱلَّذِينَ زَعَمْتُمْ أَنَّهُمْ فِيكُمْ شُرَكَـٰٓؤُا۟ ۚ لَقَد تَّقَطَّعَ بَيْنَكُمْ وَضَلَّ عَنكُم مَّا كُنتُمْ تَزْعُمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:19",
      "text_ar": "وَيَـٰٓـَٔادَمُ ٱسْكُنْ أَنتَ وَزَوْجُكَ ٱلْجَنَّةَ فَكُلَا مِنْ حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَـٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّـٰلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:71",
      "text_ar": "قَالَ قَدْ وَقَعَ عَلَيْكُم مِّن رَّبِّكُمْ رِجْسٌ وَغَضَبٌ ۖ أَتُجَـٰدِلُونَنِى فِىٓ أَسْمَآءٍ سَمَّيْتُمُوهَآ أَنتُمْ وَءَابَآؤُكُم مَّا نَزَّلَ ٱللَّهُ بِهَا مِن سُلْطَـٰنٍ ۚ فَٱنتَظِرُوٓا۟ إِنِّى مَعَكُم مِّنَ ٱلْمُنتَظِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:161",
      "text_ar": "وَإِذْ قِيلَ لَهُمُ ٱسْكُنُوا۟ هَـٰذِهِ ٱلْقَرْيَةَ وَكُلُوا۟ مِنْهَا حَيْثُ شِئْتُمْ وَقُولُوا۟ حِطَّةٌ وَٱدْخُلُوا۟ ٱلْبَابَ سُجَّدًا نَّغْفِرْ لَكُمْ خَطِيٓـَٔـٰتِكُمْ ۚ سَنَزِيدُ ٱلْمُحْسِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:15",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُوا۟ زَحْفًا فَلَا تُوَلُّوهُمُ ٱلْأَدْبَارَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:44",
      "text_ar": "وَإِذْ يُرِيكُمُوهُمْ إِذِ ٱلْتَقَيْتُمْ فِىٓ أَعْيُنِكُمْ قَلِيلًا وَيُقَلِّلُكُمْ فِىٓ أَعْيُنِهِمْ لِيَقْضِىَ ٱللَّهُ أَمْرًا كَانَ مَفْعُولًا ۗ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:45",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا لَقِيتُمْ فِئَةً فَٱثْبُتُوا۟ وَٱذْكُرُوا۟ ٱللَّهَ كَثِيرًا لَّعَلَّكُمْ تُفْلِحُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:3",
      "text_ar": "وَأَذَٰنٌ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلنَّاسِ يَوْمَ ٱلْحَجِّ ٱلْأَكْبَرِ أَنَّ ٱللَّهَ بَرِىٓءٌ مِّنَ ٱلْمُشْرِكِينَ ۙ وَرَسُولُهُۥ ۚ فَإِن تُبْتُمْ فَهُوَ خَيْرٌ لَّكُمْ ۖ وَإِن تَوَلَّيْتُمْ فَٱعْلَمُوٓا۟ أَنَّكُمْ غَيْرُ مُعْجِزِى ٱللَّهِ ۗ وَبَشِّرِ ٱلَّذِينَ كَفَرُوا۟ بِعَذَابٍ أَلِيمٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:25",
      "text_ar": "لَقَدْ نَصَرَكُمُ ٱللَّهُ فِى مَوَاطِنَ كَثِيرَةٍ ۙ وَيَوْمَ حُنَيْنٍ ۙ إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنكُمْ شَيْـًٔا وَضَاقَتْ عَلَيْكُمُ ٱلْأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُم مُّدْبِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:32",
      "text_ar": "يُرِيدُونَ أَن يُطْفِـُٔوا۟ نُورَ ٱللَّهِ بِأَفْوَٰهِهِمْ وَيَأْبَى ٱللَّهُ إِلَّآ أَن يُتِمَّ نُورَهُۥ وَلَوْ كَرِهَ ٱلْكَـٰفِرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:38",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ مَا لَكُمْ إِذَا قِيلَ لَكُمُ ٱنفِرُوا۟ فِى سَبِيلِ ٱللَّهِ ٱثَّاقَلْتُمْ إِلَى ٱلْأَرْضِ ۚ أَرَضِيتُم بِٱلْحَيَوٰةِ ٱلدُّنْيَا مِنَ ٱلْـَٔاخِرَةِ ۚ فَمَا مَتَـٰعُ ٱلْحَيَوٰةِ ٱلدُّنْيَا فِى ٱلْـَٔاخِرَةِ إِلَّا قَلِيلٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:83",
      "text_ar": "فَإِن رَّجَعَكَ ٱللَّهُ إِلَىٰ طَآئِفَةٍ مِّنْهُمْ فَٱسْتَـْٔذَنُوكَ لِلْخُرُوجِ فَقُل لَّن تَخْرُجُوا۟ مَعِىَ أَبَدًا وَلَن تُقَـٰتِلُوا۟ مَعِىَ عَدُوًّا ۖ إِنَّكُمْ رَضِيتُم بِٱلْقُعُودِ أَوَّلَ مَرَّةٍ فَٱقْعُدُوا۟ مَعَ ٱلْخَـٰلِفِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:50",
      "text_ar": "قُلْ أَرَءَيْتُمْ إِنْ أَتَىٰكُمْ عَذَابُهُۥ بَيَـٰتًا أَوْ نَهَارًا مَّاذَا يَسْتَعْجِلُ مِنْهُ ٱلْمُجْرِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:59",
      "text_ar": "قُلْ أَرَءَيْتُم مَّآ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزْقٍ فَجَعَلْتُم مِّنْهُ حَرَامًا وَحَلَـٰلًا قُلْ ءَآللَّهُ أَذِنَ لَكُمْ ۖ أَمْ عَلَى ٱللَّهِ تَفْتَرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:72",
      "text_ar": "فَإِن تَوَلَّيْتُمْ فَمَا سَأَلْتُكُم مِّنْ أَجْرٍ ۖ إِنْ أَجْرِىَ إِلَّا عَلَى ٱللَّهِ ۖ وَأُمِرْتُ أَنْ أَكُونَ مِنَ ٱلْمُسْلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:81",
      "text_ar": "فَلَمَّآ أَلْقَوْا۟ قَالَ مُوسَىٰ مَا جِئْتُم بِهِ ٱلسِّحْرُ ۖ إِنَّ ٱللَّهَ سَيُبْطِلُهُۥٓ ۖ إِنَّ ٱللَّهَ لَا يُصْلِحُ عَمَلَ ٱلْمُفْسِدِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "11:28",
      "text_ar": "قَالَ يَـٰقَوْمِ أَرَءَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى وَءَاتَىٰنِى رَحْمَةً مِّنْ عِندِهِۦ فَعُمِّيَتْ عَلَيْكُمْ أَنُلْزِمُكُمُوهَا وَأَنتُمْ لَهَا كَـٰرِهُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "11:63",
      "text_ar": "قَالَ يَـٰقَوْمِ أَرَءَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى وَءَاتَىٰنِى مِنْهُ رَحْمَةً فَمَن يَنصُرُنِى مِنَ ٱللَّهِ إِنْ عَصَيْتُهُۥ ۖ فَمَا تَزِيدُونَنِى غَيْرَ تَخْسِيرٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "11:88",
      "text_ar": "قَالَ يَـٰقَوْمِ أَرَءَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى وَرَزَقَنِى مِنْهُ رِزْقًا حَسَنًا ۚ وَمَآ أُرِيدُ أَنْ أُخَالِفَكُمْ إِلَىٰ مَآ أَنْهَىٰكُمْ عَنْهُ ۚ إِنْ أُرِيدُ إِلَّا ٱلْإِصْلَـٰحَ مَا ٱسْتَطَعْتُ ۚ وَمَا تَوْفِيقِىٓ إِلَّا بِٱللَّهِ ۚ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "12:6",
      "text_ar": "وَكَذَٰلِكَ يَجْتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأْوِيلِ ٱلْأَحَادِيثِ وَيُتِمُّ نِعْمَتَهُۥ عَلَيْكَ وَعَلَىٰٓ ءَالِ يَعْقُوبَ كَمَآ أَتَمَّهَا عَلَىٰٓ أَبَوَيْكَ مِن قَبْلُ إِبْرَٰهِيمَ وَإِسْحَـٰقَ ۚ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "12:40",
      "text_ar": "مَا تَعْبُدُونَ مِن دُونِهِۦٓ إِلَّآ أَسْمَآءً سَمَّيْتُمُوهَآ أَنتُمْ وَءَابَآؤُكُم مَّآ أَنزَلَ ٱللَّهُ بِهَا مِن سُلْطَـٰنٍ ۚ إِنِ ٱلْحُكْمُ إِلَّا لِلَّهِ ۚ أَمَرَ أَلَّا تَعْبُدُوٓا۟ إِلَّآ إِيَّاهُ ۚ ذَٰلِكَ ٱلدِّينُ ٱلْقَيِّمُ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "14:12",
      "text_ar": "وَمَا لَنَآ أَلَّا نَتَوَكَّلَ عَلَى ٱللَّهِ وَقَدْ هَدَىٰنَا سُبُلَنَا ۚ وَلَنَصْبِرَنَّ عَلَىٰ مَآ ءَاذَيْتُمُونَا ۚ وَعَلَى ٱللَّهِ فَلْيَتَوَكَّلِ ٱلْمُتَوَكِّلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "15:3",
      "text_ar": "ذَرْهُمْ يَأْكُلُوا۟ وَيَتَمَتَّعُوا۟ وَيُلْهِهِمُ ٱلْأَمَلُ ۖ فَسَوْفَ يَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_035_chunk00",
        "verse_key": "2:35",
        "text_ar": "قوله تعالى: {وقلنا يا آدم اسكن أنت وزوجك الجنة} وذلك أن آدم لم يكن له في الجنة من يجانسه فنام نومة فخلق الله زوجته حواء من قصيراء من شقه الأيسر، وسميت حواء لأنها خلقت من حي، خلقها الله عز وجل من غير أن أحس به آدم ولا وجد له ألماً، ولو وجد ألماً لما عطف رجل على امرأة قط فلما هب من نومه رآها جالسة عند رأسه (كأحسن ما في) خلق الله فقال لها: من أنتِ؟، قالت: زوجتك خلقني الله لك تسكن إلي وأسكن إليك.{وكلا منها رغداً} واسعاً كثيراً.{حيث شئتما} كيف شئتما ومتى شئتما وأين شئتما.{ولا تقربا هذه الشجرة} يعني ل",
        "char_start": 0,
        "char_end": 884,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_058_chunk00",
        "verse_key": "2:58",
        "text_ar": "( وإذ قلنا ادخلوا هذه القرية ) سميت القرية قرية لأنها تجمع أهلها ومنه المقراة للحوض لأنها تجمع الماء قال ابن عباس رضي الله عنهما هي أريحاء وهي قرية الجبارين كان فيها قوم من بقية عاد يقال لهم العمالقة ورأسهم عوج بن عنق وقيل بلقاء وقال مجاهد بيت المقدس ، وقال الضحاك : هي الرملة والأردن وفلسطين وتدمر وقال مقاتل : إيليا وقال ابن كيسان : الشام ( فكلوا منها حيث شئتم رغدا ) موسعا عليكم ( وادخلوا الباب ) يعني بابا من أبواب القرية وكان لها سبعة أبواب ( سجدا ) أي ركعا خضعا منحنين وقال وهب : فإذا دخلتموه ف",
        "char_start": 0,
        "char_end": 935,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_064_chunk00",
        "verse_key": "2:64",
        "text_ar": "{ثم توليتم} أعرضتم.{من بعد ذلك} من بعد ما قبلتم التوراة.{فلولا فضل الله عليكم ورحمته} يعني بالإمهال وإدراج وتأخير العذاب عنكم.{لكنتم} لصرتم.{من الخاسرين} من المغبونين بالعقوبة وذهاب الدنيا والآخرة.وقيل: من المعذبين في الحال لأنه رحمهم بالإمهال.",
        "char_start": 0,
        "char_end": 244,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_083_chunk00",
        "verse_key": "2:83",
        "text_ar": "قوله تعالى: {وإذ أخذنا ميثاق بني إسرائيل} في التوراة، والميثاق العهد الشديد.{لا تعبدون إلا الله} قرأ ابن كثير وحمزة والكسائي (لا يعبدون) بالياء وقرأ الآخرون بالتاء لقوله تعالى: {وقولوا للناس حسناً} معناه ألا تعبدوا فلما حذف أن صار الفعل مرفوعاً، وقرأ أُبي بن كعب: \"لا تعبدوا إلا الله على النهي\".{وبالوالدين إحساناً} أي ووصيناهم بالوالدين إحساناً، براً بهما وعطفاً عليهما ونزولاً عند أمرهما، فيما لا يخالف أمر الله تعالى.{وذي القربى} أي وبذي القرابة، والقربى مصدر كالحسنى.{واليتامى} جمع يتيم وهو الطفل",
        "char_start": 0,
        "char_end": 1004,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_095_chunk00",
        "verse_key": "2:95",
        "text_ar": "قال الله تعالى: {ولن يتمنوه أبداً بما قدمت أيديهم} لعلمهم أنهم في دعواهم كاذبون.وأراد (بما قدمت أيديهم) أي ما قدموه من الأعمال وأضافها إلى اليد [دون سائر الأعضاء] لأن أكثر جنايات الإنسان تكون باليد فأضيف إلى اليد أعماله وإن لم يكن لليد فيها عمل.{والله عليم بالظالمين}.",
        "char_start": 0,
        "char_end": 268,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_200_chunk00",
        "verse_key": "2:200",
        "text_ar": "قوله تعالى : ( فإذا قضيتم مناسككم ) أي فرغتم من حجكم وذبحتم نسائككم أي ذبائحكم ، يقال نسك الرجل ينسك نسكا إذا ذبح نسيكته وذلك بعد رمي جمرة العقبة والاستقرار بمنى ( فاذكروا الله ) بالتكبير والتحميد والثناء عليه ( كذكركم آباءكم ) وذلك أن العرب كانت إذا فرغت من الحج وقفت عند البيت فذكرت مفاخر آبائها فأمرهم الله تعالى بذكره وقال : فاذكروني فأنا الذي فعلت ذلك بكم وبآبائكم وأحسنت إليكم ، وإليهمقال ابن عباس وعطاء : معناه فاذكروا الله كذكر الصبيان الصغار الآباء وذلك أن الصبي أول ما يتكلم يلهج بذكر أبيه ",
        "char_start": 0,
        "char_end": 1145,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_223_chunk00",
        "verse_key": "2:223",
        "text_ar": "قوله تعالى : ( نساؤكم حرث لكم فأتوا حرثكم أنى شئتم ) أخبرنا أبو سعيد أحمد بن إبراهيم الشريحي أنا أبو إسحاق الثعلبي أخبرنا عبد الله بن حامد الأصبهاني أخبرنا محمد بن يعقوب أنا ابن المنادي أنا يونس أنا يعقوب القمي عن جعفر بن المغيرة عن سعيد بن جبير عن ابن عباس رضي الله عنهما قال : جاء عمر إلى رسول الله صلى الله عليه وسلم فقال : \" يا رسول الله هلكت قال وما الذي أهلكك؟ قال : حولت رحلي البارحة فلم يرد عليه شيئا وأوحى الله إليه ( نساؤكم حرث لكم فأتوا حرثكم أنى شئتم ) يقول : أدبر وأقبل واتق الدبر والحيض",
        "char_start": 0,
        "char_end": 4714,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_229_chunk00",
        "verse_key": "2:229",
        "text_ar": "قوله تعالى : ( الطلاق مرتان ) روي عن عروة بن الزبير قال : كان الناس في الابتداء يطلقون من غير حصر ولا عدد وكان الرجل يطلق امرأته فإذا قاربت انقضاء عدتها راجعها ثم طلقها كذلك ثم راجعها يقصد مضارتها فنزلت هذه الآية ( الطلاق مرتان ) يعني الطلاق الذي يملك الرجعة عقيبه مرتان فإذا طلق ثلاثا فلا تحل له إلا بعد نكاح زوج آخر .قوله تعالى : ( فإمساك بمعروف ) قيل : أراد بالإمساك الرجعة بعد الثانية والصحيح أن المراد منه : الإمساك بعد الرجعة يعني إذا راجعها بعد الرجعة الثانية فعليه أن يمسكها بالمعروف والمعروف",
        "char_start": 0,
        "char_end": 6256,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_233_chunk00",
        "verse_key": "2:233",
        "text_ar": "قوله تعالى : ( والوالدات يرضعن أولادهن ) يعني : المطلقات اللاتي لهن أولاد من أزواجهن يرضعن خبر بمعنى الأمر وهو أمر استحباب لا أمر إيجاب لأنه لا يجب عليهن الإرضاع إذا كان يوجد من ترضع الولد لقوله تعالى في سورة الطلاق : \" فإن أرضعن لكم فآتوهن أجورهن \" ( - الطلاق ) فإن رغبت الأم في الإرضاع فهي أولى من غيرها ( حولين كاملين ) أي سنتين وذكر الكمال للتأكيد كقوله تعالى : \" تلك عشرة كاملة \" ( 196 - البقرة ) وقيل إنما قال كاملين لأن العرب قد تسمي بعض الحول حولا وبعض الشهر شهرا كما قال الله تعالى : ( الحج ",
        "char_start": 0,
        "char_end": 5077,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "قوله تعالى ( ألم تر إلى الملأ من بني إسرائيل ) والملأ من القوم : وجوههم وأشرافهم وأصل الملأ الجماعة من الناس ولا واحد له من لفظه كالقوم والرهط والإبل والخيل والجيش وجمعه أملاء ( من بعد موسى ) أي من بعد موت موسى ( إذ قالوا لنبي لهم ) واختلفوا في ذلك النبي فقال قتادة هو يوشع بن نون بن افرائيم بن يوسف عليه السلام وقال السدي : اسمه شمعون وإنما سمي شمعون لأن أمه دعت الله أن يرزقها غلاما فاستجاب الله دعاءها فولدت غلاما فسمته سمعون تقول سمع الله تعالى دعائي والسين تصير شينا بالعبرانية وهو شمعون بن صفية",
        "char_start": 0,
        "char_end": 4128,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_073_chunk00",
        "verse_key": "3:73",
        "text_ar": "قوله تعالى ( ولا تؤمنوا إلا لمن تبع دينكم ) هذا متصل بالأول من قول اليهود بعضهم لبعض ( ولا تؤمنوا ) أي لا تصدقوا ( إلا لمن تبع دينكم ) وافق ملتكم واللام في \" لمن \" صلة ، أي لا تصدقوا إلا من تبع دينكم اليهودية كقوله تعالى : \" قل عسى أن يكون ردف لكم \" ( 72 - النحل ) أي : ردفكم ( قل إن الهدى هدى الله ) هذا خبر من الله عز وجل أن البيان بيانه ثم اختلفوا : فمنهم من قال : كلام معترض بين كلامين ، وما بعده متصل بالكلام الأول ، إخبار عن قول اليهود بعضهم لبعض ، ومعناه : ولا تؤمنوا إلا لمن تبع دينكم ، ولا ت",
        "char_start": 0,
        "char_end": 2882,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_143_chunk00",
        "verse_key": "3:143",
        "text_ar": "( ولقد كنتم تمنون الموت من قبل أن تلقوه ) وذلك أن قوما من المسلمين تمنوا يوما كيوم بدر ليقاتلوا ويستشهدوا فأراهم الله يوم أحد وقوله ( تمنون الموت ) أي : سبب الموت وهو الجهاد من قبل أن تلقوه ، ( فقد رأيتموه ) يعني : أسبابه .فإن قيل : ما معنى قوله ( وأنتم تنظرون ) بعد قوله : ( فقد رأيتموه ) قيل : ذكره تأكيدا وقيل : الرؤية قد تكون بمعنى العلم ، فقال : ( وأنتم تنظرون ) ليعلم أن المراد بالرؤية النظر ، وقيل : وأنتم تنظرون إلى محمد صلى الله عليه وسلم .",
        "char_start": 0,
        "char_end": 449,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_152_chunk00",
        "verse_key": "3:152",
        "text_ar": "قوله تعالى : ( ولقد صدقكم الله وعده ) قال محمد بن كعب القرظي : لما رجع رسول الله صلى الله عليه وسلم وأصحابه إلى المدينة من أحد وقد أصابهم ما أصابهم ، قال ناس من أصحابه : من أين أصابنا هذا؟ وقد وعدنا الله النصر فأنزل الله تعالى :( ولقد صدقكم الله وعده ) بالنصر والظفر وذلك أن النصر والظفر كان للمسلمين في الابتداء ، ( إذ تحسونهم بإذنه ) وذلك أن رسول الله صلى الله عليه وسلم جعل أحدا خلف ظهره واستقبل المدينة وجعل عينين ، وهو جبل عن يساره وأقام عليه الرماة وأمر عليهم عبد الله بن جبير وقال لهم : احموا ",
        "char_start": 0,
        "char_end": 2153,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "( يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها ) نزلت في أهل المدينة كانوا في الجاهلية وفي أول الإسلام ، إذا مات الرجل وله امرأة جاء ابنه من غيرها أو قريبه من عصبته فألقى ثوبه على تلك المرأة وعلى خبائها ، فصار أحق بها من نفسها ومن غيره ، فإن شاء تزوجها بغير صداق إلا الصداق الأول الذي أصدقها الميت ، وإن شاء زوجها غيره وأخذ صداقها ، وإن شاء عضلها ومنعها من الأزواج يضارها لتفتدي منه بما ورثته من الميت ، أو تموت هي فيرثها ، فإن ذهبت المرأة إلى أهلها قبل أن يلقي عليها ولي زوجها ثوبه فهي أحق بن",
        "char_start": 0,
        "char_end": 2276,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_020_chunk00",
        "verse_key": "4:20",
        "text_ar": "( وإن أردتم استبدال زوج مكان زوج ) أراد بالزوج الزوجة ولم يكن من قبلها نشوز ولا فاحشة ، ( وآتيتم إحداهن قنطارا ) وهو المال الكثير ، صداقا ، ( فلا تأخذوا منه ) من القنطار ، ( شيئا أتأخذونه ) استفهام بمعنى التوبيخ ، ( بهتانا وإثما مبينا ) انتصابهما من وجهين أحدهما بنزع الخافض ، والثاني بالإضمار تقديره : تصيبون في أخذه بهتانا وإثماثم قال:",
        "char_start": 0,
        "char_end": 337,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_024_chunk00",
        "verse_key": "4:24",
        "text_ar": "قوله تعالى : ( والمحصنات من النساء إلا ما ملكت أيمانكم ) يعني : ذوات الأزواج ، لا يحل للغير نكاحهن قبل مفارقة الأزواج ، وهذه السابعة من النساء اللاتي حرمت بالسبب .قال أبو سعيد الخدري : نزلت في نساء كن يهاجرن إلى رسول الله صلى الله عليه وسلم ولهن أزواج فيتزوجهن بعض المسلمين ، ثم قدم أزواجهن مهاجرين فنهى الله المسلمين عن نكاحهن ، ثم استثنى فقال : ( إلا ما ملكت أيمانكم ) يعني : السبايا اللواتي سبين ولهن أزواج في دار الحرب فيحل لمالكهن وطؤهن بعد الاستبراء ، لأن بالسبي يرتفع النكاح بينها وبين زوجها .",
        "char_start": 0,
        "char_end": 6387,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_086_chunk00",
        "verse_key": "4:86",
        "text_ar": "قوله تعالى : ( وإذا حييتم بتحية فحيوا بأحسن منها أو ردوها ) التحية : هي دعاء الحياة ، والمراد بالتحية هاهنا ، السلام ، يقول : إذا سلم عليكم مسلم فأجيبوا بأحسن منها أو ردوها كما سلم ، فإذا قال : السلام عليكم ، فقل : وعليكم السلام ورحمة الله ، وإذا قال : السلام عليكم ورحمة الله ، فقل : وعليكم السلام ورحمة الله وبركاته ، فإذا قال : السلام عليكم ورحمة الله وبركاته ، فرد مثله ، روي أن رجلا سلم على ابن عباس رضي الله عنهما ، قال : السلام عليكم ورحمة الله وبركاته ، ثم زاد شيئا ، فقال ابن عباس : إن السلا",
        "char_start": 0,
        "char_end": 2346,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_103_chunk00",
        "verse_key": "4:103",
        "text_ar": "( فإذا قضيتم الصلاة ) يعني : صلاة الخوف ، أي : فرغتم منها ، ( فاذكروا الله ) أي صلوا لله ( قياما ) في حال الصحة ، ( وقعودا ) في حال المرض ، ( وعلى جنوبكم ) عند الحرج والزمانة ، وقيل : اذكروا الله بالتسبيح والتحميد والتهليل والتمجيد ، على كل حال .أخبرنا عمرو بن عبد العزيز الكاشاني ، أنا القاسم بن جعفر الهاشمي ، أنا أبو علي محمد بن أحمد اللؤلؤي ، أنا أبو داود السجستاني ، أنا محمد بن العلاء ، أنا ابن أبي زائدة ، عن أبيه ، عن خالد بن سلمة ، عن الزهري ، عن عروة ، عن عائشة رضي الله عنها قالت : \" كان ر",
        "char_start": 0,
        "char_end": 2430,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_003_chunk00",
        "verse_key": "5:3",
        "text_ar": "قوله عز وجل ( حرمت عليكم الميتة والدم ولحم الخنزير وما أهل لغير الله به ) أي : ما ذكر على ذبحه اسم غير الله تعالى ، ( والمنخنقة ) وهي التي تختنق فتموت ، قال ابن عباس : كان أهل الجاهلية يخنقون الشاة حتى إذا ماتت أكلوها ، ( والموقوذة ) هي المقتولة بالخشب ، قال قتادة : كانوا يضربونها بالعصا فإذا ماتت أكلوها ، ( والمتردية ) هي التي تتردى من مكان عال أو في بئر فتموت ، ( والنطيحة ) وهي التي تنطحها أخرى فتموت ، وهاء التأنيث تدخل في الفعيل إذا كان بمعنى الفاعل ، فإذا كان بمعنى المفعول استوى فيه المذكر و",
        "char_start": 0,
        "char_end": 7330,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "قوله عز وجل : ( اليوم أحل لكم الطيبات ) يعني : الذبائح على اسم الله عز وجل ، ( وطعام الذين أوتوا الكتاب حل لكم ) يريد : ذبائح اليهود والنصارى ومن دخل في دينهم من سائر الأمم قبل مبعث النبي محمد صلى الله عليه وسلم حلال لكم ، فأما من دخل في دينهم بعد مبعث محمد صلى الله عليه وسلم فلا تحل ذبيحته ، ولو ذبح يهودي أو نصراني على اسم غير الله كالنصراني يذبح باسم المسيح فاختلفوا فيه ، قال عمر لا يحل ، وهو قول ربيعة ، وذهب أكثر أهل العلم إلى أنه يحل ، وهو قول الشعبي وعطاء والزهري ومكحول ، سئل الشعبي ومكحول ",
        "char_start": 0,
        "char_end": 2704,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_035_chunk00",
        "verse_key": "2:35",
        "text_ar": "يقول الله تعالي اخبارا عما اكرم به ادم : بعد ان امر الملايكه بالسجود له ، فسجدوا الا ابليس : انه اباحه الجنه يسكن منها حيث يشاء ، وياكل منها ما شاء رغدا ، اي : هنييا واسعا طيبا .وروي الحافظ ابو بكر بن مردويه ، من حديث محمد بن عيسي الدامغاني ، حدثنا سلمه بن الفضل ، عن ميكاييل ، عن ليث ، عن ابراهيم التيمي ، عن ابيه ، عن ابي ذر : قال : قلت : يا رسول الله ؛ اريت ادم ، انبيا كان ؟ قال : نعم ، نبيا رسولا كلمه الله قبلا فقال : ( اسكن انت وزوجك الجنه ) .وقد اختلف في الجنه التي اسكنها ادم ، اهي في السماء",
        "char_start": 0,
        "char_end": 4601,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_058_chunk00",
        "verse_key": "2:58",
        "text_ar": "يقول تعالي لايما لهم علي نكولهم عن الجهاد ودخول الارض المقدسه ، لما قدموا من بلاد مصر صحبه موسي ، عليه السلام ، فامروا بدخول الارض المقدسه التي هي ميراث لهم عن ابيهم اسراييل ، وقتال من فيها من العماليق الكفره ، فنكلوا عن قتالهم وضعفوا واستحسروا ، فرماهم الله في التيه عقوبه لهم ، كما ذكره تعالي في سوره المايده ؛ ولهذا كان اصح القولين ان هذه البلده هي بيت المقدس ، كما نص علي ذلك السدي ، والربيع بن انس ، وقتاده ، [ وابو مسلم الاصفهاني وغير واحد وقد قال الله تعالي : ( يا قوم ادخلوا الارض المقدسه الت",
        "char_start": 0,
        "char_end": 3799,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_064_chunk00",
        "verse_key": "2:64",
        "text_ar": "وقوله تعالي : ( ثم توليتم من بعد ذلك ) يقول تعالي : ثم بعد هذا الميثاق الموكد العظيم توليتم عنه وانثنيتم ونقضتموه ( فلولا فضل الله عليكم ورحمته ) اي : توبته عليكم وارساله النبيين والمرسلين اليكم ( لكنتم من الخاسرين ) بنقضكم ذلك الميثاق في الدنيا والاخره .",
        "char_start": 0,
        "char_end": 255,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_083_chunk00",
        "verse_key": "2:83",
        "text_ar": "ذكر تبارك وتعالي بني اسراييل بما امرهم به من الاوامر ، واخذ ميثاقهم علي ذلك ، وانهم تولوا عن ذلك كله ، واعرضوا قصدا وعمدا ، وهم يعرفونه ويذكرونه ، فامرهم ان يعبدوه ولا يشركوا به شييا . وبهذا امر جميع خلقه ، ولذلك خلقهم كما قال تعالي : ( وما ارسلنا من قبلك من رسول الا نوحي اليه انه لا اله الا انا فاعبدون ) [ الانبياء : 25 ] وقال تعالي : ( ولقد بعثنا في كل امه رسولا ان اعبدوا الله واجتنبوا الطاغوت ) [ النحل : 36 ] وهذا هو اعلي الحقوق واعظمها ، وهو حق الله تعالي ، ان يعبد وحده لا شريك له ، ثم بعده ",
        "char_start": 0,
        "char_end": 3734,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_095_chunk00",
        "verse_key": "2:95",
        "text_ar": "( ولن يتمنوه ابدا بما قدمت ايديهم والله عليم بالظالمين ) اي : بعلمهم بما عندهم من العلم بك ، والكفر بذلك ، ولو تمنوه يوم قال لهم ذلك ما بقي علي الارض يهودي الا مات .وقال الضحاك ، عن ابن عباس : ( فتمنوا الموت ) فسلوا الموت .وقال عبد الرزاق ، عن معمر ، عن عبد الكريم الجزري ، عن عكرمه ، قوله : ( فتمنوا الموت ان كنتم صادقين ) قال : قال ابن عباس : لو تمني اليهود الموت لماتوا .وقال ابن ابي حاتم : حدثنا ابي ، حدثنا علي بن محمد الطنافسي ، حدثنا عثام ، سمعت الاعمش قال : لا اظنه الا عن المنهال ، عن سعيد ب",
        "char_start": 0,
        "char_end": 5927,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_200_chunk00",
        "verse_key": "2:200",
        "text_ar": "يامر تعالي بذكره والاكثار منه بعد قضاء المناسك وفراغها .وقوله : ( كذكركم اباءكم ) اختلفوا في معناه ، فقال ابن جريج ، عن عطاء : هو كقول الصبي : \" ابه امه \" ، يعني : كما يلهج الصبي بذكر ابيه وامه ، فكذلك انتم ، فالهجوا بذكر الله بعد قضاء النسك . وكذا قال الضحاك والربيع بن انس . وروي ابن جرير من طريق العوفي ، عن ابن عباس نحوه .وقال سعيد بن جبير ، عن ابن عباس [ قال ] : كان اهل الجاهليه يقفون في الموسم فيقول الرجل منهم : كان ابي يطعم ويحمل الحمالات [ ويحمل الديات ] . ليس لهم ذكر غير فعال ابايهم . فان",
        "char_start": 0,
        "char_end": 2049,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_223_chunk00",
        "verse_key": "2:223",
        "text_ar": "وقوله : ( نساوكم حرث لكم ) قال ابن عباس : الحرث موضع الولد ( فاتوا حرثكم اني شيتم ) اي : كيف شيتم مقبله ومدبره في صمام واحد ، كما ثبتت بذلك الاحاديث .قال البخاري : حدثنا ابو نعيم ، حدثنا سفيان عن ابن المنكدر قال : سمعت جابرا قال : كانت اليهود تقول : اذا جامعها من ورايها جاء الولد احول ، فنزلت : ( نساوكم حرث لكم فاتوا حرثكم اني شيتم ) ورواه داود من حديث سفيان الثوري به .وقال ابن ابي حاتم : حدثنا يونس بن عبد الاعلي ، اخبرنا ابن وهب ، اخبرني مالك بن انس وابن جريج وسفيان بن سعيد الثوري : ان محمد بن ",
        "char_start": 0,
        "char_end": 21332,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_229_chunk00",
        "verse_key": "2:229",
        "text_ar": "هذه الايه الكريمه رافعه لما كان عليه الامر في ابتداء الاسلام ، من ان الرجل كان احق برجعه امراته ، وان طلقها مايه مره ما دامت في العده ، فلما كان هذا فيه ضرر علي الزوجات قصرهم الله عز وجل الي ثلاث طلقات ، واباح الرجعه في المره والثنتين ، وابانها بالكليه في الثالثه ، فقال : الطلاق مرتان فامساك بمعروف او تسريح باحسانقال ابو داود ، رحمه الله ، في سننه : \" باب في نسخ المراجعه بعد الطلقات الثلاث \" : حدثنا احمد بن محمد المروزي ، حدثني علي بن الحسين بن واقد ، عن ابيه ، عن يزيد النحوي ، عن عكرمه ، عن ابن",
        "char_start": 0,
        "char_end": 21603,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_233_chunk00",
        "verse_key": "2:233",
        "text_ar": "هذا ارشاد من الله تعالي للوالدات : ان يرضعن اولادهن كمال الرضاعه ، وهي سنتان ، فلا اعتبار بالرضاعه بعد ذلك ; ولهذا قال : ( لمن اراد ان يتم الرضاعه ) وذهب اكثر الايمه الي انه لا يحرم من الرضاعه الا ما كان دون الحولين ، فلو ارتضع المولود وعمره فوقهما لم يحرم .قال الترمذي : \" باب ما جاء ان الرضاعه لا تحرم الا في الصغر دون الحولين \" : حدثنا قتيبه ، حدثنا ابو عوانه ، عن هشام بن عروه ، عن فاطمه بنت المنذر ، عن ام سلمه قالت : قال رسول الله صلي الله عليه وسلم : \" لا يحرم من الرضاع الا ما فتق الامعاء في ",
        "char_start": 0,
        "char_end": 6007,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "قال عبد الرزاق عن معمر عن قتاده : هذا النبي هو يوشع بن نون . قال ابن جرير : يعني ابن افراثيم بن يوسف بن يعقوب . وهذا القول بعيد ; لان هذا كان بعد موسي بدهر طويل ، وكان ذلك في زمان داود عليه السلام ، كما هو مصرح به في القصه وقد كان بين داود وموسي ما ينيف عن الف سنه والله اعلم .وقال السدي : هو شمعون وقال مجاهد : هو شمويل عليه السلام . وكذا قال محمد بن اسحاق عن وهب بن منبه وهو : شمويل بن بالي بن علقمه بن يرخام بن اليهو بن تهو بن صوف بن علقمه بن ماحث بن عموصا بن عزريا بن صفنيه بن علقمه بن ابي ياسف ب",
        "char_start": 0,
        "char_end": 2082,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_073_chunk00",
        "verse_key": "3:73",
        "text_ar": "وقوله : ( ولا تومنوا الا لمن تبع دينكم ) اي : لا تطمينوا وتظهروا سركم وما عندكم الا لمن تبع دينكم ولا تظهروا ما بايديكم الي المسلمين ، فيومنوا به ويحتجوا به عليكم ، قال الله تعالي : ( قل ان الهدي هدي الله ) اي هو الذي يهدي قلوب المومنين الي اتم الايمان ، بما ينزله علي عبده ورسوله محمد صلي الله عليه وسلم من الايات البينات ، والدلايل القاطعات ، والحجج الواضحات ، وان كتمتم - ايها اليهود - ما بايديكم من صفه محمد في كتبكم التي نقلتموها عن الانبياء الاقدمين .وقوله ( ان يوتي احد مثل ما اوتيتم او يحاجوك",
        "char_start": 0,
        "char_end": 1015,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_143_chunk00",
        "verse_key": "3:143",
        "text_ar": "وقوله : ( ولقد كنتم تمنون الموت من قبل ان تلقوه فقد رايتموه وانتم تنظرون ) اي : قد كنتم - ايها المومنون - قبل هذا اليوم تتمنون لقاء العدو وتتحرقون عليهم ، وتودون مناجزتهم ومصابرتهم ، فها قد حصل لكم الذي تمنيتموه وطلبتموه ، فدونكم فقاتلوا وصابروا .وقد ثبت في الصحيحين ان رسول الله صلي الله عليه وسلم قال : \" لا تمنوا لقاء العدو ، وسلوا الله العافيه ، فاذا لقيتموهم فاصبروا ، واعلموا ان الجنه تحت ظلال السيوف \" .ولهذا قال : ( فقد رايتموه ) يعني الموت شاهدتموه في لمعان السيوف وحد الاسنه واشتباك الرماح ",
        "char_start": 0,
        "char_end": 635,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_152_chunk00",
        "verse_key": "3:152",
        "text_ar": "( ولقد صدقكم الله وعده ) اي : اول النهار ( اذ تحسونهم ) اي : تقتلونهم ( باذنه ) اي : بتسليطه اياكم عليهم ( حتي اذا فشلتم ) وقال ابن جريج : قال ابن عباس : الفشل الجبن ، ( وتنازعتم في الامر وعصيتم ) كما وقع للرماه ( من بعد ما اراكم ما تحبون ) وهو الظفر منهم ( منكم من يريد الدنيا ) وهم الذين رغبوا في المغنم حين راوا الهزيمه ( ومنكم من يريد الاخره ثم صرفكم عنهم ليبتليكم ) ثم ادالهم عليكم ليختبركم ويمتحنكم ( ولقد عفا عنكم ) اي : غفر لكم ذلك الصنيع ، وذلك - والله اعلم - لكثره عدد العدو وعددهم ، وقله ع",
        "char_start": 0,
        "char_end": 9499,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "قال البخاري : حدثنا محمد بن مقاتل ، حدثنا اسباط بن محمد ، حدثنا الشيباني عن عكرمه ، عن ابن عباس - قال الشيباني : وذكره ابو الحسن السوايي ، ولا اظنه ذكره الا عن ابن عباس - : ( ياايها الذين امنوا لا يحل لكم ان ترثوا النساء كرها ) قال : كانوا اذا مات الرجل كان اولياوه احق بامراته ، ان شاء بعضهم تزوجها ، وان شاءوا زوجوها ، وان شاءوا لم يزوجوها ، فهم احق بها من اهلها ، فنزلت هذه الايه في ذلك .هكذا رواه البخاري وابو داود ، والنسايي ، وابن مردويه ، وابن ابي حاتم ، من حديث ابي اسحاق الشيباني - واسمه سلي",
        "char_start": 0,
        "char_end": 7295,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_020_chunk00",
        "verse_key": "4:20",
        "text_ar": "وقوله : ( وان اردتم استبدال زوج مكان زوج واتيتم احداهن قنطارا فلا تاخذوا منه شييا اتاخذونه بهتانا واثما مبينا ) اي : اذا اراد احدكم ان يفارق امراه ويستبدل مكانها غيرها ، فلا ياخذن مما كان اصدق الاولي شييا ، ولو كان قنطارا من مال .وقد قدمنا في سوره ال عمران الكلام علي القنطار بما فيه كفايه عن اعادته هاهنا .وفي هذه الايه دلاله علي جواز الاصداق بالمال الجزيل ، وقد كان عمر بن الخطاب نهي عن كثره الاصداق ، ثم رجع عن ذلك كما قال الامام احمد : حدثنا اسماعيل ، حدثنا سلمه بن علقمه ، عن محمد بن سيرين ، قال",
        "char_start": 0,
        "char_end": 2828,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_024_chunk00",
        "verse_key": "4:24",
        "text_ar": "وقوله [ تعالي ] ( والمحصنات من النساء الا ما ملكت ايمانكم ) اي : وحرم عليكم الاجنبيات المحصنات وهن المزوجات ( الا ما ملكت ايمانكم ) يعني : الا ما ملكتموهن بالسبي ، فانه يحل لكم وطوهن اذا استبراتموهن ، فان الايه نزلت في ذلك .قال الامام احمد : حدثنا عبد الرزاق ، اخبرنا سفيان - هو الثوري - عن عثمان البتي ، عن ابي الخليل ، عن ابي سعيد الخدري قال : اصبنا نساء من سبي اوطاس ، ولهن ازواج ، فكرهنا ان نقع عليهن ولهن ازواج ، فسالنا النبي صلي الله عليه واله وسلم ، فنزلت هذه الايه : ( والمحصنات من النساء الا",
        "char_start": 0,
        "char_end": 7298,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_086_chunk00",
        "verse_key": "4:86",
        "text_ar": "وقوله : ( واذا حييتم بتحيه فحيوا باحسن منها او ردوها ) اي : اذا سلم عليكم المسلم ، فردوا عليه افضل مما سلم ، او ردوا عليه بمثل ما سلم [ به ] فالزياده مندوبه ، والمماثله مفروضه .قال ابن جرير : حدثني موسي بن سهل الرملي ، حدثنا عبد الله بن السري الانطاكي ، حدثنا هشام بن لاحق ، عن عاصم الاحول ، عن ابي عثمان النهدي ، عن سلمان الفارسي قال : جاء رجل الي النبي صلي الله عليه وسلم فقال : السلام عليك يا رسول الله . فقال : \" وعليك السلام ورحمه الله \" . ثم اتي اخر فقال : السلام عليك يا رسول الله ورحمه الله .",
        "char_start": 0,
        "char_end": 3324,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_103_chunk00",
        "verse_key": "4:103",
        "text_ar": "يامر الله تعالي بكثره الذكر عقيب صلاه الخوف ، وان كان مشروعا مرغبا فيه ايضا بعد غيرها ، ولكن هاهنا اكد لما وقع فيها من التخفيف في اركانها ، ومن الرخصه في الذهاب فيها والاياب وغير ذلك ، مما ليس يوجد في غيرها ، كما قال تعالي في الاشهر الحرم : ( فلا تظلموا فيهن انفسكم ) [ التوبه : 36 ] ، وان كان هذا منهيا عنه في غيرها ، ولكن فيها اكد لشده حرمتها وعظمها ; ولهذا قال تعالي : ( فاذا قضيتم الصلاه فاذكروا الله قياما وقعودا وعلي جنوبكم ) اي في ساير احوالكم .ثم قال : ( فاذا اطماننتم فاقيموا الصلاه ) اي : ف",
        "char_start": 0,
        "char_end": 1090,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_003_chunk00",
        "verse_key": "5:3",
        "text_ar": "يخبر تعالي عباده خبرا متضمنا النهي عن تعاطي هذه المحرمات من الميته وهي : ما مات من الحيوان حتف انفه ، من غير ذكاه ولا اصطياد ، وما ذاك الا لما فيها من المضره ، لما فيها من الدم المحتقن ، فهي ضاره للدين وللبدن فلهذا حرمها الله ، عز وجل ، ويستثني من الميته السمك ، فانه حلال سواء مات بتذكيه او غيرها ، لما رواه مالك في موطيه والشافعي واحمد في مسنديهما وابو داود والترمذي والنسايي وابن ماجه في سننهم وابن خزيمه وابن حبان في صحيحيهما ، عن ابي هريره ، ان رسول الله صلي الله عليه وسلم سيل عن ماء البحر ، فق",
        "char_start": 0,
        "char_end": 34162,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "لما ذكر تعالي ما حرمه علي عباده المومنين من الخبايث ، وما احله لهم من الطيبات ، قال بعده : ( اليوم احل لكم الطيبات )ثم ذكر حكم ذبايح اهل الكتابين من اليهود والنصاري فقال : ( وطعام الذين اوتوا الكتب حل لكم ) قال ابن عباس وابو امامه ومجاهد وسعيد بن جبير وعكرمه وعطاء والحسن ومكحول وابراهيم النخعي والسدي ومقاتل بن حيان : يعني ذبايحهم .وهذا امر مجمع عليه بين العلماء ؛ ان ذبايحهم حلال للمسلمين ; لانهم يعتقدون تحريم الذبح لغير الله ، ولا يذكرون علي ذبايحهم الا اسم الله ، وان اعتقدوا فيه تعالي ما هو منز",
        "char_start": 0,
        "char_end": 8045,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_035_chunk00",
        "verse_key": "2:35",
        "text_ar": "«وقلنا يا آدم اسكن أنت» تأكيد للضمير المستتر ليعطف عليه «وزوجك» حواء بالمد وكان خلقها من ضلعه الأيسر «الجنة وكلا منها» أكلاً «رغداً» واسعا لاحجر فيه «حيث شئتما ولا تقربا هذه الشجرة» بالأكل منها وهى الحنطة أو الكرم أو غيرهما «فتكونا» فتصيرا «من الظالمين» العاصين.",
        "char_start": 0,
        "char_end": 262,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_058_chunk00",
        "verse_key": "2:58",
        "text_ar": "«وإذ قلنا» لهم بعد خروجهم من التيه «ادخلوا هذه القرية» بيت المقدس أو أريحا «فكلوا منها حيث شئتم رغدا» واسعا لاَ حَجْرَ فيه «وادخلوا الباب» أي بابها «سجداً» منحنين «وقولوا» مسألتنا «حطة» أي أن تحط عنا خطايانا «نغفر» وفي قراءة بالياء والتاء مبنياً للمفعول فيهما «لكم خطاياكم وسنزيد المحسنين» بالطاعة ثواباً.",
        "char_start": 0,
        "char_end": 305,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_064_chunk00",
        "verse_key": "2:64",
        "text_ar": "«ثم توليتم» أعرضتم «من بعد ذلك» الميثاق عن الطاعة «فلولا فضل الله عليكم ورحمته» لكم بالتوبة أو تأخير العذاب «لكنتم من الخاسرين» الهالكين.",
        "char_start": 0,
        "char_end": 137,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_083_chunk00",
        "verse_key": "2:83",
        "text_ar": "«و» اذكر «إذ أخذنا ميثاق بني إسرائيل» في التوراة وقلنا «لا تعبدون» بالتاء والياء «إلا الله» خبر بمعنى النهي، وقرئ: لا تعبدوا «و» أحسنوا «بالوالدين إحساناً» براً «وذي القربى» القرابة عطف على الوالدين «واليتامى والمساكين وقولوا للناس» قولا «حسناً» من الأمر بالمعروف والنهي عن المنكر والصدق في شأن محمد والرفق بهم، وفي قراءة بضم الحاء وسكون السين مصدر وصف به مبالغة «وأقيموا الصلاة وآتوا الزكاة» فقبلتم ذلك «ثم تولَّيتم» أعرضتم عن الوفاء به، فيه التفات عن الغيبة والمراد آباؤهم «إلا قليلا منكم وأنتم معر",
        "char_start": 0,
        "char_end": 517,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_095_chunk00",
        "verse_key": "2:95",
        "text_ar": "«ولن يتمنَّوه أبداً بما قدمت أيديهم» من كفرهم بالنبي المستلزم لكذبهم «والله عليم بالظالمين» الكافرين فيجازيهم.",
        "char_start": 0,
        "char_end": 110,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_200_chunk00",
        "verse_key": "2:200",
        "text_ar": "«فإذا قضيتم» أدَّيتم «مناسككم» عبادات حجكم بأن رميتم جمرة العقبة وطفتم واستقررتم بمنى «فاذكروا الله» بالتكبير والثناء «كذكركم آباءكم» كما كنتم تذكرونهم عند فراغ حجكم بالمفاخرة «أو أشد ذكرا» من ذكركم إياهم ونصب أشد على الحال من ذكر المنصوب باذكروا إذ لو تأخر عنه لكان صفة له «فمن الناس من يقول ربنا آتنا» نصيبا «في الدنيا» فيؤتاه فيها «وماله في الآخرة من خلاق» نصيب.",
        "char_start": 0,
        "char_end": 365,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_223_chunk00",
        "verse_key": "2:223",
        "text_ar": "«نساؤكم حرث لكم» أي محل زرعكم الولد «فأتوا حرثكم» أي محله وهو القبل «أنَّى» كيف «شئتم» من قيام وقعود واضطجاع وإقبال وإدبار، نزل ردا لقول اليهود: من أتى امرأته في قبلها أي من جهة دبرها جاء الولد أحول «وقدموا لأنفسكم» العمل الصالح كالتسمية عند الجماع «واتقوا الله» في أمره ونهيه «واعلموا أنكم ملاقوه» بالبعث فيجازيكم بأعمالكم «وبشر المؤمنين» الذين اتقوه بالجنة.",
        "char_start": 0,
        "char_end": 359,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_229_chunk00",
        "verse_key": "2:229",
        "text_ar": "«الطلاق» أي التطليق الذي يراجع بعده «مرتان» أي اثنتان «فإمساك» أي فعليكم إمساكهن بعده بأن تراجعوهن «بمعروف» من غير ضرار «أو تسريح» أي إرسالهن «بإحسان ولا يحل لكم» أيها الأزواج «أن تأخذوا مما آتيتموهن» من المهور «شيئا» إذا طلقتموهن «إلا أن يخافا» أي الزوجان «أ» ن «لا يقيما حدود الله» أي لا يأتيا بما حده لهما من الحقوق وفي قراءة يخافا بالبناء للمفعول فأن لا يقيما بدل اشتمال من الضمير فيه وقرئ بالفوقانية في الفعلين «فإن خفتم أ» ن «لا يقيما حدود الله فلا جناح عليهما» «فيما افتدت به» نفسها من المال ل",
        "char_start": 0,
        "char_end": 641,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_233_chunk00",
        "verse_key": "2:233",
        "text_ar": "«والوالدات يرضعن» أي ليرضعن «أولادهن حولين» عامين «كاملين» صفة مؤكدة، ذلك «لمن أراد أن يتم الرضاعة» ولا زيادة عليه «وعلى المولود له» أي الأب «رزقهن» إطعام الوالدات «وكسوتهن» على الإرضاع إذا كن مطلقات «بالمعروف» بقدر طاقته «لا تُكلَّفُ نفس إلا وسعها» طاقتها «لا تضار والدة بولدها» أي بسببه بأن تكره على إرضاعه إذا امتنعت «ولا» يضار «مولود له بولده» أي بسببه بأن يكلف فوق طاقته وإضافة الولد إلى كل منهما في الموضعين للاستعطاف «وعلى الوارث» أي وارث الأب وهو الصبي أي على وليه في ماله «مثل ذلك» الذي على ",
        "char_start": 0,
        "char_end": 918,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "«ألم تر إلى الملأ» الجماعة «من بني إسرائيل من بعد» موت «موسى» أي إلى قصتهم وخبرهم «إذ قالوا لنبي لهم» هو شمويل «ابعث» أقم «لنا ملكا نقاتل» معه «في سبيل الله» تنتظم به كلمتنا ونرجع إليه «قال» النبي لهم «هل عسَيتم» بالفتح والكسر «إن كتب عليكم القتال أ» ن «لا تقاتلوا» خبر عسى والاستفهام لتقرير التوقع بها «قالوا وما لنا أ» ن «لا نقاتل في سبيل الله وقد أُخرجنا من ديارنا وأبنائنا» بسبيهم وقتلهم وقد فعل بهم ذلك قوم جالوت أي لا مانع لنا منه مع وجود مقتضيه قال تعالى: «فلما كُتب عليهم القتال تولوا» عنه وج",
        "char_start": 0,
        "char_end": 639,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_073_chunk00",
        "verse_key": "3:73",
        "text_ar": "وقالوا أيضاً «ولا تؤمنوا» تصدَّقوا «إلا لمن تبع» وافق «دينكم» قال تعالى: «قل» لهم يا محمد «إن الهدى هدى الله» الذي هو الإسلام وما عداه ضلال، والجملةُ اعتراض «أن» أي بأن «يؤتى أحدّ مثل ما أوتيتم» من الكتاب والحكمة والفصائل وأن مفعول تؤمنوا، والمستثنى منه أحد قدم عليه المستثنى المعنى: لا تقروا بأن أحدا يؤتى ذلك إلا لمن اتبع دينكم «أو» بأن «يحاجوكم» أي المؤمنون يغلبوكم «عند ربكم» يوم القيامة لأنكم أصح دينا، وفي قراءة: أأن بهمزة التوبيخ أي إيتاء أحد مثله تقرون به قال تعالى «قل إن الفضل بيد الله يؤتي",
        "char_start": 0,
        "char_end": 596,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_143_chunk00",
        "verse_key": "3:143",
        "text_ar": "«ولقد كنتم تمنون» فيه حذف إحدى التاءين في الأصل «الموت من قبل أن تلقوه» حيث قلتم ليت لنا يوما كيوم بدر لننال ما نال شهداؤه «فقد رأيتموه» أي سببه الحرب «وأنتم تنظرون» أي بصراء تتأملون الحال كيف هي فلم انهزمتم؟ ونزل في هزيمتهم لما أشيع أن النبي قتل وقال لهم المنافقون إن كان قتل فارجعوا إلى دينكم.",
        "char_start": 0,
        "char_end": 295,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_152_chunk00",
        "verse_key": "3:152",
        "text_ar": "«ولقد صدقكم الله وعده» إياكم بالنصر «إذ تحسونهم» تقتلونهم «بإذنه» بإرادته «حتى إذا فَشِلْتُمْ» جبنتم عن القتال «وتنازعتم» اختلفتم «في الأمر» أي أمر النبي صلى الله عليه وسلم بالمقام في سفح الجبل للرمي فقال بعضكم: نذهب فقد نُصر أصحابنا وبعضكم: لا نخالف أمر النبي صلى الله عليه وسلم «وعصَيتم» أمره فتركتم المركز لطلب الغنيمة «من بعد ما أراكم» اللهُ «ما تحبون» من النصر وجواب إذا دل عليه ما قبله أي منعكم نصره «منكم من يريد الدنيا» فترك المركز للغنيمة «ومنكم من يريد الآخرة» فثبت به حتى قتل كعبد الله بن ",
        "char_start": 0,
        "char_end": 686,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "«يا أيُّها الذين آمنوا لا يحلُّ لكم أن ترثوا النساء» أي ذاتهن «كرها» بالفتح والضم لغتان أي مكرهيهن على ذلك كانوا في الجاهلية يرثون نساء أقربائهم فإن شاءوا تزوجوهن بلا صداق أو زوَّجوهن وأخذوا صداقهن أو عضلوهن حتى يفتدين بما ورثنه أو يمتن فيرثوهن فنُهوا عن ذلك «ولا» أن «تعضلوهن» أي تمنعوا أزواجكم عن نكاح غيركم بإمساكهن ولا رغبة لكم فيهن ضرارا «لتذهبوا ببعض ما آتيتموهن» من المهر «إلا أن يأتين بفاحشة مبيَّنة» بفتح الياء وكسرها أي بينت أو هي بينة أي زنا أو نشوز فلكم أن تضاروهن حتى يفتدين منكم ويختلعن",
        "char_start": 0,
        "char_end": 676,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_020_chunk00",
        "verse_key": "4:20",
        "text_ar": "«وإن أردتم استبدال زوج مكان زوج» أي أخذها بدلها بأن طلقتموها «و» قد «آتيتم إحداهن» أي الزوجات «قنطارا» مالا كثيرا صداقا «فلا تأخذوا منه شيئا أتأخُذُونهُ بهتانا» ظلما «وإثما مبينا» بينا ونصبهما على الحال، والاستفهامُ للتوبيخ وللإنكار في قوله.",
        "char_start": 0,
        "char_end": 241,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_024_chunk00",
        "verse_key": "4:24",
        "text_ar": "«و» حرمت عليكم «المحصَنات» أي ذوات الأزواج «من النساء» أن تنكحوهن قبل مفارقة أزواجهن حرائر مسلمات كن أو لا «إلا ما ملكت أيمانكم» من الإماء بالسبي فلكم وطؤهن وإن كان لهن أزواج في دار الحرب بعد الاستبراء «كتاب الله» نصب على المصدر أي كتب ذلك «عليكم وَأحلَّ» بالبناء للفاعل والمفعول «لكم ما وراء ذلكم» أي سوى ما حرم عليكم من النساء «أن تبتغوا» تطلبوا النساء «بأموالكم» بصداق أو ثمن «محصنين» متزوجين «غير مسافحين» زانين «فما» فمن «استمتعتم» تمتعتم «به منهن» ممن تزوجتم بالوطء «فآتوهن أجورهن» مهورهن التي ",
        "char_start": 0,
        "char_end": 655,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_086_chunk00",
        "verse_key": "4:86",
        "text_ar": "«وإذا حُيِّيتم بتحية» كأن قيل لكم سلام عليكم «فحيُّوا» المحيِّي «بأحسن منها» بأن تقولوا له عليك السلام ورحمة الله وبركاته «أوردُّوها» بأن تقولوا له كما قال أي الواجب أحدهما والأول أفضل «إن الله كان على كل شيء حسيبا» محاسبا فيجازي عليه ومنه ردُّ السلام وخصّت السنة الكافر والمبتدع والفاسق والمسلِّم على قاضي الحاجة ومن في الحمام والآكل فلا يجب الرد عليهم بل يكره في غير الأخير ويقال للكافر وعليك.",
        "char_start": 0,
        "char_end": 395,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_103_chunk00",
        "verse_key": "4:103",
        "text_ar": "«فإذا قضيتم الصلاة» فرغتم منها «فاذكروا الله» بالتهليل والتسبيح «قياما وقعودا وعلى جنوبكم» مضطجعين أي في كل حال «فإذا اطمأننتم» أمنتم «فأقيموا الصلاة» أدُّوها بحقوقها «إن الصلاة كانت على المؤمنين كتابا» مكتوبا مفروضا «موْقوتا» أي مقدرا وقتها فلا تؤخر عنه، ونزل لما بعث اصلى الله عليه وسلم طائفة في طلب أبي سفيان وأصحابه لما رجعوا من أحد فشكوا الجراحات.",
        "char_start": 0,
        "char_end": 352,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_003_chunk00",
        "verse_key": "5:3",
        "text_ar": "«حرِّمت عليكم الميتة» أي أكلها «والدم» أي المسفوح كما في الأنعام «ولحم الخنزير وما أهل لغير الله به» بأن ذُبح على اسم غيره «والمنخنقة» الميتة خنقا «والموقوذة» المقتولة ضربا «والمتردية» الساقطة من علو إلى أسفل فماتت «والنطيحة» المقتولة بنطح أخرى لها «وما أكل السبع» منه «إلا ما ذكيتم» أي أدركتم فيه الروح من هذه الأشياء فذبحتموه «وما ذُبح على» اسم «النصب» جمع نصاب وهي الأصنام «وأن تستقسموا» تطلبوا القسم والحكم «بالأزلام» جمع زلم بفتح الزاي وضمها مع فتح اللام قدح _بكسر القاف_ صغير لا ريش له ولا نصل ",
        "char_start": 0,
        "char_end": 1111,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "«اليوم أحل لكم الطيبات» المستلذات «وطعام الذين أوتوا الكتاب» أي ذبائح اليهود والنصارى «حلٌ» حلال «لكم وطعامكم» إياهم «حل لهم والمحصنات من المؤمنات والمحصنات» الحرائر «من الذين أوتوا الكتاب من قبلكم» حل لكم أن تنكحوهن «إذا آتيتموهنَّ أجورهنَّ» مهورهنَّ «محصنين» متزوجين «غير مسافحين» معلنين بالزنا بهن «ولا متخذي أخدان» منهن تسرون بالزنا بهن «ومن يكفر بالإيمان» أي يرتد «فقد حبط عمله» الصالح قبل ذلك فلا يعتد به ولا يثاب عليه «وهو في الآخرة من الخاسرين» إذا مات عليه.",
        "char_start": 0,
        "char_end": 466,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_035_chunk00",
        "verse_key": "2:35",
        "text_ar": "وقال الله: يا ادم اسكن انت وزوجك حواء الجنه، وتمتعا بثمارها تمتعًا هنييًا واسعًا في اي مكان تشاءان فيها، ولا تقربا هذه الشجره حتي لا تقعا في المعصيه، فتصيرا من المتجاوزين امر الله.",
        "char_start": 0,
        "char_end": 180,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_058_chunk00",
        "verse_key": "2:58",
        "text_ar": "واذكروا نعمتنا عليكم حين قلنا: ادخلوا مدينه «بيت المقدس» فكلوا من طيباتها في اي مكان منها اكلا هنييًا، وكونوا في دخولكم خاضعين لله، ذليلين له، وقولوا: ربَّنا ضَعْ عنَّا ذنوبنا، نستجب لكم ونعف عنكم ونسترها عليكم، وسنزيد المحسنين باعمالهم خيرًا وثوابًا.",
        "char_start": 0,
        "char_end": 251,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_064_chunk00",
        "verse_key": "2:64",
        "text_ar": "ثم خالفتم وعصيتم مرة أخرى، بعد أَخْذِ الميثاق ورَفْع الجبل كشأنكم دائمًا. فلولا فَضْلُ الله عليكم ورحمته بالتوبة، والتجاوز عن خطاياكم، لصرتم من الخاسرين في الدنيا والآخرة.",
        "char_start": 0,
        "char_end": 171,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_083_chunk00",
        "verse_key": "2:83",
        "text_ar": "واذكروا يا بني اسراييل حين اخَذْنا عليكم عهدًا موكدًا: بان تعبدوا الله وحده لا شريك له، وان تحسنوا للوالدين، وللاقربين، وللاولاد الذين مات اباوهم وهم دون بلوغ الحلم، وللمحتاجين الذين لا يملكون ما يكفيهم ويسد حاجتهم، وان تقولوا للناس اطيب الكلام، مع اداء الصلاه وايتاء الزكاه، ثم اَعْرَضْتم ونقضتم العهد -الا قليلا منكم ثبت عليه- وانتم مستمرون في اعراضكم.",
        "char_start": 0,
        "char_end": 354,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_095_chunk00",
        "verse_key": "2:95",
        "text_ar": "ولن يفعلوا ذلك أبدًا; لما يعرفونه من صدق النبي محمد صلى الله عليه وسلم ومن كذبهم وافترائهم، وبسبب ما ارتكبوه من الكفر والعصيان، المؤَدِّيَيْن إلى حرمانهم من الجنة ودخول النار. والله تعالى عليم بالظالمين من عباده، وسيجازيهم على ذلك.",
        "char_start": 0,
        "char_end": 231,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_200_chunk00",
        "verse_key": "2:200",
        "text_ar": "فإذا أتممتم عبادتكم، وفرغتم من أعمال الحج، فأكثروا من ذكر الله والثناء عليه، مثل ذكركم مفاخر آبائكم وأعظم من ذلك. فمن الناس فريق يجعل همه الدنيا فقط، فيدعو قائلا ربنا آتنا في الدنيا صحة، ومالا وأولادًا، وهؤلاء ليس لهم في الآخرة حظ ولا نصيب; لرغبتهم عنها وقَصْرِ هَمِّهم على الدنيا.",
        "char_start": 0,
        "char_end": 281,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_223_chunk00",
        "verse_key": "2:223",
        "text_ar": "نساؤكم موضع زرع لكم، تضعون النطفة في أرحامهن، فَيَخْرج منها الأولاد بمشيئة الله، فجامعوهن في محل الجماع فقط، وهو القبل بأي كيفية شئتم، وقَدِّموا لأنفسكم أعمالا صالحة بمراعاة أوامر الله، وخافوا الله، واعلموا أنكم ملاقوه للحساب يوم القيامة. وبشِّر المؤمنين -أيها النبي- بما يفرحهم ويسرُّهم من حسن الجزاء في الآخرة.",
        "char_start": 0,
        "char_end": 312,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_229_chunk00",
        "verse_key": "2:229",
        "text_ar": "الطلاق الذي تحصل به الرجعة مرتان، واحدة بعد الأخرى، فحكم الله بعد كل طلقة هو إمساك المرأة بالمعروف، وحسن العشرة بعد مراجعتها، أو تخلية سبيلها مع حسن معاملتها بأداء حقوقها، وألا يذكرها مطلقها بسوء. ولا يحل لكم -أيها الأزواج- أن تأخذوا شيئًا مما أعطيتموهن من المهر ونحوه، إلا أن يخاف الزوجان ألا يقوما بالحقوق الزوجية، فحينئذ يعرضان أمرهما على الأولياء، فإن خاف الأولياء عدم إقامة الزوجين حدود الله، فلا حرج على الزوجين فيما تدفعه المرأة للزوج مقابل طلاقها. تلك الأحكام هي حدود الله الفاصلة بين الحلال ",
        "char_start": 0,
        "char_end": 597,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_233_chunk00",
        "verse_key": "2:233",
        "text_ar": "وعلى الوالدات إرضاع أولادهن مدة سنتين كاملتين لمن أراد إتمام الرضاعة، ويجب على الآباء أن يكفُلوا للمرضعات المطلقات طعامهن وكسوتهن، على الوجه المستحسن شرعًا وعرفًا; لأن الله لا يكلف نفسًا إلا قدر طاقتها، ولا يحل للوالدين أن يجعلوا المولود وسيلة للمضارة بينهما، ويجب على الوارث عند موت الوالد مثل ما يجب على الوالد قبل موته من النفقة والكسوة. فإن أراد الوالدان فطام المولود قبل انتهاء السنتين فلا حرج عليهما إذا تراضيا وتشاورا في ذلك; ليصلا إلى ما فيه مصلحة المولود. وإن اتفق الوالدان على إرضاع المولود",
        "char_start": 0,
        "char_end": 692,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "الم تعلم -ايها الرسول- قصه الاشراف والوجهاء من بني اسراييل من بعد زمان موسي; حين طلبوا من نبيهم ان يولي عليهم ملكا، يجتمعون تحت قيادته، ويقاتلون اعداءهم في سبيل الله. قال لهم نبيهم: هل الامر كما اتوقعه انْ فُرِض عليكم القتال في سبيل الله انكم لا تقاتلون; فاني اتوقع جبنكم وفراركم من القتال، قالوا مستنكرين توقع نبيهم: واي مانع يمنعنا عن القتال في سبيل الله، وقد اَخْرَجَنَا عدوُّنا من ديارنا، وابعدنا عن اولادنا بالقتل والاسر؟ فلما فرض الله عليهم القتال مع الملِك الذي عيَّنه لهم جَبُنوا وفرُّوا عن ا",
        "char_start": 0,
        "char_end": 576,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_073_chunk00",
        "verse_key": "3:73",
        "text_ar": "ولا تصدِّقوا تصديقًا صحيحًا الا لمَن تبع دينكم فكان يهودياً، قل لهم -ايها الرسول-: ان الهدي والتوفيق هدي الله وتوفيقه للايمان الصحيح. وقالوا: لا تظهروا ما عندكم من العلم للمسلمين فيتعلمون منكم فيساووكم في العلم به، وتكون لهم الافضليه عليكم، او ان يتخذوه حجه عند ربكم يغلبونكم بها. قل لهم -ايها الرسول-: ان الفضل والعطاء والامور كلها بيد الله وتحت تصرفه، يوتيها من يشاء ممن امن به وبرسوله. والله واسع عليم، يَسَعُ بعلمه وعطايه جميع مخلوقاته، ممن يستحق فضله ونعمه.",
        "char_start": 0,
        "char_end": 462,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_143_chunk00",
        "verse_key": "3:143",
        "text_ar": "ولقد كنتم -ايها المومنون- قبل غزوه «اُحد» تتمنون لقاء العدو; لتنالوا شرف الجهاد والاستشهاد في سبيل الله الذي حَظِي به اخوانكم في غزوه «بدر» ، فها هو ذا قد حصل لكم الذي تمنيتموه وطلبتموه، فدونكم فقاتلوا وصابروا.",
        "char_start": 0,
        "char_end": 210,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_152_chunk00",
        "verse_key": "3:152",
        "text_ar": "ولقد حقق الله لكم ما وعدكم به من نصر، حين كنتم تقتلون الكفار في غزوه «اُحد» باذنه تعالي، حتي اذا جَبُنتم وضعفتم عن القتال واختلفتم: هل تبقون في مواقعكم او تتركونها لجمع الغنايم مع مَن يجمعها؟ وعصيتم امر رسولكم حين امركم الا تفارفوا اماكنكم باي حال، حلَّت بكم الهزيمه من بعد ما اراكم ما تحبون من النصر، وتبيَّن ان منكم مَن يريد الغنايم، وان منكم مَن يطلب الاخره وثوابها، ثم صرف الله وجوهكم عن عدوكم; ليختبركم، وقد علم الله ندمكم وتوبتكم فعفا عنكم، والله ذو فضل عظيم علي المومنين.",
        "char_start": 0,
        "char_end": 478,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "يا أيها الذين آمنوا لا يجوز لكم أن تجعلوا نساء آبائكم من جملة تَرِكتهم، تتصرفون فيهن بالزواج منهن، أو المنع لهن، أو تزويجهن للآخرين، وهن كارهات لذلك كله، ولا يجوز لكم أن تضارُّوا أزواجكم وأنتم كارهون لهن; ليتنازلن عن بعض ما آتيتموهن من مهر ونحوه، إلا أن يرتكبن أمرا فاحشا كالزنى، فلكم حيننذ إمساكهن حتى تأخذوا ما أعطيتموهن. ولتكن مصاحبتكم لنسائكم مبنية على التكريم والمحبة، وأداء ما لهن من حقوق. فإن كرهتموهن لسبب من الأسباب الدنيوية فاصبروا; فعسى أن تكرهوا أمرًا من الأمور ويكون فيه خير كثير.",
        "char_start": 0,
        "char_end": 493,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_020_chunk00",
        "verse_key": "4:20",
        "text_ar": "وإن أردتم استبدال زوجة مكان أخرى، وكنتم قد أعطيتم مَن تريدون طلاقها مالا كثيرًا مهرًا لها، فلا يحل لكم أن تأخذوا منه شيئًا، أتأخذونه كذبًا وافتراءً واضحًا؟",
        "char_start": 0,
        "char_end": 155,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_024_chunk00",
        "verse_key": "4:24",
        "text_ar": "ويحرم عليكم نكاح المتزوجات من النساء، إلا مَنْ سَبَيْتُم منهن في الجهاد، فإنه يحل لكم نكاحهن، بعد استبراء أرحامهن بحيضة، كتب الله عليكم تحريم نكاح هؤلاء، وأجاز لكم نكاح مَن سواهن، ممَّا أحله الله لكم أن تطلبوا بأموالكم العفة عن اقتراف الحرام. فما استمتعتم به منهن بالنكاح الصحيح، فأعطوهن مهورهن، التي فرض الله لهن عليكم، ولا إثم عليكم فيما تمَّ التراضي به بينكم، من الزيادة أو النقصان في المهر، بعد ثبوت الفريضة. إن الله تعالى كان عليمًا بأمور عباده، حكيما في أحكامه وتدبيره.",
        "char_start": 0,
        "char_end": 475,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_086_chunk00",
        "verse_key": "4:86",
        "text_ar": "وإذا سلَّم عليكم المسلم فردُّوا عليه بأفضل مما سلَّم لفظًا وبشاشةً، أو ردوا عليه بمثل ما سلَّم، ولكل ثوابه وجزاؤه. إن الله تعالى كان على كل شيء مجازيًا.",
        "char_start": 0,
        "char_end": 152,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_103_chunk00",
        "verse_key": "4:103",
        "text_ar": "فإذا أدَّيتم الصلاة، فأديموا ذكر الله في جميع أحوالكم، فإذا زال الخوف فأدُّوا الصلاة كاملة، ولا تفرِّطوا فيها فإنها واجبة في أوقات معلومة في الشرع.",
        "char_start": 0,
        "char_end": 147,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_003_chunk00",
        "verse_key": "5:3",
        "text_ar": "حرَّم الله عليكم الميتة، وهي الحيوان الذي تفارقه الحياة بدون ذكاة، وحرَّم عليكم الدم السائل المُراق، ولحم الخنزير، وما ذُكِر عليه غير اسم الله عند الذبح، والمنخنقة التي حُبِس نَفَسُها حتى ماتت، والموقوذة وهي التي ضُربت بعصا أو حجر حتى ماتت، والمُتَرَدِّية وهي التي سقطت من مكان عال أو هَوَت في بئر فماتت، والنطيحة وهي التي ضَرَبَتْها أخرى بقرنها فماتت، وحرَّم الله عليكم البهيمة التي أكلها السبُع، كالأسد والنمر والذئب، ونحو ذلك. واستثنى -سبحانه- مما حرَّمه من المنخنقة وما بعدها ما أدركتم ذكاته قبل ",
        "char_start": 0,
        "char_end": 1192,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "ومن تمام نعمة الله عليكم اليوم -أيها المؤمنون- أن أَحَلَّ لكم الحلال الطيب، وذبائحُ اليهود والنصارى -إن ذكَّوها حَسَبَ شرعهم- حلال لكم وذبائحكم حلال لهم. وأَحَلَّ لكم -أيها المؤمنون- نكاح المحصنات، وهُنَّ الحرائر من النساء المؤمنات، العفيفات عن الزنى، وكذلك نكاحَ الحرائر العفيفات من اليهود والنصارى إذا أعطيتموهُنَّ مهورهن، وكنتم أعِفَّاء غير مرتكبين للزنى، ولا متخذي عشيقات، وأمِنتم من التأثر بدينهن. ومن يجحد شرائع الإيمان فقد بطل عمله، وهو يوم القيامة من الخاسرين.",
        "char_start": 0,
        "char_end": 468,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_035_chunk00",
        "verse_key": "2:35",
        "text_ar": "قوله تعالى : وقلنا يا آدم اسكن أنت وزوجك الجنة وكلا منها رغدا حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظالمين فيه ثلاث عشرة مسألة :الأولى : قوله تعالى : وقلنا يا آدم اسكن لا خلاف أن الله تعالى أخرج إبليس عند [ ص: 283 ] كفره وأبعده عن الجنة ، وبعد إخراجه قال لآدم : اسكن ، أي لازم الإقامة واتخذها مسكنا ، وهو محل السكون . وسكن إليه يسكن سكونا . والسكن : النار ، قال الشاعر :قد قومت بسكن وأدهانوالسكن : كل ما سكن إليه . والسكين معروف سمي به لأنه يسكن حركة المذبوح ، ومنه المسكين لقلة تصرفه وحركته . و",
        "char_start": 0,
        "char_end": 19989,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_058_chunk00",
        "verse_key": "2:58",
        "text_ar": "قوله تعالى : وإذ قلنا ادخلوا هذه القرية فكلوا منها حيث شئتم رغدا وادخلوا الباب سجدا وقولوا حطة نغفر لكم خطاياكم وسنزيد المحسنينفيه تسع مسائل : الأولى : قوله تعالى : وإذ قلنا ادخلوا هذه القرية حذفت الألف من قلنا لسكونها وسكون الدال بعدها ، والألف التي يبتدأ بها قبل الدال ألف وصل ؛ لأنه من \" يدخل \" .الثانية : قوله تعالى : هذه القرية أي : المدينة ، سميت بذلك لأنها تقرت أي : اجتمعت ، ومنه قريت الماء في الحوض أي : جمعته ، واسم ذلك الماء : قرى ( بكسر القاف ) مقصور ، وكذلك ما قري به الضيف ، قاله الجوهر",
        "char_start": 0,
        "char_end": 9995,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_064_chunk00",
        "verse_key": "2:64",
        "text_ar": "قوله تعالى : ثم توليتم تولى تفعل ، وأصله الإعراض والإدبار عن الشيء ومجازا .وقوله : من بعد ذلك أي : من بعد البرهان ، وهو أخذ الميثاق ورفع الجبل . وقوله : فلولا فضل الله عليكم \" فضل \" مرفوع بالابتداء عند سيبويه والخبر محذوف لا يجوز إظهاره ؛ لأن العرب استغنت عن إظهاره ، إلا أنهم إذا أرادوا إظهاره جاءوا ب \" أن \" ، فإذا جاءوا بها لم يحذفوا الخبر . والتقدير : فلولا فضل الله تدارككم .\" ورحمته \" عطف على فضل أي : لطفه وإمهاله . \" لكنتم \" جواب \" لولا \" \" من الخاسرين \" خبر كنتم . والخسران : النقصان ، وقد ت",
        "char_start": 0,
        "char_end": 672,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_083_chunk00",
        "verse_key": "2:83",
        "text_ar": "قوله تعالى : وإذ أخذنا ميثاق بني إسرائيل لا تعبدون إلا الله وبالوالدين إحسانا وذي القربى واليتامى والمساكين وقولوا للناس حسنا وأقيموا الصلاة وآتوا الزكاة ثم توليتم إلا قليلا منكم وأنتم معرضونفيه عشر مسائل : الأولى : قوله تعالى : وإذ أخذنا ميثاق بني إسرائيل تقدم الكلام في بيان هذه الألفاظ . واختلف في الميثاق هنا ، فقال مكي : هو الميثاق الذي أخذ عليهم حين أخرجوا من صلب آدم كالذر . وقيل : هو ميثاق أخذ عليهم وهم عقلاء في حياتهم على ألسنة أنبيائهم وهو قوله : لا تعبدون إلا الله وعبادة الله إثبات توحيد",
        "char_start": 0,
        "char_end": 8299,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_095_chunk00",
        "verse_key": "2:95",
        "text_ar": "وَلَنْ يَتَمَنَّوْهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ تحقيقا لكذبهم .وأيضا لو تمنوا الموت لماتوا , كما روي عن النبي صلى الله عليه وسلم أنه قال : ( لو أن اليهود تمنوا الموت لماتوا ورأوا مقامهم من النار ) .وقيل : إن الله صرفهم عن إظهار التمني , وقصرهم على الإمساك ليجعل ذلك آية لنبيه صلى الله عليه وسلم , فهذه ثلاثة أوجه في تركهم التمني .وحكى عكرمة عن ابن عباس في قوله : \" فتمنوا الموت \" أن المراد ادعوا بالموت على أكذب الفريقين منا ومنكم , فما دعوا لعلمهم بكذبهم .",
        "char_start": 0,
        "char_end": 1099,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_200_chunk00",
        "verse_key": "2:200",
        "text_ar": "قوله تعالى : فإذا قضيتم مناسككم فاذكروا الله كذكركم آباءكم أو أشد ذكرا فمن الناس من يقول ربنا آتنا في الدنيا وما له في الآخرة من خلاقفيه مسألتان :الأولى : قوله تعالى : فإذا قضيتم مناسككم قال مجاهد : المناسك الذبائح وهراقة الدماء وقيل : هي شعائر الحج ، لقوله عليه السلام : خذوا عني مناسككم . فإذا فعلتم [ ص: 399 ] منسكا من مناسك الحج فاذكروا الله وأثنوا عليه بآلائه عندكم ، وأبو عمرو يدغم الكاف في الكاف وكذلك ما سلككم لأنهما مثلان وقضيتم هنا بمعنى أديتم وفرغتم ، قال الله تعالى : فإذا قضيت الصلاة أي ",
        "char_start": 0,
        "char_end": 2255,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_223_chunk00",
        "verse_key": "2:223",
        "text_ar": "قوله تعالى : نساؤكم حرث لكم فأتوا حرثكم أنى شئتم وقدموا لأنفسكم واتقوا الله واعلموا أنكم ملاقوه وبشر المؤمنينفيه ست مسائل :الأولى : قوله تعالى : نساؤكم حرث لكم روى الأئمة واللفظ لمسلم عن جابر بن [ ص: 87 ] عبد الله قال : ( كانت اليهود تقول : إذا أتى الرجل امرأته من دبرها في قبلها كان الولد أحول ) ، فنزلت الآية نسائكم حرث لكم فأتوا حرثكم أنى شئتم زاد في رواية عن الزهري : إن شاء مجبية وإن شاء غير مجبية غير إن ذلك في صمام واحد . ويروى : في سمام واحد بالسين ، قاله الترمذي . وروى البخاري عن نافع قال :",
        "char_start": 0,
        "char_end": 8750,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_229_chunk00",
        "verse_key": "2:229",
        "text_ar": "قوله تعالى : الطلاق مرتان فإمساك بمعروف أو تسريح بإحسان ولا يحل لكم أن تأخذوا مما آتيتموهن شيئا إلا أن يخافا ألا يقيما حدود الله فإن خفتم ألا يقيما حدود الله فلا جناح عليهما فيما افتدت به تلك حدود الله فلا تعتدوها ومن يتعد حدود الله فأولئك هم الظالمونقوله تعالى : الطلاق مرتان فإمساك بمعروف أو تسريح بإحسان فيه سبع مسائل : الأولى : قوله تعالى : الطلاق مرتان ثبت أن أهل الجاهلية لم يكن عندهم للطلاق عدد ، وكانت عندهم العدة معلومة مقدرة ، وكان هذا في أول الإسلام برهة ، يطلق الرجل امرأته ما شاء من الطل",
        "char_start": 0,
        "char_end": 36386,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_233_chunk00",
        "verse_key": "2:233",
        "text_ar": "والوالدات يرضعن أولادهن حولين كاملين لمن أراد أن يتم الرضاعة وعلى المولود له رزقهن وكسوتهن بالمعروف لا تكلف نفس إلا وسعها لا تضار والدة بولدها ولا مولود له بولده وعلى الوارث مثل ذلك فإن أرادا فصالا عن تراض منهما وتشاور فلا جناح عليهما وإن أردتم أن تسترضعوا أولادكم فلا جناح عليكم إذا سلمتم ما آتيتم بالمعروف واتقوا الله واعلموا أن الله بما تعملون بصيرفيه ثمان عشرة مسألة :الأولى : قوله تعالى : والوالدات ابتداء . يرضعن أولادهن في موضع الخبر . حولين كاملين ظرف زمان . ولما ذكر الله سبحانه النكاح والطل",
        "char_start": 0,
        "char_end": 23498,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "قوله تعالى : ألم تر إلى الملإ من بني إسرائيل من بعد موسى إذ قالوا لنبي لهم ابعث لنا ملكا نقاتل في سبيل الله قال هل عسيتم إن كتب عليكم القتال ألا تقاتلوا قالوا وما لنا ألا نقاتل في سبيل الله وقد أخرجنا من ديارنا وأبنائنا فلما كتب عليهم القتال تولوا إلا قليلا منهم والله عليم بالظالمين[ ص: 222 ] ذكر في التحريض على القتال قصة أخرى جرت في بني إسرائيل . والملأ : الأشراف من الناس ، كأنهم ممتلئون شرفا . وقال الزجاج : سموا بذلك لأنهم ممتلئون مما يحتاجون إليه منهم . والملأ في هذه الآية القوم ؛ لأن المعنى ",
        "char_start": 0,
        "char_end": 3184,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_073_chunk00",
        "verse_key": "3:73",
        "text_ar": "قوله تعالى : ولا تؤمنوا إلا لمن تبع دينكم قل إن الهدى هدى الله أن يؤتى أحد مثل ما أوتيتم أو يحاجوكم عند ربكم قل إن الفضل بيد الله يؤتيه من يشاء والله واسع عليمقوله تعالى : ولا تؤمنوا إلا لمن تبع دينكم هذا نهي ، وهو من كلام اليهود بعضهم لبعض ، أي قال ذلك الرؤساء للسفلة . وقال السدي : من قول يهود خيبر ليهود المدينة . وهذه الآية أشكل ما في السورة . فروي عن الحسن ومجاهد أن معنى الآية ولا تؤمنوا إلا لمن تبع دينكم ، ولا تؤمنوا أن يحاجوكم عند ربكم لأنهم لا حجة لهم فإنكم أصح منهم دينا . و ( أن ) [ ص: 10",
        "char_start": 0,
        "char_end": 5554,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_143_chunk00",
        "verse_key": "3:143",
        "text_ar": "قوله تعالى : ولقد كنتم تمنون الموت من قبل أن تلقوه فقد رأيتموه وأنتم تنظرونقوله تعالى : ولقد كنتم تمنون الموت أي الشهادة من قبل أن تلقوه . وقرأ الأعمش \" من قبل أن تلاقوه \" أي من قبل القتل . وقيل : من قبل أن تلقوا أسباب الموت وذلك أن كثيرا ممن لم يحضروابدرا كانوا يتمنون يوما يكون فيه قتال ، فلما كان يوم أحد انهزموا ، وكان منهم من تجلد حتى قتل ، ومنهم أنس بن النضر عم أنس بن مالك ، فإنه قال لما انكشف المسلمون : اللهم إني أبرأ إليك مما جاء به هؤلاء ، وباشر القتال وقال : إيها إنها ريح الجنة ! إني لأج",
        "char_start": 0,
        "char_end": 1392,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_152_chunk00",
        "verse_key": "3:152",
        "text_ar": "قوله تعالى : ولقد صدقكم الله وعده إذ تحسونهم بإذنه حتى إذا فشلتم وتنازعتم في الأمر وعصيتم من بعد ما أراكم ما تحبون منكم من يريد الدنيا ومنكم من يريد الآخرة ثم صرفكم عنهم ليبتليكم ولقد عفا عنكم والله ذو فضل على المؤمنينقال محمد بن كعب القرظي : لما رجع رسول الله - صلى الله عليه وسلم - إلى المدينة بعد أحد وقد أصيبوا قال بعضهم لبعض : من أين أصابنا هذا وقد وعدنا الله النصر ! فنزلت هذه الآية . وذلك أنهم قتلوا صاحب لواء المشركين وسبعة نفر منهم بعده على اللواء ، وكان الظفر ابتداء للمسلمين غير أنهم اشتغل",
        "char_start": 0,
        "char_end": 8794,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن لتذهبوا ببعض ما آتيتموهن إلا أن يأتين بفاحشة مبينة وعاشروهن بالمعروف فإن كرهتموهن فعسى أن تكرهوا شيئا ويجعل الله فيه خيرا كثيرافيه ثمان مسائل :الأولى : قوله تعالى : لا يحل لكم أن ترثوا النساء هذا متصل بما تقدم ذكره من الزوجات . والمقصود نفي الظلم عنهن وإضرارهن ؛ والخطاب للأولياء . وأن في موضع رفع ب \" يحل \" أي : لا يحل لكم وراثة النساء . وكرها مصدر في موضع الحال . واختلفت الروايات وأقوال المفسرين في سبب نزولها ؛ فروى البخاري عن ابن ع",
        "char_start": 0,
        "char_end": 7931,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_020_chunk00",
        "verse_key": "4:20",
        "text_ar": "وإن أردتم استبدال زوج مكان زوج وآتيتم إحداهن قنطارا فلا تأخذوا منه شيئا أتأخذونه بهتانا وإثما مبينافيه مسائل :الأولى : لما مضى في الآية المتقدمة حكم الفراق الذي سببه المرأة ، وأن للزوج أخذ المال منها عقب ذلك بذكر الفراق الذي سببه الزوج ، وبين أنه إذا أراد الطلاق من غير نشوز وسوء عشرة فليس له أن يطلب منها مالا .الثانية : واختلف العلماء إذا كان الزوجان يريدان الفراق وكان منهما نشوز وسوء عشرة ؛ فقال مالك رضي الله عنه : للزوج أن يأخذ منها إذا تسببت في الفراق ولا يراعى تسببه هو . وقال جماعة من العلما",
        "char_start": 0,
        "char_end": 4825,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_024_chunk00",
        "verse_key": "4:24",
        "text_ar": "والمحصنات من النساء إلا ما ملكت أيمانكم كتاب الله عليكم وأحل لكم ما وراء ذلكم أن تبتغوا بأموالكم محصنين غير مسافحين فما استمتعتم به منهن فآتوهن أجورهن فريضة ولا جناح عليكم فيما تراضيتم به من بعد الفريضة إن الله كان عليما حكيمافيه أربع عشرة مسائل :الأولى : قوله تعالى : والمحصنات عطف على المحرمات والمذكورات قبل . والتحصن : التمنع ؛ ومنه الحصن لأنه يمتنع فيه ؛ ومنه قوله تعالى : [ ص: 106 ] وعلمناه صنعة لبوس لكم لتحصنكم من بأسكم الأنبياء : أي لتمنعكم ؛ ومنه الحصان للفرس ( بكسر الحاء ) لأنه يمنع صاحبه",
        "char_start": 0,
        "char_end": 26831,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_086_chunk00",
        "verse_key": "4:86",
        "text_ar": "قوله تعالى : وإذا حييتم بتحية فحيوا بأحسن منها أو ردوها إن الله كان على كل شيء حسيبا[ ص: 256 ] فيه اثنتا عشرة مسألة :الأولى : قوله تعالى : وإذا حييتم بتحية التحية تفعلة من حييت ؛ الأصل تحيية مثل ترضية وتسمية ، فأدغموا الياء في الياء . والتحية السلام . وأصل التحية الدعاء بالحياة . والتحيات لله ، أي السلام من الآفات . وقيل : الملك . قال عبد الله بن صالح العجلي : سألت الكسائي عن قوله \" التحيات لله \" ما معناه ؟ فقال : التحيات مثل البركات ؛ فقلت : ما معنى البركات ؟ فقال : ما سمعت فيها شيئا . وسألت عن",
        "char_start": 0,
        "char_end": 13384,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_103_chunk00",
        "verse_key": "4:103",
        "text_ar": "قوله : فإذا قضيتم الصلاة فاذكروا الله قياما وقعودا وعلى جنوبكم فإذا اطمأننتم فأقيموا الصلاة إن الصلاة كانت على المؤمنين كتابا موقوتافيه مسائل :الأولى : قضيتم معناه فرغتم من صلاة الخوف وهذا يدل على أن القضاء يستعمل فيما قد فعل في وقته ؛ ومنه قوله تعالى : فإذا قضيتم مناسككم وقد تقدم .الثانية : قوله تعالى : فاذكروا الله قياما وقعودا وعلى جنوبكم ذهب الجمهور إلى أن هذا الذكر المأمور به . إنما هو إثر صلاة الخوف ؛ أي إذا فرغتم من الصلاة فاذكروا الله بالقلب [ ص: 319 ] واللسان ، على أي حال كنتم قياما وقع",
        "char_start": 0,
        "char_end": 1707,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_003_chunk00",
        "verse_key": "5:3",
        "text_ar": "قوله : حرمت عليكم الميتة والدم ولحم الخنزير وما أهل لغير الله به والمنخنقة والموقوذة والمتردية والنطيحة وما أكل السبع إلا ما ذكيتم وما ذبح على النصب وأن تستقسموا بالأزلام ذلكم فسق اليوم يئس الذين كفروا من دينكم فلا تخشوهم واخشون اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا فمن اضطر في مخمصة غير متجانف لإثم فإن الله غفور رحيم[ ص: 19 ] فيه ست وعشرون مسألة :الأولى : قوله تعالى : حرمت عليكم الميتة والدم ولحم الخنزير وما أهل لغير الله به تقدم القول فيه كاملا في البقرة .الثانية : قو",
        "char_start": 0,
        "char_end": 27875,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "قوله تعالى : اليوم أحل لكم الطيبات وطعام الذين أوتوا الكتاب حل لكم وطعامكم حل لهم والمحصنات من المؤمنات والمحصنات من الذين أوتوا الكتاب من قبلكم إذا آتيتموهن أجورهن محصنين غير مسافحين ولا متخذي أخدان ومن يكفر بالإيمان فقد حبط عمله وهو في الآخرة من الخاسرينفيه عشر مسائل :الأولى : قوله تعالى : اليوم أحل لكم الطيبات أي : اليوم أكملت لكم دينكم و اليوم أحل لكم الطيبات فأعاد تأكيدا أي : أحل لكم الطيبات التي سألتم عنها ; وكانت الطيبات أبيحت للمسلمين قبل نزول هذه الآية ; فهذا جواب سؤالهم إذ قالوا : ماذا",
        "char_start": 0,
        "char_end": 7155,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_035_chunk00",
        "verse_key": "2:35",
        "text_ar": "لما خلق الله ادم وفضله; اتم نعمته عليه; بان خلق منه زوجه ليسكن اليها; ويستانس بها; وامرهما بسكني الجنه; والاكل منها رغدا; اي: واسعا هنييا، { حَيْثُ شِيْتُمَا } اي: من اصناف الثمار والفواكه; وقال الله له: { اِنَّ لَكَ اَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَي وَاَنَّكَ لَا تَظْمَاُ فِيهَا وَلَا تَضْحَي } { وَلَا تَقْرَبَا هَذِهِ الشَّجَرَهَ } نوع من انواع شجر الجنه; الله اعلم بها، وانما نهاهما عنها امتحانا وابتلاء [او لحكمه غير معلومه لنا] { فَتَكُونَا مِنَ الظَّالِمِينَ } دل علي ان النهي للتحريم; لانه",
        "char_start": 0,
        "char_end": 516,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_058_chunk00",
        "verse_key": "2:58",
        "text_ar": "وهذا ايضا من نعمته عليهم بعد معصيتهم اياه, فامرهم بدخول قريه تكون لهم عزا ووطنا ومسكنا, ويحصل لهم فيها الرزق الرغد، وان يكون دخولهم علي وجه خاضعين لله فيه بالفعل, وهو دخول الباب { سجدا } اي: خاضعين ذليلين، وبالقول وهو ان يقولوا: { حِطَّهٌ } اي ان يحط عنهم خطاياهم بسوالهم اياه مغفرته. { نَغْفِرْ لَكُمْ خَطَايَاكُمْ } بسوالكم المغفره، { وَسَنَزِيدُ الْمُحْسِنِينَ } باعمالهم, اي: جزاء عاجل واجلا.",
        "char_start": 0,
        "char_end": 396,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_064_chunk00",
        "verse_key": "2:64",
        "text_ar": "فبعد هذا التاكيد البليغ { تَوَلَّيْتُمْ } واعرضتم, وكان ذلك موجبا لان يحل بكم اعظم العقوبات، ولكن { لَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَكُنْتُمْ مِنَ الْخَاسِرِينَ }",
        "char_start": 0,
        "char_end": 178,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_083_chunk00",
        "verse_key": "2:83",
        "text_ar": "وهذه الشرايع من اصول الدين, التي امر الله بها في كل شريعه, لاشتمالها علي المصالح العامه, في كل زمان ومكان, فلا يدخلها نسخ, كاصل الدين، ولهذا امرنا بها في قوله: { وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْيًا } الي اخر الايه. فقوله: { وَاِذْ اَخَذْنَا مِيثَاقَ بَنِي اِسْرَايِيلَ } هذا من قسوتهم ان كل امر امروا به, استعصوا؛ فلا يقبلونه الا بالايمان الغليظه, والعهود الموثقه { لَا تَعْبُدُونَ اِلَّا اللَّهَ } هذا امر بعباده الله وحده, ونهي عن الشرك به، وهذا اصل الدين, فلا تقبل الاعمال كلها ان لم",
        "char_start": 0,
        "char_end": 2194,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_095_chunk00",
        "verse_key": "2:95",
        "text_ar": "{ وَلَنْ يَتَمَنَّوْهُ اَبَدًا بِمَا قَدَّمَتْ اَيْدِيهِمْ } من الكفر والمعاصي, لانهم يعلمون انه طريق لهم الي المجازاه باعمالهم الخبيثه، فالموت اكره شيء اليهم.",
        "char_start": 0,
        "char_end": 159,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_200_chunk00",
        "verse_key": "2:200",
        "text_ar": "ثم اخبر تعالي عن احوال الخلق, وان الجميع يسالونه مطالبهم, ويستدفعونه ما يضرهم, ولكن مقاصدهم تختلف، فمنهم: { مَنْ يَقُولُ رَبَّنَا اتِنَا فِي الدُّنْيَا } اي: يساله من مطالب الدنيا ما هو من شهواته, وليس له في الاخره من نصيب, لرغبته عنها, وقصر همته علي الدنيا، ومنهم من يدعو الله لمصلحه الدارين, ويفتقر اليه في مهمات دينه ودنياه، وكل من هولاء وهولاء, لهم نصيب من كسبهم وعملهم, وسيجازيهم تعالي علي حسب اعمالهم, وهماتهم ونياتهم, جزاء دايرا بين العدل والفضل, يحمد عليه اكمل حمد واتمه، وفي هذه الايه دليل ع",
        "char_start": 0,
        "char_end": 1082,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_223_chunk00",
        "verse_key": "2:223",
        "text_ar": "{ نِسَاوُكُمْ حَرْثٌ لَكُمْ فَاْتُوا حَرْثَكُمْ اَنَّي شِيْتُمْ } مقبله ومدبره غير انه لا يكون الا في القبل, لكونه موضع الحرث, وهو الموضع الذي يكون منه الولد. وفيه دليل علي تحريم الوطء في الدبر, لان الله لم يبح اتيان المراه الا في الموضع الذي منه الحرث، وقد تكاثرت الاحاديث عن النبي صلي الله عليه وسلم في تحريم ذلك, ولعن فاعله. { وَقَدِّمُوا لِاَنْفُسِكُمْ } اي: من التقرب الي الله بفعل الخيرات, ومن ذلك ان يباشر الرجل امراته, ويجامعها علي وجه القربه والاحتساب, وعلي رجاء تحصيل الذريه الذين ينفع الله",
        "char_start": 0,
        "char_end": 953,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_229_chunk00",
        "verse_key": "2:229",
        "text_ar": "كان الطلاق في الجاهليه, واستمر اول الاسلام, يطلق الرجل زوجته بلا نهايه، فكان اذا اراد مضارتها, طلقها, فاذا شارفت انقضاء عدتها, راجعها, ثم طلقها وصنع بها مثل ذلك ابدا, فيحصل عليها من الضرر ما الله به عليم، فاخبر تعالي انَّ { الطَّلَاقَ } اي: الذي تحصل به الرجعه { مَرَّتَانِ } ليتمكن الزوج ان لم يرد المضاره من ارتجاعها, ويراجع رايه في هذه المده، واما ما فوقها, فليس محلا لذلك, لان من زاد علي الثنتين, فاما متجري علي المحرم, او ليس له رغبه في امساكها, بل قصده المضاره، فلهذا امر تعالي الزوج, ان يمسك ز",
        "char_start": 0,
        "char_end": 1633,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_233_chunk00",
        "verse_key": "2:233",
        "text_ar": "هذا خبر بمعني الامر, تنزيلا له منزله المتقرر, الذي لا يحتاج الي امر بان { يُرْضِعْنَ اَوْلَادَهُنَّ حَوْلَيْنِ } ولما كان الحول, يطلق علي الكامل, وعلي معظم الحول قال: { كَامِلَيْنِ لِمَنْ اَرَادَ اَنْ يُتِمَّ الرَّضَاعَهَ } فاذا تم للرضيع حولان, فقد تم رضاعه وصار اللبن بعد ذلك, بمنزله ساير الاغذيه, فلهذا كان الرضاع بعد الحولين, غير معتبر, لا يحرم. ويوخذ من هذا النص, ومن قوله تعالي: { وَحَمْلُهُ وَفِصَالُهُ ثَلَاثُونَ شَهْرًا } ان اقل مده الحمل سته اشهر, وانه يمكن وجود الولد بها. { وَعَلَي الْمَو",
        "char_start": 0,
        "char_end": 2149,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "يقص تعالي علي نبيه قصه الملا من بني اسراييل وهم الاشراف والروساء، وخص الملا بالذكر، لانهم في العاده هم الذين يبحثون عن مصالحهم ليتفقوا فيتبعهم غيرهم علي ما يرونه، وذلك انهم اتوا الي نبي لهم بعد موسي عليه السلام فقالوا له { ابعث لنا ملكا } اي: عيِّن لنا ملكا { نقاتل في سبيل الله } ليجتمع متفرقنا ويقاوم بنا عدونا، ولعلهم في ذلك الوقت ليس لهم رييس يجمعهم، كما جرت عاده القبايل اصحاب البيوت، كل بيت لا يرضي ان يكون من البيت الاخر رييس، فالتمسوا من نبيهم تعيين ملك يرضي الطرفين ويكون تعيينه خاصا لعوايده",
        "char_start": 0,
        "char_end": 1398,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_073_chunk00",
        "verse_key": "3:73",
        "text_ar": "{ و } قال بعضهم لبعض { لا تومنوا الا لمن تبع دينكم } اي: لا تثقوا ولا تطمينوا ولا تصدقوا الا من تبع دينكم، واكتموا امركم، فانكم اذا اخبرتم غيركم وغير من هو علي دينكم حصل لهم من العلم ما حصل لكم فصاروا مثلكم، او حاجوكم عند ربكم وشهدوا عليكم انها قامت عليكم الحجه وتبين لكم الهدي فلم تتبعوه، فالحاصل انهم جعلوا عدم اخبار المومنين بما معهم من العلم قاطعا عنهم العلم، لان العلم بزعمهم لا يكون الا عندهم وموجبا للحجه عليهم، فرد الله عليهم بان { الهدي هدي الله } فماده الهدي من الله تعالي لكل من اهتدي، فان",
        "char_start": 0,
        "char_end": 1102,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_143_chunk00",
        "verse_key": "3:143",
        "text_ar": "ثم وبخهم تعالي علي عدم صبرهم بامر كانوا يتمنونه ويودون حصوله، فقال: { ولقد كنتم تمنون الموت من قبل ان تلقوه } وذلك ان كثيرا من الصحابه رضي الله عنهم ممن فاته بدر يتمنون ان يحضرهم الله مشهدا يبذلون فيه جهدهم، قال الله تعالي لهم: { فقد رايتموه } اي: رايتم ما تمنيتم باعينكم { وانتم تنظرون } فما بالكم وترك الصبر؟ هذه حاله لا تليق ولا تحسن، خصوصا لمن تمني ذلك، وحصل له ما تمني، فان الواجب عليه بذل الجهد، واستفراغ الوسع في ذلك. وفي هذه الايه دليل علي انه لا يكره تمني الشهاده، ووجه الدلاله ان الله تعالي",
        "char_start": 0,
        "char_end": 584,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_152_chunk00",
        "verse_key": "3:152",
        "text_ar": "اي: { ولقد صدقكم الله وعده } بالنصر، فنصركم عليهم، حتي ولوكم اكتافهم، وطفقتم فيهم قتلا، حتي صرتم سببا لانفسكم، وعونا لاعدايكم عليكم، فلما حصل منكم الفشل وهو الضعف والخور { وتنازعتم في الامر } الذي فيه ترك امر الله بالايتلاف وعدم الاختلاف، فاختلفتم، فمن قايل نقيم في مركزنا الذي جعلنا فيه النبي صلي الله عليه وسلم، ومن قايل: ما مقامنا فيه وقد انهزم العدو، ولم يبق محذور، فعصيتم الرسول، وتركتم امره من بعد ما اراكم الله ما تحبون وهو انخذال اعدايكم؛ لان الواجب علي من انعم الله عليه بما احب، اعظم من غير",
        "char_start": 0,
        "char_end": 1253,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "كانوا في الجاهليه اذا مات احدهم عن زوجته، راي قريبُه كاخيه وابن عمه ونحوهما انه احق بزوجته من كل احد، وحماها عن غيره، احبت او كرهت. فان احبها تزوجها علي صداق يحبه دونها، وان لم يرضها عضلها فلا يزوجها الا من يختاره هو، وربما امتنع من تزويجها حتي تبذل له شييًا من ميراث قريبه او من صداقها، وكان الرجل ايضا يعضل زوجته التي يكون يكرهها ليذهب ببعض ما اتاها، فنهي الله المومنين عن جميع هذه الاحوال الا حالتين: اذا رضيت واختارت نكاح قريب زوجها الاول، كما هو مفهوم قوله: { كَرْهًا } واذا اتين بفاحشه مبينه كا",
        "char_start": 0,
        "char_end": 1498,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_020_chunk00",
        "verse_key": "4:20",
        "text_ar": "بل متي { اَرَدْتُمُ اسْتِبْدَالَ زَوْجٍ مَكَانَ زَوْجٍ } اي: تطليقَ زوجه وتزوجَ اخري. اي: فلا جناح عليكم في ذلك ولا حرج. ولكن اذا { اتَيْتُمْ اِحْدَاهُنَّ } اي: المفارقه او التي تزوجها { قِنْطَارًا } اي: مالا كثيرا. { فَلَا تَاْخُذُوا مِنْهُ شَيْيًا } بل وفروه لهن ولا تمطلوا بهن. وفي هذه الايه دلاله علي عدم تحريم كثره المهر، مع ان الافضل واللايق الاقتداءُ بالنبي صلي الله عليه وسلم في تخفيف المهر. ووجه الدلاله ان الله اخبر عن امر يقع منهم، ولم ينكره عليهم، فدل علي عدم تحريمه لكن قد يُنهي عن كثره ",
        "char_start": 0,
        "char_end": 662,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_024_chunk00",
        "verse_key": "4:24",
        "text_ar": "{ وَ } من المحرمات في النكاح { وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ } اي: ذوات الازواج. فانه يحرم نكاحهن ما دمن في ذمه الزوج حتي تطلق وتنقضي عدتها. { اِلَّا مَا مَلَكَتْ اَيْمَانُكُمْ } اي: بالسبي، فاذا سبيت الكافره ذات الزوج حلت للمسلمين بعد ان تستبرا. واما اذا بيعت الامه المزوجه او وهبت فانه لا ينفسخ نكاحها لان المالك الثاني نزل منزله الاول ولقصه بريره حين خيرها النبي صلي الله عليه وسلم. وقوله: { كِتَابَ اللَّهِ عَلَيْكُمْ } اي: الزموه واهتدوا به فان فيه الشفاء والنور وفيه تفصيل الحلال من الحرام. ",
        "char_start": 0,
        "char_end": 2065,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_086_chunk00",
        "verse_key": "4:86",
        "text_ar": "التحيه هي: اللفظ الصادر من احد المتلاقيين علي وجه الاكرام والدعاء، وما يقترن بذلك اللفظ من البشاشه ونحوها. واعلي انواع التحيه ما ورد به الشرع، من السلام ابتداء وردًّا. فامر تعالي المومنين انهم اذا حُيّوا باي تحيه كانت، ان يردوها باحسن منها لفظا وبشاشه، او مثلها في ذلك. ومفهوم ذلك النهي عن عدم الرد بالكليه او ردها بدونها. ويوخذ من الايه الكريمه الحث علي ابتداء السلام والتحيه من وجهين احدهما: ان الله امر بردها باحسن منها او مثلها، وذلك يستلزم ان التحيه مطلوبه شرعًا. الثاني: ما يستفاد من افعل التفض",
        "char_start": 0,
        "char_end": 1175,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_103_chunk00",
        "verse_key": "4:103",
        "text_ar": "اي: فاذا فرغتم من صلاتكم، صلاه الخوف وغيرها، فاذكروا الله في جميع احوالكم وهيياتكم، ولكن خصت صلاه الخوف بذلك لفوايد. منها: ان القلب صلاحه وفلاحه وسعادته بالانابه الي الله تعالي في المحبه وامتلاء القلب من ذكره والثناء عليه. واعظم ما يحصل به هذا المقصود الصلاه، التي حقيقتها انها صله بين العبد وبين ربه. ومنها: ان فيها من حقايق الايمان ومعارف الايقان ما اوجب ان يفرضها الله علي عباده كل يوم وليله. ومن المعلوم ان صلاه الخوف لا تحصل فيها هذه المقاصد الحميده بسبب اشتغال القلب والبدن والخوف فامر بجبرها ب",
        "char_start": 0,
        "char_end": 1720,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_003_chunk00",
        "verse_key": "5:3",
        "text_ar": "هذا الذي حولنا الله عليه في قوله: { اِلَّا مَا يُتْلَي عَلَيْكُمْ ْ} واعلم ان الله تبارك وتعالي لا يحرّم ما يحرّم الا صيانه لعباده، وحمايه لهم من الضرر الموجود في المحرمات، وقد يبين للعباد ذلك وقد لا يبين. فاخبر انه حرم { الْمَيْتَه ْ} والمراد بالميته: ما فُقِدَت حياتُهُ بغير ذكاه شرعيه، فانها تحرم لضررها، وهو احتقان الدم في جوفها ولحمها المضر باكلها. وكثيرا ما تموت بعله تكون سببا لهلاكها، فتضر بالاكل. ويستثني من ذلك ميته الجراد والسمك، فانه حلال. { وَالدَّمَ ْ} اي: المسفوح، كما قيد في الايه الا",
        "char_start": 0,
        "char_end": 4319,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "كرر تعالي احلال الطيبات لبيان الامتنان، ودعوه للعباد الي شكره والاكثار من ذكره، حيث اباح لهم ما تدعوهم الحاجه اليه، ويحصل لهم الانتفاع به من الطيبات. { وَطَعَامُ الَّذِينَ اُوتُوا الْكِتَابَ حِلٌّ لَّكُمْ ْ} اي: ذبايح اليهود والنصاري حلال لكم -يا معشر المسلمين- دون باقي الكفار، فان ذبايحهم لا تحل للمسلمين، وذلك لان اهل الكتاب ينتسبون الي الانبياء والكتب. وقد اتفق الرسل كلهم علي تحريم الذبح لغير الله، لانه شرك، فاليهود والنصاري يتدينون بتحريم الذبح لغير الله، فلذلك ابيحت ذبايحهم دون غيرهم. والدلي",
        "char_start": 0,
        "char_end": 2771,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_035_chunk00",
        "verse_key": "2:35",
        "text_ar": "القول في تاويل قوله تعالي ذكره: وَقُلْنَا يَا ادَمُ اسْكُنْ اَنْتَ وَزَوْجُكَ الْجَنَّهَقال ابو جعفر: وفي هذه الايه دلاله واضحه علي صحه قول من قال: ان ابليس اخرج من الجنه بعد الاستكبار عن السجود لادم، واُسكنها ادمُ قبل ان يهبط ابليس الي الارض. الا تسمعون الله جل ثناوه يقول: وَقُلْنَا يَا ادَمُ اسْكُنْ اَنْتَ وَزَوْجُكَ الْجَنَّهَ وَكُلا مِنْهَا رَغَدًا حَيْثُ شِيْتُمَا وَلا تَقْرَبَا هَذِهِ الشَّجَرَهَ فَتَكُونَا مِنَ الظَّالِمِينَ * فَاَزَلَّهُمَا الشَّيْطَانُ عَنْهَا فَاَخْرَجَهُمَا مِمَّا كَا",
        "char_start": 0,
        "char_end": 17614,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_058_chunk00",
        "verse_key": "2:58",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذْ قُلْنَا ادْخُلُوا هَذِهِ الْقَرْيَهَو \" القريه \" -التي امرهم الله جل ثناوه ان يدخلوها , فياكلوا منها رغدا حيث شاءوا- فيما ذكر لنا: بيت المقدس .*ذكر الروايه بذلك:999 - حدثنا الحسن بن يحيي قال، انبانا عبد الرزاق قال، انبانا معمر , عن قتاده في قوله: (ادخلوا هذه القريه)، قال: بيت المقدس.1000 - حدثني موسي بن هارون قال، حدثني عمرو بن حماد قال، حدثنا &; 2-103 &; اسباط , عن السدي: (واذ قلنا ادخلوا هذه القريه) اما القريه، فقريه بيت المقدس.1001 - حُدثت عن عمار بن الحسن ق",
        "char_start": 0,
        "char_end": 13185,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_064_chunk00",
        "verse_key": "2:64",
        "text_ar": "القول في تاويل قوله تعالي : ثُمَّ تَوَلَّيْتُمْ مِنْ بَعْدِ ذَلِكَقال ابو جعفر: يعني بقوله جل ثناوه: (ثم توليتم): ثم اعرضتم. وانما هو \" تفعلتم \" من قولهم: \" ولاني فلان دبره \" اذا استدبر عنه وخلفه خلف ظهره. ثم يستعمل ذلك في كل تارك طاعه امر بها، ومعرض بوجهه. (36) يقال: \" قد تولي فلان عن طاعه فلان, وتولي عن مواصلته \"، ومنه قول الله جل ثناوه: فَلَمَّا اتَاهُمْ مِنْ فَضْلِهِ بَخِلُوا بِهِ وَتَوَلَّوْا وَهُمْ مُعْرِضُونَ [ التوبه: 76]، يعني بذلك: خالفوا ما كانوا وعدوا الله من قولهم: لَيِنْ اتَانَا مِ",
        "char_start": 0,
        "char_end": 6010,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_083_chunk00",
        "verse_key": "2:83",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذْ اَخَذْنَا مِيثَاقَ بَنِي اِسْرَايِيلَ لا تَعْبُدُونَ اِلا اللَّهَقال ابو جعفر: قد دللنا -فيما مضي من كتابنا هذا- علي ان \" الميثاق \"\" مفعال \" من \" التوثق باليمين \" ونحوها من الامور التي توكد القول. (48) فمعني الكلام اذًا: واذكروا ايضا يا معشر بني اسراييل، اذ اخذنا ميثاقكم لا تعبدون الا الله، كما:-1447 - حدثني به ابن حميد قال، حدثنا سلمه قال، حدثني ابن اسحاق قال، حدثني محمد بن ابي محمد, عن سعيد بن جبير او عكرمه, عن ابن عباس: (واذ اخذنا ميثاق بني اسراييل) -اي ميثا",
        "char_start": 0,
        "char_end": 16094,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_095_chunk00",
        "verse_key": "2:95",
        "text_ar": "القول في تاويل قوله تعالي وَلَنْ يَتَمَنَّوْهُ اَبَدًا بِمَا قَدَّمَتْ اَيْدِيهِمْ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ (95)قال ابو جعفر: وهذا خبر من الله جل ثناوه عن اليهود وكراهتهم الموت، وامتناعهم عن الاجابه الي ما دعوا اليه من تمني الموت, لعلمهم بانهم ان فعلوا ذلك فالوعيد بهم نازل، والموت بهم حال؛ ولمعرفتهم بمحمد صلي الله عليه وسلم انه رسول من الله اليهم مرسل، وهم به مكذبون, وانه لم يخبرهم خبرا الا كان حقا كما اخبر. فهم يحذرون ان يتمنوا الموت، خوفا ان يحل بهم عقاب الله بما كسبت ايديهم من الذنوب",
        "char_start": 0,
        "char_end": 3595,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_200_chunk00",
        "verse_key": "2:200",
        "text_ar": "القول في تاويل قوله تعالي : فَاِذَا قَضَيْتُمْ مَنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ ابَاءَكُمْ اَوْ اَشَدَّ ذِكْرًاقال ابو جعفر: يعني بقول جل ثناوه: \" فاذا قضيتم مناسككم \"، فاذا فرَغتم من حَجكم فذبحتم نَسايككم، فاذكروا الله (108)* * *يقال منه: \" نسك الرجل يَنسُك نُسْكًا ونُسُكًا ونسيكه ومَنْسَكًا \"، اذا ذبح نُسُكه، و \" المنسِك \" اسم مثل \" المشرق والمغرب \"، فاما \" النُّسْك \" في الدين، فانه يقال منه: \" ما كان الرجل نَاسكًا، ولقد نَسَك، ونَسُك نُسْكًا نُسُكًا ونَساكه \"، (109) وذلك اذا تقر",
        "char_start": 0,
        "char_end": 10521,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_223_chunk00",
        "verse_key": "2:223",
        "text_ar": "نساوكم حرث لكمالقول في تاويل قوله تعالي : { نساوكم حرث لكم } يعني تعالي ذكره بذلك : نساوكم مزدرع اولادكم , فاتوا مزدرعكم كيف شيتم , واين شيتم . وانما عني بالحرث المزدرع , والحرث هو الزرع , ولكنهن لما كن من اسباب الحرث جعلن حرثا , اذ كان مفهوما معني الكلام . وبنحو الذي قلنا في ذلك قال اهل التاويل . ذكر من قال ذلك : 3446 - حدثنا محمد بن عبيد المحاربي , قال : ثنا ابن المبارك , عن يونس , عن عكرمه , عن ابن عباس : { فاتوا حرثكم } قال : منبت الولد . 3447 - حدثني موسي , قال : ثنا عمرو , قال : ثنا اسباط ",
        "char_start": 0,
        "char_end": 18350,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_229_chunk00",
        "verse_key": "2:229",
        "text_ar": "الطلاق مرتان فامساك بمعروف او تسريح باحسانالقول في تاويل قوله تعالي : { الطلاق مرتان فامساك بمعروف او تسريح باحسان } اختلف اهل التاويل في تاويل ذلك , فقال بعضهم : هو دلاله علي عدد الطلاق الذي يكون للرجل فيه الرجعه علي زوجته , والعدد الذي تبين به زوجته منه . ذكر من قال ان هذه الايه انزلت لان اهل الجاهليه واهل الاسلام قبل نزولها لم يكن لطلاقهم نهايه تبين بالانتهاء اليها امراته منه ما راجعها في عدتها منه , فجعل الله تعالي ذكره لذلك حدا حرم بانتهاء الطلاق اليه علي الرجل امراته المطلقه الا بعد زوج , ",
        "char_start": 0,
        "char_end": 38219,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_233_chunk00",
        "verse_key": "2:233",
        "text_ar": "والوالدات يرضعن اولادهن حولين كاملين لمن اراد ان يتم الرضاعهالقول في تاويل قوله تعالي : { والوالدات يرضعن اولادهن حولين كاملين لمن اراد ان يتم الرضاعه } يعني تعالي ذكره بذلك : والنساء اللواتي بن من ازواجهن ولهن اولاد قد ولدنهم من ازواجهن قبل بينونتهن منهم بطلاق او ولدنهم منهم بعد فراقهم اياهن من وطء كان منهم لهن قبل البينونه يرضعن اولادهن , يعني بذلك انهن احق برضاعهم من غيرهن وليس ذلك بايجاب من الله تعالي ذكره عليهن رضاعهم , اذا كان المولود له والدا حيا موسرا ; لان الله تعالي ذكره قال في سوره ال",
        "char_start": 0,
        "char_end": 38032,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "القول في تاويل قوله : اَلَمْ تَرَ اِلَي الْمَلاِ مِنْ بَنِي اِسْرَايِيلَ مِنْ بَعْدِ مُوسَي اِذْ قَالُوا لِنَبِيٍّ لَهُمُ ابْعَثْ لَنَا مَلِكًا نُقَاتِلْ فِي سَبِيلِ اللَّهِقال ابو جعفر: يعني تعالي ذكره بقوله: \" الم تر \"، الم تر، يا محمد، بقلبك, (1) فتعلم بخبري اياك، يا محمد=\" الي الملا \"، يعني: الي وجوه بني اسراييل واشرافهم وروسايهم=\" من بعد موسي \"، يقول: من بعد ما قبض موسي فمات=\" اذ قالوا لنبي لهم ابعث لنا ملكا نقاتل في سبيل الله \". فذكر لي ان النبي الذي قال لهم ذلك شمويل (2) بن بالي (3) بن عل",
        "char_start": 0,
        "char_end": 24399,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_073_chunk00",
        "verse_key": "3:73",
        "text_ar": "القول في تاويل قوله : وَلا تُوْمِنُوا اِلا لِمَنْ تَبِعَ دِينَكُمْقال ابو جعفر: يعني بذلك جل ثناوه: ولا تصدّقوا الا من تبع دينكم فكان يهوديًّا.* * *وهذا خبر من الله عن قول الطايفه الذين قالوا لاخوانهم من اليهود: \"امنوا بالذي انزل علي الذين امنوا وجه النهار \".* * *و \" اللام \" التي في قوله: \" لمن تبع دينكم \"، نظيره \" اللام \" التي في قوله: عَسَي اَنْ يَكُونَ رَدِفَ لَكُمْ ، بمعني: ردفكم، بَعْضُ الَّذِي تَسْتَعْجِلُونَ [سوره النمل: 72].* * *وبنحو ما قلنا في تاويل ذلك قال اهل التاويل.ذكر من قال ذلك:7",
        "char_start": 0,
        "char_end": 9531,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_143_chunk00",
        "verse_key": "3:143",
        "text_ar": "القول في تاويل قوله : وَلَقَدْ كُنْتُمْ تَمَنَّوْنَ الْمَوْتَ مِنْ قَبْلِ اَنْ تَلْقَوْهُ فَقَدْ رَاَيْتُمُوهُ وَاَنْتُمْ تَنْظُرُونَ (143)قال ابو جعفر: يعني بقوله جل ثناوه: \" ولقد كنتم تمنون الموت \"، ولقد كنتم، يا معشر اصحاب محمد =\" تمنون الموت \"، يعني اسبابَ الموت، وذلك: القتالُ =\" فقد رايتموه \"، فقد رايتم ما كنتم تمنونه - و \" الهاء \" في قوله \" رايتموه \" عايده علي \" الموت \"، والمعنيُّ: [القتال] = (9) \" وانتم تنظرون \"، يعني: قد رايتموه بمراي منكم ومنظر، اي بقرب منكم.* * *وكان بعض اهل العربيه يز",
        "char_start": 0,
        "char_end": 4766,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_152_chunk00",
        "verse_key": "3:152",
        "text_ar": "القول في تاويل قوله : وَلَقَدْ صَدَقَكُمُ اللَّهُ وَعْدَهُقال ابو جعفر: يعني بقوله تعالي ذكره: \" ولقد صدقكم الله \"، ايها المومنون من اصحاب محمد صلي الله عليه وسلم باحُد وعدَه الذي وعدهم علي لسان رسوله محمد صلي الله عليه وسلم.و \" الوعد \" الذي كان وعدَهم علي لسانه باحد، قوله للرماه: \" اثبتوا مكانكم ولا تبرحوا، وان رايتمونا قد هزمناهم، فانا لن نـزال غالبين ما ثبتم مكانكم \". وكان وعدهم رسول الله صلي الله عليه وسلم النصر يوميذ ان انتهوا الي امره، كالذي:-8004- حدثنا محمد قال، حدثنا احمد قال، حدثنا اسب",
        "char_start": 0,
        "char_end": 28488,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "القول في تاويل قوله : يَا اَيُّهَا الَّذِينَ امَنُوا لا يَحِلُّ لَكُمْ اَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا اتَيْتُمُوهُنَّ اِلا اَنْ يَاْتِينَ بِفَاحِشَهٍ مُبَيِّنَهٍقال ابو جعفر: يعني تبارك وتعالي [بقوله]: (60) \" يا ايها الذين امنوا \"، يا ايها الذين صدَّقوا الله ورسوله =\" لا يحل لكم ان ترثوا النساء كَرهًا \"، يقول: لا يحل لكم ان ترثوا نكاحَ نساء اقاربكم وابايكم كَرْهًا. (61)* * *فان قال قايل: كيف كانوا يرثونهن؟ وما وجه تحريم وراثتهن؟ فقد علمت ان النساء ",
        "char_start": 0,
        "char_end": 29259,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_020_chunk00",
        "verse_key": "4:20",
        "text_ar": "القول في تاويل قوله: وَاِنْ اَرَدْتُمُ اسْتِبْدَالَ زَوْجٍ مَكَانَ زَوْجٍ وَاتَيْتُمْ اِحْدَاهُنَّ قِنْطَارًا فَلا تَاْخُذُوا مِنْهُ شَيْيًاقال ابو جعفر: يعني جل ثناوه بقوله: \" وان اردتم استبدال زوج مكان زوج \"، وان اردتم، ايها المومنون، نكاح امراه مكان امراه لكم تطلقونها (1) =\" واتيتم احداهن \"، يقول: وقد اعطيتم التي تريدون طلاقها من المهر (2) =\" قنطارًا \".* * *= و \" القنطار \" المال الكثير. وقد ذكرنا فيما مضي اختلاف اهل التاويل في مبلغه، والصوابَ من القول في ذلك عندنا. (3)* * *=\" فلا تاخذوا منه ش",
        "char_start": 0,
        "char_end": 1363,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_024_chunk00",
        "verse_key": "4:24",
        "text_ar": "والمحصنات من النساء الا ما ملكت ايمانكمالقول في تاويل قوله تعالي : { والمحصنات من النساء الا ما ملكت ايمانكم } يعني بذلك جل ثناوه : حرمت عليكم المحصنات من النساء , الا ما ملكت ايمانكم . واختلف اهل التاويل في المحصنات التي عناهن الله في هذه الايه , فقال بعضهم : هن ذوات الازواج غير المسبيات منهن . وملك اليمين : السبايا اللواتي فرق بينهن وبين ازواجهن السباء , فحللن لمن صرن له بملك اليمين من غير طلاق كان من زوجها الحربي لها . ذكر من قال ذلك : 7124 - حدثنا محمد بن بشار , قال : ثنا عبد الرحمن , قال : ",
        "char_start": 0,
        "char_end": 29574,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_086_chunk00",
        "verse_key": "4:86",
        "text_ar": "القول في تاويل قوله : وَاِذَا حُيِّيتُمْ بِتَحِيَّهٍ فَحَيُّوا بِاَحْسَنَ مِنْهَا اَوْ رُدُّوهَاقال ابو جعفر: يعني جل ثناوه بقوله: \" واذا حييتم بتحيه \"، اذا دعي لكم بطول الحياه والبقاء والسلامه. (63) =\" فحيوا باحسن منها او ردُّوها \"، يقول: فادعوا لمن دعا لكم بذلك باحسن مما دعا لكم=\" او ردوها \" يقول: او ردّوا التحيه.* * *ثم اختلف اهل التاويل في صفه \" التحيه \" التي هي احسن مما حُيِّيَ به المُحَّيي، والتي هي مثلها.فقال بعضهم: التي هي احسن منها: ان يقول المسلَّم عليه اذا قيل: \" السلام عليكم \"، : \" و",
        "char_start": 0,
        "char_end": 8173,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_103_chunk00",
        "verse_key": "4:103",
        "text_ar": "القول في تاويل قوله : فَاِذَا قَضَيْتُمُ الصَّلاهَ فَاذْكُرُوا اللَّهَ قِيَامًا وَقُعُودًا وَعَلَي جُنُوبِكُمْ فَاِذَا اطْمَاْنَنْتُمْ فَاَقِيمُوا الصَّلاهَقال ابو جعفر: يعني بذلك جل ثناوه: فاذا فرغتم، ايها المومنون، من صلاتكم وانتم مواقفو عدوِّكم= التي بيّناها لكم، (61) فاذكروا الله علي كل احوالكم= قيامًا وقعودًا ومضطجعين علي جنوبكم، بالتعظيم له، والدعاء لانفسكم بالظفر علي عدوكم، لعل الله ان يظفركم وينصركم عليهم. وذلك نظير قوله: يَا اَيُّهَا الَّذِينَ امَنُوا اِذَا لَقِيتُمْ فِيَهً فَاثْبُتُوا ",
        "char_start": 0,
        "char_end": 9005,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_003_chunk00",
        "verse_key": "5:3",
        "text_ar": "حرمت عليكم الميتهالقول في تاويل قوله تعالي : { حرمت عليكم الميته } يعني بذلك جل ثناوه : حرم الله عليكم ايها المومنون الميته , والميته : كل ما له نفس سايله من دواب البر وطيره , مما اباح الله اكلها , واهليها ووحشيها , فارقتها روحها بغير تذكيه . وقد قال بعضهم : الميته : هو كل ما فارقته الحياه من دواب البر وطيره بغير تذكيه مما احل الله اكله . وقد بينا العله الموجبه صحه القول بما قلنا في ذلك في كتابنا : كتاب \" لطيف القول في الاحكام \" .والدمواما الدم : فانه الدم المسفوح دون ما كان منه غير مسفوح ; لان ",
        "char_start": 0,
        "char_end": 38345,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "القول في تاويل قوله : الْيَوْمَ اُحِلَّ لَكُمُ الطَّيِّبَاتُ وَطَعَامُ الَّذِينَ اُوتُوا الْكِتَابَ حِلٌّ لَكُمْ وَطَعَامُكُمْ حِلٌّ لَهُمْقال ابو جعفر: يعني جل ثناوه بقوله: \" اليوم احل لكم الطيبات \"، اليوم احل لكم، ايها المومنون، الحلالُ من الذبايح والمطاعم دون الخبايث منها.وقوله: \" وطعام الذين اوتوا الكتاب حلٌّ لكم \"، وذبايحُ اهل الكتاب من &; 9-573 &; اليهود والنصاري = وهم الذين اوتوا التوراه والانجيل وانـزل عليهم, فدانُوا بهما او باحدهما =\" حل لكم \" (176) يقول: حلالٌ لكم، اكله دون ذبايح ساير ",
        "char_start": 0,
        "char_end": 30549,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [
    {
      "target_id": "ORG_EYE",
      "target_label_ar": "عين",
      "target_label_en": "Eye",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "4:10",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_004_010_chunk01",
          "char_start": 261,
          "char_end": 423,
          "relevance": "direct"
        },
        {
          "verse_key": "4:10",
          "source": "tabari",
          "chunk_id": "tabari_004_010_chunk00",
          "char_start": 485,
          "char_end": 647,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    }
  ],
  "incoming_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "4:6",
          "source": "tabari",
          "chunk_id": "tabari_004_006_chunk24",
          "char_start": 282,
          "char_end": 444,
          "relevance": "direct"
        },
        {
          "verse_key": "4:6",
          "source": "tabari",
          "chunk_id": "tabari_004_006_chunk25",
          "char_start": 487,
          "char_end": 649,
          "relevance": "direct"
        },
        {
          "verse_key": "4:48",
          "source": "tabari",
          "chunk_id": "tabari_004_048_chunk02",
          "char_start": 11,
          "char_end": 173,
          "relevance": "direct"
        }
      ],
      "confidence": 0.53
    }
  ],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [],
    "internal_external": {
      "value": "ظاهر",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_EXTERNAL_BEH_SOC_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 50,
    "quran_direct_count": 50,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 2,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.794,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.642476Z",
  "schema_version": "1.0.0"
}