{
  "behavior_id": "BEH_SOC_BETRAYAL",
  "label_ar": "خيانة",
  "label_en": "Betrayal",
  "category": "social",
  "roots": [
    "خ-و-ن"
  ],
  "stems": [],
  "synonyms_ar": [
    "خيانة",
    "الخائنين",
    "خائن",
    "يخونون",
    "خانوا",
    "خيانة"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:9",
      "text_ar": "يُخَـٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُوا۟ وَمَا يَخْدَعُونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:25",
      "text_ar": "وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ كُلَّمَا رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍ رِّزْقًا ۙ قَالُوا۟ هَـٰذَا ٱلَّذِى رُزِقْنَا مِن قَبْلُ ۖ وَأُتُوا۟ بِهِۦ مُتَشَـٰبِهًا ۖ وَلَهُمْ فِيهَآ أَزْوَٰجٌ مُّطَهَّرَةٌ ۖ وَهُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:27",
      "text_ar": "ٱلَّذِينَ يَنقُضُونَ عَهْدَ ٱللَّهِ مِنۢ بَعْدِ مِيثَـٰقِهِۦ وَيَقْطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفْسِدُونَ فِى ٱلْأَرْضِ ۚ أُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:39",
      "text_ar": "وَٱلَّذِينَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔايَـٰتِنَآ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:81",
      "text_ar": "بَلَىٰ مَن كَسَبَ سَيِّئَةً وَأَحَـٰطَتْ بِهِۦ خَطِيٓـَٔتُهُۥ فَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:82",
      "text_ar": "وَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلْجَنَّةِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:84",
      "text_ar": "وَإِذْ أَخَذْنَا مِيثَـٰقَكُمْ لَا تَسْفِكُونَ دِمَآءَكُمْ وَلَا تُخْرِجُونَ أَنفُسَكُم مِّن دِيَـٰرِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:85",
      "text_ar": "ثُمَّ أَنتُمْ هَـٰٓؤُلَآءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَـٰرِهِمْ تَظَـٰهَرُونَ عَلَيْهِم بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَإِن يَأْتُوكُمْ أُسَـٰرَىٰ تُفَـٰدُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَـٰبِ وَتَكْفُرُونَ بِبَعْضٍ ۚ فَمَا جَزَآءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْىٌ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَيَوْمَ ٱلْقِيَـٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلْعَذَابِ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:113",
      "text_ar": "وَقَالَتِ ٱلْيَهُودُ لَيْسَتِ ٱلنَّصَـٰرَىٰ عَلَىٰ شَىْءٍ وَقَالَتِ ٱلنَّصَـٰرَىٰ لَيْسَتِ ٱلْيَهُودُ عَلَىٰ شَىْءٍ وَهُمْ يَتْلُونَ ٱلْكِتَـٰبَ ۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعْلَمُونَ مِثْلَ قَوْلِهِمْ ۚ فَٱللَّهُ يَحْكُمُ بَيْنَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:121",
      "text_ar": "ٱلَّذِينَ ءَاتَيْنَـٰهُمُ ٱلْكِتَـٰبَ يَتْلُونَهُۥ حَقَّ تِلَاوَتِهِۦٓ أُو۟لَـٰٓئِكَ يُؤْمِنُونَ بِهِۦ ۗ وَمَن يَكْفُرْ بِهِۦ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:139",
      "text_ar": "قُلْ أَتُحَآجُّونَنَا فِى ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَآ أَعْمَـٰلُنَا وَلَكُمْ أَعْمَـٰلُكُمْ وَنَحْنُ لَهُۥ مُخْلِصُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:150",
      "text_ar": "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ ٱلْمَسْجِدِ ٱلْحَرَامِ ۚ وَحَيْثُ مَا كُنتُمْ فَوَلُّوا۟ وُجُوهَكُمْ شَطْرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُوا۟ مِنْهُمْ فَلَا تَخْشَوْهُمْ وَٱخْشَوْنِى وَلِأُتِمَّ نِعْمَتِى عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:187",
      "text_ar": "أُحِلَّ لَكُمْ لَيْلَةَ ٱلصِّيَامِ ٱلرَّفَثُ إِلَىٰ نِسَآئِكُمْ ۚ هُنَّ لِبَاسٌ لَّكُمْ وَأَنتُمْ لِبَاسٌ لَّهُنَّ ۗ عَلِمَ ٱللَّهُ أَنَّكُمْ كُنتُمْ تَخْتَانُونَ أَنفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنكُمْ ۖ فَٱلْـَٔـٰنَ بَـٰشِرُوهُنَّ وَٱبْتَغُوا۟ مَا كَتَبَ ٱللَّهُ لَكُمْ ۚ وَكُلُوا۟ وَٱشْرَبُوا۟ حَتَّىٰ يَتَبَيَّنَ لَكُمُ ٱلْخَيْطُ ٱلْأَبْيَضُ مِنَ ٱلْخَيْطِ ٱلْأَسْوَدِ مِنَ ٱلْفَجْرِ ۖ ثُمَّ أَتِمُّوا۟ ٱلصِّيَامَ إِلَى ٱلَّيْلِ ۚ وَلَا تُبَـٰشِرُوهُنَّ وَأَنتُمْ عَـٰكِفُونَ فِى ٱلْمَسَـٰجِدِ ۗ تِلْكَ حُدُودُ ٱللَّهِ فَلَا تَقْرَبُوهَا ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ ءَايَـٰتِهِۦ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:212",
      "text_ar": "زُيِّنَ لِلَّذِينَ كَفَرُوا۟ ٱلْحَيَوٰةُ ٱلدُّنْيَا وَيَسْخَرُونَ مِنَ ٱلَّذِينَ ءَامَنُوا۟ ۘ وَٱلَّذِينَ ٱتَّقَوْا۟ فَوْقَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ ۗ وَٱللَّهُ يَرْزُقُ مَن يَشَآءُ بِغَيْرِ حِسَابٍ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:217",
      "text_ar": "يَسْـَٔلُونَكَ عَنِ ٱلشَّهْرِ ٱلْحَرَامِ قِتَالٍ فِيهِ ۖ قُلْ قِتَالٌ فِيهِ كَبِيرٌ ۖ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفْرٌۢ بِهِۦ وَٱلْمَسْجِدِ ٱلْحَرَامِ وَإِخْرَاجُ أَهْلِهِۦ مِنْهُ أَكْبَرُ عِندَ ٱللَّهِ ۚ وَٱلْفِتْنَةُ أَكْبَرُ مِنَ ٱلْقَتْلِ ۗ وَلَا يَزَالُونَ يُقَـٰتِلُونَكُمْ حَتَّىٰ يَرُدُّوكُمْ عَن دِينِكُمْ إِنِ ٱسْتَطَـٰعُوا۟ ۚ وَمَن يَرْتَدِدْ مِنكُمْ عَن دِينِهِۦ فَيَمُتْ وَهُوَ كَافِرٌ فَأُو۟لَـٰٓئِكَ حَبِطَتْ أَعْمَـٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۖ وَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:220",
      "text_ar": "فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۗ وَيَسْـَٔلُونَكَ عَنِ ٱلْيَتَـٰمَىٰ ۖ قُلْ إِصْلَاحٌ لَّهُمْ خَيْرٌ ۖ وَإِن تُخَالِطُوهُمْ فَإِخْوَٰنُكُمْ ۚ وَٱللَّهُ يَعْلَمُ ٱلْمُفْسِدَ مِنَ ٱلْمُصْلِحِ ۚ وَلَوْ شَآءَ ٱللَّهُ لَأَعْنَتَكُمْ ۚ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:257",
      "text_ar": "ٱللَّهُ وَلِىُّ ٱلَّذِينَ ءَامَنُوا۟ يُخْرِجُهُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ ۖ وَٱلَّذِينَ كَفَرُوٓا۟ أَوْلِيَآؤُهُمُ ٱلطَّـٰغُوتُ يُخْرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَـٰتِ ۗ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "2:275",
      "text_ar": "ٱلَّذِينَ يَأْكُلُونَ ٱلرِّبَوٰا۟ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِى يَتَخَبَّطُهُ ٱلشَّيْطَـٰنُ مِنَ ٱلْمَسِّ ۚ ذَٰلِكَ بِأَنَّهُمْ قَالُوٓا۟ إِنَّمَا ٱلْبَيْعُ مِثْلُ ٱلرِّبَوٰا۟ ۗ وَأَحَلَّ ٱللَّهُ ٱلْبَيْعَ وَحَرَّمَ ٱلرِّبَوٰا۟ ۚ فَمَن جَآءَهُۥ مَوْعِظَةٌ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمْرُهُۥٓ إِلَى ٱللَّهِ ۖ وَمَنْ عَادَ فَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:7",
      "text_ar": "هُوَ ٱلَّذِىٓ أَنزَلَ عَلَيْكَ ٱلْكِتَـٰبَ مِنْهُ ءَايَـٰتٌ مُّحْكَمَـٰتٌ هُنَّ أُمُّ ٱلْكِتَـٰبِ وَأُخَرُ مُتَشَـٰبِهَـٰتٌ ۖ فَأَمَّا ٱلَّذِينَ فِى قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ مَا تَشَـٰبَهَ مِنْهُ ٱبْتِغَآءَ ٱلْفِتْنَةِ وَٱبْتِغَآءَ تَأْوِيلِهِۦ ۗ وَمَا يَعْلَمُ تَأْوِيلَهُۥٓ إِلَّا ٱللَّهُ ۗ وَٱلرَّٰسِخُونَ فِى ٱلْعِلْمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلٌّ مِّنْ عِندِ رَبِّنَا ۗ وَمَا يَذَّكَّرُ إِلَّآ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:44",
      "text_ar": "ذَٰلِكَ مِنْ أَنۢبَآءِ ٱلْغَيْبِ نُوحِيهِ إِلَيْكَ ۚ وَمَا كُنتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَـٰمَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:49",
      "text_ar": "وَرَسُولًا إِلَىٰ بَنِىٓ إِسْرَٰٓءِيلَ أَنِّى قَدْ جِئْتُكُم بِـَٔايَةٍ مِّن رَّبِّكُمْ ۖ أَنِّىٓ أَخْلُقُ لَكُم مِّنَ ٱلطِّينِ كَهَيْـَٔةِ ٱلطَّيْرِ فَأَنفُخُ فِيهِ فَيَكُونُ طَيْرًۢا بِإِذْنِ ٱللَّهِ ۖ وَأُبْرِئُ ٱلْأَكْمَهَ وَٱلْأَبْرَصَ وَأُحْىِ ٱلْمَوْتَىٰ بِإِذْنِ ٱللَّهِ ۖ وَأُنَبِّئُكُم بِمَا تَأْكُلُونَ وَمَا تَدَّخِرُونَ فِى بُيُوتِكُمْ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَةً لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:55",
      "text_ar": "إِذْ قَالَ ٱللَّهُ يَـٰعِيسَىٰٓ إِنِّى مُتَوَفِّيكَ وَرَافِعُكَ إِلَىَّ وَمُطَهِّرُكَ مِنَ ٱلَّذِينَ كَفَرُوا۟ وَجَاعِلُ ٱلَّذِينَ ٱتَّبَعُوكَ فَوْقَ ٱلَّذِينَ كَفَرُوٓا۟ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ ۖ ثُمَّ إِلَىَّ مَرْجِعُكُمْ فَأَحْكُمُ بَيْنَكُمْ فِيمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:103",
      "text_ar": "وَٱعْتَصِمُوا۟ بِحَبْلِ ٱللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا۟ ۚ وَٱذْكُرُوا۟ نِعْمَتَ ٱللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَآءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُم بِنِعْمَتِهِۦٓ إِخْوَٰنًا وَكُنتُمْ عَلَىٰ شَفَا حُفْرَةٍ مِّنَ ٱلنَّارِ فَأَنقَذَكُم مِّنْهَا ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمْ ءَايَـٰتِهِۦ لَعَلَّكُمْ تَهْتَدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:107",
      "text_ar": "وَأَمَّا ٱلَّذِينَ ٱبْيَضَّتْ وُجُوهُهُمْ فَفِى رَحْمَةِ ٱللَّهِ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:116",
      "text_ar": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ لَن تُغْنِىَ عَنْهُمْ أَمْوَٰلُهُمْ وَلَآ أَوْلَـٰدُهُم مِّنَ ٱللَّهِ شَيْـًٔا ۖ وَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۚ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:154",
      "text_ar": "ثُمَّ أَنزَلَ عَلَيْكُم مِّنۢ بَعْدِ ٱلْغَمِّ أَمَنَةً نُّعَاسًا يَغْشَىٰ طَآئِفَةً مِّنكُمْ ۖ وَطَآئِفَةٌ قَدْ أَهَمَّتْهُمْ أَنفُسُهُمْ يَظُنُّونَ بِٱللَّهِ غَيْرَ ٱلْحَقِّ ظَنَّ ٱلْجَـٰهِلِيَّةِ ۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلْأَمْرِ مِن شَىْءٍ ۗ قُلْ إِنَّ ٱلْأَمْرَ كُلَّهُۥ لِلَّهِ ۗ يُخْفُونَ فِىٓ أَنفُسِهِم مَّا لَا يُبْدُونَ لَكَ ۖ يَقُولُونَ لَوْ كَانَ لَنَا مِنَ ٱلْأَمْرِ شَىْءٌ مَّا قُتِلْنَا هَـٰهُنَا ۗ قُل لَّوْ كُنتُمْ فِى بُيُوتِكُمْ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيْهِمُ ٱلْقَتْلُ إِلَىٰ مَضَاجِعِهِمْ ۖ وَلِيَبْتَلِىَ ٱللَّهُ مَا فِى صُدُورِكُمْ وَلِيُمَحِّصَ مَا فِى قُلُوبِكُمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:156",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَكُونُوا۟ كَٱلَّذِينَ كَفَرُوا۟ وَقَالُوا۟ لِإِخْوَٰنِهِمْ إِذَا ضَرَبُوا۟ فِى ٱلْأَرْضِ أَوْ كَانُوا۟ غُزًّى لَّوْ كَانُوا۟ عِندَنَا مَا مَاتُوا۟ وَمَا قُتِلُوا۟ لِيَجْعَلَ ٱللَّهُ ذَٰلِكَ حَسْرَةً فِى قُلُوبِهِمْ ۗ وَٱللَّهُ يُحْىِۦ وَيُمِيتُ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:168",
      "text_ar": "ٱلَّذِينَ قَالُوا۟ لِإِخْوَٰنِهِمْ وَقَعَدُوا۟ لَوْ أَطَاعُونَا مَا قُتِلُوا۟ ۗ قُلْ فَٱدْرَءُوا۟ عَنْ أَنفُسِكُمُ ٱلْمَوْتَ إِن كُنتُمْ صَـٰدِقِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:175",
      "text_ar": "إِنَّمَا ذَٰلِكُمُ ٱلشَّيْطَـٰنُ يُخَوِّفُ أَوْلِيَآءَهُۥ فَلَا تَخَافُوهُمْ وَخَافُونِ إِن كُنتُم مُّؤْمِنِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "3:180",
      "text_ar": "وَلَا يَحْسَبَنَّ ٱلَّذِينَ يَبْخَلُونَ بِمَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضْلِهِۦ هُوَ خَيْرًا لَّهُم ۖ بَلْ هُوَ شَرٌّ لَّهُمْ ۖ سَيُطَوَّقُونَ مَا بَخِلُوا۟ بِهِۦ يَوْمَ ٱلْقِيَـٰمَةِ ۗ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:20",
      "text_ar": "وَإِنْ أَرَدتُّمُ ٱسْتِبْدَالَ زَوْجٍ مَّكَانَ زَوْجٍ وَءَاتَيْتُمْ إِحْدَىٰهُنَّ قِنطَارًا فَلَا تَأْخُذُوا۟ مِنْهُ شَيْـًٔا ۚ أَتَأْخُذُونَهُۥ بُهْتَـٰنًا وَإِثْمًا مُّبِينًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:21",
      "text_ar": "وَكَيْفَ تَأْخُذُونَهُۥ وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍ وَأَخَذْنَ مِنكُم مِّيثَـٰقًا غَلِيظًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:34",
      "text_ar": "ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَآ أَنفَقُوا۟ مِنْ أَمْوَٰلِهِمْ ۚ فَٱلصَّـٰلِحَـٰتُ قَـٰنِتَـٰتٌ حَـٰفِظَـٰتٌ لِّلْغَيْبِ بِمَا حَفِظَ ٱللَّهُ ۚ وَٱلَّـٰتِى تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهْجُرُوهُنَّ فِى ٱلْمَضَاجِعِ وَٱضْرِبُوهُنَّ ۖ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا۟ عَلَيْهِنَّ سَبِيلًا ۗ إِنَّ ٱللَّهَ كَانَ عَلِيًّا كَبِيرًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:37",
      "text_ar": "ٱلَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ ٱلنَّاسَ بِٱلْبُخْلِ وَيَكْتُمُونَ مَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضْلِهِۦ ۗ وَأَعْتَدْنَا لِلْكَـٰفِرِينَ عَذَابًا مُّهِينًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:77",
      "text_ar": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمْ كُفُّوٓا۟ أَيْدِيَكُمْ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ إِذَا فَرِيقٌ مِّنْهُمْ يَخْشَوْنَ ٱلنَّاسَ كَخَشْيَةِ ٱللَّهِ أَوْ أَشَدَّ خَشْيَةً ۚ وَقَالُوا۟ رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا ٱلْقِتَالَ لَوْلَآ أَخَّرْتَنَآ إِلَىٰٓ أَجَلٍ قَرِيبٍ ۗ قُلْ مَتَـٰعُ ٱلدُّنْيَا قَلِيلٌ وَٱلْـَٔاخِرَةُ خَيْرٌ لِّمَنِ ٱتَّقَىٰ وَلَا تُظْلَمُونَ فَتِيلًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:107",
      "text_ar": "وَلَا تُجَـٰدِلْ عَنِ ٱلَّذِينَ يَخْتَانُونَ أَنفُسَهُمْ ۚ إِنَّ ٱللَّهَ لَا يُحِبُّ مَن كَانَ خَوَّانًا أَثِيمًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:108",
      "text_ar": "يَسْتَخْفُونَ مِنَ ٱلنَّاسِ وَلَا يَسْتَخْفُونَ مِنَ ٱللَّهِ وَهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ مَا لَا يَرْضَىٰ مِنَ ٱلْقَوْلِ ۚ وَكَانَ ٱللَّهُ بِمَا يَعْمَلُونَ مُحِيطًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:124",
      "text_ar": "وَمَن يَعْمَلْ مِنَ ٱلصَّـٰلِحَـٰتِ مِن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَأُو۟لَـٰٓئِكَ يَدْخُلُونَ ٱلْجَنَّةَ وَلَا يُظْلَمُونَ نَقِيرًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:139",
      "text_ar": "ٱلَّذِينَ يَتَّخِذُونَ ٱلْكَـٰفِرِينَ أَوْلِيَآءَ مِن دُونِ ٱلْمُؤْمِنِينَ ۚ أَيَبْتَغُونَ عِندَهُمُ ٱلْعِزَّةَ فَإِنَّ ٱلْعِزَّةَ لِلَّهِ جَمِيعًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:142",
      "text_ar": "إِنَّ ٱلْمُنَـٰفِقِينَ يُخَـٰدِعُونَ ٱللَّهَ وَهُوَ خَـٰدِعُهُمْ وَإِذَا قَامُوٓا۟ إِلَى ٱلصَّلَوٰةِ قَامُوا۟ كُسَالَىٰ يُرَآءُونَ ٱلنَّاسَ وَلَا يَذْكُرُونَ ٱللَّهَ إِلَّا قَلِيلًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "4:162",
      "text_ar": "لَّـٰكِنِ ٱلرَّٰسِخُونَ فِى ٱلْعِلْمِ مِنْهُمْ وَٱلْمُؤْمِنُونَ يُؤْمِنُونَ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن قَبْلِكَ ۚ وَٱلْمُقِيمِينَ ٱلصَّلَوٰةَ ۚ وَٱلْمُؤْتُونَ ٱلزَّكَوٰةَ وَٱلْمُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ أُو۟لَـٰٓئِكَ سَنُؤْتِيهِمْ أَجْرًا عَظِيمًا",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:3",
      "text_ar": "حُرِّمَتْ عَلَيْكُمُ ٱلْمَيْتَةُ وَٱلدَّمُ وَلَحْمُ ٱلْخِنزِيرِ وَمَآ أُهِلَّ لِغَيْرِ ٱللَّهِ بِهِۦ وَٱلْمُنْخَنِقَةُ وَٱلْمَوْقُوذَةُ وَٱلْمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسْتَقْسِمُوا۟ بِٱلْأَزْلَـٰمِ ۚ ذَٰلِكُمْ فِسْقٌ ۗ ٱلْيَوْمَ يَئِسَ ٱلَّذِينَ كَفَرُوا۟ مِن دِينِكُمْ فَلَا تَخْشَوْهُمْ وَٱخْشَوْنِ ۚ ٱلْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِى وَرَضِيتُ لَكُمُ ٱلْإِسْلَـٰمَ دِينًا ۚ فَمَنِ ٱضْطُرَّ فِى مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِّإِثْمٍ ۙ فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:15",
      "text_ar": "يَـٰٓأَهْلَ ٱلْكِتَـٰبِ قَدْ جَآءَكُمْ رَسُولُنَا يُبَيِّنُ لَكُمْ كَثِيرًا مِّمَّا كُنتُمْ تُخْفُونَ مِنَ ٱلْكِتَـٰبِ وَيَعْفُوا۟ عَن كَثِيرٍ ۚ قَدْ جَآءَكُم مِّنَ ٱللَّهِ نُورٌ وَكِتَـٰبٌ مُّبِينٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:22",
      "text_ar": "قَالُوا۟ يَـٰمُوسَىٰٓ إِنَّ فِيهَا قَوْمًا جَبَّارِينَ وَإِنَّا لَن نَّدْخُلَهَا حَتَّىٰ يَخْرُجُوا۟ مِنْهَا فَإِن يَخْرُجُوا۟ مِنْهَا فَإِنَّا دَٰخِلُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:23",
      "text_ar": "قَالَ رَجُلَانِ مِنَ ٱلَّذِينَ يَخَافُونَ أَنْعَمَ ٱللَّهُ عَلَيْهِمَا ٱدْخُلُوا۟ عَلَيْهِمُ ٱلْبَابَ فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَـٰلِبُونَ ۚ وَعَلَى ٱللَّهِ فَتَوَكَّلُوٓا۟ إِن كُنتُم مُّؤْمِنِينَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:44",
      "text_ar": "إِنَّآ أَنزَلْنَا ٱلتَّوْرَىٰةَ فِيهَا هُدًى وَنُورٌ ۚ يَحْكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسْلَمُوا۟ لِلَّذِينَ هَادُوا۟ وَٱلرَّبَّـٰنِيُّونَ وَٱلْأَحْبَارُ بِمَا ٱسْتُحْفِظُوا۟ مِن كِتَـٰبِ ٱللَّهِ وَكَانُوا۟ عَلَيْهِ شُهَدَآءَ ۚ فَلَا تَخْشَوُا۟ ٱلنَّاسَ وَٱخْشَوْنِ وَلَا تَشْتَرُوا۟ بِـَٔايَـٰتِى ثَمَنًا قَلِيلًا ۚ وَمَن لَّمْ يَحْكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْكَـٰفِرُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:48",
      "text_ar": "وَأَنزَلْنَآ إِلَيْكَ ٱلْكِتَـٰبَ بِٱلْحَقِّ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ مِنَ ٱلْكِتَـٰبِ وَمُهَيْمِنًا عَلَيْهِ ۖ فَٱحْكُم بَيْنَهُم بِمَآ أَنزَلَ ٱللَّهُ ۖ وَلَا تَتَّبِعْ أَهْوَآءَهُمْ عَمَّا جَآءَكَ مِنَ ٱلْحَقِّ ۚ لِكُلٍّ جَعَلْنَا مِنكُمْ شِرْعَةً وَمِنْهَاجًا ۚ وَلَوْ شَآءَ ٱللَّهُ لَجَعَلَكُمْ أُمَّةً وَٰحِدَةً وَلَـٰكِن لِّيَبْلُوَكُمْ فِى مَآ ءَاتَىٰكُمْ ۖ فَٱسْتَبِقُوا۟ ٱلْخَيْرَٰتِ ۚ إِلَى ٱللَّهِ مَرْجِعُكُمْ جَمِيعًا فَيُنَبِّئُكُم بِمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:54",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ مَن يَرْتَدَّ مِنكُمْ عَن دِينِهِۦ فَسَوْفَ يَأْتِى ٱللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلْمُؤْمِنِينَ أَعِزَّةٍ عَلَى ٱلْكَـٰفِرِينَ يُجَـٰهِدُونَ فِى سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوْمَةَ لَآئِمٍ ۚ ذَٰلِكَ فَضْلُ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:80",
      "text_ar": "تَرَىٰ كَثِيرًا مِّنْهُمْ يَتَوَلَّوْنَ ٱلَّذِينَ كَفَرُوا۟ ۚ لَبِئْسَ مَا قَدَّمَتْ لَهُمْ أَنفُسُهُمْ أَن سَخِطَ ٱللَّهُ عَلَيْهِمْ وَفِى ٱلْعَذَابِ هُمْ خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    },
    {
      "verse_key": "5:116",
      "text_ar": "وَإِذْ قَالَ ٱللَّهُ يَـٰعِيسَى ٱبْنَ مَرْيَمَ ءَأَنتَ قُلْتَ لِلنَّاسِ ٱتَّخِذُونِى وَأُمِّىَ إِلَـٰهَيْنِ مِن دُونِ ٱللَّهِ ۖ قَالَ سُبْحَـٰنَكَ مَا يَكُونُ لِىٓ أَنْ أَقُولَ مَا لَيْسَ لِى بِحَقٍّ ۚ إِن كُنتُ قُلْتُهُۥ فَقَدْ عَلِمْتَهُۥ ۚ تَعْلَمُ مَا فِى نَفْسِى وَلَآ أَعْلَمُ مَا فِى نَفْسِكَ ۚ إِنَّكَ أَنتَ عَلَّـٰمُ ٱلْغُيُوبِ",
      "text_en": "",
      "relevance": "inferred",
      "confidence": 0.6
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_009_chunk00",
        "verse_key": "2:9",
        "text_ar": "{يخادعون الله}: أي يخالفون الله، وأصل الخدع في اللغة الإخفاء، ومنه المخدع للبيت الذي يخفى فيه المتاع فالمخادع يظهر خلاف ما يضمر.والخدع من الله في قوله: {وهو خادعهم} [182-النساء] أي يظهر لهم ويعجل لهم من النعيم في الدنيا خلاف ما يغيب عنهم من عذاب الآخرة.وقيل: أصل الخدع: الفساد؛ معناه يفسدون ما أظهروا من الإيمان بما أضمروا من الكفر.وقوله: {وهو خادعهم}: أي يفسد عليهم نعيمهم في الدنيا بما يصيرهم إليه من عذاب الآخرة.-فإن قيل ما معنى قوله: {يخادعون الله} والمفاعلة للمشاركة وقد جل الله تعالى عن المشارك",
        "char_start": 0,
        "char_end": 1325,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "قوله تعالى : ( وبشر الذين آمنوا ) أي أخبر والبشارة كل خبر صدق تتغير به بشرة الوجه ويستعمل في الخير والشر وفي الخير أغلب ( وعملوا الصالحات ) أي الفعلات الصالحات يعني المؤمنين الذين هم من أهل الطاعات قال عثمان بن عفان رضي الله عنه ( وعملوا الصالحات ) أي أخلصوا الأعمال كما قال \" فليعمل عملا صالحا \" ( 110 - الكهف ) أي خاليا من الرياء . قال معاذ : العمل الصالح الذي فيه أربعة أشياء . العلم والنية والصبر والإخلاص . ( أن لهم جنات ) جمع الجنة والجنة البستان الذي فيه أشجار مثمرة سميت بها لاجتنانها وتسترها",
        "char_start": 0,
        "char_end": 878,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_027_chunk00",
        "verse_key": "2:27",
        "text_ar": "{الذين ينقضون} يخالفون ويتركون، وأصل النقض الكسر.{عهد الله} أمر الله الذي عهد إليهم يوم الميثاق بقوله: {ألست بربكم قالوا بلى} [ 173-الأعراف].وقيل: أراد به العهد الذي أخذه على النبيين وسائر الأمم أن يؤمنوا بمحمد صلى الله عليه وسلم في قوله: {وإذ أخذ الله ميثاق النبيين} [81-آل عمران] الآية.وقيل: أراد به العهد الذي عهد إليهم في التوراة أن يؤمنوا بمحمد صلى الله عليه وسلم ويبينوا نعته.{من بعد ميثاقه} توكيده.والميثاق: العهد المؤكد.{ويقطعون ما أمر الله به أن يوصل} يعنى الإيمان بمحمد صلى الله عليه وسلم و",
        "char_start": 0,
        "char_end": 789,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_039_chunk00",
        "verse_key": "2:39",
        "text_ar": "{والذين كفروا} يعني جحدوا{وكذبوا بآياتنا} بالقرآن.{أولئك أصحاب النار} يوم القيامة{هم فيها خالدون} لا يخرجون منها ولا يموتون فيها.",
        "char_start": 0,
        "char_end": 129,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_081_chunk00",
        "verse_key": "2:81",
        "text_ar": "{بلى} وبل وبلى: حرفا استدراك ومعناهما نفي الخبر الماضي وإثبات الخبر المستقبل.{من كسب سيئة} يعني الشرك.{وأحاطت به خطيئته} قرأ أهل المدينة خطيئاته بالجمع، والإحاطة الإحداق بالشيء من جميع نواحيه.قال ابن عباس وعطاء والضحاك وأبو العالية والربيع وجماعة: \"هي الشرك يموت عليه\".وقيل: السيئة الكبيرة. والإحاطة به أن يصر عليها فيموت غير تائب.قال عكرمة والربيع بن خيثم وقال مجاهد: \"هي الذنوب تحيط القلب، كلما أذنب ذنباً ارتفعت (حتى تغشى) القلب وهي الرين\".قال الكلبي: \"أوبقته ذنوبه، دليله قوله تعالى: {إلا أن يحاط",
        "char_start": 0,
        "char_end": 563,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_082_chunk00",
        "verse_key": "2:82",
        "text_ar": "قوله تعالى: {والذين آمنوا وعملوا الصالحات أولئك أصحاب الجنة هم فيها خالدون}.",
        "char_start": 0,
        "char_end": 76,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_084_chunk00",
        "verse_key": "2:84",
        "text_ar": "قوله عز وجل ( وإذ أخذنا ميثاقكم لا تسفكون دماءكم ) أي لا تريقون دماءكم أي : لا يسفك بعضكم دم بعض ، وقيل : لا تسفكوا دماء غيركم فتسفك دماءكم ، فكأنكم سفكتم دماء أنفسكم ، ( ولا تخرجون أنفسكم من دياركم ) أي لا يخرج بعضكم بعضا من داره ، وقيل : لا تسيئوا جوار من جاوركم فتلجئوهم إلى الخروج بسوء جواركم ( ثم أقررتم ) بهذا العهد أنه حق وقبلتم ( وأنتم تشهدون ) اليوم على ذلك يا معشر اليهود وتقرون بالقبول .",
        "char_start": 0,
        "char_end": 398,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "قوله عز وجل: {ثم أنتم هؤلاء} يعني: يا هؤلاء، وهؤلاء للتنبيه.{تقتلون أنفسكم} أي (يقتل) بعضكم بعضاً.{وتخرجون فريقاً منكم من ديارهم تظاهرون عليهم} بتشديد الظاء أي تتظاهرون أدغمت التاء في الظاء، وقرأ عاصم وحمزة والكسائي بتخفيف الظاء فحذفوا تاء التفاعل وأبقوا تاء الخطاب كقوله تعالى: {ولا تعاونوا} معناهما جميعاً: تتعاونون، والظهير: العون.{بالإثم والعدوان} المعصية والظلم.{وإن يأتوكم أسارى} وقرأ حمزة: أسرى، وهما جمع أسير، ومعناهما واحد.{تفادوهم} بالمال وتنقذوهم.وقرأ أهل المدينة وعاصم والكسائي ويعقوب ( ت",
        "char_start": 0,
        "char_end": 1904,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "قوله ( وقالت اليهود ليست النصارى على شيء ) نزلت في يهود المدينة ونصارى أهل نجران وذلك أن وفد نجران لما قدموا على النبي صلى الله عليه وسلم أتاهم أحبار اليهود : فتناظروا حتى ارتفعت أصواتهم فقالت لهم اليهود ، ما أنتم على شيء من الدين ، وكفروا بعيسى والإنجيل ، وقالت لهم النصارى : ما أنتم على شيء من الدين ، وكفروا بموسى والتوراة فأنزل الله تعالى ( وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب ) [ وكلا الفريقين يقرءون الكتاب ، قيل : معناه ليس في كتبهم هذا الاختلاف فدل تلاوتهم الكتاب ومخالفتهم ما ",
        "char_start": 0,
        "char_end": 949,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "{الذين آتيناهم الكتاب} قال ابن عباس رضي الله عنهما: \"نزلت في أهل السفينة الذين قدموا مع جعفر بن أبي طالب رضي الله عنه وكانوا أربعين رجلاً اثنان وثلاثون من الحبشة وثمانية من رهبان الشام منهم بحيرا\"، وقال الضحاك: \"هم من آمن من اليهود عبد الله بن سلام وسعية بن عمرو وتمام بن يهودا وأسد وأسيد ابنا كعب وابن يامين وعبد الله بن صوريا\"،وقال قتادة وعكرمة: \"هم أصحاب محمد صلى الله عليه وسلم\"، وقيل: هم المؤمنون عامة.{يتلونه حق تلاوته} قال الكلبي: \"يصفونه في كتبهم حق صفته لمن سألهم من الناس\".والهاء راجعة إلى ",
        "char_start": 0,
        "char_end": 837,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "{قل} يا محمد لليهود والنصارى.{أتحاجوننا في الله} أي في دين الله، والمحاجة: المجادلة في الله لإظهار الحجة، وذلك بأنهم قالوا إن الأنبياء كانوا منا وعلى ديننا، وديننا أقوم فنحن أولى بالله منكم فقال الله تعالى: {قل أتحاجوننا في الله}.{وهو ربنا وربكم} أي نحن وأنتم سواء في الله فإنه ربنا وربكم.{ولنا أعمالنا ولكم أعمالكم} أي لكل واحد جزاء عمله، فكيف تدعون أنكم أولى بالله.{ونحن له مخلصون} وأنتم به مشركون. قال سعيد بن جبير : \"الإخلاص أن يخلص العبد دينه وعمله لله فلا يشرك به في دينه ولا يرائي بعمله\"، قال ",
        "char_start": 0,
        "char_end": 593,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_150_chunk00",
        "verse_key": "2:150",
        "text_ar": "{ومن حيث خرجت فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا وجوهكم شطره} وإنما كرر لتأكيد النسخ.{لئلا يكون للناس عليكم حجة إلا الذين ظلموا} اختلفوا في تأويل هذه الآية ووجه قوله \"إلا\" فقال بعضهم: معناه حولت القبلة إلى الكعبة {لئلا يكون للناس عليكم حجة} إذا توجهتم إلى غيرها فيقولون ليست لكم قبلة {إلا الذين ظلموا} وهم قريش واليهود فأما قريش فتقول رجع محمد إلى الكعبة، لأنه علم أنها الحق وأنها قبلة آبائه، فكذلك يرجع إلى ديننا، وأما اليهود فتقول: لم ينصرف عن بيت المقدس مع علمه بأنه حق إلا أنه يعمل برأ",
        "char_start": 0,
        "char_end": 2668,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_187_chunk00",
        "verse_key": "2:187",
        "text_ar": "قوله تعالى ( أحل لكم ليلة الصيام الرفث إلى نسائكم ) فالرفث كناية عن الجماع قال ابن عباس : إن الله تعالى حيي كريم يكني كل ما ذكر في القرآن من المباشرة والملامسة والإفضاء ، والدخول والرفث فإنما عنى به الجماع وقال الزجاج : الرفث كلمة جامعة لكل ما يريده الرجال من النساء قال أهل التفسير كان في ابتداء الأمر إذا أفطر الرجل حل له الطعام والشراب والجماع إلى أن يصلي العشاء الآخرة أو يرقد قبلها فإذا صلى العشاء أو رقد قبلها حرم عليه الطعام والنساء إلى الليلة القابلة ثم إن عمر بن الخطاب رضي الله عنه واقع أهل",
        "char_start": 0,
        "char_end": 7143,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_212_chunk00",
        "verse_key": "2:212",
        "text_ar": "( زين للذين كفروا الحياة الدنيا ) الأكثرون على أن المزين هو الله تعالى والتزيين من الله تعالى هو أنه خلق الأشياء الحسنة والمناظر العجيبة فنظر الخلق إليها بأكثر من قدرها فأعجبتهم ففتنوا بها وقال الزجاج : زين لهم الشيطان قيل نزلت هذه الآية في مشركي العرب أبي جهل وأصحابه كانوا يتنعمون بما بسط الله لهم في الدنيا من المال ويكذبون بالمعاد ( ويسخرون من الذين آمنوا ) أي يستهزئون بالفقراء من المؤمنين .قال ابن عباس : أراد بالذين آمنوا عبد الله بن مسعود وعمار بن ياسر وصهيبا وبلالا وخبابا وأمثالهم وقال مقات",
        "char_start": 0,
        "char_end": 2623,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "قوله تعالى : ( يسألونك عن الشهر الحرام قتال فيه ) سبب نزول هذه الآية أن رسول الله صلى الله عليه وسلم بعث عبد الله بن جحش وهو ابن عمة النبي صلى الله عليه وسلم أخت أبيه في جمادى الآخرة قبل قتال بدر بشهرين على رأس سبعة عشر شهرا من مقدمه إلى المدينة وبعث معه ثمانية رهط من المهاجرين : سعد بن أبي وقاص الزهري وعكاشة بن محصن الأسدي وعتبة بن غزوان السلمي وأبا حذيفة بن عتبة بن ربيعة وسهيل بن بيضاء وعامر بن ربيعة وواقد بن عبد الله وخالد بن بكير وكتب لأميرهم عبد الله بن جحش كتابا وقال له : \" سر على اسم الله",
        "char_start": 0,
        "char_end": 4293,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_220_chunk00",
        "verse_key": "2:220",
        "text_ar": "قوله تعالى: \" في الدنيا والآخرة \" قيل: معناه يبين الله لكم الآيات في أمر النفقة لعلكم تتفكرون في الدنيا والآخرة فتحبسون من أموالكم ما يصلحكم في معاش الدنيا وتنفقون الباقي فيما ينفعكم في العقبى، وقال أكثر المفسرين: معناها هكذا: يبين الله لكم الآيات في أمر الدنيا والآخرة، \" لعلكم تتفكرون \" في زوال الدنيا وفنائها فتزهدوا فيها وفي إقبال الآخرة وبقائها فترغبوا فيها.قوله تعالى: \" ويسألونك عن اليتامى \" قال ابن عباس و قتادة : لما نزل قوله تعالى: \" ولا تقربوا مال اليتيم إلا بالتي هي أحسن \" (152-الأنعام) ",
        "char_start": 0,
        "char_end": 1756,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_257_chunk00",
        "verse_key": "2:257",
        "text_ar": "قوله تعالى : ( الله ولي الذين آمنوا ) ناصرهم ومعينهم وقيل : محبهم ، وقيل متولي أمورهم لا يكلهم إلى غيره وقال الحسن : ولي هدايتهم ( يخرجهم من الظلمات إلى النور ) أي من الكفر إلى الإيمان قال الواقدي : كل ما في القرآن من الظلمات والنور فالمراد منه الكفر والإيمان غير التي في سورة الأنعام ، وجعل الظلمات والنور \" فالمراد منه الليل والنهار سمي الكفر ظلمة لالتباس طريقه وسمي الإسلام نورا لوضوح طريقه ( والذين كفروا أولياؤهم الطاغوت ) قال مقاتل : يعني كعب بن الأشرف وحيي بن أخطب وسائر رءوس الضلالة ( يخرجونه",
        "char_start": 0,
        "char_end": 1280,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_275_chunk00",
        "verse_key": "2:275",
        "text_ar": "قوله تعالى : ( الذين يأكلون الربا ) أي يعاملون به وإنما خص الأكل لأنه معظم المقصود من المال ( لا يقومون ) يعني يوم القيامة من قبورهم ( إلا كما يقوم الذي يتخبطه ) أي يصرعه ( الشيطان ) أصل الخبط الضرب والوطء وهو ضرب على غير استواء يقال : ناقة خبوط للتي تطأ الناس وتضرب الأرض بقوائمها ( من المس ) أي الجنون يقال : مس الرجل فهو ممسوس إذا كان مجنونا ومعناه : أن آكل الربا يبعث يوم القيامة وهو كمثل المصروع .أخبرنا أبو سعيد أحمد بن إبراهيم السرخسي أخبرنا أبو إسحاق الثعلبي ، أخبرنا عبد الله بن حامد ، أخبرن",
        "char_start": 0,
        "char_end": 6381,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_007_chunk00",
        "verse_key": "3:7",
        "text_ar": "قوله تعالى ( هو الذي أنزل عليك الكتاب منه آيات محكمات ) مبينات مفصلات ، سميت محكمات من الإحكام ، كأنه أحكمها فمنع الخلق من التصرف فيها لظهورها ووضوح معناها ( هن أم الكتاب ) أي أصله الذي يعمل عليه في الأحكام وإنما قال : ( هن أم الكتاب ) ولم يقل أمهات الكتاب لأن الآيات كلها في تكاملها واجتماعها كالآية الواحدة ، وكلام الله واحد وقيل : معناه كل آية منهن أم الكتاب كما قال : \" وجعلنا ابن مريم وأمه آية \" ( 50 - المؤمنون ) أي كل واحد منهما آية ( وأخر ) جمع أخرى ولم يصرفه لأنه معدول عن الآخر ، مثل : عمر ",
        "char_start": 0,
        "char_end": 6942,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_044_chunk00",
        "verse_key": "3:44",
        "text_ar": "قوله تعالى : ( ذلك من أنباء الغيب نوحيه إليك ) يقول لمحمد صلى الله عليه وسلم ( ذلك ) الذي ذكرت من حديث زكريا ويحيى ومريم وعيسى ( من أنباء الغيب ) أي من أخبار الغيب ( نوحيه إليك ) رد الكناية إلى ذلك فلذلك ذكره ( وما كنت ) يا محمد ( لديهم إذ يلقون أقلامهم ) سهامهم في الماء للاقتراع ( أيهم يكفل مريم ) يحضنها ويربيها ( وما كنت لديهم إذ يختصمون ) في كفالتها .",
        "char_start": 0,
        "char_end": 356,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_009_chunk00",
        "verse_key": "2:9",
        "text_ar": "وقوله تعالي : ( يخادعون الله والذين امنوا ) اي : باظهارهم ما اظهروه من الايمان مع اسرارهم الكفر ، يعتقدون بجهلهم انهم يخدعون الله بذلك ، وان ذلك نافعهم عنده ، وانه يروج عليه كما يروج علي بعض المومنين ، كما قال تعالي : ( يوم يبعثهم الله جميعا فيحلفون له كما يحلفون لكم ويحسبون انهم علي شيء الا انهم هم الكاذبون ) [ المجادله : 18 ] ؛ ولهذا قابلهم علي اعتقادهم ذلك بقوله : ( وما يخدعون الا انفسهم وما يشعرون ) يقول : وما يغرون بصنيعهم هذا ولا يخدعون الا انفسهم ، وما يشعرون بذلك من انفسهم ، كما قال تعال",
        "char_start": 0,
        "char_end": 2127,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "لما ذكر تعالي ما اعده لاعدايه من الاشقياء الكافرين به وبرسله من العذاب والنكال ، عطف بذكر حال اوليايه من السعداء المومنين به وبرسله ، الذين صدقوا ايمانهم باعمالهم الصالحه ، وهذا معني تسميه القران مثاني علي اصح اقوال العلماء ، كما سنبسطه في موضعه ، وهو ان يذكر الايمان ويتبعه بذكر الكفر ، او عكسه ، او حال السعداء ثم الاشقياء ، او عكسه . وحاصله ذكر الشيء ومقابله . واما ذكر الشيء ونظيره فذاك التشابه ، كما سنوضحه ان شاء الله ؛ فلهذا قال تعالي : ( وبشر الذين امنوا وعملوا الصالحات ان لهم جنات تجري من ت",
        "char_start": 0,
        "char_end": 4934,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_027_chunk00",
        "verse_key": "2:27",
        "text_ar": "وقال شعبه ، عن عمرو بن مره ، عن مصعب بن سعد ، قال : سالت ابي فقلت : قوله تعالي : ( الذين ينقضون عهد الله من بعد ميثاقه ) الي اخر الايه ، فقال : هم الحروريه . وهذا الاسناد ان صح عن سعد بن ابي وقاص - رضي الله عنه - فهو تفسير علي المعني ، لا ان الايه اريد منها التنصيص علي الخوارج ، الذين خرجوا علي علي بالنهروان ، فان اوليك لم يكونوا حال نزول الايه ، وانما هم داخلون بوصفهم فيها مع من دخل ؛ لانهم سموا خوارج لخروجهم علي طاعه الامام والقيام بشرايع الاسلام .والفاسق في اللغه : هو الخارج عن الطاعه ايضا . ",
        "char_start": 0,
        "char_end": 4779,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_039_chunk00",
        "verse_key": "2:39",
        "text_ar": "كما قال هاهنا : ( والذين كفروا وكذبوا باياتنا اوليك اصحاب النار هم فيها خالدون ) اي : مخلدون فيها ، لا محيد لهم عنها ، ولا محيص .وقد اورد ابن جرير ، رحمه الله ، هاهنا حديثا ساقه من طريقين ، عن ابي مسلمه سعيد بن يزيد ، عن ابي نضره المنذر بن مالك بن قطعه عن ابي سعيد - واسمه سعد بن مالك بن سنان الخدري - قال : قال رسول الله صلي الله عليه وسلم : اما اهل النار الذين هم اهلها فانهم لا يموتون فيها ولا يحيون ، لكن اقواما اصابتهم النار بخطاياهم ، او بذنوبهم فاماتتهم اماته ، حتي اذا صاروا فحما اذن في الشفا",
        "char_start": 0,
        "char_end": 812,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_081_chunk00",
        "verse_key": "2:81",
        "text_ar": "يقول تعالي : ليس الامر كما تمنيتم ، ولا كما تشتهون ، بل الامر : انه من عمل سييه واحاطت به خطييته ، وهو من وافي يوم القيامه وليس له حسنه ، بل جميع عمله سييات ، فهذا من اهل النار ، والذين امنوا بالله ورسوله وعملوا الصالحات من العمل الموافق للشريعه فهم من اهل الجنه . وهذا المقام شبيه بقوله تعالي : ( ليس بامانيكم ولا اماني اهل الكتاب من يعمل سوءا يجز به ولا يجد له من دون الله وليا ولا نصيرا ومن يعمل من الصالحات من ذكر او انثي وهو مومن فاوليك يدخلون الجنه ولا يظلمون نقيرا ) [ النساء : 123 ، 124 ] .قا",
        "char_start": 0,
        "char_end": 1779,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_082_chunk00",
        "verse_key": "2:82",
        "text_ar": "وقال محمد بن اسحاق : حدثني محمد ، عن سعيد او عكرمه عن ابن عباس : ( والذين امنوا وعملوا الصالحات اوليك اصحاب الجنه هم فيها خالدون ) اي من امن بما كفرتم به ، وعمل بما تركتم من دينه ، فلهم الجنه خالدين فيها . يخبرهم ان الثواب بالخير والشر مقيم علي اهله ، لا انقطاع له ابدا .",
        "char_start": 0,
        "char_end": 271,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_084_chunk00",
        "verse_key": "2:84",
        "text_ar": "يقول ، تبارك وتعالي ، منكرا علي اليهود الذين كانوا في زمان رسول الله صلي الله عليه وسلم بالمدينه ، وما كانوا يعانونه من القتال مع الاوس والخزرج ، وذلك ان الاوس والخزرج ، وهم الانصار ، كانوا في الجاهليه عباد اصنام ، وكانت بينهم حروب كثيره ، وكانت يهود المدينه ثلاث قبايل : بنو قينقاع . وبنو النضير حلفاء الخزرج . وبنو قريظه حلفاء الاوس . فكانت الحرب اذا نشبت بينهم قاتل كل فريق مع حلفايه ، فيقتل اليهودي اعداءه ، وقد يقتل اليهودي الاخر من الفريق الاخر ، وذلك حرام عليهم في دينه ونص كتابه ، ويخرجونهم م",
        "char_start": 0,
        "char_end": 1227,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "( ثم انتم هولاء تقتلون انفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالاثم والعدوان وان ياتوكم اساري تفادوهم وهو محرم عليكم اخراجهم ) قال محمد بن اسحاق بن يسار : حدثني محمد بن ابي محمد ، عن سعيد بن جبير او عكرمه عن ابن عباس : ( ثم انتم هولاء تقتلون انفسكم ) الايه ، قال : انبهم الله من فعلهم ، وقد حرم عليهم في التوراه سفك دمايهم وافترض عليهم فيها فداء اسراهم ، فكانوا فريقين : طايفه منهم بنو قينقاع وانهم حلفاء الخزرج ، والنضير ، وقريظه وانهم حلفاء الاوس ، فكانوا اذا كانت بين الاوس والخزرج حرب",
        "char_start": 0,
        "char_end": 3715,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "وقوله تعالي : ( وقالت اليهود ليست النصاري علي شيء وقالت النصاري ليست اليهود علي شيء وهم يتلون الكتاب ) يبين به تعالي تناقضهم وتباغضهم وتعاديهم وتعاندهم . كما قال محمد بن اسحاق : حدثني محمد بن ابي محمد ، عن عكرمه او سعيد بن جبير ، عن ابن عباس ، قال : لما قدم اهل نجران من النصاري علي رسول الله صلي الله عليه وسلم ، اتتهم احبار يهود ، فتنازعوا عند رسول الله صلي الله عليه وسلم ، فقال رافع بن حريمله ما انتم علي شيء ، وكفر بعيسي وبالانجيل . وقال رجل من اهل نجران من النصاري لليهود : ما انتم علي شيء . وج",
        "char_start": 0,
        "char_end": 2843,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "وقوله تعالي : ( الذين اتيناهم الكتاب يتلونه حق تلاوته ) قال عبد الرزاق ، عن معمر ، عن قتاده : هم اليهود والنصاري . وهو قول عبد الرحمن بن زيد بن اسلم ، واختاره ابن جرير .وقال : سعيد عن قتاده : هم اصحاب رسول الله صلي الله عليه وسلم .وقال ابن ابي حاتم : حدثنا ابي ، حدثنا ابراهيم بن موسي ، وعبد الله بن عمران الاصبهاني ، قالا حدثنا يحيي بن يمان ، حدثنا اسامه بن زيد ، عن ابيه ، عن عمر بن الخطاب ( يتلونه حق تلاوته ) قال : اذا مر بذكر الجنه سال الله الجنه ، واذا مر بذكر النار تعوذ بالله من النار .وقال ا",
        "char_start": 0,
        "char_end": 3557,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "يقول الله تعالي مرشدا نبيه صلوات الله وسلامه عليه الي درء مجادله المشركين : ( قل اتحاجوننا في الله ) اي : اتناظروننا في توحيد الله والاخلاص له والانقياد ، واتباع اوامره وترك زواجره ( وهو ربنا وربكم ) المتصرف فينا وفيكم ، المستحق لاخلاص الالهيه له وحده لا شريك له ! ( ولنا اعمالنا ولكم اعمالكم ) اي : نحن براء منكم ، وانتم براء منا ، كما قال في الايه الاخري : ( وان كذبوك فقل لي عملي ولكم عملكم انتم برييون مما اعمل وانا بريء مما تعملون ) [ يونس : 41 ] وقال تعالي : ( فان حاجوك فقل اسلمت وجهي لله ومن ",
        "char_start": 0,
        "char_end": 1026,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_150_chunk00",
        "verse_key": "2:150",
        "text_ar": "وقال في الامر الثاني : ( ومن حيث خرجت فول وجهك شطر المسجد الحرام وانه للحق من ربك وما الله بغافل عما تعملون ) فذكر انه الحق من الله وارتقي عن المقام الاول ، حيث كان موافقا لرضا الرسول صلي الله عليه وسلم فبين انه الحق ايضا من الله يحبه ويرتضيه ، وذكر في الامر الثالث حكمه قطع حجه المخالف من اليهود الذين كانوا يتحججون باستقبال الرسول الي قبلتهم ، وقد كانوا يعلمون بما في كتبهم انه سيصرف الي قبله ابراهيم ، عليه السلام ، الي الكعبه ، وكذلك مشركو العرب انقطعت حجتهم لما صرف الرسول صلي الله عليه وسلم عن ",
        "char_start": 0,
        "char_end": 2189,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_187_chunk00",
        "verse_key": "2:187",
        "text_ar": "هذه رخصه من الله تعالي للمسلمين ، ورفع لما كان عليه الامر في ابتداء الاسلام ، فانه كان اذا افطر احدهم انما يحل له الاكل والشرب والجماع الي صلاه العشاء او ينام قبل ذلك ، فمتي نام او صلي العشاء حرم عليه الطعام والشراب والجماع الي الليله القابله . فوجدوا من ذلك مشقه كبيره . والرفث هنا هو : الجماع . قاله ابن عباس ، وعطاء ، ومجاهد ، وسعيد بن جبير ، وطاوس ، وسالم بن عبد الله ، وعمرو بن دينار والحسن ، وقتاده ، والزهري ، والضحاك ، وابراهيم النخعي ، والسدي ، وعطاء الخراساني ، ومقاتل بن حيان .وقوله : ( هن",
        "char_start": 0,
        "char_end": 22264,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_212_chunk00",
        "verse_key": "2:212",
        "text_ar": "ثم اخبر تعالي عن تزيينه الحياه الدنيا للكافرين الذين رضوا بها واطمانوا اليها ، وجمعوا الاموال ومنعوها عن مصارفها التي امروا بها مما يرضي الله عنهم ، وسخروا من الذين امنوا الذين اعرضوا عنها ، وانفقوا ما حصل لهم منها في طاعه ربهم ، وبذلوا ابتغاء وجه الله ; فلهذا فازوا بالمقام الاسعد والحظ الاوفر يوم معادهم ، فكانوا فوق اوليك في محشرهم ومنشرهم ، ومسيرهم وماواهم ، فاستقروا في الدرجات في اعلي عليين ، وخلد اوليك في الدركات في اسفل السافلين ; ولهذا قال تعالي : ( والله يرزق من يشاء بغير حساب ) اي : يرزق",
        "char_start": 0,
        "char_end": 1173,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "قال ابن ابي حاتم : حدثنا ابي ، حدثنا محمد بن ابي بكر المقدمي ، حدثنا المعتمر بن سليمان ، عن ابيه ، حدثني الحضرمي ، عن ابي السوار ، عن جندب بن عبد الله ، ان رسول الله صلي الله عليه وسلم بعث رهطا ، وبعث عليهم ابا عبيده بن الجراح [ او عبيده بن الحارث ] فلما ذهب ينطلق ، بكي صبابه الي رسول الله صلي الله عليه وسلم ، فجلس ، فبعث عليهم مكانه عبد الله بن جحش ، وكتب له كتابا ، وامره الا يقرا الكتاب حتي يبلغ مكان كذا وكذا ، وقال : لا تكرهن احدا علي السير معك من اصحابك . فلما قرا الكتاب استرجع ، وقال : سمعا",
        "char_start": 0,
        "char_end": 8334,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_220_chunk00",
        "verse_key": "2:220",
        "text_ar": "وقوله : ( كذلك يبين الله لكم الايات لعلكم تتفكرون في الدنيا والاخره ) اي : كما فصل لكم هذه الاحكام وبينها واوضحها ، كذلك يبين لكم ساير الايات في احكامه ووعده ، ووعيده ، لعلكم تتفكرون في الدنيا والاخره .قال علي بن ابي طلحه ، عن ابن عباس : يعني في زوال الدنيا وفنايها ، واقبال الاخره وبقايها .وقال ابن ابي حاتم : حدثنا ابي ، حدثنا علي بن محمد الطنافسي ، حدثنا ابو اسامه ، عن الصعق العيشي قال : شهدت الحسن وقرا هذه الايه من البقره : ( لعلكم تتفكرون في الدنيا والاخره ) قال : هي والله لمن تفكر فيها ، ليع",
        "char_start": 0,
        "char_end": 2746,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_257_chunk00",
        "verse_key": "2:257",
        "text_ar": "يخبر تعالي انه يهدي من اتبع رضوانه سبل السلام فيخرج عباده المومنين من ظلمات الكفر والشك والريب الي نور الحق الواضح الجلي المبين السهل المنير ، وان الكافرين انما وليهم الشياطين تزين لهم ما هم فيه من الجهالات والضلالات ، ويخرجونهم ويحيدون بهم عن طريق الحق الي الكفر والافك ( اوليك اصحاب النار هم فيها خالدون )ولهذا وحد تعالي لفظ النور وجمع الظلمات ; لان الحق واحد والكفر اجناس كثيره وكلها باطله كما قال : ( وان هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله ذلكم وصاكم به لعلكم تتقون ) [",
        "char_start": 0,
        "char_end": 1121,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_275_chunk00",
        "verse_key": "2:275",
        "text_ar": "لما ذكر تعالي الابرار المودين النفقات ، المخرجين الزكوات ، المتفضلين بالبر والصلات لذوي الحاجات والقرابات في جميع الاحوال والانات شرع في ذكر اكله الربا واموال الناس بالباطل وانواع الشبهات ، فاخبر عنهم يوم خروجهم من قبورهم وقيامهم منها الي بعثهم ونشورهم ، فقال : ( الذين ياكلون الربا لا يقومون الا كما يقوم الذي يتخبطه الشيطان من المس ) اي : لا يقومون من قبورهم يوم القيامه الا كما يقوم المصروع حال صرعه وتخبط الشيطان له ; وذلك انه يقوم قياما منكرا . وقال ابن عباس : اكل الربا يبعث يوم القيامه مجنونا ",
        "char_start": 0,
        "char_end": 9283,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_007_chunk00",
        "verse_key": "3:7",
        "text_ar": "خبر تعالي ان في القران ايات محكمات هن ام الكتاب ، اي : بينات واضحات الدلاله ، لا التباس فيها علي احد من الناس ، ومنه ايات اخر فيها اشتباه في الدلاله علي كثير من الناس او بعضهم ، فمن رد ما اشتبه عليه الي الواضح منه ، وحكم محكمه علي متشابهه عنده ، فقد اهتدي . ومن عكس انعكس ، ولهذا قال تعالي : ( هو الذي انزل عليك الكتاب منه ايات محكمات هن ام الكتاب ) اي : اصله الذي يرجع اليه عند الاشتباه ( واخر متشابهات ) اي : تحتمل دلالتها موافقه المحكم ، وقد تحتمل شييا اخر من حيث اللفظ والتركيب ، لا من حيث المراد",
        "char_start": 0,
        "char_end": 13534,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_044_chunk00",
        "verse_key": "3:44",
        "text_ar": "ثم قال تعالي لرسوله [ عليه افضل الصلوات والسلام ] بعدما اطلعه علي جليه الامر : ( ذلك من انباء الغيب نوحيه اليك ) اي : نقصه عليك ( وما كنت لديهم اذ يلقون اقلامهم ايهم يكفل مريم وما كنت لديهم اذ يختصمون ) اي : ما كنت عندهم يا محمد فتخبرهم عنهم معاينه عما جري ، بل اطلعك الله علي ذلك كانك كنت حاضرا وشاهدا لما كان من امرهم حين اقترعوا في شان مريم ايهم يكفلها ، وذلك لرغبتهم في الاجر .قال ابن جرير : حدثنا القاسم ، حدثنا الحسين ، حدثني حجاج ، عن ابن جريج ، عن القاسم بن ابي بزه ، انه اخبره عن عكرمه - واب",
        "char_start": 0,
        "char_end": 1411,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_009_chunk00",
        "verse_key": "2:9",
        "text_ar": "«يخادعون الله والذين آمنوا» بإظهار خلاف ما أبطنوه من الكفر ليدفعوا عنهم أحكامه الدنيوية «وما يخدعون إلا أنفسهم» لأن وبال خداعهم راجع إليهم فيفتضحون في الدنيا بإطلاع الله نبيه على ما أبطنوه ويعاقبون في الآخرة «وما يشعرون» يعلمون أن خداعهم لأنفسهم، والمخادعة هنا من واحد كعاقبت اللص وذكر الله فيها تحسين، وفي قراءة وما يخدعون.",
        "char_start": 0,
        "char_end": 324,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "«وَبَشِّر» أخبر «الذين آمنوا» صَّدقوا بالله «وعملوا الصالحات» من الفروض والنوافل «أن» أي بأن «لهم جناتِ» حدائق ذات أشجار ومساكن «تجري من تحتها» أي تحت أشجارها وقصورها «الأنهار» أي المياه فيها، والنهر الموضع الذي يجري فيه الماء لأن الماء ينهره أي يحفره وإسناد الجري إليه مجاز «كلما رزقوا منها» أطعموا من تلك الجنات. «من ثمرة رزقاً قالوا هذا الذي» أي مثل ما «رزقنا من قبل» أي قبله في الجنة لتشابه ثمارها بقرينة «وأُتوا به» أي جيئوا بالرزق «متشابهاً» يشبه بعضه بعضا لونا ويختلف طعما «ولهم فيها أزواج» من",
        "char_start": 0,
        "char_end": 761,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_027_chunk00",
        "verse_key": "2:27",
        "text_ar": "«الذين» نعت «ينقضون عهد الله» ما عهده إليهم في الكتب من الإيمان بمحمد * «من بعد ميثاقه» توكيده عليهم «ويقطعون ما أمر الله به أن يوُصل» من الإيمان بالنبي والرحم وغير ذلك وأن بدل من ضمير به «ويفسدون في الأرض» بالمعاصي والتعويق عن الإيمان «أولئك» الموصوفون بما ذكر «هم الخاسرون» لمصيرهم إلى النار المؤبدة عليهم.",
        "char_start": 0,
        "char_end": 308,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_039_chunk00",
        "verse_key": "2:39",
        "text_ar": "«والذين كفروا وكذبوا بآياتنا» كتبنا «أولئك أصحاب النار هم فيها خالدون» ماكثون أبداً لا يفنون ولا يخرجون.",
        "char_start": 0,
        "char_end": 104,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_081_chunk00",
        "verse_key": "2:81",
        "text_ar": "«بلى» تمسكم وتخلدون فيها «من كسب سيئة» شركاً «وأحاطت به خطيئته» بالإفراد والجمع أي استولت عليه وأحدقت به من كل جانب بأن مات مشركاً «فأولئك أصحاب النار هم فيها خالدون» روعي فيه معنى من.",
        "char_start": 0,
        "char_end": 184,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_082_chunk00",
        "verse_key": "2:82",
        "text_ar": "«والذين آمنوا وعملوا الصالحات أولئك أصحاب الجنة هم فيها خالدون».",
        "char_start": 0,
        "char_end": 64,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_084_chunk00",
        "verse_key": "2:84",
        "text_ar": "«وإذ أخذنا ميثاقكم» وقلنا «لا تسفكون دماءكم» تريقونها بقتل بعضكم بعضاً «ولا تخرجون أنفسكم من دياركم» لا يخرج بعضكم بعضا من داره «ثم أقررتم» قبلتم ذلك الميثاق «وأنتم تشهدون» على أنفسكم.",
        "char_start": 0,
        "char_end": 184,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "«ثم أنتم» يا «هؤلاء تقتلون أنفسكم» بقتل بعضكم بعضا «وتخرجون فريقا منكم من ديارهم تَظَّاهَرُونَ» فيه إدغام التاء في الأصل في الظاء، وفي قراءة بالتخفيف على حذفها تتعاونون «عليهم بالإثم» بالمعصية «والعدوان» الظلم «وإن يأتوكم أسارى» وفي قراءة أسرى «تَفْدُوهُمْ» وفي قراءة «تُفَادُوهُمْ» تنقذوهم من الأسر بالمال أو غيره وهو مما عهد إليهم «وهو» أي الشأن «محرَّم عليكم إخراجهم» متصل بقوله وتخرجون والجملة بينهما اعتراض: أي كما حرم ترك الفداء، وكانت قريظةُ حالفوا الأوسَ، والنضيرُ الخزرجَ فكان كل فريق يقاتل ",
        "char_start": 0,
        "char_end": 954,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "«وقالت اليهود ليست النصارى على شئ» معتد به وكفرت بعيسى «وقالت النصارى ليست اليهود على شئ» معتد به وكفرت بموسى «وهم» أي الفريقان «يتلون الكتاب» المنزل عليهم، وفي كتاب اليهود تصديق عيسى، وفي كتاب النصارى تصديق موسى والجملة حال «كذلك» كما قال هؤلاء «قال الذين لا يعلمون» أي المشركون من العرب وغيرهم «مثل قولهم» بيان لمعنى ذلك: أي قالوا لكل ذي دين ليسوا على شئ «فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون» من أمر الدين فيدخل المحقُّ الجنة والمبطل النار.",
        "char_start": 0,
        "char_end": 458,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "«الذين آتيناهم الكتاب» مبتدأً «يتلونه حق تلاوته» أي يقرؤونه كما أنزل والجملة حال وحق نصب على المصدر والخبر «أولئك يؤمنون به» نزلت في جماعة قدموا من الحبشة وأسلموا «ومن يكفر به» أي بالكتاب المؤتى بأن يحرفه «فأولئك هم الخاسرون» لمصيرهم إلى النار المؤبدة عليهم.",
        "char_start": 0,
        "char_end": 258,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "«قل» لهم «أتحاجوننا» تخاصموننا «في الله» أن اصطفى نبيا من العرب «وهو ربنا وربكم» فله أن يصطفي من عباده ما يشاء «ولنا أعمالنا» نجازى بها «ولكم أعمالكم» تجازون بها فلا يبعد أن يكون في أعمالنا ما نستحق به الإكرام «ونحن له مخلصون» الدين والعمل دونكم فنحن أولى بالاصطفاء، والهمزة للإنكار والجمل الثلاث أحوال.",
        "char_start": 0,
        "char_end": 303,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_150_chunk00",
        "verse_key": "2:150",
        "text_ar": "«ومن حيث خرجت فولِّ وجهك شطر المسجد الحرام وحيثما كنتم فولوا وجوهكم شطره» كرره للتأكيد «لئلا يكون للناس» اليهود أو المشركين «عليكم حجة» أي مجادلة في التولي إلى غيره أي لتنتفي مجادلتهم لكم من قول اليهود يجحد ديننا ويتبع قبلتنا وقول المشركين يدعي ملة إبراهيم ويخالف قبلته «إلا الذين ظلموا منهم» بالعناد فإنهم يقولون ما تحول إليها إلا ميلا إلى دين آبائه والاستثناء متصل والمعنى: لا يكون لأحد عليكم كلام إلا كلام هؤلاء «فلا تخشوهم» تخافوا جدالهم في التولي إليها «واخشوني» بامتثال أمري «ولأتم» عطف علي لئل",
        "char_start": 0,
        "char_end": 571,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_187_chunk00",
        "verse_key": "2:187",
        "text_ar": "«أُحلَّ لكم ليلة الصيام الرفث» بمعنى الإفضاء «إلى نسائكم» بالجماع، نزل نسخا لما كان في صدر الإسلام على تحريمه وتحريم الأكل والشرب بعد العشاء «هن لباس لكم وأنتم لباس لهن» كناية عن تعانقهما أو احتياج كل منهما إلى صاحبه «علم الله أنكم كنتم تختانون» تخونون «أنفسكم» بالجماع ليلة الصيام وقع ذلك لعمر وغيره واعتذروا إلى النبي صلى الله عليه وسلم «فتاب عليكم» قبل توبتكم «وعفا عنكم فالآن» إذ أحل لكم «باشروهن» جامعوهن «وابتغوا» اطلبوا «ما كتب الله لكم» أي أباحه من الجماع أو قدره من الولد «وكلوا واشربوا» الل",
        "char_start": 0,
        "char_end": 1096,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_212_chunk00",
        "verse_key": "2:212",
        "text_ar": "«زُيِّن للَّذين كفروا» من أهل مكة «الحياة الدنيا» بالتمويه فأحبوها «و» هم «يسخرون من الذين آمنوا» لفقرهم كبلال وعمَّار وصهيب أي يستهزءون بهم ويتعالوْن عليهم بالمال «والذين اتقوا» الشرك وهم هؤلاء «فوقهم يوم القيامة والله يرزق من يشاء بغير حساب» أي رزقا واسعا في الآخرة أو الدنيا بأن يملك المسخور منهم أموال الساخرين ورقابهم.",
        "char_start": 0,
        "char_end": 323,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "وأرسل النبي صلى الله عليه وسلم أول سراياه وعليها عبد الله بن جحش فقاتلوا المشركين وقتلوا ابن الحضرمي آخر يوم من جمادى الآخرة والتبس عليهم برجب فعيرهم الكفار باستحلاله فنزل: «يسألونك عن الشهر الحرام» المحرم «قتال فيه» بدل اشتمال «قل» لهم «قتال فيه كبير» عظيم وزرا مبتدأ وخبر «وصد» مبتدأ منع للناس «عن سبيل الله» دينه «وكفر به» بالله «و» صد عن «المسجد الحرام» أي مكة «وإخراج أهله منه» وهم النبي صلى الله عليه وسلم والمؤمنون وخبر المبتدأ «أكبر» أعظم وزرا «عند الله» من القتال فيه «والفتنة» الشرك منكم «أ",
        "char_start": 0,
        "char_end": 879,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_220_chunk00",
        "verse_key": "2:220",
        "text_ar": "«في» أمر «الدنيا والآخرة» فتأخذون بالأصلح لكم فيهما «ويسألونك عن اليتامى» وما يلقونه من الحرج في شأنهم فإن واكلوهم يأثموا وإن عزلوا ما لهم من أموالهم وصنعوا لهم طعاما وحدهم فحرج «قل إصلاح لهم» في أموالهم بتنميتها ومداخلتكم «خير» من ترك ذلك «وإن تخالطوهم» أي تخلطوا نفقتكم بنفقتهم «فإخوانكم» أي فهم إخوانكم في الدين ومن شأن الأخ أن يخالط أخاه أي فلكم ذلك «والله يعلم المفسد» لأموالهم بمخالطته «من المصلح» بها فيجازي كلا منهما «ولو شاء الله لأعنتكم» لضيق عليكم بتحريم المخالطة «أن الله عزيز» غالب على أ",
        "char_start": 0,
        "char_end": 519,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_257_chunk00",
        "verse_key": "2:257",
        "text_ar": "«الله ولي» ناصر «الذين آمنوا يخرجهم من الظلمات» الكفر «إلى النور» الإيمان «والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات» ذكر الإخراج إما في مقابلة قوله يخرجهم من الظلمات أو في كل من آمن بالنبي قبل بعثته من اليهود ثم كفر به «أولئك أصحاب النار هم فيها خالدون».",
        "char_start": 0,
        "char_end": 273,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_275_chunk00",
        "verse_key": "2:275",
        "text_ar": "«الذين يأكلون الربا» أي ياخذونه وهو الزيادة في المعاملة بالنقود والمطعومات في القدر أو الأجل «لا يقومون» من قبورهم «إلا» قياما «كما يقوم الذي يتخبطه» يصرعه «الشيطان من المس» الجنون، متعلق بيقومون «ذلك» الذي نزل بهم «بأنهم» بسبب أنهم «قالوا إنما البيع مثل الربا» في الجواز وهذا من عكس التشبيه مبالغة فقال تعالى ردا عليهم: «وأحل الله البيع وحرم الربا فمن جاءه» بلغه «موعظة» وعظ «من ربِّه فانتهى» عن أكله «فله ما سلف» قبل النهي أي لا يسترد منه «وأمره» في العفو عنه «إلى الله ومن عاد» إلى أكله مشبها له ب",
        "char_start": 0,
        "char_end": 552,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_007_chunk00",
        "verse_key": "3:7",
        "text_ar": "(هو الذي أنزل عليك الكتاب منه آيات محكمات) واضحات الدلالة (هن أم الكتاب) أصله المعتمد عليه في الأحكام (و أخر متشابهات) لا تفهم معانيها كأوائل السور وجعله كله محكما في قوله \"\" أحكمت آياته \"\" بمعنى أنه ليس فيه عيب، ومتشابهًا في قوله (كتابا متشابهًا) بمعنى أنه يشبه بعضه بعضا في الحسن والصدق (فأما الذين في قلوبهم زيغ) ميل عن الحق (فيتبعون ما تشابه منه ابتغاء) طلب (الفتنة) لجهالهم بوقوعهم في الشبهات واللبس (وابتغاء تأويله) تفسيره (وما يعلم تأويله) تفسيره (إلا الله) وحده (والراسخون) الثابتون المتمكنون",
        "char_start": 0,
        "char_end": 735,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_044_chunk00",
        "verse_key": "3:44",
        "text_ar": "«ذلك» المذكور من أمر زكريا ومريم «من أنباء الغيب» أخبار ما غاب عنك «نوحيه إليك» يا محمد «وما كنت لديهم إذ يُلْقُون أقلامهم» في الماء يقترعون ليطهر لهم «أيهم يكْفُلُ» يربي «مريم وما كنت لديهم إذ يختصون» في كفالتها فتعرف ذلك فتخبر به وإنما عرفته من جهة الوحي.",
        "char_start": 0,
        "char_end": 257,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_009_chunk00",
        "verse_key": "2:9",
        "text_ar": "يعتقدون بجهلهم أنهم يخادعون الله والذين آمنوا بإظهارهم الإيمان وإضمارهم الكفر، وما يخدعون إلا أنفسهم; لأن عاقبة خداعهم تعود عليهم. ومِن فرط جهلهم لا يُحِسُّون بذلك; لفساد قلوبهم.",
        "char_start": 0,
        "char_end": 178,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "واخبر -ايها الرسول- اهل الايمان والعمل الصالح خبرًا يملوهم سرورًا، بان لهم في الاخره حدايق عجيبه، تجري الانهار تحت قصورها العاليه واشجارها الظليله. كلَّما رزقهم الله فيها نوعًا من الفاكهه اللذيذه قالوا: قد رَزَقَنا الله هذا النوع من قبل، فاذا ذاقوه وجدوه شييًا جديدًا في طعمه ولذته، وان تشابه مع سابقه في اللون والمنظر والاسم. ولهم في الجنَّات زوجات مطهَّرات من كل الوان الدنس الحسيِّ كالبول والحيض، والمعنوي كالكذب وسوء الخُلُق. وهم في الجنه ونعيمها دايمون، لا يموتون فيها ولا يخرجون منها.",
        "char_start": 0,
        "char_end": 490,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_027_chunk00",
        "verse_key": "2:27",
        "text_ar": "الذين ينكثون عهد الله الذي أخذه عليهم بالتوحيد والطاعة، وقد أكَّده بإرسال الرسل، وإنزال الكتب، ويخالفون دين الله كقطع الأرحام ونشر الفساد في الأرض، أولئك هم الخاسرون في الدنيا والآخرة.",
        "char_start": 0,
        "char_end": 184,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_039_chunk00",
        "verse_key": "2:39",
        "text_ar": "والذين جحدوا وكذبوا بآياتنا المتلوة ودلائل توحيدنا، أولئك الذين يلازمون النار، هم فيها خالدون، لا يخرجون منها.",
        "char_start": 0,
        "char_end": 110,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_081_chunk00",
        "verse_key": "2:81",
        "text_ar": "فحُكْمُ الله ثابت: ان من ارتكب الاثام حتي جَرَّته الي الكفر، واستولت عليه ذنوبه مِن جميع جوانبه -وهذا لا يكون الا فيمن اشرك بالله- فاوليك هم المشركون والكفار هم الذين يلازمون نار جهنم ملازمه دايمهً لا تنقطع.",
        "char_start": 0,
        "char_end": 207,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_082_chunk00",
        "verse_key": "2:82",
        "text_ar": "وحكم الله الثابتُ في مقابل هذا: انَّ الذين صدَّقوا بالله ورسله تصديقًا خالصًا، وعملوا الاعمال المتفقه مع شريعه الله التي اوحاها الي رسله، هولاء يلازمون الجنه في الاخره ملازمهً دايمهً لا تنقطع.",
        "char_start": 0,
        "char_end": 192,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_084_chunk00",
        "verse_key": "2:84",
        "text_ar": "واذكروا -يا بني اسراييل- حين اَخَذْنا عليكم عهدًا موكدًا في التوراه: يحرم سفك بعضكم دم بعض، واخراج بعضكم بعضًا من دياركم، ثم اعترفتم بذلك، وانتم تشهدون علي صحته.",
        "char_start": 0,
        "char_end": 161,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "ثم أنتم يا هؤلاء يقتل بعضكم بعضًا، ويُخرج بعضكم بعضًا من ديارهم، ويَتَقَوَّى كل فريق منكم على إخوانه بالأعداء بغيًا وعدوانًا. وأن يأتوكم أسارى في يد الأعداء سعيتم في تحريرهم من الأسر، بدفع الفدية، مع أنه محرم عليكم إخراجهم من ديارهم. ما أقبح ما تفعلون حين تؤمنون ببعض أحكام التوراة وتكفرون ببعضها! فليس جزاء مَن يفعل ذلك منكم إلا ذُلا وفضيحة في الدنيا. ويوم القيامة يردُّهم الله إلى أفظع العذاب في النار. وما الله بغافل عما تعملون.",
        "char_start": 0,
        "char_end": 431,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "وقالت اليهود: ليست النصاري علي شيء من الدين الصحيح، وكذلك قالت النصاري في اليهود وهم يقروون التوراه والانجيل، وفيهما وجوب الايمان بالانبياء جميعًا. كذلك قال الذين لا يعلمون من مشركي العرب وغيرهم مثل قولهم، اي قالوا لكل ذي دين: لستَ علي شيء، فالله يفصل بينهم يوم القيامه فيما اختلفوا فيه مِن امر الدين، ويجازي كلا بعمله.",
        "char_start": 0,
        "char_end": 319,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "الذين أعطيناهم الكتاب من اليهود والنصارى، يقرؤونه القراءة الصحيحة، ويتبعونه حق الاتباع، ويؤمنون بما جاء فيه من الإيمان برسل الله، ومنهم خاتمهم نبينا ورسولنا محمد صلى الله عليه وسلم، ولا يحرفون ولا يبدِّلون ما جاء فيه. هؤلاء هم الذين يؤمنون بالنبي محمد صلى الله عليه وسلم وبما أنزل عليه، وأما الذين بدَّلوا بعض الكتاب وكتموا بعضه، فهؤلاء كفار بنبي الله محمد صلى الله عليه وسلم وبما أنزل عليه، ومن يكفر به فأولئك هم أشد الناس خسرانًا عند الله.",
        "char_start": 0,
        "char_end": 441,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "قل -أيها الرسول لأهل الكتاب-: أتجادلوننا في توحيد الله والإخلاص له، وهو رب العالمين جميعًا، لا يختص بقوم دون قوم، ولنا أعمالنا ولكم أعمالكم، ونحن لله مخلصو العبادة والطَّاعة لا نشرك به شيئًا، ولا نعبد أحدًا غيره؟",
        "char_start": 0,
        "char_end": 212,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_150_chunk00",
        "verse_key": "2:150",
        "text_ar": "ومن أى مكان خرجت -أيها النبي- فتوجَّه إلى المسجد الحرام، وحيثما كنتم -أيها المسلمون-، بأي قُطْرٍ من أقطار الأرض فولُّوا وجوهكم نحو المسجد الحرام; لكي لا يكون للناس المخالفين لكم احتجاج عليكم بالمخاصمة والمجادلة، بعد هذا التوجه إليه، إلا أهل الظلم والعناد منهم، فسيظلُّون على جدالهم، فلا تخافوهم وخافوني بامتثال أمري، واجتناب نهيي; ولكي أتم نعمتي عليكم باختيار أكمل الشرائع لكم، ولعلكم تهتدون إلى الحق والصواب.",
        "char_start": 0,
        "char_end": 409,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_187_chunk00",
        "verse_key": "2:187",
        "text_ar": "اباح الله لكم في ليالي شهر رمضان جماعَ نسايكم، هنَّ ستر وحفظ لكم، وانتم ستر وحفظ لهن. علم الله انكم كنتم تخونون انفسكم; بمخالفه ما حرَّمه الله عليكم من مجامعه النساء بعد العشاء في ليالي الصيام -وكان ذلك في اول الاسلام-، فتاب الله عليكم ووسَّع لكم في الامر، فالان جامعوهن، واطلبوا ما قدَّره الله لكم من الاولاد، وكلوا واشربوا حتي يتبَيَّن ضياء الصباح من سواد الليل، بظهور الفجر الصادق، ثم اتموا الصيام بالامساك عن المفطرات الي دخول الليل بغروب الشمس. ولا تجامعوا نساءكم او تتعاطوا ما يفضي الي جماعهن ا",
        "char_start": 0,
        "char_end": 793,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_212_chunk00",
        "verse_key": "2:212",
        "text_ar": "حُسِّن للذين جحدوا وحدانية الله الحياةُ الدنيا وما فيها من الشهوات والملذات، وهم يستهزئون بالمؤمنين. وهؤلاء الذين يخشون ربهم فوق جميع الكفار يوم القيامة; حيث يدخلهم الله أعلى درجات الجنة، وينزل الكافرين أسفل دركات النار. والله يرزق مَن يشاء مِن خلقه بغير حساب.",
        "char_start": 0,
        "char_end": 260,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "يسالك المشركون -ايها الرسول- عن الشهر الحرام: هل يحل فيه القتال؟ قل لهم: القتال في الشهر الحرام عظيم عند الله استحلاله وسفك الدماء فيه، ومَنْعكم الناس من دخول الاسلام بالتعذيب والتخويف، وجحودكم بالله وبرسوله وبدينه، ومَنْع المسلمين من دخول المسجد الحرام، واخراج النبي والمهاجرين منه وهم اهله واولياوه، ذلك اكبر ذنبًا، واعظم جرمًا عند الله من القتال في الشهر الحرام. والشرك الذي انتم فيه اكبر واشد من القتل في الشهر الحرام. وهولاء الكفار لم يرتدعوا عن جرايمهم، بل هم مستمرون عليها، ولا يزالون يقاتلونك",
        "char_start": 0,
        "char_end": 698,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_220_chunk00",
        "verse_key": "2:220",
        "text_ar": "ويسالونك -ايها النبي- عن اليتامي الذين مات اباوهم وهم دون سن البلوغ كيف يتصرفون معهم في معاشهم واموالهم؟ قل لهم: اصلاحكم لهم خير، فافعلوا الانفع لهم دايمًا، وان تخالطوهم في ساير شوون المعاش فهم اخوانكم في الدين. وعلي الاخ ان يرعي مصلحه اخيه. والله يعلم المضيع لاموال اليتامي من الحريص علي اصلاحها. ولو شاء الله لضيَّق وشقَّ عليكم بتحريم الخالطه. ان الله عزيز في ملكه، حكيم في خلقه وتدبيره وتشريعه.",
        "char_start": 0,
        "char_end": 397,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_257_chunk00",
        "verse_key": "2:257",
        "text_ar": "الله يتولى المؤمنين بنصره وتوفيقه وحفظه، يخرجهم من ظلمات الكفر، إلى نور الإيمان. والذين كفروا أنصارهم وأولياؤهم الأنداد والأوثان الذين يعبدونهم من دون الله، يُخرجونهم من نور الإيمان إلى ظلمات الكفر، أولئك أصحاب النار الملازمون لها، هم فيها باقون بقاء أبديًا لا يخرجون منها.",
        "char_start": 0,
        "char_end": 273,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_275_chunk00",
        "verse_key": "2:275",
        "text_ar": "الذين يتعاملون بالربا -وهو الزياده علي راس المال- لا يقومون في الاخره من قبورهم الا كما يقوم الذي يتخبطه الشيطان من الجنون; ذلك لانهم قالوا: انما البيع مثل الربا، في ان كلا منهما حلال، ويودي الي زياده المال، فاكذبهم الله، وبيَّن انه احل البيع وحرَّم الربا; لما في البيع والشراء من نفع للافراد والجماعات، ولما في الربا من استغلال وضياع وهلاك. فمن بلغه نهي الله عن الربا فارتدع، فله ما مضي قبل ان يبلغه التحريم لا اثم عليه فيه، وامره الي الله فيما يستقبل من زمانه، فان استمرَّ علي توبته فالله لا يضيع ا",
        "char_start": 0,
        "char_end": 674,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_007_chunk00",
        "verse_key": "3:7",
        "text_ar": "هو وحده الذي انزل عليك القران: منه ايات واضحات الدلاله، هن اصل الكتاب الذي يُرجع اليه عند الاشتباه، ويُرَدُّ ما خالفه اليه، ومنه ايات اخر متشابهات تحتمل بعض المعاني، لا يتعيَّن المراد منها الا بضمها الي المحكم، فاصحاب القلوب المريضه الزايغه، لسوء قصدهم يتبعون هذه الايات المتشابهات وحدها; ليثيروا الشبهات عند الناس، كي يضلوهم، ولتاويلهم لها علي مذاهبهم الباطله. ولا يعلم حقيقه معاني هذه الايات الا الله. والمتمكنون في العلم يقولون: امنا بهذا القران، كله قد جاءنا من عند ربنا علي لسان رسوله محمد صلي ا",
        "char_start": 0,
        "char_end": 612,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_044_chunk00",
        "verse_key": "3:44",
        "text_ar": "ذلك الذي قصصناه عليك -أيها الرسول- من أخبار الغيب التي أوحاها الله إليك، إذ لم تكن معهم حين اختلفوا في كفالة مريم أيُّهم أحق بها وأولى، ووقع بينهم الخصام، فأجْرَوْا القرعة بإلقاء أقلامهم، فأصابت زكريا عليه السلام، ففاز بكفالتها.",
        "char_start": 0,
        "char_end": 228,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_009_chunk00",
        "verse_key": "2:9",
        "text_ar": "قوله تعالى : يخادعون الله والذين آمنوا وما يخدعون إلا أنفسهم وما يشعرونقال علماؤنا : معنى يخادعون الله أي يخادعونه عند أنفسهم وعلى ظنهم . وقيل : قال ذلك لعملهم عمل المخادع . وقيل : في الكلام حذف ، تقديره : يخادعون رسول الله صلى الله عليه وسلم ، عن الحسن وغيره . وجعل خداعهم لرسوله خداعا له ، لأنه دعاهم برسالته ، وكذلك إذا خادعوا المؤمنين فقد خادعوا الله . ومخادعتهم : ما أظهروه من الإيمان خلاف ما أبطنوه من الكفر ، ليحقنوا دماءهم وأموالهم ، ويظنون أنهم قد نجوا وخدعوا ، قاله جماعة من المتأولين . وقا",
        "char_start": 0,
        "char_end": 2294,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "قوله تعالى : وبشر الذين آمنوا وعملوا الصالحات أن لهم جنات تجري من تحتها الأنهار كلما رزقوا منها من ثمرة رزقا قالوا هذا الذي رزقنا من قبل وأتوا به متشابها ولهم فيها أزواج مطهرة وهم فيها خالدون قوله تعالى : وبشر الذين آمنوا فيه ثلاث مسائل :الأولى : لما ذكر الله عز وجل جزاء الكافرين ذكر جزاء المؤمنين أيضا . والتبشير الإخبار بما يظهر أثره على البشرة - وهي ظاهر الجلد - لتغيرها بأول خبر يرد عليك ، ثم الغالب أن يستعمل في السرور مقيدا بالخير المبشر به ، وغير مقيد أيضا . ولا يستعمل في الغم والشر إلا مقيد",
        "char_start": 0,
        "char_end": 5273,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_027_chunk00",
        "verse_key": "2:27",
        "text_ar": "قوله تعالى : الذين ينقضون عهد الله من بعد ميثاقه ويقطعون ما أمر الله به أن يوصل ويفسدون في الأرض أولئك هم الخاسرونفيه سبع مسائل :الأولى : قوله تعالى : الذين في موضع نصب على النعت للفاسقين ، وإن شئت جعلته في موضع رفع على أنه خبر ابتداء محذوف ، أي هم الذين . وقد تقدم .الثانية : قوله تعالى : ينقضون النقض : إفساد ما أبرمته من بناء أو حبل أو عهد . والنقاضة ما نقض من حبل الشعر . والمناقضة في القول : أن تتكلم بما تناقض معناه . والنقيضة في الشعر : ما ينقض به . والنقض : المنقوض . واختلف الناس في تعيين هذ",
        "char_start": 0,
        "char_end": 3474,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_039_chunk00",
        "verse_key": "2:39",
        "text_ar": "قوله تعالى : والذين كفروا وكذبوا بآياتنا أولئك أصحاب النار هم فيها خالدون قوله تعالى : والذين كفروا أي أشركوا ، لقوله : وكذبوا بآياتنا أولئك أصحاب النار هم فيها خالدون الصحبة : الاقتران بالشيء في حالة ما ، في زمان ما ، فإن كانت الملازمة والخلطة فهي كمال الصحبة ، وهكذا هي صحبة أهل النار لها ، وبهذا القول ينفك الخلاف في تسمية الصحابة رضي الله عنهم إذ مراتبهم متباينة على ما نبينه في \" براءة \" إن شاء الله وباقي ألفاظ الآية تقدم معناها والحمد لله .",
        "char_start": 0,
        "char_end": 447,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_081_chunk00",
        "verse_key": "2:81",
        "text_ar": "قوله تعالى : بلى من كسب سيئة وأحاطت به خطيئته فأولئك أصحاب النار هم فيها خالدون والذين آمنوا وعملوا الصالحات أولئك أصحاب الجنة هم فيها خالدونفيه ثلاث مسائل : الأولى : قوله تعالى : بلى أي ليس الأمر كما ذكرتم . قال سيبويه : ليس \" بلى \" و \" نعم \" اسمين . وإنما هما حرفان مثل \" بل \" وغيره ، وهي رد لقولهم : لن تمسنا النار . وقال الكوفيون : أصلها بل التي للإضراب عن الأول ، زيدت عليها الياء ليحسن الوقف ، وضمنت الياء معنى الإيجاب والإنعام . ف \" بل \" تدل على رد الجحد ، والياء تدل على الإيجاب لما بعد . قال",
        "char_start": 0,
        "char_end": 1610,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_082_chunk00",
        "verse_key": "2:82",
        "text_ar": "فسرت هذه الآية في موضع قبل هذا.",
        "char_start": 0,
        "char_end": 31,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_084_chunk00",
        "verse_key": "2:84",
        "text_ar": "قوله تعالى : وإذ أخذنا ميثاقكم لا تسفكون دماءكم ولا تخرجون أنفسكم من دياركم ثم أقررتم وأنتم تشهدونفيه مسألتان : الأولى : قوله تعالى : وإذ أخذنا ميثاقكم تقدم القول فيه . لا تسفكون دماءكم المراد بنو إسرائيل ، ودخل فيه بالمعنى من بعدهم . لا تسفكون مثل لا تعبدون في الإعراب . وقرأ طلحة بن مصرف وشعيب بن أبي حمزة بضم الفاء ، وهي لغة ، وأبو نهيك \" تسفكون \" بضم التاء وتشديد الفاء وفتح السين . والسفك : الصب .ولا تخرجون معطوف . أنفسكم النفس مأخوذة من النفاسة ، فنفس الإنسان أشرف ما فيه .والدار : المنزل الذي",
        "char_start": 0,
        "char_end": 2421,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "قوله تعالى : ثم أنتم هؤلاء تقتلون أنفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالإثم والعدوان وإن يأتوكم أسارى تفادوهم وهو محرم عليكم إخراجهم أفتؤمنون ببعض الكتاب وتكفرون ببعض فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا ويوم القيامة يردون إلى أشد العذاب وما الله بغافل عما تعملون أولئك الذين اشتروا الحياة الدنيا بالآخرة فلا يخفف عنهم العذاب ولا هم ينصرونقوله تعالى : ثم أنتم هؤلاء أنتم في موضع رفع بالابتداء ، ولا يعرب ; لأنه مضمر . وضمت التاء من أنتم لأنها كانت مفتوحة إذا خاطبت واحدا ",
        "char_start": 0,
        "char_end": 5797,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "قوله تعالى : وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون [ ص: 73 ] معناه ادعى كل فريق منهم أن صاحبه ليس على شيء ، وأنه أحق برحمة الله منه . وهم يتلون الكتاب يعني التوراة والإنجيل ، والجملة في موضع الحال .كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون والمراد ب الذين لا يعلمون في قول الجمهور : كفار العرب ; لأنهم لا كتاب لهم . وقال ",
        "char_start": 0,
        "char_end": 767,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "قوله تعالى : الذين آتيناهم الكتاب يتلونه حق تلاوته أولئك يؤمنون به ومن يكفر به فأولئك هم الخاسرونقوله تعالى : الذين آتيناهم الكتاب قال قتادة : هم أصحاب النبي صلى الله عليه وسلم ، والكتاب على هذا التأويل القرآن . وقال ابن زيد : هم من أسلم من بني إسرائيل . والكتاب على هذا التأويل : التوراة ، والآية تعم . والذين رفع بالابتداء ، آتيناهم صلته ، يتلونه خبر الابتداء ، وإن شئت كان الخبر أولئك يؤمنون به .[ ص: 92 ] واختلف في معنى يتلونه حق تلاوته فقيل : يتبعونه حق اتباعه ، باتباع الأمر والنهي ، فيحللون حل",
        "char_start": 0,
        "char_end": 1429,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "قوله تعالى : قل أتحاجوننا في الله وهو ربنا وربكم ولنا أعمالنا ولكم أعمالكم ونحن له مخلصونقال الحسن : كانت المحاجة أن قالوا : نحن أولى بالله منكم ; لأنا أبناء الله وأحباؤه . وقيل : لتقدم آبائنا وكتبنا ; ولأنا لم نعبد الأوثان . فمعنى الآية : قل لهم يا محمد ، أي قل لهؤلاء اليهود والنصارى الذين زعموا أنهم أبناء الله وأحباؤه وادعوا أنهم أولى بالله منكم لقدم آبائهم وكتبهم : أتحاجوننا أي أتجاذبوننا الحجة على دعواكم والرب واحد ، وكل مجازى بعمله ، فأي تأثير لقدم الدين . ومعنى في الله أي في دينه والقرب من",
        "char_start": 0,
        "char_end": 1710,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_150_chunk00",
        "verse_key": "2:150",
        "text_ar": "قوله تعالى : لئلا يكون للناس عليكم حجة إلا الذين ظلموا منهم قال مجاهد : هم مشركو العرب . وحجتهم قولهم : راجعت قبلتنا ، وقد أجيبوا عن هذا بقوله : قل لله المشرق والمغرب . وقيل : معنى لئلا يكون للناس عليكم حجة لئلا يقولوا لكم : قد أمرتم باستقبال الكعبة ولستم ترونها ، فلما قال عز وجل : وحيثما كنتم فولوا وجوهكم شطره زال هذا . وقال أبو عبيدة : إن \" إلا \" ها هنا بمعنى الواو ، أي والذين ظلموا ، فهو استثناء بمعنى الواو ، ومنه قول الشاعر [ هو الفرزدق ] :ما بالمدينة دار غير واحدة دار الخليفة إلا دار مروانا",
        "char_start": 0,
        "char_end": 2807,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_187_chunk00",
        "verse_key": "2:187",
        "text_ar": "قوله تعالى : أحل لكم ليلة الصيام الرفث إلى نسائكم هن لباس لكم وأنتم لباس لهن علم الله أنكم كنتم تختانون أنفسكم فتاب عليكم وعفا عنكم فالآن باشروهن وابتغوا ما كتب الله لكم وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود من الفجر ثم أتموا الصيام إلى الليل ولا تباشروهن وأنتم عاكفون في المساجد تلك حدود الله فلا تقربوها كذلك يبين الله آياته للناس لعلهم يتقونفيه ست وثلاثون مسألة :الأولى : قوله تعالى : أحل لكم لفظ أحل يقتضي أنه كان محرما قبل ذلك ثم نسخ . روى أبو داود عن ابن أبي ليلى قال وحدثنا ",
        "char_start": 0,
        "char_end": 36977,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_212_chunk00",
        "verse_key": "2:212",
        "text_ar": "قوله تعالى : زين للذين كفروا الحياة الدنيا ويسخرون من الذين آمنوا والذين اتقوا فوقهم يوم القيامة والله يرزق من يشاء بغير حسابقوله تعالى : زين للذين كفروا الحياة الدنيا على ما لم يسم فاعله . والمراد رؤساء قريش . وقرأ مجاهد وحميد بن قيس على بناء الفاعل . قال النحاس : وهي قراءة شاذة ؛ لأنه لم يتقدم للفاعل ذكر . وقرأ ابن أبي عبلة : \" زينت \" بإظهار العلامة ، وجاز ذلك لكون التأنيث غير حقيقي ، والمزين هو خالقها ومخترعها وخالق الكفر ، ويزينها أيضا الشيطان بوسوسته وإغوائه . وخص الذين كفروا بالذكر لقبولهم",
        "char_start": 0,
        "char_end": 3046,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير وصد عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر عند الله والفتنة أكبر من القتل ولا يزالون يقاتلونكم حتى يردوكم عن دينكم إن استطاعوا ومن يرتدد منكم عن دينه فيمت وهو كافر فأولئك حبطت أعمالهم في الدنيا والآخرة وأولئك أصحاب النار هم فيها خالدونفيه احدى عشرة مسألة :الأولى : قوله تعالى : \" يسألونك \" تقدم القول فيه . وروى جرير بن عبد الحميد [ ص: 39 ] ومحمد بن فضيل عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس قال : ( ما رأيت قوما خيرا من أص",
        "char_start": 0,
        "char_end": 15485,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_220_chunk00",
        "verse_key": "2:220",
        "text_ar": "قوله تعالى : في الدنيا والآخرة ويسألونك عن اليتامى قل إصلاح لهم خير وإن تخالطوهم فإخوانكم والله يعلم المفسد من المصلح ولو شاء الله لأعنتكم إن الله عزيز حكيمقوله تعالى : \" ويسألونك عن اليتامى \" إلى قوله \" حكيم \" فيه ثمان مسائل :الأولى : روى أبو داود والنسائي عن ابن عباس قال : ( لما أنزل الله تعالى : ولا تقربوا مال اليتيم إلا بالتي هي أحسن و إن الذين يأكلون أموال اليتامى ظلما الآية ، انطلق من كان عنده يتيم فعزل طعامه من طعامه وشرابه من شرابه فجعل يفضل من طعامه فيحبس له ، حتى يأكله أو يفسد ، فاشتد ",
        "char_start": 0,
        "char_end": 6845,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_257_chunk00",
        "verse_key": "2:257",
        "text_ar": "قوله تعالى : الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور والذين كفروا أولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات أولئك أصحاب النار هم فيها خالدونقوله تعالى : الله ولي الذين آمنوا الولي فعيل بمعنى فاعل . قال الخطابي : الولي الناصر ينصر عباده المؤمنين ، قال الله عز وجل : الله ولي الذين آمنوا يخرجهم من الظلمات إلى النور ، وقال ذلك بأن الله مولى الذين آمنوا وأن الكافرين لا مولى لهم ، قال قتادة : الظلمات الضلالة ، والنور الهدى ، وبمعناه قال الضحاك والربيع . وقال مجاهد وعبدة بن أبي لبابة : قو",
        "char_start": 0,
        "char_end": 1107,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_275_chunk00",
        "verse_key": "2:275",
        "text_ar": "الذين يأكلون الربا لا يقومون إلا كما يقوم الذي يتخبطه الشيطان من المس ذلك بأنهم قالوا إنما البيع مثل الربا وأحل الله البيع وحرم الربا فمن جاءه موعظة من ربه فانتهى فله ما سلف وأمره إلى الله ومن عاد فأولئك أصحاب النار هم فيها خالدون يمحق الله الربا ويربي الصدقات والله لا يحب كل كفار أثيم إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون يا أيها الذين آمنوا اتقوا الله وذروا ما بقي من الربا إن كنتم مؤمنين فإن لم تفعلوا فأذنوا بحرب من الله ورسول",
        "char_start": 0,
        "char_end": 23834,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_007_chunk00",
        "verse_key": "3:7",
        "text_ar": "قوله : هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات هو الذي يصوركم في الأرحام كيف يشاء لا إله إلا هو العزيز الحكيمفيه تسع مسائل :الأولى : خرج مسلم عن عائشة - رضي الله عنها - قالت : تلا رسول الله - صلى الله عليه وسلم - هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات فأما الذين في قلوبهم زيغ فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله وما يعلم تأويله إلا الله والراسخون في العلم يقولون آمنا به كل من عند ربنا وما يذكر إلا أولو الألباب قالت : قال رسول ",
        "char_start": 0,
        "char_end": 17450,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_044_chunk00",
        "verse_key": "3:44",
        "text_ar": "قوله تعالى : ذلك من أنباء الغيب نوحيه إليك وما كنت لديهم إذ يلقون أقلامهم أيهم يكفل مريم وما كنت لديهم إذ يختصمون[ ص: 81 ] فيه أربع مسائل :الأولى : قوله تعالى : ذلك من أنباء الغيب أي الذي ذكرنا من حديث زكريا ويحيى ومريم عليهم السلام من أخبار الغيب . نوحيه إليك فيه دلالة على نبوة محمد - صلى الله عليه وسلم - حيث أخبر عن قصة زكريا ومريم ولم يكن قرأ الكتب ; وأخبر عن ذلك وصدقه أهل الكتاب بذلك ; فذلك قوله تعالى : نوحيه إليك فرد الكناية إلى \" ذلك \" فلذلك ذكر . والإيحاء هنا الإرسال إلى النبي - صلى الله ",
        "char_start": 0,
        "char_end": 5053,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_009_chunk00",
        "verse_key": "2:9",
        "text_ar": "وانما هذا مخادعه لله ولعباده المومنين. والمخادعه: ان يظهر المخادع لمن يخادعه شييا, ويبطن خلافه لكي يتمكن من مقصوده ممن يخادع، فهولاء المنافقون, سلكوا مع الله وعباده هذا المسلك, فعاد خداعهم علي انفسهم، فان هذا من العجايب؛ لان المخادع, اما ان ينتج خداعه ويحصل له ما يريد او يسلم, لا له ولا عليه، وهولاء عاد خداعهم عليهم, وكانهم يعملون ما يعملون من المكر لاهلاك انفسهم واضرارها وكيدها؛ لان الله تعالي لا يتضرر بخداعهم [شييا] وعباده المومنون, لا يضرهم كيدهم شييا، فلا يضر المومنين ان اظهر المنافقون الايم",
        "char_start": 0,
        "char_end": 772,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "لما ذكر جزاء الكافرين, ذكر جزاء المومنين, اهل الاعمال الصالحات, علي طريقته تعالي في القران يجمع بين الترغيب والترهيب, ليكون العبد راغبا راهبا, خايفا راجيا فقال: { وَبَشِّرِ } اي: [يا ايها الرسول ومن قام مقامه] { الَّذِينَ امَنُوا } بقلوبهم { وَعَمِلُوا الصَّالِحَاتِ } بجوارحهم, فصدقوا ايمانهم باعمالهم الصالحه. ووصفت اعمال الخير بالصالحات, لان بها تصلح احوال العبد, وامور دينه ودنياه, وحياته الدنيويه والاخرويه, ويزول بها عنه فساد الاحوال, فيكون بذلك من الصالحين, الذين يصلحون لمجاوره الرحمن في جنته",
        "char_start": 0,
        "char_end": 2524,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_027_chunk00",
        "verse_key": "2:27",
        "text_ar": "ثم وصف الفاسقين فقال: { الَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِ } وهذا يعم العهد الذي بينهم وبينه والذي بينهم وبين عباده الذي اكده عليهم بالمواثيق الثقيله والالزامات، فلا يبالون بتلك المواثيق; بل ينقضونها ويتركون اوامره ويرتكبون نواهيه; وينقضون العهود التي بينهم وبين الخلق. { وَيَقْطَعُونَ مَا اَمَرَ اللَّهُ بِهِ اَنْ يُوصَلَ } وهذا يدخل فيه اشياء كثيره، فان الله امرنا ان نصل ما بيننا وبينه بالايمان به والقيام بعبوديته، وما بيننا وبين رسوله بالايمان به ومحبته وتعزيره والقيام ",
        "char_start": 0,
        "char_end": 1325,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_039_chunk00",
        "verse_key": "2:39",
        "text_ar": "{ اوليك اصحاب النار } اي: الملازمون لها, ملازمه الصاحب لصاحبه, والغريم لغريمه، { هُمْ فِيهَا خَالِدُونَ } لا يخرجون منها، ولا يفتر عنهم العذاب ولا هم ينصرون. وفي هذه الايات وما اشبهها, انقسام الخلق من الجن والانس, الي اهل السعاده, واهل الشقاوه, وفيها صفات الفريقين والاعمال الموجبه لذلك، وان الجن كالانس في الثواب والعقاب, كما انهم مثلهم, في الامر والنهي.",
        "char_start": 0,
        "char_end": 355,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_081_chunk00",
        "verse_key": "2:81",
        "text_ar": "ثم ذكر تعالي حكما عاما لكل احد, يدخل به بنو اسراييل وغيرهم, وهو الحكم الذي لا حكم غيره, لا امانيهم ودعاويهم بصفه الهالكين والناجين، فقال: { بَلَي } اي: ليس الامر كما ذكرتم, فانه قول لا حقيقه له، ولكن { مَنْ كَسَبَ سَيِّيَهً } وهو نكره في سياق الشرط, فيعم الشرك فما دونه، والمراد به هنا الشرك, بدليل قوله: { وَاَحَاطَتْ بِهِ خَطِييَتُهُ } اي: احاطت بعاملها, فلم تدع له منفذا, وهذا لا يكون الا الشرك, فان من معه الايمان لا تحيط به خطييته. { فَاُولَيِكَ اَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ } وقد ا",
        "char_start": 0,
        "char_end": 674,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_082_chunk00",
        "verse_key": "2:82",
        "text_ar": "{ وَالَّذِينَ امَنُوا } بالله وملايكته, وكتبه, ورسله, واليوم الاخر، { وَعَمِلُوا الصَّالِحَاتِ } ولا تكون الاعمال صالحه الا بشرطين: ان تكون خالصه لوجه الله, متبعا بها سنه رسوله. فحاصل هاتين الايتين, ان اهل النجاه والفوز, هم اهل الايمان والعمل الصالح، والهالكون اهل النار المشركون بالله, الكافرون به.",
        "char_start": 0,
        "char_end": 299,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_084_chunk00",
        "verse_key": "2:84",
        "text_ar": "تفسير الايات من 84 ال 85 وهذا الفعل المذكور في هذه الايه, فعل للذين كانوا في زمن الوحي بالمدينه، وذلك ان الاوس والخزرج - وهم الانصار - كانوا قبل مبعث النبي صلي الله عليه وسلم مشركين, وكانوا يقتتلون علي عاده الجاهليه، فنزلت عليهم الفرق الثلاث من فرق اليهود, بنو قريظه, وبنو النضير, وبنو قينقاع، فكل فرقه منهم حالفت فرقه من اهل المدينه. فكانوا اذا اقتتلوا اعان اليهودي حليفه علي مقاتليه الذين تعينهم الفرقه الاخري من اليهود, فيقتل اليهودي اليهودي, ويخرجه من دياره اذا حصل جلاء ونهب، ثم اذا وضعت الحرب ا",
        "char_start": 0,
        "char_end": 1250,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "تفسير الايات من 84 ال 85 وهذا الفعل المذكور في هذه الايه, فعل للذين كانوا في زمن الوحي بالمدينه، وذلك ان الاوس والخزرج - وهم الانصار - كانوا قبل مبعث النبي صلي الله عليه وسلم مشركين, وكانوا يقتتلون علي عاده الجاهليه، فنزلت عليهم الفرق الثلاث من فرق اليهود, بنو قريظه, وبنو النضير, وبنو قينقاع، فكل فرقه منهم حالفت فرقه من اهل المدينه. فكانوا اذا اقتتلوا اعان اليهودي حليفه علي مقاتليه الذين تعينهم الفرقه الاخري من اليهود, فيقتل اليهودي اليهودي, ويخرجه من دياره اذا حصل جلاء ونهب، ثم اذا وضعت الحرب ا",
        "char_start": 0,
        "char_end": 1250,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "وذلك أنه بلغ بأهل الكتاب الهوى والحسد, إلى أن بعضهم ضلل بعضا, وكفر بعضهم بعضا, كما فعل الأميون من مشركي العرب وغيرهم. فكل فرقة تضلل الفرقة الأخرى, ويحكم الله في الآخرة بين المختلفين بحكمه العدل, الذي أخبر به عباده, فإنه لا فوز ولا نجاة إلا لمن صدق جميع الأنبياء والمرسلين, وامتثل أوامر ربه, واجتنب نواهيه, ومن عداهم, فهو هالك.",
        "char_start": 0,
        "char_end": 326,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "يخبر تعالي ان الذين اتاهم الكتاب, ومنَّ عليهم به منه مطلقه, انهم { يَتْلُونَهُ حَقَّ تِلَاوَتِهِ } اي: يتبعونه حق اتباعه, والتلاوه: الاتباع، فيحلون حلاله, ويحرمون حرامه, ويعملون بمحكمه, ويومنون بمتشابهه، وهولاء هم السعداء من اهل الكتاب, الذين عرفوا نعمه الله وشكروها, وامنوا بكل الرسل, ولم يفرقوا بين احد منهم. فهولاء, هم المومنون حقا, لا من قال منهم: { نومن بما انزل علينا ويكفرون بما وراءه } ولهذا توعدهم بقوله { وَمَنْ يَكْفُرْ بِهِ فَاُولَيِكَ هُمُ الْخَاسِرُونَ } وقد تقدم تفسير الايه التي بعدها",
        "char_start": 0,
        "char_end": 501,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "المحاجه هي: المجادله بين اثنين فاكثر, تتعلق بالمسايل الخلافيه, حتي يكون كل من الخصمين يريد نصره قوله, وابطال قول خصمه، فكل واحد منهما, يجتهد في اقامه الحجه علي ذلك، والمطلوب منها, ان تكون بالتي هي احسن, باقرب طريق يرد الضال الي الحق, ويقيم الحجه علي المعاند, ويوضح الحق, ويبين الباطل، فان خرجت عن هذه الامور, كانت مماراه, ومخاصمه لا خير فيها, واحدثت من الشر ما احدثت، فكان اهل الكتاب, يزعمون انهم اولي بالله من المسلمين, وهذا مجرد دعوي, تفتقر الي برهان ودليل. فاذا كان رب الجميع واحداً, ليس رباً لكم ",
        "char_start": 0,
        "char_end": 1094,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_150_chunk00",
        "verse_key": "2:150",
        "text_ar": "وقال هنا: { لِيَلَّا يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّهٌ } اي: شرعنا لكم استقبال الكعبه المشرفه, لينقطع عنكم احتجاج الناس من اهل الكتاب والمشركين، فانه لو بقي مستقبلا بيت المقدس, لتوجهت عليه الحجه، فانَّ اهل الكتاب, يجدون في كتابهم انَّ قبلته المستقره, هي الكعبه البيت الحرام، والمشركون يرون انَّ من مفاخرهم, هذا البيت العظيم, وانه من مله ابراهيم, وانه اذا لم يستقبله محمد صلي الله عليه وسلم, توجهت نحوه حججهم, وقالوا: كيف يدعي انه علي مله ابراهيم, وهو من ذريته, وقد ترك استقبال قبلته؟ فباستقبال الك",
        "char_start": 0,
        "char_end": 3122,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_187_chunk00",
        "verse_key": "2:187",
        "text_ar": "كان في اول فرض الصيام، يحرم علي المسلمين في الليل بعد النوم الاكل والشرب والجماع، فحصلت المشقه لبعضهم، فخفف الله تعالي عنهم ذلك، واباح في ليالي الصيام كلها الاكل والشرب والجماع، سواء نام او لم ينم، لكونهم يختانون انفسهم بترك بعض ما امروا به. { فتاب } الله { عليكم } بان وسع لكم امرا كان - لولا توسعته - موجبا للاثم { وعفا عنكم } ما سلف من التخون. { فالان } بعد هذه الرخصه والسعه من الله { باشروهن } وطاً وقبلهً ولمساً وغير ذلك. { وابتغوا ما كتب الله لكم } اي: انووا في مباشرتكم لزوجاتكم التقرب الي ال",
        "char_start": 0,
        "char_end": 2488,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_212_chunk00",
        "verse_key": "2:212",
        "text_ar": "وهذا فيه من الوعيد الشديد والتهديد ما تنخلع له القلوب، يقول تعالي: هل ينتظر الساعون في الفساد في الارض, المتبعون لخطوات الشيطان, النابذون لامر الله الا يوم الجزاء بالاعمال, الذي قد حشي من الاهوال والشدايد والفظايع, ما يقلقل قلوب الظالمين, ويحق به الجزاء السيي علي المفسدين. وذلك ان الله تعالي يطوي السماوات والارض, وتنثر الكواكب, وتكور الشمس والقمر, وتنزل الملايكه الكرام, فتحيط بالخلايق, وينزل الباري [تبارك] تعالي: { فِي ظُلَلٍ مِنَ الْغَمَامِ } ليفصل بين عباده بالقضاء العدل. فتوضع الموازين, وتنشر",
        "char_start": 0,
        "char_end": 2519,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "الجمهور علي ان تحريم القتال في الاشهر الحرم, منسوخ بالامر بقتال المشركين حيثما وجدوا، وقال بعض المفسرين: انه لم ينسخ, لان المطلق محمول علي المقيد، وهذه الايه مقيده لعموم الامر بالقتال مطلقا؛ ولان من جمله مزيه الاشهر الحرم، بل اكبر مزاياها, تحريم القتال فيها, وهذا انما هو في قتال الابتداء، واما قتال الدفع فانه يجوز في الاشهر الحرم, كما يجوز في البلد الحرام. ولما كانت هذه الايه نازله بسبب ما حصل, لسريه عبد الله بن جحش, وقتلهم عمرو بن الحَضْرَمِيِّ, واخذهم اموالهم, وكان ذلك - علي ما قيل - في شهر رج",
        "char_start": 0,
        "char_end": 2664,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_220_chunk00",
        "verse_key": "2:220",
        "text_ar": "لما نزل قوله تعالي: { اِنَّ الَّذِينَ يَاْكُلُونَ اَمْوَالَ الْيَتَامَي ظُلْمًا اِنَّمَا يَاْكُلُونَ فِي بُطُونِهِمْ نَارًا وَسَيَصْلَوْنَ سَعِيرًا } شق ذلك علي المسلمين, وعزلوا طعامهم عن طعام اليتامي, خوفا علي انفسهم من تناولها, ولو في هذه الحاله التي جرت العاده بالمشاركه فيها, وسالوا النبي صلي الله عليه وسلم عن ذلك، فاخبرهم تعالي ان المقصود, اصلاح اموال اليتامي, بحفظها وصيانتها, والاتجار فيها وان خلطتهم اياهم في طعام او غيره جايز علي وجه لا يضر باليتامي, لانهم اخوانكم, ومن شان الاخ مخالطه اخيه",
        "char_start": 0,
        "char_end": 1477,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_257_chunk00",
        "verse_key": "2:257",
        "text_ar": "ثم ذكر السبب الذي اوصلهم الي ذلك فقال: { الله ولي الذين امنوا } وهذا يشمل ولايتهم لربهم، بان تولوه فلا يبغون عنه بدلا ولا يشركون به احدا، قد اتخذوه حبيبا ووليا، ووالوا اولياءه وعادوا اعداءه، فتولاهم بلطفه ومنَّ عليهم باحسانه، فاخرجهم من ظلمات الكفر والمعاصي والجهل الي نور الايمان والطاعه والعلم، وكان جزاوهم علي هذا ان سلمهم من ظلمات القبر والحشر والقيامه الي النعيم المقيم والراحه والفسحه والسرور { والذين كفروا اولياوهم الطاغوت } فتولوا الشيطان وحزبه، واتخذوه من دون الله وليا ووالوه وتركوا ولايه ",
        "char_start": 0,
        "char_end": 836,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_275_chunk00",
        "verse_key": "2:275",
        "text_ar": "يخبر تعالي عن اكله الربا وسوء مالهم وشده منقلبهم، انهم لا يقومون من قبورهم ليوم نشورهم { الا كما يقوم الذي يتخبطه الشيطان من المس } اي: يصرعه الشيطان بالجنون، فيقومون من قبورهم حياري سكاري مضطربين، متوقعين لعظيم النكال وعسر الوبال، فكما تقلبت عقولهم و { قالوا انما البيع مثل الربا } وهذا لا يكون الا من جاهل عظيم جهله، او متجاهل عظيم عناده، جازاهم الله من جنس احوالهم فصارت احوالهم احوال المجانين، ويحتمل ان يكون قوله: { لا يقومون الا كما يقوم الذي يتخبطه الشيطان من المس } انه لما انسلبت عقولهم في ط",
        "char_start": 0,
        "char_end": 2022,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_007_chunk00",
        "verse_key": "3:7",
        "text_ar": "القران العظيم كله محكم كما قال تعالي { كتاب احكمت اياته ثم فصلت من لدن حكيم خبير } فهو مشتمل علي غايه الاتقان والاحكام والعدل والاحسان { ومن احسن من الله حكما لقوم يوقنون } وكله متشابه في الحسن والبلاغه وتصديق بعضه لبعضه ومطابقته لفظا ومعني، واما الاحكام والتشابه المذكور في هذه الايه فان القران كما ذكره الله { منه ايات محكمات } اي: واضحات الدلاله، ليس فيها شبهه ولا اشكال { هن ام الكتاب } اي: اصله الذي يرجع اليه كل متشابه، وهي معظمه واكثره، { و } منه ايات { اخر متشابهات } اي: يلتبس معناها علي كثي",
        "char_start": 0,
        "char_end": 3210,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_044_chunk00",
        "verse_key": "3:44",
        "text_ar": "، ولما اخبر الله نبيه بما اخبر به عن مريم، وكيف تنقلت بها الاحوال التي قيضها الله لها، وكان هذا من الامور الغيبيه التي لا تعلم الا بالوحي. قال { ذلك من انباء الغيب نوحيه اليك وما كنت لديهم } اي: عندهم { اذ يلقون اقلامهم ايهم يكفل مريم } لما ذهبت بها امها الي من لهم الامر علي بيت المقدس، فتشاحوا وتخاصموا ايهم يكفل مريم، واقترعوا عليها بان القوا اقلامهم في النهر، فايهم لم يجرِ قلمه مع الماء فله كفالتها، فوقع ذلك لزكريا نبيهم وافضلهم، فلما اَخْبَرتَهُم يا محمد بهذه الاخبار التي لا علم لك ولا لقومك ",
        "char_start": 0,
        "char_end": 650,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_009_chunk00",
        "verse_key": "2:9",
        "text_ar": "القول في تاويل جل ثناوه: يُخَادِعُونَ اللَّهَ وَالَّذِينَ امَنُواقال ابو جعفر: وخداعُ المنافق ربَّه والمومنينَ، اظهارُه بلسانه من القول والتصديق، خلافَ الذي في قلبه من الشكّ والتكذيب، ليدْرَا عن نفسه، بما اظهر بلسانه، حكمَ الله عز وجلّ - اللازمَ مَن كان بمثل حاله من التكذيب، لو لم يُظْهِرْ بلسانه ما اظهرَ من التصديق والاقرار - من القَتْل والسِّباء. فذلك خِداعُه ربَّه واهلَ الايمان بالله.فان قال قايل: وكيف يكون المنافق لله وللمومنين مُخادِعًا، وهو لا يظهر بلسانه خلافَ ما هو له معتقدٌ الا تَقِيَّه",
        "char_start": 0,
        "char_end": 10004,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_025_chunk00",
        "verse_key": "2:25",
        "text_ar": "القول في تاويل قوله : وَبَشِّرِ الَّذِينَ امَنُوا وَعَمِلُوا الصَّالِحَاتِ اَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الاَنْهَارُقال ابو جعفر: اما قوله تعالي: \" وبشِّر \"، فانه يعني: اخبرهم. والبشاره اصلها الخبرُ بما يُسَرُّ به المخبَرُ, اذا كان سابقًا به كل مخبِرٍ سواه.وهذا امر من الله تعالي نبيَّه محمدًا صلي الله عليه وسلم بابلاغ بشارته خلقَه الذين امنوا به وبمحمد صلي الله عليه وسلم وبما جاء به من عند ربه, وصدّقوا ايمانهم ذلك واقرَارهم باعمالهم الصالحه, فقال له: يا محمد، بشِّرْ من صدَّقك انك ",
        "char_start": 0,
        "char_end": 22375,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_027_chunk00",
        "verse_key": "2:27",
        "text_ar": "القول في تاويل قوله : الَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِقال ابو جعفر: وهذا وصف من الله جل ذكره الفاسقين الذين اخبر انه لا يُضلّ بالمثَل الذي ضربه لاهل النفاق غيرَهم, فقال: وما يُضِلّ الله بالمثل الذي يضربه - علي ما وصف قبلُ في الايات المتقدمه - الا الفاسقين الذين ينقُضُون عهد الله من بعد ميثاقه.ثم اختلف اهل المعرفه في معني العهد الذي وصف الله هولاء الفاسقين بنقضه:-فقال بعضهم: هو وصيه الله الي خلقه, وامره اياهم بما امرهم به من طاعته, ونهيه اياهم عما نهاهم عنه من معصيته، ف",
        "char_start": 0,
        "char_end": 11743,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_039_chunk00",
        "verse_key": "2:39",
        "text_ar": "وقوله : وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِايَاتِنَا اُولَيِكَ اَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ (39)يعني: والذين جَحدوا اياتي وكذّبوا رسلي. وايات الله: حُجَجه وادلتُه علي وحدانيّته وربوبيّته، وما جاءت به الرُّسُل من الاعلام والشواهد علي ذلك، وعلي صدقها فيما انباتْ عن ربّها. وقد بيّنا ان معني الكفر، التغطيهُ علي الشيء (14) .\" اوليك اصحاب النار \"، يعني: اهلُها الذين هم اهلها دون غيرهم، المخلدون فيها ابدًا الي غير امَدٍ ولا نهايه. كما:-797- حدثنا به عُقبه بن سنان البصري، قال: حدثنا غَسان ب",
        "char_start": 0,
        "char_end": 2446,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_081_chunk00",
        "verse_key": "2:81",
        "text_ar": "القول في تاويل قوله تعالي : بَلَي مَنْ كَسَبَ سَيِّيَهًقال ابو جعفر: وقوله: (بلي من كسب سييه) تكذيب من الله القايلين من اليهود: لَنْ تَمَسَّنَا النَّارُ اِلا اَيَّامًا مَعْدُودَهً واخبار منه لهم انه معذب من اشرك ومن كفر به وبرسله، واحاطت به ذنوبه، فمخلده في النار، (39) فان الجنه لا يسكنها الا اهل الايمان به وبرسوله, واهل الطاعه له, والقايمون بحدوده كما:-1420 - حدثنا محمد بن حميد قال، حدثنا سلمه قال، حدثني محمد بن اسحاق قال، حدثني محمد بن ابي محمد, عن سعيد بن جبير او عكرمه, عن ابن عباس: (بلي من ك",
        "char_start": 0,
        "char_end": 8729,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_082_chunk00",
        "verse_key": "2:82",
        "text_ar": "القول في تاويل قوله تعالي : وَالَّذِينَ امَنُوا وَعَمِلُوا الصَّالِحَاتِ اُولَيِكَ اَصْحَابُ الْجَنَّهِ هُمْ فِيهَا خَالِدُونَ (82)قال ابو جعفر: ويعني بقوله: (والذين امنوا)، اي صدقوا بما جاء به محمد صلي الله عليه وسلم. ويعني بقوله: (وعملوا الصالحات)، اطاعوا الله فاقاموا حدوده, وادوا فرايضه, واجتنبوا محارمه. ويعني بقوله: (فاوليك)، فالذين هم كذلك (اصحاب الجنه هم فيها خالدون)، يعني اهلها الذين هم اهلها هم فيها(خالدون)، مقيمون ابدا.* * *وانما هذه الايه والتي قبلها اخبار من الله عباده عن بقاء النار و",
        "char_start": 0,
        "char_end": 1370,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_084_chunk00",
        "verse_key": "2:84",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذْ اَخَذْنَا مِيثَاقَكُمْ لا تَسْفِكُونَ دِمَاءَكُمْ وَلا تُخْرِجُونَ اَنْفُسَكُمْ مِنْ دِيَارِكُمْقال ابو جعفر: قوله: (واذ اخذنا ميثاقكم لا تسفكون دماءكم) في المعني والاعراب نظير قوله: وَاِذْ اَخَذْنَا مِيثَاقَ بَنِي اِسْرَايِيلَ لا تَعْبُدُونَ اِلا اللَّهَ .* * *&; 2-300 &;واما \" سفك الدم \", فانه صبه واراقته.* * *فان قال قايل: وما معني قوله: (لا تسفكون دماءكم ولا تخرجون انفسكم من دياركم)؟ وقال: او كان القوم يقتلون انفسهم ويخرجونها من ديارها, فنهوا عن ذلك؟ قيل: ل",
        "char_start": 0,
        "char_end": 5413,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "القول في تاويل قوله تعالي : ثُمَّ اَنْتُمْ هَوُلاءِ تَقْتُلُونَ اَنْفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِنْكُمْ مِنْ دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِمْ بِالاِثْمِ وَالْعُدْوَانِقال ابو جعفر: ويتجه في قوله: (ثم انتم هولاء) وجهان. احدهما ان يكون اريد به: ثم انتم يا هولاء, فترك \" يا \" استغناء بدلاله الكلام عليه, كما قال: يُوسُفُ اَعْرِضْ عَنْ هَذَا [ يوسف: 29]، وتاويله: يا يوسف اعرض عن هذا. فيكون معني الكلام حينيذ: ثم انتم يا معشر يهود بني اسراييل - بعد اقراركم بالميثاق الذي اخذته عليكم: لا تسفكون دم",
        "char_start": 0,
        "char_end": 18866,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "القول في تاويل قوله تعالي : وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَي عَلَي شَيْءٍ وَقَالَتِ النَّصَارَي لَيْسَتِ الْيَهُودُ عَلَي شَيْءٍ وَهُمْ يَتْلُونَ الْكِتَابَقال ابو جعفر: ذكر ان هذه الايه نـزلت في قوم من اهل الكتابين تنازعوا عند رسول الله صلي الله عليه وسلم ، فقال بعضهم لبعض.* ذكر من قال ذلك:1811- حدثنا ابن حميد قال، حدثنا سلمه ، وحدثنا ابو كريب قال، حدثنا يونس بن بكير ، قالا جميعا- حدثنا محمد بن اسحاق قال، حدثني محمد بن ابي محمد مولي زيد بن ثابت قال، حدثني سعيد بن جبير او عكرمه ، عن ابن",
        "char_start": 0,
        "char_end": 7315,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "القول في تاويل قوله تعالي : الَّذِينَ اتَيْنَاهُمُ الْكِتَابَقال ابو جعفر: اختلف اهل التاويل في الذين عناهم الله جل ثناوه بقوله: (الذين اتيناهم الكتاب) فقال بعضهم: هم المومنون برسول الله صلي الله عليه وسلم ، وبما جاء به من اصحابه.*ذكر من قال ذلك:1878- حدثنا بشر بن معاذ قال، حدثنا يزيد بن زريع ، عن سعيد ، عن قتاده قوله: (الذين اتيناهم الكتاب) ، هولاء اصحاب نبي الله صلي الله عليه وسلم ، امنوا بكتاب الله وصدقوا به.* * *وقال اخرون: بل عني الله بذلك علماء بني اسراييل ، الذين امنوا بالله وصدقوا رسله، ",
        "char_start": 0,
        "char_end": 11965,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_139_chunk00",
        "verse_key": "2:139",
        "text_ar": "القول في تاويل قوله تعالي : قُلْ اَتُحَاجُّونَنَا فِي اللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَا اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْ وَنَحْنُ لَهُ مُخْلِصُونَ (139)قال ابو جعفر: يعني تعالي ذكره بقوله: \" قُلْ اتُحاجُّونَنا في الله \"، قل يا محمد = لمعاشر اليهود والنصاري، الذين قالوا لك ولاصحابك: كُونُوا هُودًا اَوْ نَصَارَي تَهْتَدُوا , وزعموا ان دينهم خيرٌ من دينكم, وكتابهم خير من كتابكم، لانه كان قبلَ كتابكم, وزعموا انهم من اجل ذلك اولي بالله منكم = : \" اتحاجوننا في الله وهو رَبنا وربكم \", بيده",
        "char_start": 0,
        "char_end": 2260,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_150_chunk00",
        "verse_key": "2:150",
        "text_ar": "القول في تاويل قوله تعالي ذكره وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَيْثُمَا كُنْتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُقال ابو جعفر: يعني بقوله تعالي ذكره: \" ومن حَيثُ خرجت فول وَجهك شطر المسجد الحرام \": من ايّ مكان وبُقعه شَخصتَ فخرجت يا محمد, فولِّ وجهك تلقاء المسجد الحرام، وهو شَطره.ويعني بقوله: \" وحيث ما كنتم فولُّوا وُجوهكم \"، واينما كنتم ايها المومنون من ارض الله، فولُّوا وجوهكم في صلاتكم تُجاهه وقِبَله وقَصْدَه. (27)القول في تاويل قوله تعالي : لِيَلا يَكُو",
        "char_start": 0,
        "char_end": 13881,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_187_chunk00",
        "verse_key": "2:187",
        "text_ar": "احل لكم ليله الصيام الرفث الي نسايكمالقول في تاويل قوله تعالي : { احل لكم ليله الصيام الرفث الي نسايكم } يعني تعالي ذكره بقوله : { احل لكم } اطلق لكم وابيح . ويعني بقوله : { ليله الصيام } في ليله الصيام . فاما الرفث فانه كنايه عن الجماع في هذا الموضع , يقال : هو الرفث والرفوث . وقد روي انها في قراءه عبد الله : { واحل لكم ليله الصيام الرفوث الي نسايكم } وبمثل الذي قلنا في تاويل الرفث قال اهل التاويل . ذكر من قال ذلك : 2396 - حدثني محمد بن عبد الله بن عبد الحكم المصري , قال : ثنا ايوب بن سويد , عن",
        "char_start": 0,
        "char_end": 38435,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_212_chunk00",
        "verse_key": "2:212",
        "text_ar": "القول في تاويل قوله تعالي : زُيِّنَ لِلَّذِينَ كَفَرُوا الْحَيَاهُ الدُّنْيَا وَيَسْخَرُونَ مِنَ الَّذِينَ امَنُوا وَالَّذِينَ اتَّقَوْا فَوْقَهُمْ يَوْمَ الْقِيَامَهِقال ابو جعفر: يعني جل ثناوه بذلك: زيِّن للذين كفروا حبُّ الحياه الدنيا العاجله اللذات، (4) فهم يبتغون فيها المكاثره والمفاخره، ويطلبون فيها الرياسات والمباهاه، ويستكبرون عن اتباعك يا محمد، والاقرار بما جيت به من عندي، تعظُّمًا منهم علي من صدَّقك واتبعك، ويسخرون بمن تبعك من اهل، الايمان، والتصديق بك، في تركهم المكاثره، والمفاخره بال",
        "char_start": 0,
        "char_end": 2468,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "القول في تاويل قوله تعالي : يَسْاَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ قُلْ قِتَالٌ فِيهِ كَبِيرٌ وَصَدٌّ عَنْ سَبِيلِ اللَّهِ وَكُفْرٌ بِهِ وَالْمَسْجِدِ الْحَرَامِ وَاِخْرَاجُ اَهْلِهِ مِنْهُ اَكْبَرُ عِنْدَ اللَّهِ وَالْفِتْنَهُ اَكْبَرُ مِنَ الْقَتْلِقال ابو جعفر: يعني بذلك جل ثناوه: يسالك يا محمد اصحابُك عن الشهر الحرام = وذلك رَجبٌ = عن قتالٍ فيه.&; 4-300 &;وخفضُ\" القتال \" علي معني تكرير \" عن \" عليه، وكذلك كانت قراءهُ عبد الله بن مسعود فيما ذكر لنا. وقد:-4080 - حدثت عن عمار بن ا",
        "char_start": 0,
        "char_end": 26980,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_220_chunk00",
        "verse_key": "2:220",
        "text_ar": "القول في تاويل قوله عز ذكره : وَيَسْاَلُونَكَ عَنِ الْيَتَامَي قُلْ اِصْلاحٌ لَهُمْ خَيْرٌ وَاِنْ تُخَالِطُوهُمْ فَاِخْوَانُكُمْاختلف اهل التاويل فيمَ نـزلت هذه الايه. (1)فقال بعضهم: نـزلت [ في الذين عزلوا اموال اليتامي الذين كانوا عندهم، وكرهوا ان يخالطوهم في ماكل او في غيره، وذلك حين نـزلت وَلا تَقْرَبُوا مَالَ الْيَتِيمِ اِلا بِالَّتِي هِيَ اَحْسَنُ [ سوره الانعام: 152]، وقوله: اِنَّ الَّذِينَ يَاْكُلُونَ اَمْوَالَ الْيَتَامَي ظُلْمًا [ سوره النساء : 10 ] .* ذكر من قال ذلك] : (2)4182 - حدثنا ",
        "char_start": 0,
        "char_end": 18389,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_257_chunk00",
        "verse_key": "2:257",
        "text_ar": "القول في تاويل قوله : اللَّهُ وَلِيُّ الَّذِينَ امَنُوا يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ اِلَي النُّورِ وَالَّذِينَ كَفَرُوا اَوْلِيَاوُهُمُ الطَّاغُوتُ يُخْرِجُونَهُمْ مِنَ النُّورِ اِلَي الظُّلُمَاتِقال ابو جعفر: يعني تعالي ذكره بقوله: \" الله ولي الذين امنوا \"، نصيرهم وظهيرهم، يتولاهم بعونه وتوفيقه= (1) \" يخرجهم من الظلمات \" يعني بذلك: (2) .يخرجهم من ظلمات الكفر الي نور الايمان. وانما عني ب \" الظلمات \" في هذا الموضع، الكفر. وانما جعل \" الظلمات \" للكفر مثلا لان الظلمات حاجبه للابصار عن ادراك الاش",
        "char_start": 0,
        "char_end": 7841,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_275_chunk00",
        "verse_key": "2:275",
        "text_ar": "القول في تاويل قوله تعالي : الَّذِينَ يَاْكُلُونَ الرِّبَا لا يَقُومُونَ اِلا كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنَ الْمَسِّقال ابو جعفر: يعني بذلك جل ثناوه: الذين يُرْبون.* * *و \" الارباء \" الزياده علي الشيء، يقال منه: \" ارْبي فلان علي فلان \"، اذا زاد عليه،\" يربي ارباءً\"، والزياده هي\" الربا \"،\" وربا الشيء \"، اذا زاد علي ما كان عليه فعظم،\" فهو يَرْبو رَبْوًا \". وانما قيل للرابيه [رابيه]، (1) لزيادتها في العظم والاشراف علي ما استوي من الارض مما حولها، من قولهم: \" ربا يربو \". ومن ذ",
        "char_start": 0,
        "char_end": 12114,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_007_chunk00",
        "verse_key": "3:7",
        "text_ar": "هو الذي انزل عليك الكتابالقول في تاويل قوله تعالي : { هو الذي انزل عليك الكتاب } يعني بقوله جل ثناوه : { هو الذي انزل عليك الكتاب } ان الله الذي لا يخفي عليه شيء في الارض ولا في السماء , { هو الذي انزل عليك الكتاب } يعني بالكتاب : القران . وقد اتينا علي البيان فيما مضي عن السبب الذي من اجله سمي القران كتابا بما اغني عن اعادته في هذا الموضع .منه ايات محكمات هن ام الكتاب واخر متشابهاتواما قوله : { منه ايات محكمات } فانه يعني من الكتاب ايات , يعني بالايات ايات القران . واما المحكمات : فانهن اللواتي",
        "char_start": 0,
        "char_end": 36882,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_044_chunk00",
        "verse_key": "3:44",
        "text_ar": "القول في تاويل قوله : ذَلِكَ مِنْ اَنْبَاءِ الْغَيْبِ نُوحِيهِ اِلَيْكَقال ابو جعفر: يعني جل ثناوه بقوله ذلك: الاخبارَ التي اخبرَ بها عبادَه عن امراه عمران وابنتها مريم، وزكريا وابنه يحيي، وساير ما قصَّ في الايات من قوله: اِنَّ اللَّهَ اصْطَفَي ادَمَ وَنُوحًا ، ثم جمعَ جميعَ ذلك تعالي ذكره بقوله: \" ذلك \"، فقال: هذه الانباء من \" انباء الغيب \"، اي: من اخبار الغيب.ويعني ب \" الغيب \"، انها من خفيّ اخبار القوم التي لم تطَّلع انت، يا محمد، عليها ولا قومك، ولم يعلمها الا قليلٌ من احبار اهل الكتابين ورهب",
        "char_start": 0,
        "char_end": 8512,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [],
  "incoming_edges": [],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [],
    "internal_external": {
      "value": "ظاهر",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_EXTERNAL_BEH_SOC_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 50,
    "quran_direct_count": 0,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 0,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.764,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.469233Z",
  "schema_version": "1.0.0"
}