{
  "behavior_id": "BEH_EMO_FEAR_ALLAH",
  "label_ar": "الخشية",
  "label_en": "Fear of Allah",
  "category": "emotional",
  "roots": [
    "خ-ش-ي",
    "خ-و-ف"
  ],
  "stems": [],
  "synonyms_ar": [
    "الخوف",
    "خوف الله",
    "خوف",
    "يخشون",
    "يخافون",
    "خائفين"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:38",
      "text_ar": "قُلْنَا ٱهْبِطُوا۟ مِنْهَا جَمِيعًا ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى فَمَن تَبِعَ هُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:62",
      "text_ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلنَّصَـٰرَىٰ وَٱلصَّـٰبِـِٔينَ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَعَمِلَ صَـٰلِحًا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:74",
      "text_ar": "ثُمَّ قَسَتْ قُلُوبُكُم مِّنۢ بَعْدِ ذَٰلِكَ فَهِىَ كَٱلْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةً ۚ وَإِنَّ مِنَ ٱلْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ ٱلْأَنْهَـٰرُ ۚ وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ ٱلْمَآءُ ۚ وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ ٱللَّهِ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:112",
      "text_ar": "بَلَىٰ مَنْ أَسْلَمَ وَجْهَهُۥ لِلَّهِ وَهُوَ مُحْسِنٌ فَلَهُۥٓ أَجْرُهُۥ عِندَ رَبِّهِۦ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:155",
      "text_ar": "وَلَنَبْلُوَنَّكُم بِشَىْءٍ مِّنَ ٱلْخَوْفِ وَٱلْجُوعِ وَنَقْصٍ مِّنَ ٱلْأَمْوَٰلِ وَٱلْأَنفُسِ وَٱلثَّمَرَٰتِ ۗ وَبَشِّرِ ٱلصَّـٰبِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:262",
      "text_ar": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ ثُمَّ لَا يُتْبِعُونَ مَآ أَنفَقُوا۟ مَنًّا وَلَآ أَذًى ۙ لَّهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:274",
      "text_ar": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُم بِٱلَّيْلِ وَٱلنَّهَارِ سِرًّا وَعَلَانِيَةً فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:277",
      "text_ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:170",
      "text_ar": "فَرِحِينَ بِمَآ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضْلِهِۦ وَيَسْتَبْشِرُونَ بِٱلَّذِينَ لَمْ يَلْحَقُوا۟ بِهِم مِّنْ خَلْفِهِمْ أَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:175",
      "text_ar": "إِنَّمَا ذَٰلِكُمُ ٱلشَّيْطَـٰنُ يُخَوِّفُ أَوْلِيَآءَهُۥ فَلَا تَخَافُوهُمْ وَخَافُونِ إِن كُنتُم مُّؤْمِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:25",
      "text_ar": "وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلًا أَن يَنكِحَ ٱلْمُحْصَنَـٰتِ ٱلْمُؤْمِنَـٰتِ فَمِن مَّا مَلَكَتْ أَيْمَـٰنُكُم مِّن فَتَيَـٰتِكُمُ ٱلْمُؤْمِنَـٰتِ ۚ وَٱللَّهُ أَعْلَمُ بِإِيمَـٰنِكُم ۚ بَعْضُكُم مِّنۢ بَعْضٍ ۚ فَٱنكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَءَاتُوهُنَّ أُجُورَهُنَّ بِٱلْمَعْرُوفِ مُحْصَنَـٰتٍ غَيْرَ مُسَـٰفِحَـٰتٍ وَلَا مُتَّخِذَٰتِ أَخْدَانٍ ۚ فَإِذَآ أُحْصِنَّ فَإِنْ أَتَيْنَ بِفَـٰحِشَةٍ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى ٱلْمُحْصَنَـٰتِ مِنَ ٱلْعَذَابِ ۚ ذَٰلِكَ لِمَنْ خَشِىَ ٱلْعَنَتَ مِنكُمْ ۚ وَأَن تَصْبِرُوا۟ خَيْرٌ لَّكُمْ ۗ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:77",
      "text_ar": "أَلَمْ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمْ كُفُّوٓا۟ أَيْدِيَكُمْ وَأَقِيمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ إِذَا فَرِيقٌ مِّنْهُمْ يَخْشَوْنَ ٱلنَّاسَ كَخَشْيَةِ ٱللَّهِ أَوْ أَشَدَّ خَشْيَةً ۚ وَقَالُوا۟ رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا ٱلْقِتَالَ لَوْلَآ أَخَّرْتَنَآ إِلَىٰٓ أَجَلٍ قَرِيبٍ ۗ قُلْ مَتَـٰعُ ٱلدُّنْيَا قَلِيلٌ وَٱلْـَٔاخِرَةُ خَيْرٌ لِّمَنِ ٱتَّقَىٰ وَلَا تُظْلَمُونَ فَتِيلًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:83",
      "text_ar": "وَإِذَا جَآءَهُمْ أَمْرٌ مِّنَ ٱلْأَمْنِ أَوِ ٱلْخَوْفِ أَذَاعُوا۟ بِهِۦ ۖ وَلَوْ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰٓ أُو۟لِى ٱلْأَمْرِ مِنْهُمْ لَعَلِمَهُ ٱلَّذِينَ يَسْتَنۢبِطُونَهُۥ مِنْهُمْ ۗ وَلَوْلَا فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ لَٱتَّبَعْتُمُ ٱلشَّيْطَـٰنَ إِلَّا قَلِيلًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:23",
      "text_ar": "قَالَ رَجُلَانِ مِنَ ٱلَّذِينَ يَخَافُونَ أَنْعَمَ ٱللَّهُ عَلَيْهِمَا ٱدْخُلُوا۟ عَلَيْهِمُ ٱلْبَابَ فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَـٰلِبُونَ ۚ وَعَلَى ٱللَّهِ فَتَوَكَّلُوٓا۟ إِن كُنتُم مُّؤْمِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:52",
      "text_ar": "فَتَرَى ٱلَّذِينَ فِى قُلُوبِهِم مَّرَضٌ يُسَـٰرِعُونَ فِيهِمْ يَقُولُونَ نَخْشَىٰٓ أَن تُصِيبَنَا دَآئِرَةٌ ۚ فَعَسَى ٱللَّهُ أَن يَأْتِىَ بِٱلْفَتْحِ أَوْ أَمْرٍ مِّنْ عِندِهِۦ فَيُصْبِحُوا۟ عَلَىٰ مَآ أَسَرُّوا۟ فِىٓ أَنفُسِهِمْ نَـٰدِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:54",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ مَن يَرْتَدَّ مِنكُمْ عَن دِينِهِۦ فَسَوْفَ يَأْتِى ٱللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُۥٓ أَذِلَّةٍ عَلَى ٱلْمُؤْمِنِينَ أَعِزَّةٍ عَلَى ٱلْكَـٰفِرِينَ يُجَـٰهِدُونَ فِى سَبِيلِ ٱللَّهِ وَلَا يَخَافُونَ لَوْمَةَ لَآئِمٍ ۚ ذَٰلِكَ فَضْلُ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۚ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:69",
      "text_ar": "إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَٱلَّذِينَ هَادُوا۟ وَٱلصَّـٰبِـُٔونَ وَٱلنَّصَـٰرَىٰ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَعَمِلَ صَـٰلِحًا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "6:48",
      "text_ar": "وَمَا نُرْسِلُ ٱلْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ وَمُنذِرِينَ ۖ فَمَنْ ءَامَنَ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "6:51",
      "text_ar": "وَأَنذِرْ بِهِ ٱلَّذِينَ يَخَافُونَ أَن يُحْشَرُوٓا۟ إِلَىٰ رَبِّهِمْ ۙ لَيْسَ لَهُم مِّن دُونِهِۦ وَلِىٌّ وَلَا شَفِيعٌ لَّعَلَّهُمْ يَتَّقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:35",
      "text_ar": "يَـٰبَنِىٓ ءَادَمَ إِمَّا يَأْتِيَنَّكُمْ رُسُلٌ مِّنكُمْ يَقُصُّونَ عَلَيْكُمْ ءَايَـٰتِى ۙ فَمَنِ ٱتَّقَىٰ وَأَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:49",
      "text_ar": "أَهَـٰٓؤُلَآءِ ٱلَّذِينَ أَقْسَمْتُمْ لَا يَنَالُهُمُ ٱللَّهُ بِرَحْمَةٍ ۚ ٱدْخُلُوا۟ ٱلْجَنَّةَ لَا خَوْفٌ عَلَيْكُمْ وَلَآ أَنتُمْ تَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:56",
      "text_ar": "وَلَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ بَعْدَ إِصْلَـٰحِهَا وَٱدْعُوهُ خَوْفًا وَطَمَعًا ۚ إِنَّ رَحْمَتَ ٱللَّهِ قَرِيبٌ مِّنَ ٱلْمُحْسِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:62",
      "text_ar": "أَلَآ إِنَّ أَوْلِيَآءَ ٱللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:83",
      "text_ar": "فَمَآ ءَامَنَ لِمُوسَىٰٓ إِلَّا ذُرِّيَّةٌ مِّن قَوْمِهِۦ عَلَىٰ خَوْفٍ مِّن فِرْعَوْنَ وَمَلَإِي۟هِمْ أَن يَفْتِنَهُمْ ۚ وَإِنَّ فِرْعَوْنَ لَعَالٍ فِى ٱلْأَرْضِ وَإِنَّهُۥ لَمِنَ ٱلْمُسْرِفِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "13:12",
      "text_ar": "هُوَ ٱلَّذِى يُرِيكُمُ ٱلْبَرْقَ خَوْفًا وَطَمَعًا وَيُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "13:21",
      "text_ar": "وَٱلَّذِينَ يَصِلُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوٓءَ ٱلْحِسَابِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:47",
      "text_ar": "أَوْ يَأْخُذَهُمْ عَلَىٰ تَخَوُّفٍ فَإِنَّ رَبَّكُمْ لَرَءُوفٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:50",
      "text_ar": "يَخَافُونَ رَبَّهُم مِّن فَوْقِهِمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ ۩",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:112",
      "text_ar": "وَضَرَبَ ٱللَّهُ مَثَلًا قَرْيَةً كَانَتْ ءَامِنَةً مُّطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا رَغَدًا مِّن كُلِّ مَكَانٍ فَكَفَرَتْ بِأَنْعُمِ ٱللَّهِ فَأَذَٰقَهَا ٱللَّهُ لِبَاسَ ٱلْجُوعِ وَٱلْخَوْفِ بِمَا كَانُوا۟ يَصْنَعُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "17:31",
      "text_ar": "وَلَا تَقْتُلُوٓا۟ أَوْلَـٰدَكُمْ خَشْيَةَ إِمْلَـٰقٍ ۖ نَّحْنُ نَرْزُقُهُمْ وَإِيَّاكُمْ ۚ إِنَّ قَتْلَهُمْ كَانَ خِطْـًٔا كَبِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "17:57",
      "text_ar": "أُو۟لَـٰٓئِكَ ٱلَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَىٰ رَبِّهِمُ ٱلْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ وَيَرْجُونَ رَحْمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓ ۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحْذُورًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "17:60",
      "text_ar": "وَإِذْ قُلْنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِ ۚ وَمَا جَعَلْنَا ٱلرُّءْيَا ٱلَّتِىٓ أَرَيْنَـٰكَ إِلَّا فِتْنَةً لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلْمَلْعُونَةَ فِى ٱلْقُرْءَانِ ۚ وَنُخَوِّفُهُمْ فَمَا يَزِيدُهُمْ إِلَّا طُغْيَـٰنًا كَبِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "17:100",
      "text_ar": "قُل لَّوْ أَنتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّىٓ إِذًا لَّأَمْسَكْتُمْ خَشْيَةَ ٱلْإِنفَاقِ ۚ وَكَانَ ٱلْإِنسَـٰنُ قَتُورًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "18:80",
      "text_ar": "وَأَمَّا ٱلْغُلَـٰمُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَـٰنًا وَكُفْرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "20:3",
      "text_ar": "إِلَّا تَذْكِرَةً لِّمَن يَخْشَىٰ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "20:44",
      "text_ar": "فَقُولَا لَهُۥ قَوْلًا لَّيِّنًا لَّعَلَّهُۥ يَتَذَكَّرُ أَوْ يَخْشَىٰ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "20:77",
      "text_ar": "وَلَقَدْ أَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ أَنْ أَسْرِ بِعِبَادِى فَٱضْرِبْ لَهُمْ طَرِيقًا فِى ٱلْبَحْرِ يَبَسًا لَّا تَخَـٰفُ دَرَكًا وَلَا تَخْشَىٰ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "20:94",
      "text_ar": "قَالَ يَبْنَؤُمَّ لَا تَأْخُذْ بِلِحْيَتِى وَلَا بِرَأْسِىٓ ۖ إِنِّى خَشِيتُ أَن تَقُولَ فَرَّقْتَ بَيْنَ بَنِىٓ إِسْرَٰٓءِيلَ وَلَمْ تَرْقُبْ قَوْلِى",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "21:28",
      "text_ar": "يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يَشْفَعُونَ إِلَّا لِمَنِ ٱرْتَضَىٰ وَهُم مِّنْ خَشْيَتِهِۦ مُشْفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "21:49",
      "text_ar": "ٱلَّذِينَ يَخْشَوْنَ رَبَّهُم بِٱلْغَيْبِ وَهُم مِّنَ ٱلسَّاعَةِ مُشْفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "23:57",
      "text_ar": "إِنَّ ٱلَّذِينَ هُم مِّنْ خَشْيَةِ رَبِّهِم مُّشْفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "24:37",
      "text_ar": "رِجَالٌ لَّا تُلْهِيهِمْ تِجَـٰرَةٌ وَلَا بَيْعٌ عَن ذِكْرِ ٱللَّهِ وَإِقَامِ ٱلصَّلَوٰةِ وَإِيتَآءِ ٱلزَّكَوٰةِ ۙ يَخَافُونَ يَوْمًا تَتَقَلَّبُ فِيهِ ٱلْقُلُوبُ وَٱلْأَبْصَـٰرُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "24:50",
      "text_ar": "أَفِى قُلُوبِهِم مَّرَضٌ أَمِ ٱرْتَابُوٓا۟ أَمْ يَخَافُونَ أَن يَحِيفَ ٱللَّهُ عَلَيْهِمْ وَرَسُولُهُۥ ۚ بَلْ أُو۟لَـٰٓئِكَ هُمُ ٱلظَّـٰلِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "24:55",
      "text_ar": "وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُوا۟ مِنكُمْ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ لَيَسْتَخْلِفَنَّهُمْ فِى ٱلْأَرْضِ كَمَا ٱسْتَخْلَفَ ٱلَّذِينَ مِن قَبْلِهِمْ وَلَيُمَكِّنَنَّ لَهُمْ دِينَهُمُ ٱلَّذِى ٱرْتَضَىٰ لَهُمْ وَلَيُبَدِّلَنَّهُم مِّنۢ بَعْدِ خَوْفِهِمْ أَمْنًا ۚ يَعْبُدُونَنِى لَا يُشْرِكُونَ بِى شَيْـًٔا ۚ وَمَن كَفَرَ بَعْدَ ذَٰلِكَ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْفَـٰسِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "30:24",
      "text_ar": "وَمِنْ ءَايَـٰتِهِۦ يُرِيكُمُ ٱلْبَرْقَ خَوْفًا وَطَمَعًا وَيُنَزِّلُ مِنَ ٱلسَّمَآءِ مَآءً فَيُحْىِۦ بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَآ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يَعْقِلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "32:16",
      "text_ar": "تَتَجَافَىٰ جُنُوبُهُمْ عَنِ ٱلْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "33:19",
      "text_ar": "أَشِحَّةً عَلَيْكُمْ ۖ فَإِذَا جَآءَ ٱلْخَوْفُ رَأَيْتَهُمْ يَنظُرُونَ إِلَيْكَ تَدُورُ أَعْيُنُهُمْ كَٱلَّذِى يُغْشَىٰ عَلَيْهِ مِنَ ٱلْمَوْتِ ۖ فَإِذَا ذَهَبَ ٱلْخَوْفُ سَلَقُوكُم بِأَلْسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى ٱلْخَيْرِ ۚ أُو۟لَـٰٓئِكَ لَمْ يُؤْمِنُوا۟ فَأَحْبَطَ ٱللَّهُ أَعْمَـٰلَهُمْ ۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "33:37",
      "text_ar": "وَإِذْ تَقُولُ لِلَّذِىٓ أَنْعَمَ ٱللَّهُ عَلَيْهِ وَأَنْعَمْتَ عَلَيْهِ أَمْسِكْ عَلَيْكَ زَوْجَكَ وَٱتَّقِ ٱللَّهَ وَتُخْفِى فِى نَفْسِكَ مَا ٱللَّهُ مُبْدِيهِ وَتَخْشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخْشَىٰهُ ۖ فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَـٰكَهَا لِكَىْ لَا يَكُونَ عَلَى ٱلْمُؤْمِنِينَ حَرَجٌ فِىٓ أَزْوَٰجِ أَدْعِيَآئِهِمْ إِذَا قَضَوْا۟ مِنْهُنَّ وَطَرًا ۚ وَكَانَ أَمْرُ ٱللَّهِ مَفْعُولًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "33:39",
      "text_ar": "ٱلَّذِينَ يُبَلِّغُونَ رِسَـٰلَـٰتِ ٱللَّهِ وَيَخْشَوْنَهُۥ وَلَا يَخْشَوْنَ أَحَدًا إِلَّا ٱللَّهَ ۗ وَكَفَىٰ بِٱللَّهِ حَسِيبًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "35:18",
      "text_ar": "وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۚ وَإِن تَدْعُ مُثْقَلَةٌ إِلَىٰ حِمْلِهَا لَا يُحْمَلْ مِنْهُ شَىْءٌ وَلَوْ كَانَ ذَا قُرْبَىٰٓ ۗ إِنَّمَا تُنذِرُ ٱلَّذِينَ يَخْشَوْنَ رَبَّهُم بِٱلْغَيْبِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ ۚ وَمَن تَزَكَّىٰ فَإِنَّمَا يَتَزَكَّىٰ لِنَفْسِهِۦ ۚ وَإِلَى ٱللَّهِ ٱلْمَصِيرُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "وقوله تعالى : ( قلنا اهبطوا منها جميعا ) يعني هؤلاء الأربعة . وقيل : الهبوط الأول من الجنة إلى السماء الدنيا والهبوط ( الآخر ) من السماء الدنيا إلى الأرض ( فإما يأتينكم ) أي فإن يأتكم يا ذرية آدم ( مني هدى ) أي رشد وبيان شريعة وقيل كتاب ورسول ( فمن تبع هداي فلا خوف عليهم ولا هم يحزنون ) قرأ يعقوب : فلا خوف بالفتح في كل القرآن والآخرون بالضم والتنوين فلا خوف عليهم فيما يستقبلون هم ] ( ولا هم يحزنون ) على ما خلفوا . وقيل لا خوف عليهم في الدنيا ولا هم يحزنون في الآخرة.",
        "char_start": 0,
        "char_end": 470,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "( إن الذين آمنوا والذين هادوا ) يعني اليهود سموا به لقولهم إنا هدنا إليك أي ملنا إليك وقيل لأنهم هادوا أي تابوا عن عبادة العجل وقيل لأنهم مالوا عن دين الإسلام وعن دين موسى عليه السلام وقال أبو عمرو بن العلاء : لأنهم يتهودون أي يتحركون عند قراءة التوراة ويقولون : إن السماوات والأرض تحركت حين آتى الله موسى التوراة ( والنصارى ) سموا به لقول الحواريين : نحن أنصار الله ، وقال مقاتل : لأنهم نزلوا قرية يقال لها ناصرة وقيل لاعتزائهم إلى نصرة وهي قرية كان ينزلها عيسى عليه السلام( والصابئين ) قرأ أهل المد",
        "char_start": 0,
        "char_end": 2581,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_074_chunk00",
        "verse_key": "2:74",
        "text_ar": "قوله تعالى: {ثم قست قلوبكم} يبست وجفت، جفاف القلب: خروج الرحمة واللين عنه، وقيل: غلظت، وقيل: اسودت.{من بعد ذلك} من بعد ظهور الدلالات.قال الكلبي: \"قالوا بعد ذلك: نحن لم نقتله، فلم يكونوا قط أعمى قلباً ولا أشد تكذيباً لنبيهم منهم عند ذلك\".{فهي} أي في الغلظة والشدة.{كالحجارة أو أشد قسوة} قيل: أو بمعنى بل، وقيل: بمعنى الواو كقوله تعالى: {مائة ألف أو يزيدون} [147-الصافات] أي: بل يزيدون أو ويزيدون، وإنما لم يشبهها بالحديد مع أنه أصلب من الحجارة، لأن الحديد قابل للين فإنه يلين بالنار، وقد لان لداود علي",
        "char_start": 0,
        "char_end": 3908,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "ثم قال رداً عليهم: {بلى من أسلم وجهه} أي ليس الأمر كما قالوا، بل الحكم للإسلام وإنما يدخل الجنة من أسلم وجهه{لله} أي أخلص دينه لله، وقيل: أخلص عبادته لله، وقيل: خضع وتواضع لله.وأصل الإسلام : الاستسلام والخضوع، وخص الوجه لأنه إذا جاد بوجهه في السجود لم يبخل بسائر جوارحه.{وهو محسن} في عمله، وقيل: مؤمن، وقيل: مخلص.{فله أجره عند ربه ولا خوف عليهم ولا هم يحزنون}.",
        "char_start": 0,
        "char_end": 360,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_155_chunk00",
        "verse_key": "2:155",
        "text_ar": "قوله تعالى: {ولنبلونكم} أي ولنختبرنكم يا أمة محمد، واللام لجواب القسم تقديره والله لبيلونكم والابتلاء من الله لإظهار المطيع من العاصي لا ليعلم شيئاً لم يكن عالماً به.{بشيء من الخوف} قال ابن عباس: \"يعني خوف العدو\".{والجوع} يعني القحط.{ونقص من الأموال} بالخسران والهلاك.{والأنفس} يعني بالقتل والموت وقيل بالمرض والشيب.{والثمرات} يعني الجوائح في الثمار، وحكي عن الشافعي أنه قال: \"الخوف خوف الله تعالى، والجوع صيام رمضان، ونقص من الأموال أداء الزكاة والصدقات، والأنفس الأمراض، والثمرات موت الأولاد لأن ول",
        "char_start": 0,
        "char_end": 1142,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "قوله تعالى : ( الذين ينفقون أموالهم في سبيل الله ) قال الكلبي : نزلت هذه الآية في عثمان بن عفان وعبد الرحمن بن عوف رضي الله تعالى عنهما جاء عبد الرحمن بأربعة آلاف درهم صدقة إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله كانت عندي ثمانية آلاف فأمسكت منها لنفسي وعيالي أربعة آلاف درهم وأربعة آلاف أقرضتها ربي فقال له رسول الله صلى الله عليه وسلم : بارك الله فيما أمسكت لك وفيما أعطيت وأما عثمان فجهز جيش المسلمين في غزوة تبوك بألف بعير بأقتابها وأحلاسها فنزلت فيهما هذه الآية .وقال عبد الرحمن بن ",
        "char_start": 0,
        "char_end": 1308,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "( الذين ينفقون أموالهم بالليل والنهار سرا وعلانية ) روي عن مجاهد عن ابن عباس رضي الله عنهما قال : نزلت هذه الآية في علي بن أبي طالب رضي الله عنه كانت عنده أربعة دراهم لا يملك غيرها فتصدق بدرهم ليلا وبدرهم نهارا وبدرهم سرا وبدرهم علانية .وعن الضحاك عن ابن عباس رضي الله عنهم قال لما نزلت ( للفقراء الذين أحصروا في سبيل الله ) بعث عبد الرحمن بن عوف بدنانير كثيرة إلى أصحاب الصفة ، وبعث علي بن أبي طالب رضي الله عنه في جوف الليل بوسق من تمر فأنزل الله تعالى فيهما ( الذين ينفقون أموالهم بالليل والنهار )",
        "char_start": 0,
        "char_end": 1293,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "\" إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون \".",
        "char_start": 0,
        "char_end": 110,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "( فرحين بما آتاهم الله من فضله ) رزقه وثوابه ، ( ويستبشرون ) ويفرحون ( بالذين لم يلحقوا بهم من خلفهم ) من إخوانهم الذين تركوهم أحياء في الدنيا على مناهج الإيمان والجهاد لعلمهم أنهم إذا استشهدوا ولحقوا بهم ونالوا من الكرامة ما نالوا فهم لذلك مستبشرون ، ( ألا خوف عليهم ولا هم يحزنون ) .",
        "char_start": 0,
        "char_end": 285,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_175_chunk00",
        "verse_key": "3:175",
        "text_ar": "قوله تعالى : ( إنما ذلكم الشيطان ) يعني : ذلك الذي قال لكم : ( إن الناس قد جمعوا لكم فاخشوهم ) من فعل الشيطان ألقى في أفواههم ليرهبوهم ويجبنوا عنهم ، ( يخوف أولياءه ) أي يخوفكم بأوليائه ، وكذلك هو في قراءة أبي بن كعب يعني : يخوف المؤمنين بالكافرين قال السدي : يعظم أولياءه في صدورهم ليخافوهم يدل عليه قراءة عبد الله بن مسعود \" يخوفكم أولياءه \" ( فلا تخافوهم وخافون ) في ترك أمري ( إن كنتم مؤمنين ) مصدقين بوعدي فإني متكفل لكم بالنصرة والظفر .",
        "char_start": 0,
        "char_end": 442,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_025_chunk00",
        "verse_key": "4:25",
        "text_ar": "قوله تعالى : ( ومن لم يستطع منكم طولا ) أي : فضلا وسعة ، ( أن ينكح المحصنات ) الحرائر ( المؤمنات ) قرأ الكسائي ( المحصنات ) بكسر الصاد حيث كان ، إلا قوله في هذه السورة والمحصنات من النساء ، وقرأ الآخرون بفتح جميعها ، ( فمن ما ملكت أيمانكم من فتياتكم ) إمائكم ، ( المؤمنات ) أي : من لم يقدر على مهر الحرة المؤمنة ، فليتزوج الأمة المؤمنة .وفيه دليل على أنه لا يجوز للحر نكاح الأمة إلا بشرطين ، أحدهما : أن لا يجد مهر حرة ، والثاني أن يكون خائفا على نفسه من العنت ، وهو الزنا ، لقوله تعالى في آخر الآية ",
        "char_start": 0,
        "char_end": 3485,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_077_chunk00",
        "verse_key": "4:77",
        "text_ar": "قوله تعالى : ( ألم تر إلى الذين قيل لهم كفوا أيديكم ) الآية ، قال الكلبي : نزلت في عبد الرحمن بن عوف الزهري ، والمقداد بن الأسود الكندي ، وقدامة بن مظعون الجمحي ، وسعد بن أبي وقاص ، وجماعة كانوا يلقون من المشركين بمكة أذى كثيرا قبل أن يهاجروا ، ويقولون : يا رسول الله ائذن لنا في قتالهم فإنهم قد آذونا ، فيقول لهم رسول الله صلى الله عليه وسلم : \" كفوا أيديكم فإني لم أؤمر بقتالهم \" .( وأقيموا الصلاة وآتوا الزكاة ) فلما هاجروا إلى المدينة وأمرهم الله بقتال المشركين شق ذلك على بعضهم ، قال الله تعالى ",
        "char_start": 0,
        "char_end": 1738,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_083_chunk00",
        "verse_key": "4:83",
        "text_ar": "قوله تعالى : ( وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ) وذلك أن النبي صلى الله عليه وسلم كان يبعث السرايا فإذا غلبوا أو غلبوا بادر المنافقون يستخبرون عن حالهم ، فيفشون ويحدثون به قبل أن يحدث به رسول الله صلى الله عليه وسلم فيضعفون به قلوب المؤمنين فأنزل الله تعالى ( وإذا جاءهم ) يعني : المنافقين ( أمر من الأمن ) أي : الفتح والغنيمة ( أو الخوف ) القتل والهزيمة ( أذاعوا به ) أشاعوه وأفشوه ، ( ولو ردوه إلى الرسول ) أي : لو لم يحدثوا به حتى يكون النبي صلى الله عليه وسلم هو الذي يحدث به ، ( وإلى ",
        "char_start": 0,
        "char_end": 1822,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_023_chunk00",
        "verse_key": "5:23",
        "text_ar": "(قال رجلان من الذين يخافون ) أي : يخافون الله تعالى ، قرأ سعيد بن جبير \" يخافون \" بضم الياء ، وقال : الرجلان كانا من الجبارين فأسلما واتبعا موسى ، ( أنعم الله عليهما ) بالتوفيق والعصمة قالا ( ادخلوا عليهم الباب ) يعني : قرية الجبارين ، ( فإذا دخلتموه فإنكم غالبون ) لأن الله تعالى منجز وعده ، وإنا رأيناهم وأجسامهم عظيمة وقلوبهم ضعيفة ، فلا تخشوهم ، ( وعلى الله فتوكلوا إن كنتم مؤمنين ) فأراد بنو إسرائيل أن يرجموهما بالحجارة وعصوهما .",
        "char_start": 0,
        "char_end": 435,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_052_chunk00",
        "verse_key": "5:52",
        "text_ar": "( فترى الذين في قلوبهم مرض ) أي : نفاق يعني عبد الله بن أبي وأصحابه من المنافقين الذين يوالون اليهود ، ) ( يسارعون فيهم ) في معونتهم وموالاتهم ، ( يقولون نخشى أن تصيبنا دائرة ) دولة ، يعني : أن يدول الدهر دولة فنحتاج إلى نصرهم إيانا ، وقال ابن عباس رضي الله عنهما : معناه نخشى أن لا يتم أمر محمد فيدور الأمر علينا ، وقيل : نخشى أن يدور الدهر علينا بمكروه من جدب وقحط فلا يعطونا الميرة والقرض ( فعسى الله أن يأتي بالفتح ) قال قتادة ومقاتل : بالقضاء الفصل من نصر محمد صلى الله عليه وسلم على من خالفه ، ",
        "char_start": 0,
        "char_end": 802,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_054_chunk00",
        "verse_key": "5:54",
        "text_ar": "قوله عز وجل : ( ياأيها الذين آمنوا من يرتد منكم عن دينه فسوف يأتي الله بقوم يحبهم ويحبونه ) قرأ أهل المدينة والشام \" يرتدد \" بدالين على إظهار التضعيف \" عن دينه \" فيرجع إلى الكفر .قال الحسن : علم الله تبارك وتعالى أن قوما يرجعون عن الإسلام بعد موت نبيهم صلى الله عليه وسلم فأخبر أنه سيأتي بقوم يحبهم الله ويحبونه .واختلفوا في أولئك القوم من هم؟ قال علي بن أبي طالب رضي الله عنه والحسن وقتادة : هم أبو بكر وأصحابه الذين قاتلوا أهل الردة الزكاة وذلك أن النبي صلى الله عليه وسلم لما قبض ارتد عامة العرب إ",
        "char_start": 0,
        "char_end": 5410,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "( إن الذين آمنوا والذين هادوا والصابئون والنصارى ) وكان حقه : ) ( والصابئين ) وقد ذكرنا في سورة البقرة وجه ارتفاعه . وقال سيبويه : فيه تقديم وتأخير تقديره : إن الذين آمنوا والذين هادوا والنصارى من آمن بالله إلى آخر الآية ، والصابئون كذلك ، وقوله : ( إن الذين آمنوا ) أي : باللسان ، وقوله : ( من آمن بالله ) أي : بالقلب ، وقيل : الذين آمنوا على حقيقة الإيمان ( من آمن بالله ) أي : ثبت على الإيمان ، ( واليوم الآخر وعمل صالحا فلا خوف عليهم ولا هم يحزنون )",
        "char_start": 0,
        "char_end": 453,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "قوله عز وجل : ( وما نرسل المرسلين إلا مبشرين ومنذرين فمن آمن وأصلح ) العمل ، ( فلا خوف عليهم ) حين يخاف أهل النار ، ( ولا هم يحزنون ) إذا حزنوا .",
        "char_start": 0,
        "char_end": 145,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_006_051_chunk00",
        "verse_key": "6:51",
        "text_ar": "قوله عز وجل : ( وأنذر به ) خوف به أي : بالقرآن ، ( الذين يخافون أن يحشروا ) يجمعوا ويبعثوا إلى ربهم ، وقيل : يخافون أي يعلمون ، لأن خوفهم إنما كان من علمهم ، ( ليس لهم من دونه ) من دون الله ، ( ولي ) قريب ينفعهم ، ( ولا شفيع ) يشفع لهم ، ( لعلهم يتقون ) فينتهون عما نهوا عنه ، وإنما نفى الشفاعة لغيره - مع أن الأنبياء والأولياء يشفعون - لأنهم لا يشفعون إلا بإذنه .",
        "char_start": 0,
        "char_end": 364,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "قوله تعالى : ( يابني آدم إما يأتينكم رسل منكم ) أي : أن يأتيكم . قيل : أراد جميع الرسل . وقال مقاتل : أراد بقوله : ( يا بني آدم ) مشركي العرب وبالرسل محمدا - صلى الله عليه وسلم - وحده ، ( يقصون عليكم آياتي ) قال ابن عباس : فرائضي وأحكامي ، ( فمن اتقى وأصلح ) أي : اتقى الشرك وأصلح عمله . وقيل : أخلص ما بينه وبين ربه ( فلا خوف عليهم ) إذا خاف الناس ، ( ولا هم يحزنون ) أي : إذا حزنوا .",
        "char_start": 0,
        "char_end": 385,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "قول تعالي مخبرا عما انذر به ادم وزوجته وابليس حتي اهبطهم من الجنه ، والمراد الذريه - انه سينزل الكتب ، ويبعث الانبياء والرسل ؛ كما قال ابو العاليه : الهدي : الانبياء والرسل والبيان ، وقال مقاتل بن حيان : الهدي : محمد صلي الله عليه وسلم . وقال الحسن : الهدي القران . وهذان القولان صحيحان ، وقول ابي العاليه اعم .( فمن تبع هداي ) اي : من اقبل علي ما انزلت به الكتب وارسلت به الرسل ( فلا خوف عليهم ) اي : فيما يستقبلونه من امر الاخره ( ولا هم يحزنون ) علي ما فاتهم من امور الدنيا ، كما قال في سوره \" طه ",
        "char_start": 0,
        "char_end": 738,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "لما بين [ الله ] تعالي حال من خالف اوامره وارتكب زواجره ، وتعدي في فعل ما لا اذن فيه وانتهك المحارم ، وما احل بهم من النكال ، نبه تعالي علي ان من احسن من الامم السالفه واطاع ، فان له جزاء الحسني ، وكذلك الامر الي قيام الساعه ؛ كل من اتبع الرسول النبي الامي فله السعاده الابديه ، ولا خوف عليهم فيما يستقبلونه ، ولا هم يحزنون علي ما يتركونه ويخلفونه ، كما قال تعالي : ( الا ان اولياء الله لا خوف عليهم ولا هم يحزنون ) [ يونس : 62 ] وكما تقول الملايكه للمومنين عند الاحتضار في قوله : ( ان الذين قالوا رب",
        "char_start": 0,
        "char_end": 6181,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_074_chunk00",
        "verse_key": "2:74",
        "text_ar": "يقول تعالي توبيخا لبني اسراييل ، وتقريعا لهم علي ما شاهدوه من ايات الله تعالي ، واحيايه الموتي : ( ثم قست قلوبكم من بعد ذلك ) كله ( فهي كالحجاره ) التي لا تلين ابدا . ولهذا نهي الله المومنين عن مثل حالهم فقال : ( الم يان للذين امنوا ان تخشع قلوبهم لذكر الله وما نزل من الحق ولا يكونوا كالذين اوتوا الكتاب من قبل فطال عليهم الامد فقست قلوبهم وكثير منهم فاسقون ) [ الحديد : 16 ] .وقال العوفي ، في تفسيره ، عن ابن عباس : لما ضرب المقتول ببعض البقره جلس احيا ما كان قط ، فقيل له : من قتلك ؟ فقال : بنو اخ",
        "char_start": 0,
        "char_end": 6226,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "ثم قال تعالي : ( بلي من اسلم وجهه لله وهو محسن ) اي : من اخلص العمل لله وحده لا شريك له ، كما قال تعالي : ( فان حاجوك فقل اسلمت وجهي لله ومن اتبعن ) الايه [ ال عمران : 20 ] .وقال ابو العاليه والربيع : ( بلي من اسلم وجهه لله ) يقول : من اخلص لله .وقال سعيد بن جبير : ( بلي من اسلم ) اخلص ، ( وجهه ) قال : دينه ، ( وهو محسن ) اي : متبع فيه الرسول صلي الله عليه وسلم . فان للعمل المتقبل شرطين ، احدهما : ان يكون خالصا لله وحده والاخر : ان يكون صوابا موافقا للشريعه . فمتي كان خالصا ولم يكن صوابا لم يتقب",
        "char_start": 0,
        "char_end": 1932,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_155_chunk00",
        "verse_key": "2:155",
        "text_ar": "اخبر تعالي انه يبتلي عباده [ المومنين ] اي : يختبرهم ويمتحنهم ، كما قال تعالي : ( ولنبلونكم حتي نعلم المجاهدين منكم والصابرين ونبلو اخباركم ) [ محمد : 31 ] فتاره بالسراء ، وتاره بالضراء من خوف وجوع ، كما قال تعالي : ( فاذاقها الله لباس الجوع والخوف ) [ النحل : 112 ] فان الجايع والخايف كل منهما يظهر ذلك عليه ; ولهذا قال : لباس الجوع والخوف . وقال هاهنا ( بشيء من الخوف والجوع ) اي : بقليل من ذلك ( ونقص من الاموال ) اي : ذهاب بعضها ) والانفس ) كموت الاصحاب والاقارب والاحباب ) والثمرات ) اي : لا تغل",
        "char_start": 0,
        "char_end": 882,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "يمدح تعالي الذين ينفقون اموالهم في سبيل الله ، ثم لا يتبعون ما انفقوا من الخيرات والصدقات منا علي من اعطوه ، فلا يمنون علي احد ، ولا يمنون به لا بقول ولا فعل .وقوله : ( ولا اذي ) اي : لا يفعلون مع من احسنوا اليه مكروها يحبطون به ما سلف من الاحسان . ثم وعدهم تعالي الجزاء الجزيل علي ذلك ، فقال : ( لهم اجرهم عند ربهم ) اي : ثوابهم علي الله ، لا علي احد سواه ( ولا خوف عليهم ) اي : فيما يستقبلونه من اهوال يوم القيامه ( ولا هم يحزنون ) اي : [ علي ] ما خلفوه من الاولاد وما فاتهم من الحياه الدنيا وزهرته",
        "char_start": 0,
        "char_end": 561,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "وقوله : ( الذين ينفقون اموالهم بالليل والنهار سرا وعلانيه فلهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون ) هذا مدح منه تعالي للمنفقين في سبيله ، وابتغاء مرضاته في جميع الاوقات من ليل او نهار ، والاحوال من سر وجهار ، حتي ان النفقه علي الاهل تدخل في ذلك ايضا ، كما ثبت في الصحيحين ان رسول الله صلي الله عليه وسلم قال لسعد بن ابي وقاص حين عاده مريضا عام الفتح ، وفي روايه عام حجه الوداع : \" وانك لن تنفق نفقه تبتغي بها وجه الله الا ازددت بها درجه ورفعه ، حتي ما تجعل في في امراتك \" .وقال الامام احمد : ",
        "char_start": 0,
        "char_end": 1790,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "ثم قال تعالي مادحا للمومنين بربهم ، المطيعين امره ، المودين شكره ، المحسنين الي خلقه في اقامه الصلاه وايتاء الزكاه ، مخبرا عما اعد لهم من الكرامه ، وانهم يوم القيامه من التبعات امنون ، فقال : ( ان الذين امنوا وعملوا الصالحات واقاموا الصلاه واتوا الزكاه لهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون )",
        "char_start": 0,
        "char_end": 301,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "وقوله : ( فرحين بما اتاهم الله [ من فضله ويستبشرون بالذين لم يلحقوا بهم من خلفهم الا خوف عليهم ولا هم يحزنون ] ) اي : الشهداء الذين قتلوا في سبيل الله احياء عند الله ، وهم فرحون مما هم فيه من النعمه والغبطه ، ومستبشرون باخوانهم الذين يقتلون بعدهم في سبيل الله انهم يقدمون عليهم ، وانهم لا يخافون مما امامهم ولا يحزنون علي ما تركوه وراءهم .قال محمد بن اسحاق ( ويستبشرون ) اي : ويسرون بلحوق من خلفهم من اخوانهم علي ما مضوا عليه من جهادهم ، ليشركوهم فيما هم فيه من ثواب الله الذي اعطاهم .[ و ] قال السدي",
        "char_start": 0,
        "char_end": 1363,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_175_chunk00",
        "verse_key": "3:175",
        "text_ar": "ثم قال تعالي : ( انما ذلكم الشيطان يخوف اولياءه ) اي : يخوفكم اولياءه ، ويوهمكم انهم ذوو باس وذوو شده ، قال الله تعالي : ( فلا تخافوهم وخافون ان كنتم مومنين ) [ اي : ف ] اذا سول لكم واوهمكم فتوكلوا علي والجيوا الي ، فانا كافيكم وناصركم عليهم ، كما قال تعالي : ( اليس الله بكاف عبده ويخوفونك بالذين من دونه ) الي قوله : ( قل حسبي الله عليه يتوكل المتوكلون ) [ الزمر : 36 - 38 ] وقال تعالي : ( فقاتلوا اولياء الشيطان ان كيد الشيطان كان ضعيفا ) [ النساء : 76 ] وقال تعالي : ( اوليك حزب الشيطان الا ان حز",
        "char_start": 0,
        "char_end": 924,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_025_chunk00",
        "verse_key": "4:25",
        "text_ar": "يقول [ تعالي ] ومن لم يجد ) طولا ) اي : سعه وقدره ( ان ينكح المحصنات المومنات ) اي الحراير .وقال ابن وهب : اخبرني عبد الجبار ، عن ربيعه : ( ومن لم يستطع منكم طولا ان ينكح المحصنات ) قال ربيعه الطول الهوي ، ينكح الامه اذا كان هواه فيها . رواه ابن جرير وابن ابي حاتم .ثم شرع يشنع علي هذا القول ويرده ( فمن ما ملكت ايمانكم من فتياتكم المومنات ) اي : فتزوجوا من الاماء المومنات اللاتي يملكهن المومنون ، ولهذا قال : ( من فتياتكم المومنات ) قال ابن عباس وغيره : فلينكح من اماء المومنين ، وكذا قال السدي ومق",
        "char_start": 0,
        "char_end": 13194,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_077_chunk00",
        "verse_key": "4:77",
        "text_ar": "كان المومنون في ابتداء الاسلام - وهم بمكه - مامورين بالصلاه والزكاه وان لم تكن ذات النصب ، لكن كانوا مامورين بمواساه الفقراء منهم ، وكانوا مامورين بالصفح والعفو عن المشركين والصبر الي حين ، وكانوا يتحرقون ويودون لو امروا بالقتال ليشتفوا من اعدايهم ، ولم يكن الحال اذ ذاك مناسبا لاسباب كثيره ، منها : قله عددهم بالنسبه الي كثره عدد عدوهم ، ومنها كونهم كانوا في بلدهم وهو بلد حرام واشرف بقاع الارض ، فلم يكن الامر بالقتال فيه ابتداء لايقا . فلهذا لم يومر بالجهاد الا بالمدينه ، لما صارت لهم دار ومنعه و",
        "char_start": 0,
        "char_end": 2651,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_083_chunk00",
        "verse_key": "4:83",
        "text_ar": "وقوله : ( واذا جاءهم امر من الامن او الخوف اذاعوا به ) انكار علي من يبادر الي الامور قبل تحققها ، فيخبر بها ويفشيها وينشرها ، وقد لا يكون لها صحه .وقد قال مسلم في \" مقدمه صحيحه \" حدثنا ابو بكر بن ابي شيبه ، حدثنا علي بن حفص ، حدثنا شعبه ، عن خبيب بن عبد الرحمن ، عن حفص بن عاصم ، عن ابي هريره ، عن النبي صلي الله عليه وسلم قال : \" كفي بالمرء ان يحدث بكل ما سمع \" وكذا رواه ابو داود في كتاب \" الادب \" من سننه ، عن محمد بن الحسين بن اشكاب ، عن علي بن حفص ، عن شعبه ورواه مسلم ايضا من حديث معاذ بن هشام ",
        "char_start": 0,
        "char_end": 1965,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_023_chunk00",
        "verse_key": "5:23",
        "text_ar": "وقوله : ( قال رجلان من الذين يخافون انعم الله عليهما ) اي : فلما نكل بنو اسراييل عن طاعه الله ومتابعه رسول الله موسي عليه السلام ، حرضهم رجلان لله عليهما نعمه عظيمه ، وهما ممن يخاف امر الله ويخشي عقابه .وقرا بعضهم : ( قال رجلان من الذين يخافون ) اي : ممن لهم مهابه وموضع من الناس . ويقال : انهما \" يوشع بن نون \" و \" كالب بن يوفنا \" ، قاله ابن عباس ومجاهد وعكرمه وعطيه والسدي والربيع بن انس وغير واحد من السلف ، والخلف ، رحمهم الله ، فقالا ( ادخلوا عليهم الباب فاذا دخلتموه فانكم غالبون وعلي الله فتوك",
        "char_start": 0,
        "char_end": 680,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_052_chunk00",
        "verse_key": "5:52",
        "text_ar": "وقوله : ( فتري الذين في قلوبهم مرض ) اي : شك ، وريب ، ونفاق ( يسارعون فيهم ) اي : يبادرون الي موالاتهم ومودتهم في الباطن والظاهر ، ( يقولون نخشي ان تصيبنا دايره ) اي : يتاولون في مودتهم وموالاتهم انهم يخشون ان يقع امر من ظفر الكفار بالمسلمين ، فتكون لهم اياد عند اليهود والنصاري فينفعهم ذلك ، عند ذلك قال الله تعالي : ( فعسي الله ان ياتي بالفتح ) قال السدي : يعني فتح مكه . وقال غيره : يعني القضاء والفصل ( او امر من عنده ) قال السدي : يعني ضرب الجزيه علي اليهود والنصاري ( فيصبحوا ) يعني : الذين وال",
        "char_start": 0,
        "char_end": 961,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_054_chunk00",
        "verse_key": "5:54",
        "text_ar": "يقول تعالي مخبرا عن قدرته العظيمه ان من تولي عن نصره دينه واقامه شريعته ، فان الله يستبدل به من هو خير لها منه واشد منعه واقوم سبيلا كما قال تعالي : ( وان تتولوا يستبدل قوما غيركم ثم لا يكونوا امثالكم ) [ محمد : 38 ] وقال تعالي : ( ان يشا يذهبكم ايها الناس ويات باخرين ) [ النساء : 133 ] ، وقال تعالي : ( ان يشا يذهبكم ويات بخلق جديد وما ذلك علي الله بعزيز ) [ ابراهيم : 19 ، 20 ] اي : بممتنع ولا صعب . وقال تعالي هاهنا : ( يا ايها الذين امنوا من يرتد منكم عن دينه ) اي : يرجع عن الحق الي الباطل .قال",
        "char_start": 0,
        "char_end": 4339,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "ثم قال : ( ان الذين امنوا ) وهم : المسلمون ( والذين هادوا ) وهم : حمله التوراه ( والصابيون ) - لما طال الفصل حسن العطف بالرفع . والصابيون : طايفه بين النصاري والمجوس ليس لهم دين . قاله مجاهد وعنه : بين اليهود والمجوس . وقال سعيد بن جبير : بين اليهود والنصاري وعن الحسن [ والحكم ] انهم كالمجوس . وقال قتاده : هم قوم يعبدون الملايكه ، ويصلون الي غير القبله ، ويقرءون الزبور . وقال وهب بن منبه : هم قوم يعرفون الله وحده ، وليست لهم شريعه يعملون بها ، ولم يحدثوا كفرا .وقال ابن وهب : اخبرني ابن ابي الزنا",
        "char_start": 0,
        "char_end": 1056,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "وقوله : ( وما نرسل المرسلين الا مبشرين ومنذرين ) اي : مبشرين عباد الله المومنين بالخيرات ومنذرين من كفر بالله النقمات والعقوبات . ولهذا قال [ سبحانه وتعالي ] ( فمن امن واصلح ) اي : فمن امن قلبه بما جاءوا به واصلح عمله باتباعه اياهم ( فلا خوف عليهم ) اي : بالنسبه الي ما يستقبلونه ( ولا هم يحزنون ) اي : بالنسبه الي ما فاتهم وتركوه وراء ظهورهم من امر الدنيا وصنيعها ، الله وليهم فيما خلفوه ، وحافظهم فيما تركوه .",
        "char_start": 0,
        "char_end": 411,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_006_051_chunk00",
        "verse_key": "6:51",
        "text_ar": "( الذين يخافون ان يحشروا الي ربهم ) اي : يوم القيامه . ( ليس لهم ) اي : يوميذ ( من دونه ولي ولا شفيع ) اي : لا قريب لهم ولا شفيع فيهم من عذابه ان اراده بهم ( لعلهم يتقون ) اي : انذر هذا اليوم الذي لا حاكم فيه الا الله ، عز وجل ( لعلهم يتقون ) فيعملون في هذه الدار عملا ينجيهم الله به يوم القيامه من عذابه ، ويضاعف لهم به الجزيل من ثوابه .",
        "char_start": 0,
        "char_end": 338,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "ثم انذر تعالي بني ادم بانه سيبعث اليهم رسلا يقصون عليهم اياته ، وبشر وحذر فقال : ( فمن اتقي واصلح ) اي : ترك المحرمات وفعل الطاعات ( فلا خوف عليهم ولا هم يحزنون)",
        "char_start": 0,
        "char_end": 161,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "«قلنا اهبطوا منها» من الجنة «جميعاً» كرره ليعطف عليه «فإما» فيه إدغام نون إن الشرطية في ما الزائدة «يأتينكم مني هدىً» كتاب ورسول «فمن تبع هداي» فآمن بي وعمل بطاعتي «فلا خوف عليهم ولا هم يحزنون» في الآخرة بأن يدخلوا الجنة.",
        "char_start": 0,
        "char_end": 221,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "«إن الذين آمنوا» بالأنبياء من قبل «والذين هادوا» هم اليهود «والنصارى والصابئين» طائفة من اليهود أو النصارى «من آمن» منهم «بالله واليوم الآخر» في زمن نبينا «وعمل صالحاً» بشريعته «فلهم أجرهم» أي ثواب أعمالهم «عند ربهم ولا خوف عليهم ولا هم يحزنون» رُوعي في ضمير آمن وعمل لفظ من وفيما بعده معناها.",
        "char_start": 0,
        "char_end": 293,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_074_chunk00",
        "verse_key": "2:74",
        "text_ar": "«ثم قست قلوبكم» أيها اليهود صلبت عن قبول الحق «من بعد ذلك» المذكور من إحياء القتيل وما قبله من الآيات «فهي كالحجارة» في القسوة «أو أشد قسوة» منها «وإن من الحجارة لما يتفجَّر منه الأنهار وإن منها لما يشقق» فيه إدغام التاء في الأصل في الشين «فيخرج منه الماء وإن منها لما يهبط» ينزل من علو إلى أسفل «من خشية الله» وقلوبكم لا تتأثر ولا تلين ولا تخشع «وما الله بغافل عما تعلمون» وإنما يؤخركم لوقتكم وفي قراءة بالتحتانية وفيه التفات عن الخطاب.",
        "char_start": 0,
        "char_end": 437,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "«بلى» يدخل الجنة غيرهم «من أسلم وجهه لله» أي انقاد لأمره. وخص الوجه لأنه أشرف الأعضاء فغيره أولى «وهو محسن» موحد «فله أجره عند ربِّه» أي ثواب عمله الجنة «ولا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 193,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_155_chunk00",
        "verse_key": "2:155",
        "text_ar": "«ولنبلونكم بشيء من الخوف» للعدو «والجوع» القحط «ونقص من الأموال» بالهلاك «والأنفس» بالقتل والموت والأمراض «والثمرات» بالحوائج أي لنختبرنكم فننظر أتصبرون أم لا «وبشر الصابرين» على البلاء بالجنة.",
        "char_start": 0,
        "char_end": 193,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "«الذين ينفقون أموالهم في سبيل الله ثم لا يُتبِعون ما أنفقوا مَنًّا» على المنفق عليه بقولهم مثلا: قد أحسنت إليه وجبرت حاله «ولا أذًى» له بذكر ذلك إلى من لا يجب وقوفه عليه ونحو «لهم أجرهم» ثواب إنفاقهم «عند ربهم ولا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 249,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "«الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربَّهم ولا خوف عليهم ولا هم يحزنون».",
        "char_start": 0,
        "char_end": 100,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "«إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون».",
        "char_start": 0,
        "char_end": 108,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "«فرحين» حال من ضمير يُرزقون «بما آتاهم الله من فضله و» هم «يستبشرون» يفرحون «بالذين لم يلحقوا بهم من خلفهم» من إخوانهم المؤمنين ويبدل من الذين «أ» نْ أي بأن «لا خوف عليهم» أي الذين لم يلحقوا بهم «ولا هم يحزنون» في الآخرة المعنى يفرحون بأمنهم وفرحهم.",
        "char_start": 0,
        "char_end": 249,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_175_chunk00",
        "verse_key": "3:175",
        "text_ar": "«إنما ذلكم» أي القائل لكم إن الناس إلخ «الشيطان يخوِّفُ» ـكم «أولياءه» الكفار «فلا تخافوهم وخافون» في ترك أمري «إن كنتم مؤمنين» حقَّا.",
        "char_start": 0,
        "char_end": 134,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_025_chunk00",
        "verse_key": "4:25",
        "text_ar": "(ومن لم يستطع منكم طولا) أي غنى لـ (أن ينكح المحصنات) الحرائر (المؤمنات) هو جري على الغالب فلا مفهوم له (فمن ما ملكت أيمانكم) ينكح (من فتياتكم المؤمنات والله أعلم بإيمانكم) فاكتفوا بظاهره وكِلوا السرائر إليه فإنه العالم بتفضيلها ورب أمة تفضل حرة فيه وهذا تأنيس بنكاح الإماء (بعضكم من بعض) أي أنتم وهن سواء في الدين فلا تستنكفوا من نكاحهن (فانكحوهن بإذن أهلهن) مواليهن (وآتوهن) أعطوهن. (أجورهن) مهورهن (بالمعروف) من غير مطل ونقص (محصنات) عفائف حال (غير مسافحات) زانيات جهرا (ولا متخذات أخذان) أخلاء يز",
        "char_start": 0,
        "char_end": 1166,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_077_chunk00",
        "verse_key": "4:77",
        "text_ar": "«ألم تر إلى الذين قيل لهم كفُّوا أيديكم» عن قتال الكفار لما طلبوه بمكة لأذى الكفار لهم وهم جماعة من الصحابة «وأقيموا الصلاة وآتوا الزكاة فلما كُتب» فرض «عليهم القتال إذا فريق منهم يخشون» يخافون «الناس» الكفار، أي عذابهم بالقتل «كَخَشْيَتـ» ـهم عذاب «الله أو أشدَّ خشية» من خشيتهم له ونصب أشد على الحال وجواب لما دل عليه إذا وما بعدها أي فاجأتهم الخشية «وقالوا» جزعا من الموت «ربَنا لم كتبت علينا القتال لولا» هلاّ «أخَّرتنا إلى أجل قريب قل» لهم «متاعُ الدنيا» ما يتمتع به فيها أو الاستمتاع بها «قليل»",
        "char_start": 0,
        "char_end": 650,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_083_chunk00",
        "verse_key": "4:83",
        "text_ar": "«وإذا جاءهم أمر» عن سرايا النبي صلى الله عليه وسلم ما حصل لهم «من الأمن» بالنصر «أو الخوف» الهزيمة «أذاعوا به» أفشَوه نزل في جماعة من المنافقين أو في ضعفاء المؤمنين كانوا يفعلون ذلك فتضعف قلوب المؤمنين ويتأذى النبي «ولو ردوه» أي الخبر «إلى الرسول وإلى أُولي الأمر منهم» أي الرأي من أكابر الصحابة أي لو سكتوا عنه حتى يخبروا به «لعَلِمَه» هل هو مما ينبغي أن يذاع أو لا «الذين يستنبطونه» يتبعونه ويطلبون علمه وهم المذيعون «منهم» من الرسول وأولي الأمر «ولولا فضل الله عليكم» بالإسلام «ورحمته» لكم بالقرآن",
        "char_start": 0,
        "char_end": 557,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_023_chunk00",
        "verse_key": "5:23",
        "text_ar": "«قال» لهم «رجلان من الذين يخافون» مخالفة أمر الله وهما يوشع وكالب من النقباء الذين بعثهم موسى في كشف أحوال الجبابرة «أنعم الله عليهما» بالعصمة فكتما ما اطَّلعا عليه من حالهم إلا عن موسى بخلاف بقية النقباء فأفشوه فجبنوا «ادخلوا عليهم الباب» باب القرية ولا تخشوهم فإنهم أجساد بلا قلوب «فإذا دخلتموه فإنكم غالبون» قالا ذلك تيقناً بنصر الله وإنجاز وعده «وعلى الله فتوكلوا إن كنتم مؤمنين».",
        "char_start": 0,
        "char_end": 384,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_052_chunk00",
        "verse_key": "5:52",
        "text_ar": "«فترى الذين في قلوبهم مرض» ضعف اعتقاد كعبد الله بن أبي المنافق «يسارعون فيهم» في موالاتهم «يقولون» معتذرين عنها «نخشى أن تصيبنا دائرة» يدور بها الدهر علينا من جدب أو غلبة ولا يتم أمر محمد فلا يميرونا قال تعالى: «فعسى الله أن يأتي بالفتح» بالنصر لنبيه بإظهار دينه «أو أمر من عنده» بهتك ستر المنافقين وافتضاحهم «فيصبحوا على ما أسرُّوا في أنفسهم» من الشك وموالاة الكفار «نادمين».",
        "char_start": 0,
        "char_end": 376,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_054_chunk00",
        "verse_key": "5:54",
        "text_ar": "(يا أيها الذين آمنوا من يرتد) بالفك والإدغام يرجع (منكم عن دينه) إلى الكفر إخبار بما علم الله وقوعه وقد ارتد جماعة بعد موت النبي صلى الله عليه وسلم (فسوف يأتي الله) بدلهم (بقوم يحبهم ويحبونه) قال صلى الله عليه وسلم: \"\" هم قوم هذا وأشار إلى أبي موسى الأشعري \"\" رواه الحاكم في صحيحه (أذلة) عاطفين (على المؤمنين أعزة) أشداء (على الكافرين يجاهدون في سبيل الله ولا يخافون لومة لائم) فيه كما يخاف المنافقون لوم الكفار (ذلك فضل الله يؤتيه من يشاء والله واسع) كثير الفضل (عليم) بمن هو أهله، ونزل لما قال ابن ",
        "char_start": 0,
        "char_end": 534,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "«إن الذين آمنوا والذين هادوا» هم اليهود مبتدأ «والصابئون» فرقة منهم «والنصارى» ويبدل من المبتدأ «من آمن» منهم «بالله واليوم الآخر وعمل صالحا فلا خوف عليهم ولا هم يحزنون» في الآخرة خبر المبتدأ ودال على خبر إن.",
        "char_start": 0,
        "char_end": 208,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "«وما نرسل المرسلين إلا مبشِّرين» من آمن بالجنة «ومنذرين» من كفر بالنار «فمن آمن» بهم «وأصلح» عمله «فلا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 138,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_006_051_chunk00",
        "verse_key": "6:51",
        "text_ar": "«وأنذر» خوِّف «به» أي القرآن «الذين يخافون أن يُحشروا إلى ربِّهم ليس لهم من دونه» أي غيره «ولي» ينصرهم «ولا شفيع» يشفع لهم وجملة النفي حال من ضمير يحشروا وهي محل الخوف والمراد بهم العاصون «لعلهم يتقون» الله بإقلاعهم عما هم فيه وعمل الطاعات.",
        "char_start": 0,
        "char_end": 240,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "«يابني آدم إمَّا» فيه إدغام نون إن الشرطية في ما المزيدة «يأتينكم رسل منكم يقصُّون عليكم آياتي فمن اتقى» الشرك «وأصلح» عمله «فلا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 164,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "قال الله لهم: اهبطوا من الجنه جميعًا، وسياتيكم انتم وذرياتكم المتعاقبه ما فيه هدايتكم الي الحق. فمن عمل بها فلا خوف عليهم فيما يستقبلونه من امر الاخره ولا هم يحزنون علي ما فاتهم من امور الدنيا.",
        "char_start": 0,
        "char_end": 193,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "إن المؤمنين من هذه الأمة، الذين صدَّقوا بالله ورسله، وعملوا بشرعه، والذين كانوا قبل بعثة محمد صلى الله عليه وسلم من الأمم السالفة من اليهود، والنصارى، والصابئين -وهم قوم باقون على فطرتهم، ولا دين مقرر لهم يتبعونه- هؤلاء جميعًا إذا صدَّقوا بالله تصديقًا صحيحًا خالصًا، وبيوم البعث والجزاء، وعملوا عملا مرضيًا عند الله، فثوابهم ثابت لهم عند ربهم، ولا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على ما فاتهم من أمور الدنيا. وأما بعد بعثة محمد صلى الله عليه وسلم خاتمًا للنبيين والمرسلين إلى ا",
        "char_start": 0,
        "char_end": 565,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_074_chunk00",
        "verse_key": "2:74",
        "text_ar": "ولكنكم لم تنتفعوا بذلك; إذ بعد كل هذه المعجزات الخارقة اشتدت قلوبكم وغلظت، فلم يَنْفُذ إليها خير، ولم تَلِنْ أمام الآيات الباهرة التي أريتكموها، حتى صارت قلوبكم مثل الحجارة الصمَّاء، بل هي أشد منها غلظة; لأن من الحجارة ما يتسع وينفرج حتى تنصبَّ منه المياه صبًا، فتصير أنهارًا جاريةً، ومن الحجارة ما يتصدع فينشق، فتخرج منه العيون والينابيع، ومن الحجارة ما يسقط من أعالي الجبال مِن خشية الله تعالى وتعظيمه. وما الله بغافل عما تعملون.",
        "char_start": 0,
        "char_end": 431,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "ليس الأمر كما زعموا أنَّ الجنة تختص بطائفة دون غيرها، وإنما يدخل الجنَّة مَن أخلص لله وحده لا شريك له، وهو متبع للرسول محمد صلى الله عليه وسلم في كل أقواله وأعماله. فمن فعل ذلك فله ثواب عمله عند ربه في الآخرة، وهو دخول الجنة، وهم لا يخافون فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 312,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_155_chunk00",
        "verse_key": "2:155",
        "text_ar": "ولنختبرنكم بشيء يسير من الخوف، ومن الجوع، وبنقص من الاموال بتعسر الحصول عليها، او ذهابها، ومن الانفس: بالموت او الشهاده في سبيل الله، وبنقص من ثمرات النخيل والاعناب والحبوب، بقلَّه ناتجها او فسادها. وبشِّر -ايها النبي- الصابرين علي هذا وامثاله بما يفرحهم ويَسُرُّهم من حسن العاقبه في الدنيا والاخره.",
        "char_start": 0,
        "char_end": 299,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "الذين يخرجون أموالهم في الجهاد وأنواع الخير، ثم لا يتبعون ما أنفقوا من الخيرات مَنّاً على مَن أعطَوه ولا أذى بقول أو فِعْلٍ يشعره بالتفضل عليه، لهم ثوابهم العظيم عند ربهم، ولا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على شيء فاتهم في هذه الدنيا.",
        "char_start": 0,
        "char_end": 258,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "الذين يُخْرجون أموالهم مرضاة لله ليلا ونهارًا مسرِّين ومعلنين، فلهم أجرهم عند ربهم، ولا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا. ذلك التشريع الإلهي الحكيم هو منهاج الإسلام في الإنفاق لما فيه مِن سدِّ حاجة الفقراء في كرامة وعزة، وتطهير مال الأغنياء، وتحقيق التعاون على البر والتقوى; ابتغاء وجه الله دون قهر أو إكراه.",
        "char_start": 0,
        "char_end": 357,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "إن الذين صدقوا الله ورسوله، وعملوا الأعمال الطيبة، وأدَّوا الصلاة كما أمر الله ورسوله، وأخرجوا زكاة أموالهم، لهم ثواب عظيم خاص بهم عند ربهم ورازقهم، ولا يلحقهم خوف في آخرتهم، ولا حزن على ما فاتهم من حظوظ دنياهم.",
        "char_start": 0,
        "char_end": 211,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "لقد عَمَّتهم السعادة حين مَنَّ الله عليهم، فأعطاهم مِن عظيم جوده وواسع كرمه من النعيم والرضا ما تَقَرُّ به أعينهم، وهم يفرحون بإخوانهم المجاهدين الذين فارقوهم وهم أحياء; ليفوزوا كما فازوا، لِعِلْمِهم أنهم سينالون من الخير الذي نالوه، إذا استشهدوا في سبيل الله مخلصين له، وأن لا خوف عليهم فيما يستقبلون من أمور الآخرة، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 360,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_175_chunk00",
        "verse_key": "3:175",
        "text_ar": "إنَّما المثبِّط لكم في ذلك هو الشيطان جاءكم يخوِّفكم أنصاره، فلا تخافوا المشركين; لأنّهم ضعاف لا ناصر لهم، وخافوني بالإقبال على طاعتي إن كنتم مصدِّقين بي، ومتبعين رسولي.",
        "char_start": 0,
        "char_end": 169,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_025_chunk00",
        "verse_key": "4:25",
        "text_ar": "ومن لا قدرة له على مهور الحرائر المؤمنات، فله أن ينكح غيرهن، من فتياتكم المؤمنات المملوكات. والله تعالى هو العليم بحقيقة إيمانكم، بعضكم من بعض، فتزوجوهن بموافقة أهلهن، وأعطوهن مهورهن على ما تراضيتم به عن طيب نفس منكم، متعففات عن الحرام، غير مجاهرات بالزنى، ولا مسرات به باتخاذ أخلاء، فإذا تزوجن وأتين بفاحشة الزنى فعليهن من الحدِّ -وهو الجَلْدُ لا الرَّجْمُ- نصف ما على الحرائر. ذلك الذي أبيح مِن نكاح الإماء بالصفة المتقدمة إنما أبيح لمن خاف على نفسه الوقوع في الزنى، وشق عليه الصبر عن الجماع، والصب",
        "char_start": 0,
        "char_end": 616,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_077_chunk00",
        "verse_key": "4:77",
        "text_ar": "الم تعلم -ايها الرسول- امر اوليك الذين قيل لهم قبل الاذن بالجهاد: امنعوا ايديكم عن قتال اعدايكم من المشركين، وعليكم اداء ما فرضه الله عليكم من الصلاه، والزكاه، فلما فرض عليهم القتال اذا جماعه منهم قد تغير حالهم، فاصبحوا يخافون الناس ويرهبونهم، كخوفهم من الله او اشد، ويعلنون عما اعتراهم من شده الخوف، فيقولون: ربنا لِمَ اَوْجَبْتَ علينا القتال؟ هلا امهلتنا الي وقت قريب، رغبه منهم في متاع الحياه الدنيا، قل لهم -ايها الرسول-: متاع الدنيا قليل، والاخره وما فيها اعظم وابقي لمن اتقي، فعمل بما اُمر به، ",
        "char_start": 0,
        "char_end": 594,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_083_chunk00",
        "verse_key": "4:83",
        "text_ar": "وإذا جاء هؤلاء الذين لم يستقر الإيمان في قلوبهم أمْرٌ يجب كتمانه متعلقًا بالأمن الذي يعود خيره على الإسلام والمسلمين، أو بالخوف الذي يلقي في قلوبهم عدم الاطمئنان، أفشوه وأذاعوا به في الناس، ولو ردَّ هؤلاء ما جاءهم إلى رسول الله صلى الله عليه وسلم وإلى أهل العلم والفقه لَعَلِمَ حقيقة معناه أهل الاستنباط منهم. ولولا أنْ تَفَضَّلَ الله عليكم ورحمكم لاتبعتم الشيطان ووساوسه إلا قليلا منكم.",
        "char_start": 0,
        "char_end": 387,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_023_chunk00",
        "verse_key": "5:23",
        "text_ar": "قال رجلان من الذين يخشون الله تعالي، انعم الله عليهما بطاعته وطاعه نبيِّه، لبني اسراييل: ادخلوا علي هولاء الجبارين باب مدينتهم، اخْذًا بالاسباب، فاذا دخلتم الباب غلبتموهم، وعلي الله وحده فتوكَّلوا، ان كنتم مُصدِّقين رسوله فيما جاءكم به، عاملين بشرعه.",
        "char_start": 0,
        "char_end": 250,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_052_chunk00",
        "verse_key": "5:52",
        "text_ar": "يخبر الله تعالي عن جماعه من المنافقين انهم كانوا يبادرون في مواده اليهود لما في قلوبهم من الشكِّ والنفاق، ويقولون: انما نوادُّهم خشيه ان يظفروا بالمسلمين فيصيبونا معهم، قال الله تعالي ذكره: فعسي الله ان ياتي بالفتح -اي فتح «مكه» - وينصر نَبِيَّه، ويُظْهِر الاسلام والمسلمين علي الكفار، او يُهيِّي من الامور ما تذهب به قوهُ اليهود والنَّصاري، فيخضعوا للمسلمين، فحينيذٍ يندم المنافقون علي ما اضمروا في انفسهم من موالاتهم.",
        "char_start": 0,
        "char_end": 419,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_054_chunk00",
        "verse_key": "5:54",
        "text_ar": "يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه من يرجع منكم عن دينه، ويستبدل به اليهودية أو النصرانية أو غير ذلك، فلن يضرُّوا الله شيئًا، وسوف يأتي الله بقوم خير منهم يُحِبُّهم ويحبونه، رحماء بالمؤمنين أشدَّاء على الكافرين، يجاهدون أعداء الله، ولا يخافون في ذات الله أحدًا. ذلك الإنعام مِن فضل الله يؤتيه من أراد، والله واسع الفضل، عليم بمن يستحقه من عباده.",
        "char_start": 0,
        "char_end": 357,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "ان الذين امنوا (وهم المسلمون) واليهود، -والصابيون كذلك (وهم قوم باقون علي فطرتهم، ولا دين مقرر لهم يتبعونه) - والنصاري (وهم اتباع المسيح) من امن منهم بالله الايمان الكامل، وهو توحيد الله والتصديق بمحمد صلي الله عليه وسلم وبما جاء به، وامن باليوم الاخر، وعمل العمل الصالح، فلا خوف عليهم من اهوال يوم القيامه، ولا هم يحزنون علي ما تركوه وراءهم في الدنيا.",
        "char_start": 0,
        "char_end": 352,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "وما نرسل رسلنا إلا مبشرين أهل طاعتنا بالنعيم المقيم، ومنذرين أهل المعصية بالعذاب الأليم، فمن آمن وصدَّق الرسل وعمل صالحًا فأولئك لا يخافون عند لقاء ربهم، ولا يحزنون على شيء فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 194,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_006_051_chunk00",
        "verse_key": "6:51",
        "text_ar": "وخوِّف -أيها النبي- بالقرآن الذين يعلمون أنهم يُحشرون إلى ربهم، فهم مصدِّقون بوعد الله ووعيده، ليس لهم غير الله وليّ ينصرهم، ولا شفيع يشفع لهم عنده تعالى، فيخلصهم من عذابه; لعلهم يتقون الله تعالى بفعل الأوامر واجتناب النواهي.",
        "char_start": 0,
        "char_end": 225,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "يا بني آدم إذا جاءكم رسلي من أقوامكم، يتلون عليكم آيات كتابي، ويبينون لكم البراهين على صدق ما جاؤوكم به فأطيعوهم، فإنه من اتقى سخطي وأصلح عمله فلا خوف عليهم يوم القيامة من عقاب الله تعالى، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا.",
        "char_start": 0,
        "char_end": 231,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "قوله تعالى قلنا اهبطوا منها جميعا فإما يأتينكم مني هدى فمن تبع هداي فلا خوف عليهم ولا هم يحزنونقوله تعالى : قلنا اهبطوا كرر الأمر على جهة التغليظ وتأكيده ، كما تقول لرجل : قم قم . وقيل : كرر الأمر لما علق بكل أمر منهما حكما غير حكم الآخر فعلق بالأول العداوة وبالثاني إتيان الهدى . وقيل : الهبوط الأول من الجنة إلى السماء والثاني من السماء إلى الأرض ، وعلى هذا يكون فيه دليل على أن الجنة في السماء السابعة كما دل عليه حديث الإسراء على ما يأتي .\" جميعا \" نصب على الحال وقال وهب بن منبه : لما هبط آدم عل",
        "char_start": 0,
        "char_end": 3383,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "قوله تعالى : إن الذين آمنوا والذين هادوا والنصارى والصابئين من آمن بالله واليوم الآخر وعمل صالحا فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنونفيه ثماني مسائل : الأولى : قوله تعالى : إن الذين آمنوا أي : صدقوا بمحمد صلى الله عليه وسلم . وقال سفيان : المراد المنافقون . كأنه قال : الذين آمنوا في ظاهر أمرهم ، فلذلك قرنهم باليهود والنصارى والصابئين ، ثم بين حكم من آمن بالله واليوم الآخر من جميعهم .الثانية : قوله تعالى : والذين هادوا معناه صاروا يهودا ، نسبوا إلى يهوذا وهو أكبر ولد يعقوب عليه السلام ",
        "char_start": 0,
        "char_end": 5066,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_074_chunk00",
        "verse_key": "2:74",
        "text_ar": "قوله تعالى : ثم قست قلوبكم من بعد ذلك فهي كالحجارة أو أشد قسوة وإن من الحجارة لما يتفجر منه الأنهار وإن منها لما يشقق فيخرج منه الماء وإن منها لما يهبط من خشية الله وما الله بغافل عما تعملونقوله تعالى : ثم قست قلوبكم من بعد ذلك القسوة : الصلابة والشدة واليبس وهي عبارة عن خلوها من الإنابة والإذعان لآيات الله تعالى . قال أبو العالية وقتادة وغيرهما : المراد قلوب جميع بني إسرائيل . وقال ابن عباس : المراد قلوب ورثة القتيل ؛ لأنهم حين حيي وأخبر بقاتله وعاد إلى موته أنكروا قتله ، وقالوا : كذب ، بعد ما ",
        "char_start": 0,
        "char_end": 5285,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "ثم قال تعالى : بلى ردا عليهم وتكذيبا لهم ، أي ليس كما تقولون . وقيل : إن بلى محمولة على المعنى ، كأنه قيل أما يدخل الجنة أحد ؟ فقيل : بلى من أسلم وجهه لله ومعنى أسلم استسلم وخضع . وقيل : أخلص عمله . وخص الوجه بالذكر لكونه أشرف ما يرى من الإنسان ; ولأنه موضع الحواس ، وفيه يظهر العز والذل . والعرب تخبر بالوجه عن جملة الشيء . ويصح أن يكون الوجه في هذه الآية المقصد . وهو محسن جملة في موضع الحال ، وعاد الضمير في وجهه وله على لفظ من وكذلك أجره وعاد في عليهم على المعنى ، وكذلك في يحزنون وقد تقدم .",
        "char_start": 0,
        "char_end": 495,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_155_chunk00",
        "verse_key": "2:155",
        "text_ar": "قوله تعالى : ولنبلونكم بشيء من الخوف والجوع ونقص من الأموال والأنفس والثمرات وبشر الصابرينقوله تعالى : \" ولنبلونكم \" هذه الواو مفتوحة عند سيبويه لالتقاء الساكنين . وقال غيره : لما ضمت إلى النون الثقيلة بني الفعل فصار بمنزلة خمسة عشر . والبلاء يكون حسنا ويكون سيئا . وأصله المحنة ، وقد تقدم . والمعنى لأمتحننكم لنعلم المجاهد والصابر علم معاينة حتى يقع عليه الجزاء ، كما تقدم . وقيل : إنما ابتلوا بهذا ليكون آية لمن بعدهم فيعلموا أنهم إنما صبروا على هذا حين وضح لهم الحق . وقيل : أعلمهم بهذا ليكونوا عل",
        "char_start": 0,
        "char_end": 2465,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "قوله تعالى : الذين ينفقون أموالهم في سبيل الله ثم لا يتبعون ما أنفقوا منا ولا أذى لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنونفيه ثلاث مسائل :الأولى : قوله تعالى : الذين ينفقون أموالهم في سبيل الله قيل : إنها نزلت في عثمان بن عفان رضي الله عنه . قال عبد الرحمن بن سمرة : جاء عثمان بألف دينار في جيش العسرة فصبها في حجر رسول الله صلى الله عليه وسلم فرأيته يدخل يده فيها ويقلبها ويقول : ما ضر ابن عفان ما عمل بعد اليوم اللهم لا تنس هذا اليوم لعثمان . وقال أبو سعيد الخدري : رأيت النبي صلى الله عليه و",
        "char_start": 0,
        "char_end": 3820,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون فيه مسألة واحدة روي عن ابن عباس وأبي ذر وأبي أمامة وأبي الدرداء وعبد الله بن بشر الغافقي والأوزاعي أنها نزلت في علف الخيل المربوطة في سبيل الله . وذكر ابن سعد في الطبقات قال : أخبرت عن محمد بن شعيب بن شابور قال : أنبأنا سعيد بن سنان عن يزيد بن عبد الله بن عريب عن أبيه عن جده عريب أن رسول الله صلى الله عليه وسلم سئل عن قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم",
        "char_start": 0,
        "char_end": 1206,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "وقد تقدم القول في قوله تعالى : إن الذين آمنوا وعملوا الصالحات وأقاموا الصلاة وآتوا الزكاة وخص الصلاة والزكاة بالذكر وقد تضمنها عمل الصالحات تشريفا لهما وتنبيها على قدرهما إذ هما رأس الأعمال ؛ الصلاة في أعمال البدن ، والزكاة في أعمال المال .",
        "char_start": 0,
        "char_end": 240,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "و فرحين نصب في موضع الحال من [ ص: 259 ] المضمر في يرزقون . ويجوز في الكلام \" فرحون \" على النعت لأحياء . وهو من الفرح بمعنى السرور . والفضل في هذه الآية هو النعيم المذكور . وقرأ ابن السميقع \" فارحين \" بالألف وهما لغتان ، كالفره والفاره ، والحذر والحاذر ، والطمع والطامع ، والبخل والباخل . قال النحاس : ويجوز في غير القرآن رفعه ، يكون نعتا لأحياء .قوله تعالى : ويستبشرون بالذين لم يلحقوا بهم من خلفهم المعنى لم يلحقوا بهم في الفضل ، وإن كان لهم فضل . وأصله من البشرة ; لأن الإنسان إذا فرح ظهر أثر السرو",
        "char_start": 0,
        "char_end": 1129,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_175_chunk00",
        "verse_key": "3:175",
        "text_ar": "قوله تعالى : إنما ذلكم الشيطان يخوف أولياءه فلا تخافوهم وخافون إن كنتم مؤمنينقال ابن عباس وغيره : المعنى يخوفكم أولياءه ; أي بأوليائه ، أو من أوليائه ; فحذف حرف الجر ووصل الفعل إلى الاسم فنصب . كما قال تعالى : لينذر بأسا شديدا أي لينذركم ببأس شديد ; أي يخوف المؤمن بالكافر . وقال الحسن والسدي : المعنى يخوف أولياءه المنافقين ; ليقعدوا عن قتال المشركين . فأما أولياء الله فإنهم لا يخافونه إذا خوفهم . وقد قيل : إن المراد هذا الذي يخوفكم بجمع الكفار شيطان من شياطين الإنس ; إما نعيم بن مسعود أو غيره ، ",
        "char_start": 0,
        "char_end": 2266,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_025_chunk00",
        "verse_key": "4:25",
        "text_ar": "قوله : ومن لم يستطع منكم طولا أن ينكح المحصنات المؤمنات فمن ما ملكت أيمانكم من فتياتكم المؤمنات والله أعلم بإيمانكم بعضكم من بعض فانكحوهن بإذن أهلهن وآتوهن أجورهن بالمعروف محصنات غير مسافحات ولا متخذات أخدان فإذا أحصن فإن أتين بفاحشة فعليهن نصف ما على المحصنات من العذاب ذلك لمن خشي العنت منكم وأن تصبروا خير لكم والله غفور رحيمفيه إحدى وعشرون مسألة :الأولى : قوله تعالى : ومن لم يستطع منكم طولا الآية نبه تعالى على تخفيف في النكاح وهو نكاح الأمة لمن لم يجد الطول . واختلف العلماء في معنى الطول على ث",
        "char_start": 0,
        "char_end": 19832,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_077_chunk00",
        "verse_key": "4:77",
        "text_ar": "قوله تعالى : ألم تر إلى الذين قيل لهم كفوا أيديكم وأقيموا الصلاة وآتوا الزكاة فلما كتب عليهم القتال إذا فريق منهم يخشون الناس كخشية الله أو أشد خشية وقالوا ربنا لم كتبت علينا القتال لولا أخرتنا إلى أجل قريب قل متاع الدنيا قليل والآخرة خير لمن اتقى ولا تظلمون فتيلا روى عمرو بن دينار عن عكرمة عن ابن عباس أن عبد الرحمن بن عوف وأصحابا له أتوا النبي صلى الله عليه وسلم بمكة فقالوا : يا نبي الله ، كنا في عز ونحن مشركون ، فلما آمنا صرنا أذلة ؟ فقال : إني أمرت بالعفو فلا تقاتلوا القوم . فلما حوله الله تع",
        "char_start": 0,
        "char_end": 1827,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_083_chunk00",
        "verse_key": "4:83",
        "text_ar": "قوله تعالى : وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به ولو ردوه إلى الرسول وإلى أولي الأمر منهم لعلمه الذين يستنبطونه منهم ولولا فضل الله عليكم ورحمته لاتبعتم الشيطان إلا قليلا[ ص: 251 ] قوله تعالى : وإذا جاءهم أمر من الأمن في إذا معنى الشرط ولا يجازى بها وإن زيدت عليها \" ما \" وهي قليلة الاستعمال . قال سيبويه . والجيد ما قال كعب بن زهير :وإذا ما تشاء تبعث منها مغرب الشمس ناشطا مذعورايعني أن الجيد لا يجزم بإذا ما كما لم يجزم في هذا البيت ، وقد تقدم في أول \" البقرة \" .والمعنى أنهم إذا سمعوا شيئا ",
        "char_start": 0,
        "char_end": 2625,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_023_chunk00",
        "verse_key": "5:23",
        "text_ar": "قوله تعالى : قال رجلان من الذين يخافون قال ابن عباس وغيره : هما يوشع وكالب بن يوقنا ويقال ابن قانيا ، وكانا من الاثني عشر نقيبا . ويخافون أي : من الجبارين . قتادة : يخافون الله تعالى ، وقال الضحاك : هما رجلان كانا في مدينة الجبارين على دين موسى ; فمعنى يخافون على هذا أي : من العمالقة من حيث الطبع لئلا يطلعوا على إيمانهم فيفتنوهم ولكن وثقا بالله ، وقيل : يخافون ضعف بني إسرائيل وجبنهم ، وقرأ مجاهد وابن جبير \" يخافون \" بضم الياء ، وهذا يقوي أنهما من غير قوم موسى . أنعم الله عليهما أي : بالإسلام أو ",
        "char_start": 0,
        "char_end": 937,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_052_chunk00",
        "verse_key": "5:52",
        "text_ar": "قوله تعالى : فترى الذين في قلوبهم مرض يسارعون فيهم يقولون نخشى أن تصيبنا دائرة فعسى الله أن يأتي بالفتح أو أمر من عنده فيصبحوا على ما أسروا في أنفسهم نادمينقوله تعالى : فترى الذين في قلوبهم مرض شك ونفاق ، وقد تقدم في \" البقرة \" والمراد ابن أبي وأصحابه يسارعون فيهم أي : في موالاتهم ومعاونتهم . يقولون نخشى أن تصيبنا دائرة أي : يدور الدهر علينا إما بقحط فلا يميزوننا ولا يفضلوا علينا ، وإما أن يظفر اليهود بالمسلمين فلا يدوم الأمر لمحمد صلى الله عليه وسلم ، وهذا القول أشبه بالمعنى ; كأنه من دارت تدور",
        "char_start": 0,
        "char_end": 1205,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_054_chunk00",
        "verse_key": "5:54",
        "text_ar": "قوله : ياأيها الذين آمنوا من يرتد منكم عن دينه فسوف يأتي الله بقوم يحبهم ويحبونه أذلة على المؤمنين أعزة على الكافرين يجاهدون في سبيل الله ولا يخافون لومة لائم ذلك فضل الله يؤتيه من يشاء والله واسع عليم[ ص: 160 ] فيه أربع مسائل :الأولى : قوله تعالى : من يرتد منكم عن دينه شرط وجوابه فسوف ، وقراءة أهل المدينة والشام \" من يرتدد \" بدالين . الباقون \" من يرتد \" . وهذا من إعجاز القرآن والنبي صلى الله عليه وسلم : إذ أخبر عن ارتدادهم ولم يكن ذلك في عهده وكان ذلك غيبا ، فكان على ما أخبر بعد مدة ، وأهل الرد",
        "char_start": 0,
        "char_end": 2719,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "قوله تعالى : إن الذين آمنوا والذين هادوا والصابئون والنصارى من آمن بالله واليوم الآخر وعمل صالحا فلا خوف عليهم ولا هم يحزنونتقدم الكلام في هذا كله فلا معنى لإعادته . والذين هادوا معطوف ، وكذا والصابئون معطوف على المضمر في هادوا في قول الكسائي والأخفش . قال النحاس : سمعت الزجاج يقول : وقد ذكر له قول الأخفش والكسائي : هذا خطأ من جهتين ; إحداهما أن المضمر المرفوع يقبح العطف عليه حتى يؤكد . والجهة الأخرى أن المعطوف [ ص: 182 ] شريك المعطوف عليه فيصير المعنى أن الصابئين قد دخلوا في اليهودية وهذا محال ",
        "char_start": 0,
        "char_end": 1393,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "قوله تعالى : وما نرسل المرسلين إلا مبشرين ومنذرين فمن آمن وأصلح فلا خوف عليهم ولا هم يحزنون .قوله تعالى : وما نرسل المرسلين إلا مبشرين ومنذرين أي : بالترغيب والترهيب . قال الحسن : مبشرين بسعة الرزق في الدنيا والثواب في الآخرة ; يدل على ذلك قوله تعالى : ولو أن أهل القرى آمنوا واتقوا لفتحنا عليهم بركات من السماء والأرض . ومعنى منذرين مخوفين عقاب الله ; فالمعنى : إنما أرسلنا المرسلين لهذا لا لما يقترح عليهم من الآيات ، وإنما يأتون من الآيات بما تظهر معه براهينهم وصدقهم . فمن آمن وأصلح فلا خوف عليهم",
        "char_start": 0,
        "char_end": 531,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_006_051_chunk00",
        "verse_key": "6:51",
        "text_ar": "قوله تعالى : وأنذر به الذين يخافون أن يحشروا إلى ربهم ليس لهم من دونه ولي ولا شفيع لعلهم يتقون قوله تعالى : وأنذر به أي : بالقرآن . والإنذار الإعلام وقد تقدم في البقرة وقيل : به أي : بالله . وقيل : باليوم الآخر . وخص الذين يخافون أن يحشروا لأن الحجة عليهم أوجب ، فهم خائفون من عذابه ، لا أنهم يترددون في الحشر ; فالمعنى يخافون يتوقعون عذاب الحشر . وقيل : يخافون يعلمون ، فإن كان مسلما أنذر ليترك المعاصي ، وإن كان من أهل الكتاب أنذر ليتبع الحق . وقال الحسن : المراد المؤمنون . قال الزجاج : كل من أقر ",
        "char_start": 0,
        "char_end": 1067,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "قوله : يابني آدم إما يأتينكم رسل منكم يقصون عليكم آياتي فمن اتقى وأصلح فلا خوف عليهم ولا هم يحزنون والذين كذبوا بآياتنا واستكبروا عنها أولئك أصحاب النار هم فيها خالدونقوله تعالى يابني آدم إما يأتينكم رسل منكم شرط . ودخلت النون توكيدا لدخول ما . وقيل : \" ما \" صلة ، أي إن يأتكم . أخبر أنه يرسل إليهم الرسل منهم لتكون إجابتهم أقرب . والقصص إتباع الحديث بعضه بعضا .آياتي أي فرائضي وأحكامي .فمن اتقى وأصلح شرط وما بعده جوابه ، وهو جواب الأول . أي وأصلح منكم ما بيني وبينه .فلا خوف عليهم ولا هم يحزنون دلي",
        "char_start": 0,
        "char_end": 730,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "كرر الاهباط, ليرتب عليه ما ذكر وهو قوله: { فَاِمَّا يَاْتِيَنَّكُمْ مِنِّي هُدًي } اي: ايَّ وقت وزمان جاءكم مني -يا معشر الثقلين- هدي, اي: رسول وكتاب يهديكم لما يقربكم مني, ويدنيكم مني; ويدنيكم من رضايي، { فمن تبع هداي } منكم, بان امن برسلي وكتبي, واهتدي بهم, وذلك بتصديق جميع اخبار الرسل والكتب, والامتثال للامر والاجتناب للنهي، { فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ } وفي الايه الاخري: { فَمَنِ اتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشْقَي } فرتب علي اتباع هداه اربعه اشياء: نفي الخوف وا",
        "char_start": 0,
        "char_end": 936,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "ثم قال تعالي حاكما بين الفرق الكتابيه: { اِنَّ الَّذِينَ امَنُوا وَالَّذِينَ هَادُوا وَالنَّصَارَي وَالصَّابِيِينَ مَنْ امَنَ بِاللَّهِ وَالْيَوْمِ الْاخِرِ وَعَمِلَ صَالِحًا فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ } وهذا الحكم علي اهل الكتاب خاصه, لان الصابيين, الصحيح انهم من جمله فرق النصاري، فاخبر الله ان المومنين من هذه الامه, واليهود والنصاري, والصابيين من امن بالله واليوم الاخر, وصدقوا رسلهم, فان لهم الاجر العظيم والامن, ولا خوف عليهم ولا هم يحزن",
        "char_start": 0,
        "char_end": 1256,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_074_chunk00",
        "verse_key": "2:74",
        "text_ar": "{ ثُمَّ قَسَتْ قُلُوبُكُمْ } اي: اشتدت وغلظت, فلم توثر فيها الموعظه، { مِنْ بَعْدِ ذَلِكَ } اي: من بعد ما انعم عليكم بالنعم العظيمه واراكم الايات، ولم يكن ينبغي ان تقسو قلوبكم, لان ما شاهدتم, مما يوجب رقه القلب وانقياده، ثم وصف قسوتها بانها { كَالْحِجَارَهِ } التي هي اشد قسوه من الحديد، لان الحديد والرصاص اذا اذيب في النار, ذاب بخلاف الاحجار. وقوله: { اَوْ اَشَدُّ قَسْوَهً } اي: انها لا تقصر عن قساوه الاحجار، وليست \\\" او \\\" بمعني \\\" بل \\\" ثم ذكر فضيله الاحجار علي قلوبهم، فقال: { وَاِنَّ مِنَ الْ",
        "char_start": 0,
        "char_end": 1636,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "واخبر ان من قدح في النسخ فقد قدح في ملكه وقدرته فقال: الم تعلم ان الله علي كل شيء قدير .",
        "char_start": 0,
        "char_end": 88,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_155_chunk00",
        "verse_key": "2:155",
        "text_ar": "اخبر تعالي انه لا بد ان يبتلي عباده بالمحن, ليتبين الصادق من الكاذب, والجازع من الصابر, وهذه سنته تعالي في عباده؛ لان السراء لو استمرت لاهل الايمان, ولم يحصل معها محنه, لحصل الاختلاط الذي هو فساد, وحكمه الله تقتضي تمييز اهل الخير من اهل الشر. هذه فايده المحن, لا ازاله ما مع المومنين من الايمان, ولا ردهم عن دينهم, فما كان الله ليضيع ايمان المومنين، فاخبر في هذه الايه انه سيبتلي عباده { بِشَيْءٍ مِنَ الْخَوْفِ } من الاعداء { وَالْجُوعِ } اي: بشيء يسير منهما؛ لانه لو ابتلاهم بالخوف كله, او الجوع, ل",
        "char_start": 0,
        "char_end": 1638,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "اي: الذين ينفقون اموالهم في طاعه الله وسبيله، ولا يتبعونها بما ينقصها ويفسدها من المن بها علي المنفق عليه بالقلب او باللسان، بان يعدد عليه احسانه ويطلب منه مقابلته، ولا اذيه له قوليه او فعليه، فهولاء لهم اجرهم اللايق بهم ولا خوف عليهم ولا هم يحزنون، فحصل لهم الخير واندفع عنهم الشر لانهم عملوا عملا خالصا لله سالما من المفسدات.",
        "char_start": 0,
        "char_end": 327,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "ثم ذكر حاله المتصدقين في جميع الاوقات علي جميع الاحوال فقال: { الذين ينفقون اموالهم في سبيل الله } اي: طاعته وطريق مرضاته، لا في المحرمات والمكروهات وشهوات انفسهم { بالليل والنهار سرا وعلانيه فلهم اجرهم عند ربهم } اي: اجر عظيم من خير عند الرب الرحيم { ولا خوف عليهم } اذا خاف المقصرون { ولا هم يحزنون } اذا حزن المفرطون، ففازوا بحصول المقصود المطلوب، ونجوا من الشرور والمرهوب،",
        "char_start": 0,
        "char_end": 376,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "لما ذكر اكله الربا وكان من المعلوم انهم لو كانوا مومنين ايمانا ينفعهم لم يصدر منهم ما صدر ذكر حاله المومنين واجرهم، وخاطبهم بالايمان، ونهاهم عن اكل الربا ان كانوا مومنين، وهولاء هم الذين يقبلون موعظه ربهم وينقادون لامره، وامرهم ان يتقوه، ومن جمله تقواه ان يذروا ما بقي من الربا اي: المعاملات الحاضره الموجوده، واما ما سلف، فمن اتعظ عفا الله عنه ما سلف، واما من لم ينزجر بموعظه الله ولم يقبل نصيحته فانه مشاق لربه محارب له، وهو عاجز ضعيف ليس له يدان في محاربه العزيز الحكيم الذي يمهل للظالم ولا يهمله ",
        "char_start": 0,
        "char_end": 681,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "{ فرحين بما اتاهم الله من فضله } اي: مغتبطين بذلك، قد قرت به عيونهم، وفرحت به نفوسهم، وذلك لحسنه وكثرته، وعظمته، وكمال اللذه في الوصول اليه، وعدم المنغص، فجمع الله لهم بين نعيم البدن بالرزق، ونعيم القلب والروح بالفرح بما اتاهم من فضله: فتم لهم النعيم والسرور، وجعلوا { يستبشرون بالذين لم يلحقوا بهم من خلفهم } اي: يبشر بعضهم بعضا، بوصول اخوانهم الذين لم يلحقوا بهم، وانهم سينالون ما نالوا، { الا خوف عليهم ولا هم يحزنون } اي: يستبشرون بزوال المحذور عنهم وعن اخوانهم المستلزم كمال السرور",
        "char_start": 0,
        "char_end": 486,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_175_chunk00",
        "verse_key": "3:175",
        "text_ar": "{ انما ذلكم الشيطان يخوف اولياءه } اي: ان ترهيب من رهب من المشركين، وقال: انهم جمعوا لكم، داع من دعاه الشيطان، يخوف اولياءه الذين عدم ايمانهم، او ضعف. { فلا تخافوهم وخافون ان كنتم مومنين } اي: فلا تخافوا المشركين اولياء الشيطان، فان نواصيهم بيد الله، لا يتصرفون الا بقدره، بل خافوا الله الذي ينصر اولياءه الخايفين منه المستجيبين لدعوته. وفي هذه الايه وجوب الخوف من الله وحده، وانه من لوازم الايمان، فعلي قدر ايمان العبد يكون خوفه من الله، والخوف المحمود: ما حجز العبد عن محارم الله.",
        "char_start": 0,
        "char_end": 482,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_025_chunk00",
        "verse_key": "4:25",
        "text_ar": "ثم قال تعالي { وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلًا } الايه. اي: ومن لم يستطع الطول الذي هو المهر لنكاح المحصنات اي: الحراير المومنات وخاف علي نفسه العَنَت اي: الزنا والمشقه الكثيره، فيجوز له نكاح الاماء المملوكات المومنات. وهذا بحسب ما يظهر، والا فالله اعلم بالمومن الصادق من غيره، فامور الدنيا مبنيه علي ظواهر الامور، واحكام الاخره مبنيه علي ما في البواطن. { فَانْكِحُوهُنَّ } اي: المملوكات { بِاِذْنِ اَهْلِهِنَّ } اي: سيدهن واحدا او متعددا. { وَاتُوهُنَّ اُجُورَهُنَّ بِالْمَعْرُوفِ } اي: ولو ",
        "char_start": 0,
        "char_end": 1836,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_077_chunk00",
        "verse_key": "4:77",
        "text_ar": "كان المسلمون -اذ كانوا بمكه- مامورين بالصلاه والزكاه اي: مواساه الفقراء، لا الزكاه المعروفه ذات النصب والشروط، فانها لم تفرض الا بالمدينه، ولم يومروا بجهاد الاعداء لعده فوايد: منها: ان من حكمه الباري تعالي ان يشرع لعباده الشرايع علي وجه لا يشق عليهم؛ ويبدا بالاهم فالاهم، والاسهل فالاسهل. ومنها: انه لو فرض عليهم القتال -مع قله عَدَدِهِم وعُدَدِهِم وكثره اعدايهم- لادي ذلك الي اضمحلال الاسلام، فروعي جانب المصلحه العظمي علي ما دونها ولغير ذلك من الحِكَم. وكان بعض المومنين يودون ان لو فرض عليهم القتا",
        "char_start": 0,
        "char_end": 2674,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_083_chunk00",
        "verse_key": "4:83",
        "text_ar": "هذا تاديب من الله لعباده عن فعلهم هذا غير اللايق. وانه ينبغي لهم اذا جاءهم امر من الامور المهمه والمصالح العامه ما يتعلق بالامن وسرور المومنين، او بالخوف الذي فيه مصيبه عليهم ان يتثبتوا ولا يستعجلوا باشاعه ذلك الخبر، بل يردونه الي الرسول والي اولي الامر منهم، اهلِ الراي: والعلم والنصح والعقل والرزانه، الذين يعرفون الامور ويعرفون المصالح وضدها. فان راوا في اذاعته مصلحه ونشاطا للمومنين وسرورا لهم وتحرزا من اعدايهم فعلوا ذلك. وان راوا انه ليس فيه مصلحه او فيه مصلحه ولكن مضرته تزيد علي مصلحته، لم يذ",
        "char_start": 0,
        "char_end": 1266,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_023_chunk00",
        "verse_key": "5:23",
        "text_ar": "{ قَالَ رَجُلَانِ مِنَ الَّذِينَ يَخَافُونَ } الله تعالي، مشجعين لقومهم، منهضين لهم علي قتال عدوهم واحتلال بلادهم. { اَنْعَمَ اللَّهُ عَلَيْهِمَا } بالتوفيق، وكلمه الحق في هذا الموطن المحتاج الي مثل كلامهم، وانعم عليهم بالصبر واليقين. { ادْخُلُوا عَلَيْهِمُ الْبَابَ فَاِذَا دَخَلْتُمُوهُ فَاِنَّكُمْ غَالِبُونَ } اي: ليس بينكم وبين نصركم عليهم الا ان تجزموا عليهم، وتدخلوا عليهم الباب، فاذا دخلتموه عليهم فانهم سينهزمون، ثم امَرَاهم بعده هي اقوي العدد، فقالا: { وَعَلَي اللَّهِ فَتَوَكَّلُوا اِن كُن",
        "char_start": 0,
        "char_end": 661,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_052_chunk00",
        "verse_key": "5:52",
        "text_ar": "ولما نهي الله المومنين عن توليهم، اخبر ان ممن يدعي الايمان طايفهً تواليهم، فقال: { فَتَرَي الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ ْ} اي: شك ونفاق، وضعف ايمان، يقولون: ان تولينا اياهم للحاجه، فاننا { نَخْشَي اَن تُصِيبَنَا دَايِرَهٌ ْ} اي: تكون الدايره لليهود والنصاري، فاذا كانت الدايره لهم، فاذا لنا معهم يد يكافوننا عنها، وهذا سوء ظن منهم بالاسلام، قال تعالي -رادا لظنهم السيي-: { فَعَسَي اللَّهُ اَن يَاْتِيَ بِالْفَتْحِ ْ} الذي يعز الله به الاسلام علي اليهود والنصاري، ويقهرهم المسلمون { اَوْ اَمْرٍ مِ",
        "char_start": 0,
        "char_end": 797,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_054_chunk00",
        "verse_key": "5:54",
        "text_ar": "يخبر تعالي انه الغني عن العالمين، وانه من يرتد عن دينه فلن يضر الله شييا، وانما يضر نفسه. وان لله عبادا مخلصين، ورجالا صادقين، قد تكفل الرحمن الرحيم بهدايتهم، ووعد بالاتيان بهم، وانهم اكمل الخلق اوصافا، واقواهم نفوسا، واحسنهم اخلاقا، اجلُّ صفاتهم ان الله { يُحِبُّهُمْ وَيُحِبُّونَهُ ْ} فان محبه الله للعبد هي اجل نعمه انعم بها عليه، وافضل فضيله، تفضل الله بها عليه، واذا احب الله عبدا يسر له الاسباب، وهون عليه كل عسير، ووفقه لفعل الخيرات وترك المنكرات، واقبل بقلوب عباده اليه بالمحبه والوداد. ومن ل",
        "char_start": 0,
        "char_end": 3069,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "يخبر تعالي عن اهل الكتب من اهل القران والتوراه والانجيل، ان سعادتهم ونجاتهم في طريق واحد، واصل واحد، وهو الايمان بالله واليوم الاخر [والعمل الصالح] فمن امن منهم بالله واليوم الاخر، فله النجاه، ولا خوف عليهم فيما يستقبلونه من الامور المخوفه، ولا هم يحزنون علي ما خلفوا منها. وهذا الحكم المذكور يشمل ساير الازمنه.",
        "char_start": 0,
        "char_end": 311,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "يذكر تعالي، زبده ما ارسل به المرسلين؛ انه البشاره والنذاره، وذلك مستلزم لبيان المبشر والمبشر به، والاعمال التي اذا عملها العبد، حصلت له البشاره. والمنذر والمنذر به، والاعمال التي من عملها، حقت عليه النذاره. ولكن الناس انقسموا -بحسب اجابتهم لدعوتهم وعدمها - الي قسمين: { فَمَنْ امَنَ وَاَصْلَحَ } اي: امن بالله وملايكته، وكتبه، ورسله واليوم الاخر، واصلح ايمانه واعماله ونيته { فَلَا خَوْفٌ عَلَيْهِمْ } فيما يستقبل { وَلَا هُمْ يَحْزَنُونَ } علي ما مضي.",
        "char_start": 0,
        "char_end": 452,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_006_051_chunk00",
        "verse_key": "6:51",
        "text_ar": "هذا القران نذاره للخلق كلهم، ولكن انما ينتفع به { الَّذِينَ يَخَافُونَ اَنْ يُحْشَرُوا اِلَي رَبِّهِمْ } فهم متيقنون للانتقال، من هذه الدار، الي دار القرار، فلذلك يستصحبون ما ينفعهم ويدَعُون ما يضرهم. { لَيْسَ لَهُمْ مِنْ دُونِهِ } اي: لا من دون الله { وَلِيٌّ وَلَا شَفِيعٌ } اي: من يتولي امرهم فيحصّل لهم المطلوب، ويدفع عنهم المحذور، ولا من يشفع لهم، لان الخلق كلهم، ليس لهم من الامر شيء. { لَعَلَّهُمْ يَتَّقُونَ } الله، بامتثال اوامره، واجتناب نواهيه، فان الانذار موجب لذلك، وسبب من اسبابه.",
        "char_start": 0,
        "char_end": 494,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "لما اخرج اللّه بني ادم من الجنه، ابتلاهم بارسال الرسل وانزال الكتب عليهم يقصون عليهم ايات اللّه ويبينون لهم احكامه، ثم ذكر فضل من استجاب لهم، وخسار من لم يستجب لهم فقال: { فَمَنِ اتَّقَي } ما حرم اللّه، من الشرك والكباير والصغاير، { وَاَصْلَحَ } اعماله الظاهره والباطنه { فَلَا خَوْفٌ عَلَيْهِمْ } من الشر الذي قد يخافه غيرهم { وَلَا هُمْ يَحْزَنُونَ } علي ما مضي، واذا انتفي الخوف والحزن حصل الامن التام، والسعاده، والفلاح الابدي.",
        "char_start": 0,
        "char_end": 431,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_038_chunk00",
        "verse_key": "2:38",
        "text_ar": "القول في تاويل قوله تعالي: قُلْنَا اهْبِطُوا مِنْهَا جَمِيعًاقال ابو جعفر: وقد ذكرنا القول في تاويل قوله: \" قلنا اهبطوا منها جميعًا \" فيما مضي، (1) فلا حاجه بنا الي اعادته، اذْ كان معناه في هذا الموضع، هو معناه في ذلك الموضع.793- وقد حدثني يعقوب بن ابراهيم قال: حدثنا هشيم، قال: اخبرنا اسماعيل بن سالم، عن ابي صالح، في قوله : \" اهبطوا منها جميعًا \"، قال: ادم وحواء والحيه وابليس. (2)القول في تاويل قوله تعالي ذكره: فَاِمَّا يَاْتِيَنَّكُمْ مِنِّي هُدًيقال ابو جعفر: وتاويل قوله: \" فاما ياتينكم \"، فان",
        "char_start": 0,
        "char_end": 5554,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_062_chunk00",
        "verse_key": "2:62",
        "text_ar": "القول في تاويل قوله تعالي : اِنَّ الَّذِينَ امَنُوا وَالَّذِينَ هَادُواقال ابو جعفر: اما \" الذين امنوا \"، فهم المصدقون رسول الله فيما اتاهم به من الحق من عند الله, وايمانهم بذلك، تصديقهم به - علي ما قد بيناه فيما مضي من كتابنا هذا. (1)* * *واما \" الذين هادوا \", فهم اليهود. ومعني: \" هادوا \"، تابوا. يقال منه: \" هاد القوم يهودون هودا وهاده \" . (2) وقيل: انما سميت اليهود \" يهود \"، من اجل قولهم: اِنَّا هُدْنَا اِلَيْكَ . [سوره الاعراف: 156].1094 - حدثنا القاسم قال، حدثنا الحسين قال، حدثني حجاج, عن اب",
        "char_start": 0,
        "char_end": 18756,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_074_chunk00",
        "verse_key": "2:74",
        "text_ar": "القول في تاويل قوله تعالي : ثُمَّ قَسَتْ قُلُوبُكُمْ مِنْ بَعْدِ ذَلِكَقال ابو جعفر: يعني بذلك كفار بني اسراييل, وهم -فيما ذكر- بنو اخي المقتول, فقال لهم: \" ثم قست قلوبكم \": اي جفت وغلظت وعست, كما قال الراجز:وقد قسوت وقسا لداتي (54)يقال: \" قسا \" و \" عسا \" و \" عتا \" بمعني واحد, وذلك اذا جفا وغلظ وصلب. يقال: منه: قسا قلبه يقسو قسوا وقسوه وقساوه وقَساء. (55)* * *ويعني بقوله: (من بعد ذلك)، من بعد ان احيا المقتول لهم الذي - ادارءوا &; 2-234 &; في قتله، فاخبرهم بقاتله، وبالسبب الذي من اجله قتله، (56) ",
        "char_start": 0,
        "char_end": 16244,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_112_chunk00",
        "verse_key": "2:112",
        "text_ar": "بَلَي مَنْ اَسْلَمَ وَجْهَهُ لِلَّهِالْقَوْل فِي تَاْوِيل قَوْله تَعَالَي : { بَلَي مَنْ اَسْلَمَ وَجْهه لِلَّهِ } يَعْنِي بِقَوْلِهِ جَلّ ثَنَاوُهُ : { بَلَي مَنْ اَسْلَمَ } اَنَّهُ لَيْسَ كَمَا قَالَ الزَّاعِمُونَ { لَنْ يَدْخُل الْجَنَّه الَّا مَنْ كَانَ هُودًا اَوْ نَصَارَي } وَلَكِنْ مَنْ اَسْلَمَ وَجْهه لِلَّهِ وَهُوَ مُحْسِن , فَهُوَ الَّذِي يَدْخُلهَا وَيُنَعَّم فِيهَا . كَمَا : 1498 - حَدَّثَنِي مُوسَي , قَالَ : ثنا عَمْرو , قَالَ : ثنا اَسْبَاط , عَنْ السُّدِّيّ , قَالَ : اَخْبَرَهُمْ ",
        "char_start": 0,
        "char_end": 4166,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_155_chunk00",
        "verse_key": "2:155",
        "text_ar": "القول في تاويل قوله تعالي : وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الاَمْوَالِ وَالاَنْفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ (155)قال ابو جعفر: وهذا اخبار من الله تعالي ذكره اتباعَ رَسوله صلي الله عليه وسلم، انه مبتليهم وممتحنهم بشدايد من الامور، ليعلم من يتبع الرسول ممن ينقلب علي عقبيه, كما ابتلاهم فامتحنهم بتحويل القبله من بيت المقدس الي الكعبه, وكما امتحن اصفياءَه قَبلهم. ووَعدهم ذلك في ايه اخري فقال لهم: اَمْ حَسِبْتُمْ اَنْ تَدْخُلُوا الْجَنَّهَ وَلَمَّا ",
        "char_start": 0,
        "char_end": 3674,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "القول في تاويل قوله : الَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ ثُمَّ لا يُتْبِعُونَ مَا اَنْفَقُوا مَنًّا وَلا اَذًي لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (262)قال ابو جعفر: يعني تعالي ذكره بذلك: المعطيَ ماله المجاهدين في سبيل الله معونهً لهم علي جهاد اعداء الله. يقول تعالي ذكره: الذين يعينون المجاهدين في سبيل الله بالانفاق عليهم وفي حَمُولاتهم, وغير ذلك من مونهم, (71) . ثم لم يتْبع نفقته التي انفقها عليهم منًّا عليهم بانفاق ذلك عليهم، ولا",
        "char_start": 0,
        "char_end": 5125,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "القول في تاويل قوله تعالي : الَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلانِيَهً فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (274)[قال ابو جعفر]:..........................................................................................................................................................* * *6232 - حدثنا يعقوب بن ابراهيم، قال: حدثنا معتمر، عن ايمن بن نابل، قال: حدثني شيخ من غافق: ان ابا الدرداء كان ينظر الي الخيل مربوطه",
        "char_start": 0,
        "char_end": 3085,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_277_chunk00",
        "verse_key": "2:277",
        "text_ar": "القول في تاويل قوله تعالي : اِنَّ الَّذِينَ امَنُوا وَعَمِلُوا الصَّالِحَاتِ وَاَقَامُوا الصَّلاهَ وَاتَوُا الزَّكَاهَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (277)قال ابو جعفر: وهذا خبر من الله عز وجل بان الذين امنوا = يعني الذين صدقوا بالله وبرسوله، وبما جاء به من عند ربهم، من تحريم الربا واكله، وغير ذلك من ساير شرايع دينه =\" وعملوا الصالحات \" التي امرهم الله عز وجل بها، والتي نَدَبهم اليها =\" واقاموا الصلاه \" المفروضه بحدودها، وادّوها بسُنَنها =\" واتوا ",
        "char_start": 0,
        "char_end": 1165,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_170_chunk00",
        "verse_key": "3:170",
        "text_ar": "القول في تاويل قوله تعالي : وَيَسْتَبْشِرُونَ بِالَّذِينَ لَمْ يَلْحَقُوا بِهِمْ مِنْ خَلْفِهِمْ اَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (170)قال ابو جعفر: يعني بذلك تعالي ذكره: ويفرحون بمن لم يلحق بهم من اخوانهم الذين فارقوهم وهم احياء في الدنيا علي مناهجهم من جهاد اعداء الله مع رسوله، لعلمهم بانهم ان استشهدوا فلحقوا بهم صاروا من كرامه الله الي مثل الذي صاروا هم اليه، فهم لذلك مستبشرون بهم، فرحون انهم اذا صاروا كذلك &; 7-396 &; =\" لا خوف عليهم ولا هم يحزنون \"، يعني بذلك: (43) لا خوف عليهم،",
        "char_start": 0,
        "char_end": 3298,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_175_chunk00",
        "verse_key": "3:175",
        "text_ar": "القول في تاويل قوله : اِنَّمَا ذَلِكُمُ الشَّيْطَانُ يُخَوِّفُ اَوْلِيَاءَهُقال ابو جعفر: يعني بذلك تعالي ذكره: انما الذي قال لكم، ايها المومنون: اِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ ، فخوفوكم بجموع عدوّكم ومسيرهم اليكم، من فعل الشيطان القاه علي افواه من قال ذلك لكم، يخوفكم باوليايه من المشركين -ابي سفيان واصحابه من قريش- لترهبوهم، وتجبنوا عنهم، كما:-8256 - حدثنا بشر قال، حدثنا يزيد قال، حدثنا سعيد، عن قتاده قوله: \" انما ذلكم الشيطان يخوّف اولياءه \"، يخوف والله المومنَ بالكافر، ويُرهب المومن بالك",
        "char_start": 0,
        "char_end": 3362,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_025_chunk00",
        "verse_key": "4:25",
        "text_ar": "القول في تاويل قوله : اَنْ يَنْكِحَ الْمُحْصَنَاتِ الْمُوْمِنَاتِ فَمِنْ مَا مَلَكَتْ اَيْمَانُكُمْ مِنْ فَتَيَاتِكُمُ الْمُوْمِنَاتِقال ابو جعفر: يعني بذلك: ومن لم يستطع منكم، ايها الناس، طولا = يعني من الاحرار =\" ان ينكح المحصنات \"، وهن الحراير (54) = \" المومنات \" اللواتي قد صدَّقن بتوحيد الله وبما جاء به رسول الله صلي الله عليه وسلم من الحق.* * *وبنحو ما قلنا في\" المحصنات \" قال اهل التاويل.*ذكر من قال ذلك:9062 - حدثني المثني قال، حدثنا عبد الله بن صالح قال، حدثني معاويه بن صالح، عن علي بن ابي",
        "char_start": 0,
        "char_end": 30442,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_077_chunk00",
        "verse_key": "4:77",
        "text_ar": "القول في تاويل قوله : اَلَمْ تَرَ اِلَي الَّذِينَ قِيلَ لَهُمْ كُفُّوا اَيْدِيَكُمْ وَاَقِيمُوا الصَّلاهَ وَاتُوا الزَّكَاهَ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ اِذَا فَرِيقٌ مِنْهُمْ يَخْشَوْنَ النَّاسَ كَخَشْيَهِ اللَّهِ اَوْ اَشَدَّ خَشْيَهً وَقَالُوا رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا الْقِتَالَ لَوْلا اَخَّرْتَنَا اِلَي اَجَلٍ قَرِيبٍقال ابو جعفر: ذكر ان هذه الايه نـزلت في قوم من اصحاب رسول الله صلي الله عليه وسلم كانوا قد امنوا به وصدقوه قبل ان يفرض عليهم الجهاد، وقد فرض عليهم الصلاه والزك",
        "char_start": 0,
        "char_end": 6202,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_083_chunk00",
        "verse_key": "4:83",
        "text_ar": "القول في تاويل قوله : وَاِذَا جَاءَهُمْ اَمْرٌ مِنَ الاَمْنِ اَوِ الْخَوْفِ اَذَاعُوا بِهِقال ابو جعفر: يعني جل ثناوه بقوله: \" واذا جاءهم امر من الامن او الخوف اذاعوا به \"، واذا جاء هذه الطايفه المبيّته غير الذي يقول رسول الله صلي الله عليه وسلم=\" امرٌ من الامن \"، فالهاء والميم في قوله: \" واذا جاءهم \"، من ذكر الطايفه المبيته= يقول جل ثناوه: واذا جاءهم خبرٌ عن سريهٍ للمسلمين غازيه بانهم قد امِنوا من عدوهم بغلبتهم اياهم=\" او الخوف \"، يقول: او تخوّفهم من عدوهم باصابه عدوهم منهم=\" اذاعوا به \"، يقول:",
        "char_start": 0,
        "char_end": 15800,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_023_chunk00",
        "verse_key": "5:23",
        "text_ar": "القول في تاويل قوله جل ثناوه : قَالَ رَجُلانِ مِنَ الَّذِينَ يَخَافُونَ اَنْعَمَ اللَّهُ عَلَيْهِمَاقال ابو جعفر: وهذا خبر من الله عز ذكره عن الرجلين الصَّالحين من قوم موسي: \" يوشع بن نون \" و \" كالب بن يافنا \"، انهما وفَيا لموسي بما عهد اليهما من ترك اعلام قومِه بني اسراييل= الذين امرَهم بدخول الارض المقدسه علي الجبابره من الكنعانيين= بما رايا وعاينا من شدّه بطش الجبابره وعِظم خلقهم، ووصفهما الله عز وجل بانهما ممن يخاف الله ويراقبه في امره ونهيه، كما:-11664 - حدثنا محمد بن بشار قال، حدثنا عبد ال",
        "char_start": 0,
        "char_end": 12457,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_052_chunk00",
        "verse_key": "5:52",
        "text_ar": "القول في تاويل قوله : فَتَرَي الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يُسَارِعُونَ فِيهِمْ يَقُولُونَ نَخْشَي اَنْ تُصِيبَنَا دَايِرَهٌاختلف اهل التاويل فيمن عني بهذه الايه.فقال بعضهم: عني بها عبد الله بن ابي ابن سلول.ذكر من قال ذلك:12166 - حدثنا ابو كريب قال، حدثنا ابن ادريس قال، سمعت ابي، عن عطيه بن سعد: \" فتري الذين في قلوبهم مرض \"، عبد الله بن ابي=\" يسارعون &; 10-403 &; فيهم \"، في ولايتهم=\" يقولون نخشي ان تصيبنا دايره \"، الي اخر الايه: فَيُصْبِحُوا عَلَي مَا اَسَرُّوا فِي اَنْفُسِهِمْ نَادِمِينَ .1",
        "char_start": 0,
        "char_end": 5846,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_054_chunk00",
        "verse_key": "5:54",
        "text_ar": "القول في تاويل قوله : يَا اَيُّهَا الَّذِينَ امَنُوا مَنْ يَرْتَدَّ مِنْكُمْ عَنْ دِينِهِ فَسَوْفَ يَاْتِي اللَّهُ بِقَوْمٍ يُحِبُّهُمْ وَيُحِبُّونَهُقال ابو جعفر: يقول تعالي ذكره للمومنين بالله وبرسوله: \" يا ايها الذين امنوا \"، اي: صدّقوا لله ورسوله، واقرُّوا بما جاءهم به نبيُّهم محمد صلي الله عليه وسلم=\" من يرتد منكم عن دينه \"، يقول: من يرجع منكم عن دينه الحق الذي &; 10-410 &; هو عليه اليوم، فيبدِّله ويغيره بدخوله في الكفر، اما في اليهوديه او النصرانيه او غير ذلك من صنوف الكفر، (33) فلن يضر ال",
        "char_start": 0,
        "char_end": 20972,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_069_chunk00",
        "verse_key": "5:69",
        "text_ar": "القول في تاويل قوله : اِنَّ الَّذِينَ امَنُوا وَالَّذِينَ هَادُوا وَالصَّابِيُونَ وَالنَّصَارَي مَنْ امَنَ بِاللَّهِ وَالْيَوْمِ الاخِرِ وَعَمِلَ صَالِحًا فَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (69)قال ابو جعفر: يقول تعالي ذكره: ان الذين صدّقوا الله ورسوله، وهم اهل الاسلام=\" والذين هادوا \"، وهم اليهود (42) = \" والصابيون \"، وقد بينا امرهم (43) =\" والنصاري من امن منهم بالله واليوم الاخر \"، فصدّق بالبعث بعد الممات=\" وعمل \"، من العمل=\" صالحًا \" لمعاده \" فلا خوف عليهم \"، فيما قَدِموا عليه من اه",
        "char_start": 0,
        "char_end": 1198,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_048_chunk00",
        "verse_key": "6:48",
        "text_ar": "القول في تاويل قوله : وَمَا نُرْسِلُ الْمُرْسَلِينَ اِلا مُبَشِّرِينَ وَمُنْذِرِينَ فَمَنْ امَنَ وَاَصْلَحَ فَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (48)قال ابو جعفر: يقول تعالي ذكره: وما نرسل رسلنا الا ببشاره اهل الطاعه لنا بالجنه والفوز المبين يوم القيامه, جزاءً منَّا لهم علي طاعتنا (14) = وبانذار من عصَانا وخالف امرنا, عقوبتنا اياه علي معصيتنا يوم القيامه, جزاءً منا علي معصيتنا, لنعذر اليه فيهلك ان هلك عن بينه (15) =\" فمن امن واصلح \"، يقول: فمن صدَّق من ارسلنا اليه من رسلنا انذارهم اياه, ",
        "char_start": 0,
        "char_end": 937,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_006_051_chunk00",
        "verse_key": "6:51",
        "text_ar": "القول في تاويل قوله : وَاَنْذِرْ بِهِ الَّذِينَ يَخَافُونَ اَنْ يُحْشَرُوا اِلَي رَبِّهِمْ لَيْسَ لَهُمْ مِنْ دُونِهِ وَلِيٌّ وَلا شَفِيعٌ لَعَلَّهُمْ يَتَّقُونَ (51)قال ابو جعفر: يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم: وانذر، يا محمد، بالقران الذي انـزلناه اليك، القومَ الذين يخافون ان يحشروا الي ربهم، علمًا منهم بان ذلك كاين، فهم مصدقون بوعد الله ووعيده, عاملون بما يرضي الله, دايبون في السعي، (26) فيما ينقذهم في معادهم من عذاب الله (27)=\" ليس لهم من دونه وليّ\" ، اي ليس لهم من عذاب الله ا",
        "char_start": 0,
        "char_end": 1704,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_035_chunk00",
        "verse_key": "7:35",
        "text_ar": "القول في تاويل قوله : يَا بَنِي ادَمَ اِمَّا يَاْتِيَنَّكُمْ رُسُلٌ مِنْكُمْ يَقُصُّونَ عَلَيْكُمْ ايَاتِي فَمَنِ اتَّقَي وَاَصْلَحَ فَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (35)قال ابو جعفر: يقول تعالي ذكره معرِّفًا خلقه ما اعدَّ لحزبه واهل طاعته والايمان به وبرسوله, وما اعدّ لحزب الشيطان واوليايه والكافرين به وبرسله: (يا بني ادم اما ياتينكم رسل منكم)، يقول: ان يجيكم رسلي الذين ارسلهم اليكم بدعايكم الي طاعتي، والانتهاء الي امري ونهيي =\" منكم \", يعني: من انفسكم, ومن عشايركم وقبايلكم =(يقصون ",
        "char_start": 0,
        "char_end": 2626,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 29,
      "evidence_refs": [
        {
          "verse_key": "2:3",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_003_chunk00",
          "char_start": 334,
          "char_end": 496,
          "relevance": "direct"
        },
        {
          "verse_key": "2:3",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_003_chunk00",
          "char_start": 394,
          "char_end": 556,
          "relevance": "direct"
        },
        {
          "verse_key": "2:3",
          "source": "tabari",
          "chunk_id": "tabari_002_003_chunk01",
          "char_start": 130,
          "char_end": 292,
          "relevance": "direct"
        },
        {
          "verse_key": "2:3",
          "source": "tabari",
          "chunk_id": "tabari_002_003_chunk01",
          "char_start": 188,
          "char_end": 350,
          "relevance": "direct"
        },
        {
          "verse_key": "2:150",
          "source": "saadi",
          "chunk_id": "saadi_002_150_chunk01",
          "char_start": 44,
          "char_end": 206,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_BELIEVER",
      "target_label_ar": "مؤمن",
      "target_label_en": "Believer",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "8:65",
          "source": "baghawi",
          "chunk_id": "baghawi_008_065_chunk00",
          "char_start": 294,
          "char_end": 456,
          "relevance": "direct"
        },
        {
          "verse_key": "23:57",
          "source": "baghawi",
          "chunk_id": "baghawi_023_057_chunk00",
          "char_start": 0,
          "char_end": 154,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "AGT_HUMAN_GENERAL",
      "target_label_ar": "إنسان",
      "target_label_en": "Human",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "4:53",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_004_053_chunk00",
          "char_start": 389,
          "char_end": 551,
          "relevance": "direct"
        },
        {
          "verse_key": "17:100",
          "source": "saadi",
          "chunk_id": "saadi_017_100_chunk00",
          "char_start": 41,
          "char_end": 194,
          "relevance": "direct"
        },
        {
          "verse_key": "17:100",
          "source": "tabari",
          "chunk_id": "tabari_017_100_chunk00",
          "char_start": 419,
          "char_end": 581,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:10",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_010_chunk01",
          "char_start": 498,
          "char_end": 662,
          "relevance": "direct"
        },
        {
          "verse_key": "2:10",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_010_chunk01",
          "char_start": 499,
          "char_end": 662,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "18:80",
          "source": "tabari",
          "chunk_id": "tabari_018_080_chunk01",
          "char_start": 153,
          "char_end": 315,
          "relevance": "direct"
        },
        {
          "verse_key": "18:80",
          "source": "tabari",
          "chunk_id": "tabari_018_080_chunk01",
          "char_start": 185,
          "char_end": 347,
          "relevance": "direct"
        },
        {
          "verse_key": "35:28",
          "source": "saadi",
          "chunk_id": "saadi_035_028_chunk00",
          "char_start": 635,
          "char_end": 797,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_UNDERSTANDING",
      "target_label_ar": "الفقه",
      "target_label_en": "Understanding",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "17:28",
          "source": "tabari",
          "chunk_id": "tabari_017_028_chunk04",
          "char_start": 221,
          "char_end": 383,
          "relevance": "direct"
        },
        {
          "verse_key": "17:28",
          "source": "tabari",
          "chunk_id": "tabari_017_028_chunk04",
          "char_start": 234,
          "char_end": 396,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_FIN_HOARDING",
      "target_label_ar": "البخل",
      "target_label_en": "Hoarding/Miserliness",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "4:53",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_004_053_chunk00",
          "char_start": 389,
          "char_end": 551,
          "relevance": "direct"
        },
        {
          "verse_key": "17:100",
          "source": "saadi",
          "chunk_id": "saadi_017_100_chunk00",
          "char_start": 41,
          "char_end": 194,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SOC_IHSAN",
      "target_label_ar": "الإحسان",
      "target_label_en": "Excellence/Ihsan",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "23:57",
          "source": "baghawi",
          "chunk_id": "baghawi_023_057_chunk00",
          "char_start": 82,
          "char_end": 209,
          "relevance": "direct"
        },
        {
          "verse_key": "23:57",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_023_057_chunk00",
          "char_start": 0,
          "char_end": 139,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_FAITH",
      "target_label_ar": "الإيمان",
      "target_label_en": "Faith",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:3",
          "source": "tabari",
          "chunk_id": "tabari_002_003_chunk01",
          "char_start": 130,
          "char_end": 292,
          "relevance": "direct"
        },
        {
          "verse_key": "23:57",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_023_057_chunk00",
          "char_start": 0,
          "char_end": 139,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_TAQWA",
      "target_label_ar": "التقوى",
      "target_label_en": "God-Consciousness",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "17:28",
          "source": "tabari",
          "chunk_id": "tabari_017_028_chunk04",
          "char_start": 221,
          "char_end": 383,
          "relevance": "direct"
        },
        {
          "verse_key": "17:28",
          "source": "tabari",
          "chunk_id": "tabari_017_028_chunk04",
          "char_start": 234,
          "char_end": 396,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    }
  ],
  "incoming_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 22,
      "evidence_refs": [
        {
          "verse_key": "2:26",
          "source": "tabari",
          "chunk_id": "tabari_002_026_chunk06",
          "char_start": 480,
          "char_end": 642,
          "relevance": "direct"
        },
        {
          "verse_key": "2:26",
          "source": "tabari",
          "chunk_id": "tabari_002_026_chunk06",
          "char_start": 543,
          "char_end": 705,
          "relevance": "direct"
        },
        {
          "verse_key": "2:268",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_268_chunk01",
          "char_start": 367,
          "char_end": 529,
          "relevance": "direct"
        },
        {
          "verse_key": "5:115",
          "source": "qurtubi",
          "chunk_id": "qurtubi_005_115_chunk04",
          "char_start": 265,
          "char_end": 427,
          "relevance": "direct"
        },
        {
          "verse_key": "7:26",
          "source": "tabari",
          "chunk_id": "tabari_007_026_chunk12",
          "char_start": 377,
          "char_end": 539,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "PREVENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "8:41",
          "source": "qurtubi",
          "chunk_id": "qurtubi_008_041_chunk02",
          "char_start": 331,
          "char_end": 495,
          "relevance": "direct"
        },
        {
          "verse_key": "17:28",
          "source": "tabari",
          "chunk_id": "tabari_017_028_chunk04",
          "char_start": 178,
          "char_end": 342,
          "relevance": "direct"
        }
      ],
      "confidence": 0.71
    },
    {
      "target_id": "AGT_HYPOCRITE",
      "target_label_ar": "منافق",
      "target_label_en": "Hypocrite",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "4:77",
          "source": "qurtubi",
          "chunk_id": "qurtubi_004_077_chunk01",
          "char_start": 0,
          "char_end": 104,
          "relevance": "direct"
        },
        {
          "verse_key": "23:60",
          "source": "tabari",
          "chunk_id": "tabari_023_060_chunk01",
          "char_start": 296,
          "char_end": 458,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_COG_ARROGANCE",
      "target_label_ar": "الكبر",
      "target_label_en": "Arrogance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "25:63",
          "source": "qurtubi",
          "chunk_id": "qurtubi_025_063_chunk02",
          "char_start": 498,
          "char_end": 660,
          "relevance": "direct"
        },
        {
          "verse_key": "25:63",
          "source": "qurtubi",
          "chunk_id": "qurtubi_025_063_chunk02",
          "char_start": 516,
          "char_end": 678,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_COG_IGNORANCE",
      "target_label_ar": "الجهل",
      "target_label_en": "Ignorance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "25:63",
          "source": "qurtubi",
          "chunk_id": "qurtubi_025_063_chunk02",
          "char_start": 498,
          "char_end": 660,
          "relevance": "direct"
        },
        {
          "verse_key": "25:63",
          "source": "qurtubi",
          "chunk_id": "qurtubi_025_063_chunk02",
          "char_start": 516,
          "char_end": 678,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "25:63",
          "source": "qurtubi",
          "chunk_id": "qurtubi_025_063_chunk02",
          "char_start": 549,
          "char_end": 711,
          "relevance": "direct"
        },
        {
          "verse_key": "27:18",
          "source": "qurtubi",
          "chunk_id": "qurtubi_027_018_chunk04",
          "char_start": 310,
          "char_end": 472,
          "relevance": "direct"
        },
        {
          "verse_key": "35:28",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_035_028_chunk02",
          "char_start": 256,
          "char_end": 418,
          "relevance": "direct"
        },
        {
          "verse_key": "35:28",
          "source": "tabari",
          "chunk_id": "tabari_035_028_chunk01",
          "char_start": 185,
          "char_end": 347,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_UNDERSTANDING",
      "target_label_ar": "الفقه",
      "target_label_en": "Understanding",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "23:60",
          "source": "tabari",
          "chunk_id": "tabari_023_060_chunk01",
          "char_start": 296,
          "char_end": 458,
          "relevance": "direct"
        },
        {
          "verse_key": "59:13",
          "source": "qurtubi",
          "chunk_id": "qurtubi_059_013_chunk00",
          "char_start": 10,
          "char_end": 172,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_FIN_ZAKAT",
      "target_label_ar": "الزكاة",
      "target_label_en": "Zakat",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "12:76",
          "source": "qurtubi",
          "chunk_id": "qurtubi_012_076_chunk02",
          "char_start": 251,
          "char_end": 413,
          "relevance": "direct"
        },
        {
          "verse_key": "12:76",
          "source": "qurtubi",
          "chunk_id": "qurtubi_012_076_chunk03",
          "char_start": 222,
          "char_end": 384,
          "relevance": "direct"
        },
        {
          "verse_key": "12:76",
          "source": "qurtubi",
          "chunk_id": "qurtubi_012_076_chunk03",
          "char_start": 231,
          "char_end": 393,
          "relevance": "direct"
        },
        {
          "verse_key": "12:76",
          "source": "qurtubi",
          "chunk_id": "qurtubi_012_076_chunk04",
          "char_start": 77,
          "char_end": 239,
          "relevance": "direct"
        }
      ],
      "confidence": 0.58
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "17:44",
          "source": "qurtubi",
          "chunk_id": "qurtubi_017_044_chunk02",
          "char_start": 455,
          "char_end": 617,
          "relevance": "direct"
        },
        {
          "verse_key": "23:57",
          "source": "saadi",
          "chunk_id": "saadi_023_057_chunk00",
          "char_start": 42,
          "char_end": 204,
          "relevance": "direct"
        },
        {
          "verse_key": "51:55",
          "source": "saadi",
          "chunk_id": "saadi_051_055_chunk00",
          "char_start": 511,
          "char_end": 673,
          "relevance": "direct"
        },
        {
          "verse_key": "64:1",
          "source": "qurtubi",
          "chunk_id": "qurtubi_064_001_chunk03",
          "char_start": 38,
          "char_end": 200,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "CSQ_ADHAB",
      "target_label_ar": "العذاب",
      "target_label_en": "Punishment",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "24:52",
          "source": "saadi",
          "chunk_id": "saadi_024_052_chunk00",
          "char_start": 310,
          "char_end": 472,
          "relevance": "direct"
        },
        {
          "verse_key": "24:52",
          "source": "saadi",
          "chunk_id": "saadi_024_052_chunk00",
          "char_start": 336,
          "char_end": 498,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "ORG_FACE",
      "target_label_ar": "وجه",
      "target_label_en": "Face",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "12:76",
          "source": "qurtubi",
          "chunk_id": "qurtubi_012_076_chunk02",
          "char_start": 251,
          "char_end": 413,
          "relevance": "direct"
        },
        {
          "verse_key": "50:33",
          "source": "saadi",
          "chunk_id": "saadi_050_033_chunk00",
          "char_start": 0,
          "char_end": 119,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    }
  ],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [
      {
        "value": "ORG_HEART",
        "citation_type": "rule",
        "confidence": 0.9,
        "citation_ref": "RULE_EMOTION_HEART"
      }
    ],
    "internal_external": {
      "value": "باطن",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_INTERNAL_BEH_EMO_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 50,
    "quran_direct_count": 50,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 21,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.914,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.069083Z",
  "schema_version": "1.0.0"
}