{
  "behavior_id": "BEH_EMO_HATRED",
  "label_ar": "البغض",
  "label_en": "Hatred",
  "category": "emotional",
  "roots": [
    "ب-غ-ض"
  ],
  "stems": [],
  "synonyms_ar": [
    "يبغضون",
    "بغضاء",
    "المبغضين",
    "كره",
    "الكراهية"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:61",
      "text_ar": "وَإِذْ قُلْتُمْ يَـٰمُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَٰحِدٍ فَٱدْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنۢبِتُ ٱلْأَرْضُ مِنۢ بَقْلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ ٱلَّذِى هُوَ أَدْنَىٰ بِٱلَّذِى هُوَ خَيْرٌ ۚ ٱهْبِطُوا۟ مِصْرًا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ وَٱلْمَسْكَنَةُ وَبَآءُو بِغَضَبٍ مِّنَ ٱللَّهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيْرِ ٱلْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:90",
      "text_ar": "بِئْسَمَا ٱشْتَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ أَن يَكْفُرُوا۟ بِمَآ أَنزَلَ ٱللَّهُ بَغْيًا أَن يُنَزِّلَ ٱللَّهُ مِن فَضْلِهِۦ عَلَىٰ مَن يَشَآءُ مِنْ عِبَادِهِۦ ۖ فَبَآءُو بِغَضَبٍ عَلَىٰ غَضَبٍ ۚ وَلِلْكَـٰفِرِينَ عَذَابٌ مُّهِينٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:216",
      "text_ar": "كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ وَهُوَ كُرْهٌ لَّكُمْ ۖ وَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًٔا وَهُوَ خَيْرٌ لَّكُمْ ۖ وَعَسَىٰٓ أَن تُحِبُّوا۟ شَيْـًٔا وَهُوَ شَرٌّ لَّكُمْ ۗ وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:83",
      "text_ar": "أَفَغَيْرَ دِينِ ٱللَّهِ يَبْغُونَ وَلَهُۥٓ أَسْلَمَ مَن فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ طَوْعًا وَكَرْهًا وَإِلَيْهِ يُرْجَعُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:112",
      "text_ar": "ضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ أَيْنَ مَا ثُقِفُوٓا۟ إِلَّا بِحَبْلٍ مِّنَ ٱللَّهِ وَحَبْلٍ مِّنَ ٱلنَّاسِ وَبَآءُو بِغَضَبٍ مِّنَ ٱللَّهِ وَضُرِبَتْ عَلَيْهِمُ ٱلْمَسْكَنَةُ ۚ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلْأَنۢبِيَآءَ بِغَيْرِ حَقٍّ ۚ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:118",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ بِطَانَةً مِّن دُونِكُمْ لَا يَأْلُونَكُمْ خَبَالًا وَدُّوا۟ مَا عَنِتُّمْ قَدْ بَدَتِ ٱلْبَغْضَآءُ مِنْ أَفْوَٰهِهِمْ وَمَا تُخْفِى صُدُورُهُمْ أَكْبَرُ ۚ قَدْ بَيَّنَّا لَكُمُ ٱلْـَٔايَـٰتِ ۖ إِن كُنتُمْ تَعْقِلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:19",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا يَحِلُّ لَكُمْ أَن تَرِثُوا۟ ٱلنِّسَآءَ كَرْهًا ۖ وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا۟ بِبَعْضِ مَآ ءَاتَيْتُمُوهُنَّ إِلَّآ أَن يَأْتِينَ بِفَـٰحِشَةٍ مُّبَيِّنَةٍ ۚ وَعَاشِرُوهُنَّ بِٱلْمَعْرُوفِ ۚ فَإِن كَرِهْتُمُوهُنَّ فَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًٔا وَيَجْعَلَ ٱللَّهُ فِيهِ خَيْرًا كَثِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:14",
      "text_ar": "وَمِنَ ٱلَّذِينَ قَالُوٓا۟ إِنَّا نَصَـٰرَىٰٓ أَخَذْنَا مِيثَـٰقَهُمْ فَنَسُوا۟ حَظًّا مِّمَّا ذُكِّرُوا۟ بِهِۦ فَأَغْرَيْنَا بَيْنَهُمُ ٱلْعَدَاوَةَ وَٱلْبَغْضَآءَ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ ۚ وَسَوْفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُوا۟ يَصْنَعُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:64",
      "text_ar": "وَقَالَتِ ٱلْيَهُودُ يَدُ ٱللَّهِ مَغْلُولَةٌ ۚ غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا۟ بِمَا قَالُوا۟ ۘ بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنفِقُ كَيْفَ يَشَآءُ ۚ وَلَيَزِيدَنَّ كَثِيرًا مِّنْهُم مَّآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ طُغْيَـٰنًا وَكُفْرًا ۚ وَأَلْقَيْنَا بَيْنَهُمُ ٱلْعَدَٰوَةَ وَٱلْبَغْضَآءَ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ ۚ كُلَّمَآ أَوْقَدُوا۟ نَارًا لِّلْحَرْبِ أَطْفَأَهَا ٱللَّهُ ۚ وَيَسْعَوْنَ فِى ٱلْأَرْضِ فَسَادًا ۚ وَٱللَّهُ لَا يُحِبُّ ٱلْمُفْسِدِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:91",
      "text_ar": "إِنَّمَا يُرِيدُ ٱلشَّيْطَـٰنُ أَن يُوقِعَ بَيْنَكُمُ ٱلْعَدَٰوَةَ وَٱلْبَغْضَآءَ فِى ٱلْخَمْرِ وَٱلْمَيْسِرِ وَيَصُدَّكُمْ عَن ذِكْرِ ٱللَّهِ وَعَنِ ٱلصَّلَوٰةِ ۖ فَهَلْ أَنتُم مُّنتَهُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:8",
      "text_ar": "لِيُحِقَّ ٱلْحَقَّ وَيُبْطِلَ ٱلْبَـٰطِلَ وَلَوْ كَرِهَ ٱلْمُجْرِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:16",
      "text_ar": "وَمَن يُوَلِّهِمْ يَوْمَئِذٍ دُبُرَهُۥٓ إِلَّا مُتَحَرِّفًا لِّقِتَالٍ أَوْ مُتَحَيِّزًا إِلَىٰ فِئَةٍ فَقَدْ بَآءَ بِغَضَبٍ مِّنَ ٱللَّهِ وَمَأْوَىٰهُ جَهَنَّمُ ۖ وَبِئْسَ ٱلْمَصِيرُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:32",
      "text_ar": "يُرِيدُونَ أَن يُطْفِـُٔوا۟ نُورَ ٱللَّهِ بِأَفْوَٰهِهِمْ وَيَأْبَى ٱللَّهُ إِلَّآ أَن يُتِمَّ نُورَهُۥ وَلَوْ كَرِهَ ٱلْكَـٰفِرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:33",
      "text_ar": "هُوَ ٱلَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِٱلْهُدَىٰ وَدِينِ ٱلْحَقِّ لِيُظْهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوْ كَرِهَ ٱلْمُشْرِكُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:46",
      "text_ar": "وَلَوْ أَرَادُوا۟ ٱلْخُرُوجَ لَأَعَدُّوا۟ لَهُۥ عُدَّةً وَلَـٰكِن كَرِهَ ٱللَّهُ ٱنۢبِعَاثَهُمْ فَثَبَّطَهُمْ وَقِيلَ ٱقْعُدُوا۟ مَعَ ٱلْقَـٰعِدِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:53",
      "text_ar": "قُلْ أَنفِقُوا۟ طَوْعًا أَوْ كَرْهًا لَّن يُتَقَبَّلَ مِنكُمْ ۖ إِنَّكُمْ كُنتُمْ قَوْمًا فَـٰسِقِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:81",
      "text_ar": "فَرِحَ ٱلْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلَـٰفَ رَسُولِ ٱللَّهِ وَكَرِهُوٓا۟ أَن يُجَـٰهِدُوا۟ بِأَمْوَٰلِهِمْ وَأَنفُسِهِمْ فِى سَبِيلِ ٱللَّهِ وَقَالُوا۟ لَا تَنفِرُوا۟ فِى ٱلْحَرِّ ۗ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا ۚ لَّوْ كَانُوا۟ يَفْقَهُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:82",
      "text_ar": "وَيُحِقُّ ٱللَّهُ ٱلْحَقَّ بِكَلِمَـٰتِهِۦ وَلَوْ كَرِهَ ٱلْمُجْرِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:99",
      "text_ar": "وَلَوْ شَآءَ رَبُّكَ لَـَٔامَنَ مَن فِى ٱلْأَرْضِ كُلُّهُمْ جَمِيعًا ۚ أَفَأَنتَ تُكْرِهُ ٱلنَّاسَ حَتَّىٰ يَكُونُوا۟ مُؤْمِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "11:70",
      "text_ar": "فَلَمَّا رَءَآ أَيْدِيَهُمْ لَا تَصِلُ إِلَيْهِ نَكِرَهُمْ وَأَوْجَسَ مِنْهُمْ خِيفَةً ۚ قَالُوا۟ لَا تَخَفْ إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمِ لُوطٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "12:31",
      "text_ar": "فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ أَرْسَلَتْ إِلَيْهِنَّ وَأَعْتَدَتْ لَهُنَّ مُتَّكَـًٔا وَءَاتَتْ كُلَّ وَٰحِدَةٍ مِّنْهُنَّ سِكِّينًا وَقَالَتِ ٱخْرُجْ عَلَيْهِنَّ ۖ فَلَمَّا رَأَيْنَهُۥٓ أَكْبَرْنَهُۥ وَقَطَّعْنَ أَيْدِيَهُنَّ وَقُلْنَ حَـٰشَ لِلَّهِ مَا هَـٰذَا بَشَرًا إِنْ هَـٰذَآ إِلَّا مَلَكٌ كَرِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "13:15",
      "text_ar": "وَلِلَّهِ يَسْجُدُ مَن فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَـٰلُهُم بِٱلْغُدُوِّ وَٱلْـَٔاصَالِ ۩",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "13:33",
      "text_ar": "أَفَمَنْ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفْسٍۭ بِمَا كَسَبَتْ ۗ وَجَعَلُوا۟ لِلَّهِ شُرَكَآءَ قُلْ سَمُّوهُمْ ۚ أَمْ تُنَبِّـُٔونَهُۥ بِمَا لَا يَعْلَمُ فِى ٱلْأَرْضِ أَم بِظَـٰهِرٍ مِّنَ ٱلْقَوْلِ ۗ بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا۟ مَكْرُهُمْ وَصُدُّوا۟ عَنِ ٱلسَّبِيلِ ۗ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "14:5",
      "text_ar": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِـَٔايَـٰتِنَآ أَنْ أَخْرِجْ قَوْمَكَ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ وَذَكِّرْهُم بِأَيَّىٰمِ ٱللَّهِ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "14:46",
      "text_ar": "وَقَدْ مَكَرُوا۟ مَكْرَهُمْ وَعِندَ ٱللَّهِ مَكْرُهُمْ وَإِن كَانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ ٱلْجِبَالُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:62",
      "text_ar": "وَيَجْعَلُونَ لِلَّهِ مَا يَكْرَهُونَ وَتَصِفُ أَلْسِنَتُهُمُ ٱلْكَذِبَ أَنَّ لَهُمُ ٱلْحُسْنَىٰ ۖ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفْرَطُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:106",
      "text_ar": "مَن كَفَرَ بِٱللَّهِ مِنۢ بَعْدِ إِيمَـٰنِهِۦٓ إِلَّا مَنْ أُكْرِهَ وَقَلْبُهُۥ مُطْمَئِنٌّۢ بِٱلْإِيمَـٰنِ وَلَـٰكِن مَّن شَرَحَ بِٱلْكُفْرِ صَدْرًا فَعَلَيْهِمْ غَضَبٌ مِّنَ ٱللَّهِ وَلَهُمْ عَذَابٌ عَظِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "18:63",
      "text_ar": "قَالَ أَرَءَيْتَ إِذْ أَوَيْنَآ إِلَى ٱلصَّخْرَةِ فَإِنِّى نَسِيتُ ٱلْحُوتَ وَمَآ أَنسَىٰنِيهُ إِلَّا ٱلشَّيْطَـٰنُ أَنْ أَذْكُرَهُۥ ۚ وَٱتَّخَذَ سَبِيلَهُۥ فِى ٱلْبَحْرِ عَجَبًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "20:73",
      "text_ar": "إِنَّآ ءَامَنَّا بِرَبِّنَا لِيَغْفِرَ لَنَا خَطَـٰيَـٰنَا وَمَآ أَكْرَهْتَنَا عَلَيْهِ مِنَ ٱلسِّحْرِ ۗ وَٱللَّهُ خَيْرٌ وَأَبْقَىٰٓ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "21:60",
      "text_ar": "قَالُوا۟ سَمِعْنَا فَتًى يَذْكُرُهُمْ يُقَالُ لَهُۥٓ إِبْرَٰهِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "23:71",
      "text_ar": "وَلَوِ ٱتَّبَعَ ٱلْحَقُّ أَهْوَآءَهُمْ لَفَسَدَتِ ٱلسَّمَـٰوَٰتُ وَٱلْأَرْضُ وَمَن فِيهِنَّ ۚ بَلْ أَتَيْنَـٰهُم بِذِكْرِهِمْ فَهُمْ عَن ذِكْرِهِم مُّعْرِضُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "24:33",
      "text_ar": "وَلْيَسْتَعْفِفِ ٱلَّذِينَ لَا يَجِدُونَ نِكَاحًا حَتَّىٰ يُغْنِيَهُمُ ٱللَّهُ مِن فَضْلِهِۦ ۗ وَٱلَّذِينَ يَبْتَغُونَ ٱلْكِتَـٰبَ مِمَّا مَلَكَتْ أَيْمَـٰنُكُمْ فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا ۖ وَءَاتُوهُم مِّن مَّالِ ٱللَّهِ ٱلَّذِىٓ ءَاتَىٰكُمْ ۚ وَلَا تُكْرِهُوا۟ فَتَيَـٰتِكُمْ عَلَى ٱلْبِغَآءِ إِنْ أَرَدْنَ تَحَصُّنًا لِّتَبْتَغُوا۟ عَرَضَ ٱلْحَيَوٰةِ ٱلدُّنْيَا ۚ وَمَن يُكْرِههُّنَّ فَإِنَّ ٱللَّهَ مِنۢ بَعْدِ إِكْرَٰهِهِنَّ غَفُورٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "27:51",
      "text_ar": "فَٱنظُرْ كَيْفَ كَانَ عَـٰقِبَةُ مَكْرِهِمْ أَنَّا دَمَّرْنَـٰهُمْ وَقَوْمَهُمْ أَجْمَعِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "40:14",
      "text_ar": "فَٱدْعُوا۟ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ وَلَوْ كَرِهَ ٱلْكَـٰفِرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "41:11",
      "text_ar": "ثُمَّ ٱسْتَوَىٰٓ إِلَى ٱلسَّمَآءِ وَهِىَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ٱئْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَآ أَتَيْنَا طَآئِعِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "46:15",
      "text_ar": "وَوَصَّيْنَا ٱلْإِنسَـٰنَ بِوَٰلِدَيْهِ إِحْسَـٰنًا ۖ حَمَلَتْهُ أُمُّهُۥ كُرْهًا وَوَضَعَتْهُ كُرْهًا ۖ وَحَمْلُهُۥ وَفِصَـٰلُهُۥ ثَلَـٰثُونَ شَهْرًا ۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِىٓ أَنْ أَشْكُرَ نِعْمَتَكَ ٱلَّتِىٓ أَنْعَمْتَ عَلَىَّ وَعَلَىٰ وَٰلِدَىَّ وَأَنْ أَعْمَلَ صَـٰلِحًا تَرْضَىٰهُ وَأَصْلِحْ لِى فِى ذُرِّيَّتِىٓ ۖ إِنِّى تُبْتُ إِلَيْكَ وَإِنِّى مِنَ ٱلْمُسْلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "47:9",
      "text_ar": "ذَٰلِكَ بِأَنَّهُمْ كَرِهُوا۟ مَآ أَنزَلَ ٱللَّهُ فَأَحْبَطَ أَعْمَـٰلَهُمْ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "47:26",
      "text_ar": "ذَٰلِكَ بِأَنَّهُمْ قَالُوا۟ لِلَّذِينَ كَرِهُوا۟ مَا نَزَّلَ ٱللَّهُ سَنُطِيعُكُمْ فِى بَعْضِ ٱلْأَمْرِ ۖ وَٱللَّهُ يَعْلَمُ إِسْرَارَهُمْ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "47:28",
      "text_ar": "ذَٰلِكَ بِأَنَّهُمُ ٱتَّبَعُوا۟ مَآ أَسْخَطَ ٱللَّهَ وَكَرِهُوا۟ رِضْوَٰنَهُۥ فَأَحْبَطَ أَعْمَـٰلَهُمْ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "49:7",
      "text_ar": "وَٱعْلَمُوٓا۟ أَنَّ فِيكُمْ رَسُولَ ٱللَّهِ ۚ لَوْ يُطِيعُكُمْ فِى كَثِيرٍ مِّنَ ٱلْأَمْرِ لَعَنِتُّمْ وَلَـٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيْكُمُ ٱلْإِيمَـٰنَ وَزَيَّنَهُۥ فِى قُلُوبِكُمْ وَكَرَّهَ إِلَيْكُمُ ٱلْكُفْرَ وَٱلْفُسُوقَ وَٱلْعِصْيَانَ ۚ أُو۟لَـٰٓئِكَ هُمُ ٱلرَّٰشِدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "49:12",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱجْتَنِبُوا۟ كَثِيرًا مِّنَ ٱلظَّنِّ إِنَّ بَعْضَ ٱلظَّنِّ إِثْمٌ ۖ وَلَا تَجَسَّسُوا۟ وَلَا يَغْتَب بَّعْضُكُم بَعْضًا ۚ أَيُحِبُّ أَحَدُكُمْ أَن يَأْكُلَ لَحْمَ أَخِيهِ مَيْتًا فَكَرِهْتُمُوهُ ۚ وَٱتَّقُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ تَوَّابٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "60:4",
      "text_ar": "قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِىٓ إِبْرَٰهِيمَ وَٱلَّذِينَ مَعَهُۥٓ إِذْ قَالُوا۟ لِقَوْمِهِمْ إِنَّا بُرَءَٰٓؤُا۟ مِنكُمْ وَمِمَّا تَعْبُدُونَ مِن دُونِ ٱللَّهِ كَفَرْنَا بِكُمْ وَبَدَا بَيْنَنَا وَبَيْنَكُمُ ٱلْعَدَٰوَةُ وَٱلْبَغْضَآءُ أَبَدًا حَتَّىٰ تُؤْمِنُوا۟ بِٱللَّهِ وَحْدَهُۥٓ إِلَّا قَوْلَ إِبْرَٰهِيمَ لِأَبِيهِ لَأَسْتَغْفِرَنَّ لَكَ وَمَآ أَمْلِكُ لَكَ مِنَ ٱللَّهِ مِن شَىْءٍ ۖ رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ ٱلْمَصِيرُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "61:8",
      "text_ar": "يُرِيدُونَ لِيُطْفِـُٔوا۟ نُورَ ٱللَّهِ بِأَفْوَٰهِهِمْ وَٱللَّهُ مُتِمُّ نُورِهِۦ وَلَوْ كَرِهَ ٱلْكَـٰفِرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "61:9",
      "text_ar": "هُوَ ٱلَّذِىٓ أَرْسَلَ رَسُولَهُۥ بِٱلْهُدَىٰ وَدِينِ ٱلْحَقِّ لِيُظْهِرَهُۥ عَلَى ٱلدِّينِ كُلِّهِۦ وَلَوْ كَرِهَ ٱلْمُشْرِكُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "74:55",
      "text_ar": "فَمَن شَآءَ ذَكَرَهُۥ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "80:12",
      "text_ar": "فَمَن شَآءَ ذَكَرَهُۥ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "قوله تعالى: {وإذ قلتم يا موسى لن نصبر على طعام واحد} وذلك أنهم أجمعوا وسئموا من أكل المن والسلوى، وإنما قال: {على طعام واحد} وهما اثنان لأن العرب تعبر عن الاثنين بلفظ الواحد كما تعبر عن الواحد بلفظ الاثنين، كقوله تعالى: {يخرج منهما اللؤلؤ والمرجان} [22-الرحمن] وإنما يخرج من المالح دون العذب.وقيل: كانوا يأكلون أحدهما بالآخر فكانا كطعام واحد.وقال عبد الرحمن بن زيد بن أسلم: \"كانوا يعجنون المن بالسلوى فيصيران واحداً\".{فادع لنا} فاسأل لأجلنا.{ربك يخرج لنا مما تنبت الأرض من بقلها وقثائها وفومها} قال ا",
        "char_start": 0,
        "char_end": 2307,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_090_chunk00",
        "verse_key": "2:90",
        "text_ar": "{بئسما اشتروا به أنفسهم} بئس ونعم: فعلان ماضيان وضعا للمدح والذم، لا يتصرفان تصرف الأفعال، معناه: بئس الذي اختاروا لأنفسهم حين استبدلوا الباطل بالحق.وقيل: الاشتراء هاهنا بمعنى البيع والمعنى بئس ما باعوا به حظ أنفسهم أي حين اختاروا الكفر (وبذلوا أنفسهم للنار).{أن يكفروا بما أنزل الله} يعني القرآن.{بغياً} أي حسداً، وأصل البغي: الفساد، ويقال بغى الجرح إذا فسد، والبغي: الظلم، وأصله الطلب، والباغي طالب الظلموالحاسد يظلم المحسود جهده، طلباً لإزالة نعمة الله تعالى عنه.{أن ينزل الله من فضله} أي النبوة و",
        "char_start": 0,
        "char_end": 1336,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_216_chunk00",
        "verse_key": "2:216",
        "text_ar": "قوله تعالى : ( كتب عليكم القتال ) أي فرض عليكم الجهاد واختلف العلماء في حكم هذه الآية فقال عطاء : الجهاد تطوع والمراد من الآية أصحاب رسول الله صلى الله عليه وسلم دون غيرهم وإليه ذهب الثوري واحتج من ذهب إلى هذا بقوله تعالى : \" فضل الله المجاهدين بأموالهم وأنفسهم على القاعدين درجة وكلا وعد الله الحسنى \" ( 95 - النساء ) ولو كان القاعد تاركا فرضا لم يكن يعده الحسنى وجرى بعضهم على ظاهر الآية وقال : الجهاد فرض على كافة المسلمين إلى قيام الساعة .أخبرنا أبو سعيد أحمد بن إبراهيم الشريحي الخوارزمي أخبرنا ",
        "char_start": 0,
        "char_end": 1603,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_083_chunk00",
        "verse_key": "3:83",
        "text_ar": "قوله عز وجل : ( أفغير دين الله يبغون ) وذلك أن أهل الكتاب اختلفوا فادعى كل واحد أنه على دين إبراهيم عليه السلام واختصموا إلى رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم : \" كلا الفريقين بريء من دين إبراهيم عليه السلام \" فغضبوا وقالوا : لا نرضى بقضائك ولا نأخذ بدينك ، فأنزل الله تعالى : ( أفغير دين الله يبغون ) قرأ أبو جعفر وأهل البصرة وحفص عن عاصم ( يبغون ) بالياء لقوله تعالى ( وأولئك هم الفاسقون ) وقرأ الآخرون بالتاء لقوله تعالى ( لما آتيتكم ) ، ( وله أسلم ) خضع وانقاد ، ( من في ",
        "char_start": 0,
        "char_end": 1617,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_112_chunk00",
        "verse_key": "3:112",
        "text_ar": "( ضربت عليهم الذلة أين ما ثقفوا ) حيث ما وجدوا ( إلا بحبل من الله ) يعني : أينما وجدوا استضعفوا وقتلوا وسبوا فلا يأمنون \" إلا بحبل من الله \" : عهد من الله تعالى بأن يسلموا ، ( وحبل من الناس ) المؤمنين ببذل جزية أو أمان يعني : إلا أن يعتصموا بحبل فيأمنوا .قوله تعالى : ( وباءوا بغضب من الله ) رجعوا به ، ( وضربت عليهم المسكنة ذلك بأنهم كانوا يكفرون بآيات الله ويقتلون الأنبياء بغير حق ذلك بما عصوا وكانوا يعتدون )",
        "char_start": 0,
        "char_end": 412,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_118_chunk00",
        "verse_key": "3:118",
        "text_ar": "قوله تعالى : ( ياأيها الذين آمنوا لا تتخذوا بطانة من دونكم ) الآية قال ابن عباس رضي الله عنهما : كان رجال من المسلمين يواصلون اليهود لما بينهم من القرابة والصداقة والحلف والجوار والرضاع ، فأنزل الله تعالى هذه الآية ينهاهم عن مباطنتهم خوف الفتنة عليهم .وقال مجاهد : نزلت في قوم من المؤمنين كانوا يصافون المنافقين ، فنهاهم الله تعالى عن ذلك فقال : ( ياأيها الذين آمنوا لا تتخذوا بطانة من دونكم ) أي : أولياء وأصفياء من غير أهل ملتكم ، وبطانة الرجل : خاصته تشبيها ببطانة الثوب التي تلي بطنه لأنهم يستبطن",
        "char_start": 0,
        "char_end": 1137,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "( يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها ) نزلت في أهل المدينة كانوا في الجاهلية وفي أول الإسلام ، إذا مات الرجل وله امرأة جاء ابنه من غيرها أو قريبه من عصبته فألقى ثوبه على تلك المرأة وعلى خبائها ، فصار أحق بها من نفسها ومن غيره ، فإن شاء تزوجها بغير صداق إلا الصداق الأول الذي أصدقها الميت ، وإن شاء زوجها غيره وأخذ صداقها ، وإن شاء عضلها ومنعها من الأزواج يضارها لتفتدي منه بما ورثته من الميت ، أو تموت هي فيرثها ، فإن ذهبت المرأة إلى أهلها قبل أن يلقي عليها ولي زوجها ثوبه فهي أحق بن",
        "char_start": 0,
        "char_end": 2276,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_014_chunk00",
        "verse_key": "5:14",
        "text_ar": "قوله عز وجل : ( ومن الذين قالوا إنا نصارى أخذنا ميثاقهم ) قيل : أراد بهم اليهود والنصارى فاكتفى بذكر أحدهما ، والصحيح أن الآية في النصارى خاصة لأنه قد تقدم ذكر اليهود ، وقال الحسن : فيه دليل على أنهم نصارى بتسميتهم لا بتسمية الله تعالى ، أخذنا ميثاقهم في التوحيد والنبوة ، ( فنسوا حظا مما ذكروا به فأغرينا بينهم العداوة والبغضاء إلى يوم القيامة ) بالأهواء المختلفة والجدال في الدين ، قال مجاهد وقتادة : يعني بين اليهود والنصارى ، وقال قوم : هم النصارى وحدهم صاروا فرقا ، منهم اليعقوبية والنسطورية وال",
        "char_start": 0,
        "char_end": 582,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_064_chunk00",
        "verse_key": "5:64",
        "text_ar": "( وقالت اليهود يد الله مغلولة ) قال ابن عباس وعكرمة والضحاك وقتادة : إن الله تعالى كان قد بسط على اليهود حتى كانوا من أكثر الناس مالا وأخصبهم ناحية فلما عصوا الله في أمر محمد صلى الله عليه وسلم وكذبوا به كف الله عنهم ما بسط عليهم من السعة ، فعند ذلك قال فنحاص بن عازوراء : يد الله مغلولة ، أي : محبوسة مقبوضة عن الرزق نسبوه إلى البخل ، تعالى الله عن ذلك .قيل : إنما قال هذه المقالة فنحاص ، فلما لم ينهه الآخرون ورضوا بقوله أشركهم الله فيها .وقال الحسن : معناه \" يد الله مكفوفة عن عذابنا فليس يعذبنا إ",
        "char_start": 0,
        "char_end": 2079,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_091_chunk00",
        "verse_key": "5:91",
        "text_ar": "( إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر ) أما العدواة في الخمر فإن الشاربين إذا سكروا عربدوا وتشاجروا ، كما فعل الأنصاري الذي شج سعد بن أبي وقاص بلحي الجمل أما العداوة في الميسر ، قال قتادة : كان الرجل يقامر على الأهل والمال ثم يبقى حزينا مسلوب الأهل والمال مغتاظا على حرفائه . ( ويصدكم عن ذكر الله وعن الصلاة ) وذلك أن من اشتغل بشرب الخمر أو القمار ألهاه ذلك عن ذكر الله ، وشوش عليه صلاته كما فعل بأضياف عبد الرحمن بن عوف ، تقدم رجل ليصلي بهم صلاة المغرب بعدما شربوا فقرأ",
        "char_start": 0,
        "char_end": 664,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_008_008_chunk00",
        "verse_key": "8:8",
        "text_ar": "( ليحق الحق ) ليثبت الإسلام ، ( ويبطل الباطل ) أي : يفني الكفر ( ولو كره المجرمون ) المشركون . وكانت وقعة بدر يوم الجمعة صبيحة سبع عشرة ليلة من شهر رمضان .",
        "char_start": 0,
        "char_end": 155,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_008_016_chunk00",
        "verse_key": "8:16",
        "text_ar": "ومن يولهم يومئذ دبره ) ظهره ، ( إلا متحرفا لقتال ) أي منعطفا يرى من نفسه الانهزام ، وقصده طلب الغرة وهو يريد الكرة ، ( أو متحيزا إلى فئة ) أي : منضما صائرا إلى جماعة من المؤمنين يريد العود إلى القتال . ومعنى الآية النهي عن الانهزام من الكفار والتولي عنهم ، إلا على نية التحرف للقتال والانضمام إلى جماعة من المسلمين ليستعين بهم ويعودون إلى القتال ، فمن ولى ظهره لا على هذه النية لحقه الوعيد ، كما قال تعالى : ( فقد باء بغضب من الله ومأواه جهنم وبئس المصير ) اختلف العلماء في هذه الآية فقال أبو سعيد ال",
        "char_start": 0,
        "char_end": 1905,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_032_chunk00",
        "verse_key": "9:32",
        "text_ar": "( يريدون أن يطفئوا نور الله بأفواههم ) أي : يبطلوا دين الله بألسنتهم وتكذيبهم إياه . وقال الكلبي : النور القرآن ، أي : يريدون أن يردوا القرآن بألسنتهم تكذيبا ، ( ويأبى الله إلا أن يتم نوره ) أي : يعلي دينه ويظهر كلمته ويتم الحق الذي بعث به محمدا صلى الله عليه وسلم ( ولو كره الكافرون ) .",
        "char_start": 0,
        "char_end": 287,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "( هو الذي أرسل رسوله ) يعني : الذي يأبى إلا إتمام دينه هو الذي أرسل رسوله محمدا صلى الله عليه وسلم ، ( بالهدى ) قيل : بالقرآن . وقيل : ببيان الفرائض ، ( ودين الحق ) وهو الإسلام ، ( ليظهره ) ليعليه وينصره ، ( على الدين كله ) على سائر الأديان ، ( ولو كره المشركون ) .واختلفوا في معنى هذه الآية : فقال ابن عباس : الهاء عائدة إلى رسول الله صلى الله عليه وسلم أي : ليعلمه شرائع الدين كلها فيظهره عليها حتى لا يخفى عليه منها شيء .وقال الآخرون : الهاء راجعة إلى دين الحق ، وظهوره على الأديان هو أن لا يدان ا",
        "char_start": 0,
        "char_end": 2215,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_046_chunk00",
        "verse_key": "9:46",
        "text_ar": "( ولو أرادوا الخروج ) إلى الغزو ، ( لأعدوا له ) أي : لهيئوا له ( عدة ) أهبة وقوة من السلاح والكراع ، ( ولكن كره الله انبعاثهم ) خروجهم ، ( فثبطهم ) منعهم وحبسهم عن الخروج ، ( وقيل اقعدوا ) في بيوتكم ، ( مع القاعدين ) يعني : مع المرضى والزمنى . وقيل : مع النسوان والصبيان . قوله عز وجل : ( وقيل ) أي : قال بعضهم لبعض : اقعدوا . وقيل : أوحى إلى قلوبهم وألهموا أسباب الخذلان .",
        "char_start": 0,
        "char_end": 373,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_053_chunk00",
        "verse_key": "9:53",
        "text_ar": "( قل أنفقوا طوعا أو كرها ) أمر بمعنى الشرط والجزاء ، أي : إن أنفقتم طوعا أو كرها . نزلت في جد بن قيس حين استأذن في القعود ، قال أعينكم بمالي ، يقول : إن أنفقتم طوعا أو كرها ( لن يتقبل منكم إنكم ) أي : لأنكم ، ( كنتم قوما فاسقين ) .",
        "char_start": 0,
        "char_end": 231,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_009_081_chunk00",
        "verse_key": "9:81",
        "text_ar": "( فرح المخلفون ) عن غزوة تبوك . والمخلف : المتروك ( بمقعدهم ) أي بقعودهم ( خلاف رسول الله ) قال أبو عبيدة : أي بعد رسول الله صلى الله عليه وسلم . وقيل : مخالفة لرسول الله صلى الله عليه وسلم حين سار وأقاموا ، ( وكرهوا أن يجاهدوا بأموالهم وأنفسهم في سبيل الله وقالوا لا تنفروا في الحر ) وكانت غزوة تبوك في شدة الحر ، ( قل نار جهنم أشد حرا لو كانوا يفقهون ) يعلمون وكذلك هو في مصحف عبد الله بن مسعود .",
        "char_start": 0,
        "char_end": 398,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_010_082_chunk00",
        "verse_key": "10:82",
        "text_ar": "( ويحق الله الحق بكلماته ) بآياته ، ( ولو كره المجرمون ) .",
        "char_start": 0,
        "char_end": 58,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_010_099_chunk00",
        "verse_key": "10:99",
        "text_ar": "قوله تعالى : ( ولو شاء ربك ) يا محمد ، ( لآمن من في الأرض كلهم جميعا أفأنت تكره الناس حتى يكونوا مؤمنين ) هذه تسلية للنبي صلى الله عليه وسلم وذلك أنه كان حريصا على أن يؤمن جميع الناس ، فأخبره الله جل ذكره : أنه لا يؤمن إلا من قد سبق له من الله السعادة ، ولا يضل إلا من سبق له الشقاوة .",
        "char_start": 0,
        "char_end": 285,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_011_070_chunk00",
        "verse_key": "11:70",
        "text_ar": "( فلما رأى أيديهم لا تصل إليه ) أي : إلى العجل ، ( نكرهم ) أنكرهم ، ( وأوجس ) أضمر ، ( منهم خيفة ) خوفا . قال مقاتل : وقع في قلبه ، وأصل الوجوس : الدخول ، كان الخوف دخل قلبه . وقال قتادة : وذلك أنهم كانوا إذا نزل بهم ضيف فلم يأكل من طعامهم ظنوا أنه لم يأت بخير وإنما جاء بشر . ( قالوا لا تخف ) يا إبراهيم إنا رسل ربك . يعني : ( إنا ) ملائكة الله ( أرسلنا إلى قوم لوط ) .",
        "char_start": 0,
        "char_end": 370,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "يقول تعالي : واذكروا نعمتي عليكم في انزالي عليكم المن والسلوي ، طعاما طيبا نافعا هنييا سهلا واذكروا دبركم وضجركم مما رزقتكم وسوالكم موسي استبدال ذلك بالاطعمه الدنيه من البقول ونحوها مما سالتم . وقال الحسن البصري رحمه الله : فبطروا ذلك ولم يصبروا عليه ، وذكروا عيشهم الذي كانوا فيه ، وكانوا قوما اهل اعداس وبصل وبقل وفوم ، فقالوا : ( يا موسي لن نصبر علي طعام واحد فادع لنا ربك يخرج لنا مما تنبت الارض من بقلها وقثايها وفومها وعدسها وبصلها ) [ وهم ياكلون المن والسلوي ، لانه لا يتبدل ولا يتغير كل يوم ف",
        "char_start": 0,
        "char_end": 6742,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_090_chunk00",
        "verse_key": "2:90",
        "text_ar": "قال مجاهد : ( بيسما اشتروا به انفسهم ) يهود شروا الحق بالباطل ، وكتمان ما جاء به محمد صلي الله عليه وسلم بان يبينوه .وقال السدي : ( بيسما اشتروا به انفسهم ) يقول : باعوا به انفسهم ، يعني : بيسما اعتاضوا لانفسهم ورضوا به [ وعدلوا اليه من الكفر بما انزل الله علي محمد صلي الله عليه وسلم الي تصديقه وموازرته ونصرته ] .وانما حملهم علي ذلك البغي والحسد والكراهيه ( ان ينزل الله من فضله علي من يشاء من عباده ) ولا حسد اعظم من هذا .قال ابن اسحاق عن محمد ، عن عكرمه او سعيد ، عن ابن عباس : ( بيسما اشتروا به ",
        "char_start": 0,
        "char_end": 1668,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_216_chunk00",
        "verse_key": "2:216",
        "text_ar": "هذا ايجاب من الله تعالي للجهاد علي المسلمين : ان يكفوا شر الاعداء عن حوزه الاسلام .وقال الزهري : الجهاد واجب علي كل احد ، غزا او قعد ; فالقاعد عليه اذا استعين ان يعين ، واذا استغيث ان يغيث ، واذا استنفر ان ينفر ، وان لم يحتج اليه قعد .قلت : ولهذا ثبت في الصحيح \" من مات ولم يغز ، ولم يحدث نفسه بغزو مات ميته جاهليه \" . وقال عليه السلام يوم الفتح : \" لا هجره ، ولكن جهاد ونيه ، اذا استنفرتم فانفروا \" .وقوله : ( وهو كره لكم ) اي : شديد عليكم ومشقه . وهو كذلك ، فانه اما ان يقتل او يجرح مع مشقه السفر و",
        "char_start": 0,
        "char_end": 1017,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_083_chunk00",
        "verse_key": "3:83",
        "text_ar": "يقول تعالي منكرا علي من اراد دينا سوي دين الله ، الذي انزل به كتبه وارسل به رسله ، وهو عبادته وحده لا شريك له ، الذي ( له اسلم من في السماوات والارض ) اي : استسلم له من فيهما طوعا وكرها ، كما قال تعالي : ( ولله يسجد من في السماوات والارض طوعا وكرها وظلالهم بالغدو والاصال ) [ الرعد : 15 ] وقال تعالي : ( اولم يروا الي ما خلق الله من شيء يتفيا ظلاله عن اليمين والشمايل سجدا لله وهم داخرون . ولله يسجد ما في السماوات وما في الارض من دابه والملايكه وهم لا يستكبرون يخافون ربهم من فوقهم ويفعلون ما يومرون",
        "char_start": 0,
        "char_end": 1604,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_112_chunk00",
        "verse_key": "3:112",
        "text_ar": "ثم قال تعالي : ( ضربت عليهم الذله اينما ثقفوا الا بحبل من الله وحبل من الناس ) اي : الزمهم الله الذله والصغار اينما كانوا فلا يامنون ( الا بحبل من الله ) اي : بذمه من الله ، وهو عقد الذمه لهم وضرب الجزيه عليهم ، والزامهم احكام المله ( وحبل من الناس ) اي : امان منهم ولهم ، كما في المهادن والمعاهد والاسير اذا امنه واحد من المسلمين ولو امراه ، وكذا عبد ، علي احد قولي العلماء .قال ابن عباس : ( الا بحبل من الله وحبل من الناس ) اي : بعهد من الله وعهد من الناس ، [ و ] هكذا قال مجاهد ، وعكرمه ، وعطاء ، ",
        "char_start": 0,
        "char_end": 1356,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_118_chunk00",
        "verse_key": "3:118",
        "text_ar": "يقول تبارك وتعالي ناهيا عباده المومنين عن اتخاذ المنافقين بطانه ، اي : يطلعونهم علي سرايرهم وما يضمرونه لاعدايهم ، والمنافقون بجهدهم وطاقتهم لا يالون المومنين خبالا اي : يسعون في مخالفتهم وما يضرهم بكل ممكن ، وبما يستطيعونه من المكر والخديعه ، ويودون ما يعنت المومنين ويخرجهم ويشق عليهم .وقوله : ( لا تتخذوا بطانه من دونكم ) اي : من غيركم من اهل الاديان ، وبطانه الرجل : هم خاصه اهله الذين يطلعون علي داخل امره .وقد روي البخاري ، والنسايي ، وغيرهما ، من حديث جماعه ، منهم : يونس ، ويحيي بن سعيد ، ومو",
        "char_start": 0,
        "char_end": 3316,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "قال البخاري : حدثنا محمد بن مقاتل ، حدثنا اسباط بن محمد ، حدثنا الشيباني عن عكرمه ، عن ابن عباس - قال الشيباني : وذكره ابو الحسن السوايي ، ولا اظنه ذكره الا عن ابن عباس - : ( ياايها الذين امنوا لا يحل لكم ان ترثوا النساء كرها ) قال : كانوا اذا مات الرجل كان اولياوه احق بامراته ، ان شاء بعضهم تزوجها ، وان شاءوا زوجوها ، وان شاءوا لم يزوجوها ، فهم احق بها من اهلها ، فنزلت هذه الايه في ذلك .هكذا رواه البخاري وابو داود ، والنسايي ، وابن مردويه ، وابن ابي حاتم ، من حديث ابي اسحاق الشيباني - واسمه سلي",
        "char_start": 0,
        "char_end": 7295,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_014_chunk00",
        "verse_key": "5:14",
        "text_ar": "وقوله : ( ومن الذين قالوا انا نصاري اخذنا ميثاقهم ) اي : ومن الذين ادعوا لانفسهم انهم نصاري يتابعون المسيح ابن مريم عليه السلام ، وليسوا كذلك ، اخذنا عليهم العهود والمواثيق علي متابعه الرسول ومناصرته وموازرته واقتفاء اثاره ، والايمان بكل نبي يرسله الله الي اهل الارض ، اي : ففعلوا كما فعل اليهود خالفوا المواثيق ونقضوا العهود ; ولهذا قال : ( فنسوا حظا مما ذكروا به فاغرينا بينهم العداوه والبغضاء الي يوم القيامه ) اي : فالقينا بينهم العداوه والتباغض لبعضهم بعضا ، ولا يزالون كذلك الي قيام الساعه . وك",
        "char_start": 0,
        "char_end": 1069,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_064_chunk00",
        "verse_key": "5:64",
        "text_ar": "يخبر تعالي عن اليهود - عليهم لعاين الله المتتابعه الي يوم القيامه - بانهم وصفوا الله عز وجل وتعالي عن قولهم علوا كبيرا ، بانه بخيل . كما وصفوه بانه فقير وهم اغنياء ، وعبروا عن البخل بقولهم : ( يد الله مغلوله )قال ابن ابي حاتم : حدثنا ابو عبد الله الطهراني ، حدثنا حفص بن عمر العدني ، حدثنا الحكم بن ابان ، عن عكرمه قال : قال ابن عباس : ( مغلوله ) اي : بخيله .وقال علي بن ابي طلحه ، عن ابن عباس قوله : ( وقالت اليهود يد الله مغلوله ) قال : لا يعنون بذلك ان يد الله موثقه ولكن يقولون : بخيل امسك ما عند",
        "char_start": 0,
        "char_end": 3850,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_091_chunk00",
        "verse_key": "5:91",
        "text_ar": "ثم قال تعالي : ( انما يريد الشيطان ان يوقع بينكم العداوه والبغضاء في الخمر والميسر ويصدكم عن ذكر الله وعن الصلاه فهل انتم منتهون ) وهذا تهديد وترهيب .ذكر الاحاديث الوارده في [ بيان ] تحريم الخمر :قال الامام احمد : حدثنا سريج ، حدثنا ابو معشر ، عن ابي وهب مولي ابي هريره ، عن ابي هريره قال : حرمت الخمر ثلاث مرات ، قدم رسول الله صلي الله عليه وسلم المدينه ، وهم يشربون الخمر وياكلون الميسر ، فسالوا رسول الله صلي الله عليه وسلم عنهما ، فانزل الله : ( يسالونك عن الخمر والميسر قل فيهما اثم كبير ومنافع ",
        "char_start": 0,
        "char_end": 21549,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_008_008_chunk00",
        "verse_key": "8:8",
        "text_ar": "لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ",
        "char_start": 0,
        "char_end": 69,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_008_016_chunk00",
        "verse_key": "8:16",
        "text_ar": "( ومن يولهم يوميذ دبره الا متحرفا لقتال ) اي : يفر بين يدي قرنه مكيده ؛ ليريه انه [ قد ] خاف منه فيتبعه ، ثم يكر عليه فيقتله ، فلا باس عليه في ذلك . نص عليه سعيد بن جبير ، والسدي .وقال الضحاك : ان يتقدم عن اصحابه ليري غره من العدو فيصيبها .( او متحيزا الي فيه ) اي : فر من هاهنا الي فيه اخري من المسلمين ، يعاونهم ويعاونوه فيجوز له ذلك ، حتي [ و ] لو كان في سريه ففر الي اميره او الي الامام الاعظم ، دخل في هذه الرخصه .قال الامام احمد : حدثنا حسن ، حدثنا زهير ، حدثنا يزيد بن ابي زياد ، عن عبد الرحمن",
        "char_start": 0,
        "char_end": 6059,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_032_chunk00",
        "verse_key": "9:32",
        "text_ar": "قول تعالي : يريد هولاء الكفار من المشركين واهل الكتاب ( ان يطفيوا نور الله ) اي : ما بعث به رسوله من الهدي ودين الحق بمجرد جدالهم وافترايهم ، فمثلهم في ذلك كمثل من يريد ان يطفي شعاع الشمس ، او نور القمر بنفخه ، وهذا لا سبيل اليه ، فكذلك ما ارسل الله به رسوله لا بد ان يتم ويظهر ؛ ولهذا قال تعالي مقابلا لهم فيما راموه وارادوه : ( ويابي الله الا ان يتم نوره ولو كره الكافرون )والكافر : هو الذي يستر الشيء ويغطيه ، ومنه سمي الليل \" كافرا \" ؛ لانه يستر الاشياء ، والزارع كافرا ؛ لانه يغطي الحب في الارض ",
        "char_start": 0,
        "char_end": 549,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "ثم قال تعالي : ( هو الذي ارسل رسوله بالهدي ودين الحق ) فالهدي : هو ما جاء به من الاخبارات الصادقه ، والايمان الصحيح ، والعلم النافع . ودين الحق : هي الاعمال [ الصالحه ] الصحيحه النافعه في الدنيا والاخره .( ليظهره علي الدين كله ) اي : علي ساير الاديان ، كما ثبت في الصحيح عن رسول الله - صلي الله عليه وسلم - انه قال : ان الله زوي لي الارض مشارقها ومغاربها ، وسيبلغ ملك امتي ما زوي لي منها .وقال الامام احمد : حدثنا محمد بن جعفر ، حدثنا شعبه ، عن محمد بن ابي يعقوب : سمعت شقيق بن حيان يحدث عن مسعود بن ",
        "char_start": 0,
        "char_end": 3079,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_046_chunk00",
        "verse_key": "9:46",
        "text_ar": "يقول تعالي : ( ولو ارادوا الخروج ) اي : معك الي الغزو ( لاعدوا له عده ) اي : لكانوا تاهبوا له ، ( ولكن كره الله انبعاثهم ) اي : ابغض ان يخرجوا معك قدرا ، ( فثبطهم ) اي : اخرهم ، ( وقيل اقعدوا مع القاعدين ) اي : قدرا .",
        "char_start": 0,
        "char_end": 217,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_053_chunk00",
        "verse_key": "9:53",
        "text_ar": "وقوله : ( قل انفقوا طوعا او كرها ) اي : مهما انفقتم من نفقه طايعين او مكرهين ( لن يتقبل منكم انكم كنتم قوما فاسقين )",
        "char_start": 0,
        "char_end": 116,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_009_081_chunk00",
        "verse_key": "9:81",
        "text_ar": "يقول تعالي ذاما للمنافقين المتخلفين عن صحابه رسول الله - صلي الله عليه وسلم - في غزوه تبوك ، وفرحوا بمقعدهم بعد خروجه ، ( وكرهوا ان يجاهدوا ) معه ( باموالهم وانفسهم في سبيل الله وقالوا ) اي : بعضهم لبعض : ( لا تنفروا في الحر ) ؛ وذلك ان الخروج في غزوه تبوك كان في شده الحر ، عند طيب الظلال والثمار ، فلهذا قالوا ( لا تنفروا في الحر ) قال الله تعالي لرسوله : ( قل ) لهم : ( نار جهنم ) التي تصيرون اليها بسبب مخالفتكم ( اشد حرا ) مما فررتم منه من الحر ، بل اشد حرا من النار ، كما قال الامام مالك ، عن ا",
        "char_start": 0,
        "char_end": 3833,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_010_082_chunk00",
        "verse_key": "10:82",
        "text_ar": "(ويحق الله الحق بكلماته ولو كره المجرمون ) والايه الاخري : ( فوقع الحق وبطل ما كانوا يعملون ) [ الاعراف : 118 - 122 ] ، وقوله ( انما صنعوا كيد ساحر ولا يفلح الساحر حيث اتي ) [ طه : 69 ] .",
        "char_start": 0,
        "char_end": 187,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_010_099_chunk00",
        "verse_key": "10:99",
        "text_ar": "يقول تعالي : ( ولو شاء ربك ) - يا محمد - لاذن لاهل الارض كلهم في الايمان بما جيتهم به ، فامنوا كلهم ، ولكن له حكمه فيما يفعله تعالي كما قال تعالي : ( ولو شاء ربك لجعل الناس امه واحده ولا يزالون مختلفين الا من رحم ربك ولذلك خلقهم وتمت كلمه ربك لاملان جهنم من الجنه والناس اجمعين ) [ هود : 118 ، 119 ] ، وقال تعالي : ( افلم يياس الذين امنوا ان لو يشاء الله لهدي الناس جميعا ) [ الرعد : 31 ] ؛ ولهذا قال تعالي : ( افانت تكره الناس ) اي : تلزمهم وتلجيهم ( حتي يكونوا مومنين ) اي : ليس ذلك عليك ولا اليك ،",
        "char_start": 0,
        "char_end": 995,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_011_070_chunk00",
        "verse_key": "11:70",
        "text_ar": "وقوله : ( فلما راي ايديهم لا تصل اليه نكرهم ) تنكرهم ، ( واوجس منهم خيفه ) وذلك ان الملايكه لا همه لهم الي الطعام ولا يشتهونه ولا ياكلونه; فلهذا راي حالهم معرضين عما جاءهم به ، فارغين عنه بالكليه فعند ذلك نكرهم ، ( واوجس منهم خيفه ) .قال السدي : لما بعث الله الملايكه لقوم لوط اقبلت تمشي في صور رجال شبان حتي نزلوا علي ابراهيم فتضيفوه ، فلما راهم [ ابراهيم ] اجلهم ، ( فراغ الي اهله فجاء بعجل سمين ) فذبحه ثم شواه في الرضف . [ فهو الحنيد حين شواه ] واتاهم به فقعد معهم ، وقامت ساره تخدمهم فذلك حين يق",
        "char_start": 0,
        "char_end": 2153,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "«وإذا قلتم يا موسى لن نصبر على طعام» أي نوع منه «واحد» وهو المن والسلوى «فادع لنا ربَّك يُخرج لنا» شيئاً «مما تنبت الأرض من» للبيان «بقلها وقثائها وفومها» حنطتها «وعدسها وبصلها قال» لهم موسى «أتستبدلون الذي هو أدنى» أخس «بالذي هو خير» أشرف أي أتأخذونه بدله، والهمزة للإنكار فأبوا أن يرجعوا فدعا الله تعالى فقال تعالى «اهبطوا» انزلوا «مصراً» من الأمصار «فإن لكم» فيه «ما سألتم» من النبات «وضُربت» جعلت «عليهم الذلة» الذل والهوان «والمسكنة» أي أثر الفقر من السكون والخزي فهي لازمة لهم، وإن كانوا أغنياء",
        "char_start": 0,
        "char_end": 743,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_090_chunk00",
        "verse_key": "2:90",
        "text_ar": "«بئسما اشتروا» باعوا «به أنفسهم» أي حظها من الثواب، وما: نكرة بمعنى شيئاً تمييز لفاعل بئس والمخصوص بالذم «أن يكفروا» أي كفرهم «بما أنزل الله» من القرآن «بغياً» مفعول له ليكفروا: أي حسداً على «أن ينزل الله» بالتخفيف والتشديد «من فضله» الوحي «على من يشاء» للرسالة «من عباده فباءوا» رجعوا «بغضب» من الله بكفرهم بما أنزل والتنكيرُ للتعظيم «على غضب» استحقوه من قبل بتضييع التوراة والكفر بعيسى «وللكافرين عذاب مُهين» ذو إهانة.",
        "char_start": 0,
        "char_end": 420,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_216_chunk00",
        "verse_key": "2:216",
        "text_ar": "«كُتِب» فرض «عليكم القتال» للكفار «وهو كُرْهٌ» مكروه «لكم» طبعا لمشقته «وعسى أن تكرهوا شيئا وهو خير لكم وعسى أن تحبوا شيئا وهو شر لكم» لميل النفس إلى الشهوات الموجبة لهلاكها ونفورها عن التكليفات الموجبة لسعادتها فلعل لكم في القتال وإن كرهتموه خيرا لأن فيه إما الظفر والغنيمة أو الشهادة والأجر وفي تركه وإن أحببتموه شرا لأن فيه الذل والفقر وحرمان الأجر «والله يعلم» ما هو خير لكم «وأنتم لا تعلمون» ذلك فبادروا إلى ما يأمركم به.",
        "char_start": 0,
        "char_end": 426,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_083_chunk00",
        "verse_key": "3:83",
        "text_ar": "«أفغير دين الله يبغون» بالياء والتاء أي المتولون «وله أسلم» إنقاذ «من في السماوات والأرض طوعا» بلا إباء «وكرها» بالسيف بمعاينة ما يلجأ إليه «وإليه يُرْجَعُون» بالتاء والياء والهمزة في أول الآية للإنكار.",
        "char_start": 0,
        "char_end": 202,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_112_chunk00",
        "verse_key": "3:112",
        "text_ar": "«ضربت عليهم الذلة أين ما ثُقفوا» حيثما وجدوا فلا عز لهم ولا اعتصام «إلا» كائنين «بحبل من الله وحبل من الناس» المؤمنين وهو عهدهم إليهم بالأمان على أداء الجزية أي لا عصمة لهم غير ذلك «وباءُوا» رجعوا «بغضب من الله وضربت عليهم المسكنة ذلك بأنهم» أي بسبب أنهم «كانوا يكفرون بآيات الله ويقتلون الأنبياء بغير حق ذلك» تأكيد «بما عصوا» أمر الله «وكانوا يعتدون» يتجاوزون الحلال إلى الحرام.",
        "char_start": 0,
        "char_end": 379,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_118_chunk00",
        "verse_key": "3:118",
        "text_ar": "«يا أيها الذين آمنوا لا تتخذوا بطانة» أصفياء تطلعونهم على سرِّكم «من دونكم» أي غيركم من اليهود والنصارى والمنافقين «لا يألونكم خبالا» نصب بنزع الخافض أي لا يقصرون لكم في الفساد «ودُّوا» تمنَّوا «ما عنتم» أي عنتكم وهو شدة الضرر «قد بدت» ظهرت «البغضاء» العداوة لكم «من أفواههم» بالوقيعة فيكم وإطلاع المشركين على سركم «وما تخفي صدورهم» من العداوة «أكبر قد بينا لكم الآيات» على عدواتهم «إن كنتم تعقلون» ذلك فلا توالوهم.",
        "char_start": 0,
        "char_end": 415,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "«يا أيُّها الذين آمنوا لا يحلُّ لكم أن ترثوا النساء» أي ذاتهن «كرها» بالفتح والضم لغتان أي مكرهيهن على ذلك كانوا في الجاهلية يرثون نساء أقربائهم فإن شاءوا تزوجوهن بلا صداق أو زوَّجوهن وأخذوا صداقهن أو عضلوهن حتى يفتدين بما ورثنه أو يمتن فيرثوهن فنُهوا عن ذلك «ولا» أن «تعضلوهن» أي تمنعوا أزواجكم عن نكاح غيركم بإمساكهن ولا رغبة لكم فيهن ضرارا «لتذهبوا ببعض ما آتيتموهن» من المهر «إلا أن يأتين بفاحشة مبيَّنة» بفتح الياء وكسرها أي بينت أو هي بينة أي زنا أو نشوز فلكم أن تضاروهن حتى يفتدين منكم ويختلعن",
        "char_start": 0,
        "char_end": 676,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_014_chunk00",
        "verse_key": "5:14",
        "text_ar": "«ومن الذين قالوا إنا نصارى» متعلق بقوله «أخذنا ميثاقهم» كما أخذنا على بني إسرائيل اليهود «فنسوا حظاً مما ذكِّروا به» في الإنجيل من الإيمان وغيره ونقضوا الميثاق «فأغرينا» أوقعنا «بينهم العداوة والبغضاء إلى يوم القيامة» بتفرقهم واختلاف أهوائهم فكل فرقة تكفر الأخرى «وسوف ينبئهم الله» في الآخرة «بما كانوا يصنعون» فيجازيهم عليه.",
        "char_start": 0,
        "char_end": 325,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_064_chunk00",
        "verse_key": "5:64",
        "text_ar": "«وقالت اليهود» لما ضيق عليهم بتكذيبهم النبي صلى الله عليه وسلم بعد أن كانوا أكثر الناس مالا «يد الله مغلولة» مقبوضة عن إدرار الرزق علينا كنوا به عن البخل - تعالى الله عن ذلك- قال تعالى: «غُلَّتْ» أمسكت «أيديهم» عن فعل الخيرات دعاء عليهم «ولُعنوا بما قالوا بل يداه مبسوطتان» مبالغة في الوصف بالجود وثنى اليد لإفادة الكثرة إذ غاية ما يبذله السخي من ماله أن يعطي بيديه «ينفق كيف يشاء» من توسيع وتضيق لا اعتراض عليه «وليزيدن كثيرا منهم ما أنزل إليك من ربك» من القرآن «طغيانا وكفرا» لكفرهم به «وألقينا بين",
        "char_start": 0,
        "char_end": 742,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_091_chunk00",
        "verse_key": "5:91",
        "text_ar": "«إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر» إذا أتيتموهما لما يحصل فيهما من الشر والفتن «ويصدَّكم» بالاشتغال بهما «عن ذكر الله وعن الصلاة» خصها بالذكر تعظيما لها «فهل أنتم منتهون» عن إتيانهما أي انتهوا.",
        "char_start": 0,
        "char_end": 226,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_008_008_chunk00",
        "verse_key": "8:8",
        "text_ar": "«ليُحق الحق ويبطل» يمحق «الباطل» الكفر «ولو كره المجرمون» المشركون ذلك.",
        "char_start": 0,
        "char_end": 71,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_008_016_chunk00",
        "verse_key": "8:16",
        "text_ar": "«ومن يولهم يومئذ» أي يوم لقائهم «دُبُرَهُ إلا متحرفا» منعطفا «لقتال» بأن يريهم الغرَّة مكيدة وهو يريد الكرَّة «أو متحيزا» منضما «إلى فئة» جماعة من المسلمين يستنجد بها «فقد باء» رجع «بغضب من الله ومأواه جنهم وبئس المصير» المرجع هي وهذا مخصوص بما لم يزد الكفار على الضعف.",
        "char_start": 0,
        "char_end": 269,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_032_chunk00",
        "verse_key": "9:32",
        "text_ar": "«يريدون أن يطفئوا نور الله» شرعه وبراهينه «بأفواههم» بأقوالهم فيه «ويأبى الله إلا أن يتم» يظهر «نوره ولو كره الكافرون» ذلك.",
        "char_start": 0,
        "char_end": 123,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "«هو الذي أرسل رسوله» محمدا صلى الله عليه وسلم «بالهدى ودين الحق ليُظهره» يعليه «على الدين كله» جميع الأديان المخالفة له «ولو كره المشركون» ذلك.",
        "char_start": 0,
        "char_end": 143,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_046_chunk00",
        "verse_key": "9:46",
        "text_ar": "«ولو أرادوا الخروج» معك «لأعدوا له عدة» أهبة من الآلة والزاد «ولكن كره الله انبعاثهم» أي لم يرد خروجهم «فثبطهم» كسَّلهم «وقيل» لهم «اقعدوا مع القاعدين» المرضى والنساء والصبيان، أي قدر الله تعالى ذلك.",
        "char_start": 0,
        "char_end": 199,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_053_chunk00",
        "verse_key": "9:53",
        "text_ar": "«قل أنفقوا» في طاعة الله «طوعا أو كرها لن يتقبل منكم» ما أنفقتموه «إنكم كننتم قوما فاسقين» والأمر هنا بمعنى الخبر.",
        "char_start": 0,
        "char_end": 114,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_009_081_chunk00",
        "verse_key": "9:81",
        "text_ar": "«فرح المخلَّفون» عن تبوك «بمقعدهم» أي بقعودهم «خلاف» أي بعد «رسول الله وكرهوا أن يجاهدوا بأموالهم وأنفسهم في سبيل الله وقالوا» أي قال بعضهم لبعض «لا تنفروا» تخرجوا إلى الجهاد «في الحر قل نار جهنم أشدُّ حرا» من تبوك فالأولى أن يتقوها بترك التخلف «لو كانوا يفقهون» يعلمون ذلك ما تخلفوا.",
        "char_start": 0,
        "char_end": 284,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_010_082_chunk00",
        "verse_key": "10:82",
        "text_ar": "«ويحق» يثبت ويظهر «الله الحق بكلماته» بمواعيده «ولو كره المجرمون».",
        "char_start": 0,
        "char_end": 66,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_010_099_chunk00",
        "verse_key": "10:99",
        "text_ar": "«ولو شاء ربك لآمن من في الأرض كلهم جميعا أفأنت تُكره الناس» بما لم يشأه الله منهم «حتى يكونوا مؤمنين» لا.",
        "char_start": 0,
        "char_end": 105,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_011_070_chunk00",
        "verse_key": "11:70",
        "text_ar": "«فلما رأى أيديهم لا تصل إليه نكرهم» بمعنى أنكرهم «وأوجس» أضمر في نفسه «منهم خيفة» خوفا «قالوا لا تخف إنا أرسلنا إلى قوم لوط» لنهلكهم.",
        "char_start": 0,
        "char_end": 133,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "واذكروا حين انزلنا عليكم الطعام الحلو، والطير الشهي، فبطِرتم النعمه كعادتكم، واصابكم الضيق والملل، فقلتم: يا موسي لن نصبر علي طعام ثابت لا يتغير مع الايام، فادع لنا ربك يخرج لنا من نبات الارض طعامًا من البقول والخُضَر، والقثاء والحبوب التي توكل، والعدس، والبصل. قال موسي -مستنكرًا عليهم-: اتطلبون هذه الاطعمه التي هي اقل قدرًا، وتتركون هذا الرزق النافع الذي اختاره الله لكم؟ اهبطوا من هذه الباديه الي اي مدينه، تجدوا ما اشتهيتم كثيرًا في الحقول والاسواق. ولما هبطوا تبيَّن لهم انهم يُقَدِّمون اختياره",
        "char_start": 0,
        "char_end": 764,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_090_chunk00",
        "verse_key": "2:90",
        "text_ar": "قَبُحَ ما اختاره بنو إسرائيل لأنفسهم; إذ استبدلوا الكفر بالإيمان ظلمًا وحسدًا لإنزال الله من فضله القرآن على نبي الله ورسوله محمد صلى الله عليه وسلم، فرجعوا بغضب من الله عليهم بسبب جحودهم بالنبي محمد صلى الله عليه وسلم، بعد غضب الله كذلك عليهم بسبب تحريفهم التوراة. وللجاحدين نبوَّة محمد صلى الله عليه وسلم عذابٌ يذلُّهم ويخزيهم.",
        "char_start": 0,
        "char_end": 329,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_216_chunk00",
        "verse_key": "2:216",
        "text_ar": "فرض الله عليكم -أيها المؤمنون- قتال الكفار، والقتال مكروه لكم من جهة الطبع; لمشقته وكثرة مخاطره، وقد تكرهون شيئًا وهو في حقيقته خير لكم، وقد تحبون شيئًا لما فيه من الراحة أو اللذة العاجلة، وهو شر لكم. والله تعالى يعلم ما هو خير لكم، وأنتم لا تعلمون ذلك. فبادروا إلى الجهاد في سبيله.",
        "char_start": 0,
        "char_end": 282,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_083_chunk00",
        "verse_key": "3:83",
        "text_ar": "أيريد هؤلاء الفاسقون من أهل الكتاب غير دين الله -وهو الإسلام الذي بعث الله به محمدا صلى الله عليه وسلم-، مع أن كل مَن في السموات والأرض استسلم وانقاد وخضع لله طواعية -كالمؤمنين- ورغمًا عنهم عند الشدائد، حين لا ينفعهم ذلك وهم الكفار، كما خضع له سائر الكائنات، وإليه يُرجَعون يوم المعاد، فيجازي كلا بعمله. وهذا تحذير من الله تعالى لخلقه أن يرجع إليه أحد منهم على غير ملة الإسلام.",
        "char_start": 0,
        "char_end": 377,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_112_chunk00",
        "verse_key": "3:112",
        "text_ar": "جعل الله الهوان والصغار أمرًا لازمًا لا يفارق اليهود، فهم أذلاء محتقرون أينما وُجِدوا، إلا بعهد من الله وعهد من الناس يأمنون به على أنفسهم وأموالهم، وذلك هو عقد الذمة لهم وإلزامهم أحكام الإسلام، ورجعوا بغضب من الله مستحقين له، وضُربت عليهم الذلَّة والمسكنة، فلا ترى اليهوديَّ إلا وعليه الخوف والرعب من أهل الإيمان; ذلك الذي جعله الله عليهم بسبب كفرهم بالله، وتجاوزهم حدوده، وقَتْلهم الأنبياء ظلمًا واعتداء، وما جرَّأهم على هذا إلا ارتكابهم للمعاصي، وتجاوزهم حدود الله.",
        "char_start": 0,
        "char_end": 468,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_118_chunk00",
        "verse_key": "3:118",
        "text_ar": "يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، لا تتخذوا الكافرين أولياء من دون المؤمنين، تُطْلعونهم على أسراركم، فهؤلاء لا يَفْتُرون عن إفساد حالكم، وهم يفرحون بما يصيبكم من ضرر ومكروه، وقد ظهرت شدة البغض في كلامهم، وما تخفي صدورهم من العداوة لكم أكبر وأعظم. قد بيَّنَّا لكم البراهين والحجج، لتتعظوا وتحذروا، إن كنتم تعقلون عن الله مواعظه وأمره ونهيه.",
        "char_start": 0,
        "char_end": 353,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "يا أيها الذين آمنوا لا يجوز لكم أن تجعلوا نساء آبائكم من جملة تَرِكتهم، تتصرفون فيهن بالزواج منهن، أو المنع لهن، أو تزويجهن للآخرين، وهن كارهات لذلك كله، ولا يجوز لكم أن تضارُّوا أزواجكم وأنتم كارهون لهن; ليتنازلن عن بعض ما آتيتموهن من مهر ونحوه، إلا أن يرتكبن أمرا فاحشا كالزنى، فلكم حيننذ إمساكهن حتى تأخذوا ما أعطيتموهن. ولتكن مصاحبتكم لنسائكم مبنية على التكريم والمحبة، وأداء ما لهن من حقوق. فإن كرهتموهن لسبب من الأسباب الدنيوية فاصبروا; فعسى أن تكرهوا أمرًا من الأمور ويكون فيه خير كثير.",
        "char_start": 0,
        "char_end": 493,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_014_chunk00",
        "verse_key": "5:14",
        "text_ar": "واخذنا علي الذين ادَّعوا انهم اتباع المسيح عيسي -وليسوا كذلك- العهد الموكد الذي اخذناه علي بني اسراييل: بان يُتابعوا رسولهم وينصروه ويوازروه، فبدَّلوا دينهم، وتركوا نصيبًا مما ذكروا به، فلم يعملوا به، كما صنع اليهود، فالقينا بينهم العداوه والبغضاء الي يوم القيامه، وسوف ينبيهم الله بما كانوا يصنعون يوم الحساب، وسيعاقبهم علي صنيعهم.",
        "char_start": 0,
        "char_end": 332,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_064_chunk00",
        "verse_key": "5:64",
        "text_ar": "يُطلع الله نَبِيَّه علي شيء من ماثم اليهود -وكان مما يُسرُّونه فيما بينهم- انهم قالوا: يد الله محبوسه عن فعل الخيرات، بَخِلَ علينا بالرزق والتوسعه، وذلك حين لحقهم جَدْب وقحط. غُلَّتْ ايديهم، اي: حبست ايديهم هم عن فِعْلِ الخيرات، وطردهم الله من رحمته بسبب قولهم. وليس الامر كما يفترونه علي ربهم، بل يداه مبسوطتان لا حَجْرَ عليه، ولا مانع يمنعه من الانفاق، فانه الجواد الكريم، ينفق علي مقتضي الحكمه وما فيه مصلحه العباد. وفي الايه اثبات لصفه اليدين لله سبحانه وتعالي كما يليق به من غير تشبيه ولا تكييف.",
        "char_start": 0,
        "char_end": 868,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_091_chunk00",
        "verse_key": "5:91",
        "text_ar": "إنما يريد الشيطان بتزيين الآثام لكم أن يُلقِي بينكم ما يوجد العداوة والبغضاء، بسبب شرب الخمر ولعب الميسر، ويصرفكم عن ذكر الله وعن الصلاة بغياب العقل في شرب الخمر، والاشتغال باللهو في لعب الميسر، فانتهوا عن ذلك.",
        "char_start": 0,
        "char_end": 210,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_008_008_chunk00",
        "verse_key": "8:8",
        "text_ar": "ليعزَّ الله الإسلام وأهله، ويذهب الشرك وأهله، ولو كره المشركون ذلك.",
        "char_start": 0,
        "char_end": 67,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_008_016_chunk00",
        "verse_key": "8:16",
        "text_ar": "ومن يُوَلِّهم منكم ظهره وقت الزحف إلا منعطفًا لمكيدة الكفار أو منحازًا إلى جماعة المسلمين حاضري الحرب حيث كانوا، فقد استحق الغضب من الله، ومقامه جهنم، وبئس المصير والمنقلب.",
        "char_start": 0,
        "char_end": 172,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_032_chunk00",
        "verse_key": "9:32",
        "text_ar": "يريد الكفار بتكذيبهم أن يبطلوا دين الإسلام، ويبطلوا حجج الله وبراهينه على توحيده الذي جاء به محمد صلى الله عليه وسلم، ويأبى الله إلا أن يتم دينه ويظهره، ويعلي كلمته، ولو كره ذلك الجاحدون.",
        "char_start": 0,
        "char_end": 187,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "هو الذي أرسل رسوله محمدًا صلى الله عليه وسلم بالقرآن ودين الإسلام; ليعليه على الأديان كلها، ولو كره المشركون دين الحق -الإسلام- وظهوره على الأديان.",
        "char_start": 0,
        "char_end": 147,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_046_chunk00",
        "verse_key": "9:46",
        "text_ar": "ولو اراد المنافقون الخروج معك -ايها النبي- الي الجهاد لتاهَّبوا له بالزاد والراحله، ولكن الله كره خروجهم فثَقُلَ عليهم الخروج قضاء وقدرًا، وان كان امرهم به شرعا، وقيل لهم: تخلفوا مع القاعدين من المرضي والضعفاء والنساء والصبيان.",
        "char_start": 0,
        "char_end": 227,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_053_chunk00",
        "verse_key": "9:53",
        "text_ar": "قل -ايها النبي- للمنافقين: انفقوا اموالكم كيف شيتم، وعلي اي حال شيتم طايعين او كارهين، لن يقبل الله منكم نفقاتكم; لانكم قوم خارجون عن دين الله وطاعته.",
        "char_start": 0,
        "char_end": 150,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_009_081_chunk00",
        "verse_key": "9:81",
        "text_ar": "فرح المخلفون الذين تخلفوا عن رسول الله صلي الله عليه وسلم بقعودهم في (المدينه) مخالفين لرسول الله صلي الله عليه وسلم، وكرهوا ان يجاهدوا معه باموالهم وانفسهم في سبيل الله، وقال بعضهم لبعض: لا تنفروا في الحرِّ، وكانت غزوه (تبوك) في وقت شده الحرِّ. قل لهم -ايها الرسول-: نار جهنم اشد حرًا، لو كانوا يعلمون ذلك.",
        "char_start": 0,
        "char_end": 307,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_010_082_chunk00",
        "verse_key": "10:82",
        "text_ar": "ويثبِّت الله الحق الذي جئتكم به من عنده فيُعليه على باطلكم بكلماته وأمره، ولو كره المجرمون أصحاب المعاصي مِن آل فرعون.",
        "char_start": 0,
        "char_end": 118,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_010_099_chunk00",
        "verse_key": "10:99",
        "text_ar": "ولو شاء ربك -أيها الرسول- الإيمان لأهل الأرض كلهم لآمنوا جميعًا بما جئتهم به، ولكن له حكمة في ذلك; فإنه يهدي من يشاء ويضل من يشاء وَفْق حكمته، وليس في استطاعتك أن تُكْره الناس على الإيمان.",
        "char_start": 0,
        "char_end": 188,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_011_070_chunk00",
        "verse_key": "11:70",
        "text_ar": "فلما رأى إبراهيم أيديهم لا تَصِل إلى العجل الذي أتاهم به ولا يأكلون منه، أنكر ذلك منهم، وأحس في نفسه خيفة وأضمرها، قالت الملائكة -لما رأت ما بإبراهيم من الخوف-: لا تَخَفْ إنا ملائكة ربك أُرسلنا إلى قوم لوط لإهلاكهم.",
        "char_start": 0,
        "char_end": 215,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "قوله تعالى : وإذ قلتم يا موسى لن نصبر على طعام واحد فادع لنا ربك يخرج لنا مما تنبت الأرض من بقلها وقثائها وفومها وعدسها وبصلها قال أتستبدلون الذي هو أدنى بالذي هو خير اهبطوا مصرا فإن لكم ما سألتم وضربت عليهم الذلة والمسكنة وباءوا بغضب من الله ذلك بأنهم كانوا يكفرون بآيات الله ويقتلون النبيين بغير الحق ذلك بما عصوا وكانوا يعتدونقوله تعالى : وإذ قلتم يا موسى لن نصبر على طعام واحد كان هذا القول منهم في التيه حين ملوا المن والسلوى وتذكروا عيشهم الأول بمصر ، قال الحسن : كانوا نتانى أهل كراث وأبصال وأ",
        "char_start": 0,
        "char_end": 14579,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_090_chunk00",
        "verse_key": "2:90",
        "text_ar": "قوله تعالى : بئسما اشتروا به أنفسهم أن يكفروا بما أنزل الله بغيا أن ينزل الله من فضله على من يشاء من عباده فباءوا بغضب على غضب وللكافرين عذاب مهين قوله تعالى : بئسما اشتروا بئس في كلام العرب مستوفية للذم ، كما أن \" نعم \" مستوفية للمدح . وفي كل واحدة منها أربع لغات : بئس ، بئس ، بئس ، بئس . نعم ، نعم ، نعم ، نعم . ومذهب سيبويه أن \" ما \" فاعلة بئس ، ولا تدخل إلا على أسماء الأجناس والنكرات . وكذا نعم ، فتقول نعم الرجل زيد ، ونعم رجلا زيد ، فإذا كان معها اسم بغير ألف ولام فهو نصب أبدا ، فإذا كان فيه",
        "char_start": 0,
        "char_end": 2810,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_216_chunk00",
        "verse_key": "2:216",
        "text_ar": "قوله تعالى : كتب عليكم القتال وهو كره لكم وعسى أن تكرهوا شيئا وهو خير لكم وعسى أن تحبوا شيئا وهو شر لكم والله يعلم وأنتم لا تعلمونفيه ثلاث مسائل :الأولى : قوله تعالى : \" كتب \" معناه فرض ، وقد تقدم مثله . وقرأ قوم \" كتب عليكم القتل \" ، وقال الشاعر ( هو عمر بن أبي ربيعة ) : [ ص: 37 ]كتب القتل والقتال علينا وعلى الغانيات جر الذيولهذا هو فرض الجهاد ، بين سبحانه أن هذا مما امتحنوا به وجعل وصلة إلى الجنة . والمراد بالقتال قتال الأعداء من الكفار ، وهذا كان معلوما لهم بقرائن الأحوال ، ولم يؤذن للنبي صلى",
        "char_start": 0,
        "char_end": 3194,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_083_chunk00",
        "verse_key": "3:83",
        "text_ar": "قوله تعالى : أفغير دين الله يبغون وله أسلم من في السماوات والأرض طوعا وكرها وإليه يرجعونقوله تعالى : أفغير دين الله يبغون قال الكلبي : إن كعب بن الأشرف وأصحابه [ ص: 120 ] اختصموا مع النصارى إلى النبي - صلى الله عليه وسلم - فقالوا : أينا أحق بدين إبراهيم ؟ فقال النبي - صلى الله عليه وسلم - : ( كلا الفريقين بريء من دينه ) . فقالوا : ما نرضى بقضائك ولا نأخذ بدينك ; فنزل أفغير دين الله يبغون يعني يطلبون . ونصبت غير بيبغون ، أي يبغون غير دين الله . وقرأ أبو عمرو وحده \" يبغون \" بالياء على الخبر \" وإلي",
        "char_start": 0,
        "char_end": 2367,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_112_chunk00",
        "verse_key": "3:112",
        "text_ar": "قوله تعالى : ضربت عليهم الذلة يعني اليهود . أين ما ثقفوا أي وجدوا ولقوا ، وتم الكلام . وقد مضى في البقرة معنى ضرب الذلة عليهم . إلا بحبل من الله استثناء منقطع ليس من الأول . أي لكنهم يعتصمون بحبل من الله . وحبل من الناس يعني الذمة التي لهم . والناس : محمد والمؤمنون يؤدون إليهم الخراج فيؤمنونهم . وفي الكلام اختصار ، والمعنى : إلا أن يعتصموا بحبل من الله ، فحذف ; قاله الفراء .وباءوا بغضب من الله أي رجعوا . وقيل احتملوا . وأصله في اللغة أنه لزمهم ، وقد مضى في البقرة . ثم أخبر لم فعل ذلك بهم . فقال ",
        "char_start": 0,
        "char_end": 612,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_118_chunk00",
        "verse_key": "3:118",
        "text_ar": "قوله تعالى : ياأيها الذين آمنوا لا تتخذوا بطانة من دونكم لا يألونكم خبالا ودوا ما عنتم قد بدت البغضاء من أفواههم وما تخفي صدورهم أكبر قد بينا لكم الآيات إن كنتم تعقلونفيه ست مسائل :الأولى : أكد الله تعالى الزجر عن الركون إلى الكفار . وهو متصل بما سبق من قوله : إن تطيعوا فريقا من الذين أوتوا الكتاب . والبطانة مصدر ، يسمى به الواحد والجمع . وبطانة الرجل خاصته الذين يستبطنون أمره ، وأصله من البطن الذي هو خلاف الظهر . وبطن فلان بفلان يبطن بطونا وبطانة إذا كان خاصا به . قال الشاعر :أولئك خلصائي نعم و",
        "char_start": 0,
        "char_end": 5004,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن لتذهبوا ببعض ما آتيتموهن إلا أن يأتين بفاحشة مبينة وعاشروهن بالمعروف فإن كرهتموهن فعسى أن تكرهوا شيئا ويجعل الله فيه خيرا كثيرافيه ثمان مسائل :الأولى : قوله تعالى : لا يحل لكم أن ترثوا النساء هذا متصل بما تقدم ذكره من الزوجات . والمقصود نفي الظلم عنهن وإضرارهن ؛ والخطاب للأولياء . وأن في موضع رفع ب \" يحل \" أي : لا يحل لكم وراثة النساء . وكرها مصدر في موضع الحال . واختلفت الروايات وأقوال المفسرين في سبب نزولها ؛ فروى البخاري عن ابن ع",
        "char_start": 0,
        "char_end": 7931,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_014_chunk00",
        "verse_key": "5:14",
        "text_ar": "قوله تعالى : ومن الذين قالوا إنا نصارى أخذنا ميثاقهم فنسوا حظا مما ذكروا به فأغرينا بينهم العداوة والبغضاء إلى يوم القيامة وسوف ينبئهم الله بما كانوا يصنعون[ ص: 77 ] قوله تعالى : ومن الذين قالوا إنا نصارى أخذنا ميثاقهم أي : في التوحيد والإيمان بمحمد صلى الله عليه وسلم ; إذ هو مكتوب في الإنجيل ، فنسوا حظا وهو الإيمان بمحمد عليه الصلاة والسلام ; أي : لم يعملوا بما أمروا به ، وجعلوا ذلك الهوى والتحريف سببا للكفر بمحمد صلى الله عليه وسلم . ومعنى أخذنا ميثاقهم هو كقولك : أخذت من زيد ثوبه ودرهمه ; قال",
        "char_start": 0,
        "char_end": 2129,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_064_chunk00",
        "verse_key": "5:64",
        "text_ar": "قوله : وقالت اليهود يد الله مغلولة غلت أيديهم ولعنوا بما قالوا بل يداه مبسوطتان ينفق كيف يشاء وليزيدن كثيرا منهم ما أنزل إليك من ربك طغيانا وكفرا وألقينا بينهم العداوة والبغضاء إلى يوم القيامة كلما أوقدوا نارا للحرب أطفأها الله ويسعون في الأرض فسادا والله لا يحب المفسدينقوله تعالى : وقالت اليهود يد الله مغلولة قال عكرمة : إنما قال هذا فنحاص بن عازوراء ، لعنه الله ، وأصحابه ، وكان لهم أموال فلما كفروا بمحمد صلى الله عليه وسلم قل مالهم ; فقالوا : إن الله بخيل ، ويد الله مقبوضة عنا في العطاء ; فالآ",
        "char_start": 0,
        "char_end": 5480,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_091_chunk00",
        "verse_key": "5:91",
        "text_ar": "قوله تعالى : إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر الآية . أعلم الله تعالى عباده أن الشيطان إنما يريد أن يوقع العداوة والبغضاء بيننا بسبب الخمر وغيره ، فحذرنا منها ، ونهانا عنها . روي أن قبيلتين من الأنصار شربوا الخمر وانتشوا ، فعبث بعضهم ببعض ، فلما صحوا رأى بعضهم في وجه بعض آثار ما فعلوا ، وكانوا إخوة ليس في قلوبهم ضغائن ، فجعل بعضهم يقول : لو كان أخي بي رحيما ما فعل بي هذا ، فحدثت بينهم الضغائن ; فأنزل الله : إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء الآية .",
        "char_start": 0,
        "char_end": 1122,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_008_008_chunk00",
        "verse_key": "8:8",
        "text_ar": "ليحق الحق أي يظهر دين الإسلام ويعزه ويبطل الباطل ولو كره المجرمون أي الكفر . وإبطاله إعدامه ; كما أن إحقاق الحق إظهاره بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولو كره المجرمون .",
        "char_start": 0,
        "char_end": 182,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_008_016_chunk00",
        "verse_key": "8:16",
        "text_ar": "قال ابن القاسم : لا تجوز شهادة من فر من الزحف ، ولا يجوز لهم الفرار وإن فر إمامهم ; لقوله عز وجل : ومن يولهم يومئذ دبره الآية . قال : ويجوز الفرار من أكثر من ضعفهم ، وهذا ما لم يبلغ عدد المسلمين اثني عشر ألفا ; فإن بلغ اثني عشر ألفا لم يحل لهم الفرار وإن زاد عدد المشركين على الضعف ; لقول رسول الله صلى الله عليه وسلم : ولن يغلب اثنا عشر ألفا من قلة فإن أكثر أهل العلم خصصوا هذا العدد بهذا الحديث من عموم الآية .قلت : رواه أبو بشر وأبو سلمة العاملي ، وهو الحكم بن عبد الله بن خطاف وهو متروك . قالا : ",
        "char_start": 0,
        "char_end": 3029,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_032_chunk00",
        "verse_key": "9:32",
        "text_ar": "قوله تعالى يريدون أن يطفئوا نور الله بأفواههم ويأبى الله إلا أن يتم نوره ولو كره الكافرونقوله تعالى يريدون أن يطفئوا نور الله أي دلالته وحججه على توحيده . جعل البراهين بمنزلة النور لما فيها من البيان . وقيل : المعنى نور الإسلام ، أي أن يخمدوا دين الله بتكذيبهم .بأفواههم ، جمع فوه على الأصل ؛ لأن الأصل في فم : فوه ، مثل حوض وأحواض .ويأبى الله إلا أن يتم نوره يقال : كيف دخلت ( إلا ) وليس في الكلام حرف نفي ، ولا يجوز : ضربت إلا زيدا . فزعم الفراء أن ( إلا ) إنما دخلت لأن في الكلام طرفا من الجحد . ق",
        "char_start": 0,
        "char_end": 924,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "قوله تعالى هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركونقوله تعالى هو الذي أرسل رسوله يريد محمدا صلى الله عليه وسلم .بالهدى أي بالفرقان ودين الحق ليظهره على الدين كله أي بالحجة والبراهين . وقد أظهره على شرائع الدين حتى لا يخفى عليه شيء منها ، عن ابن عباس وغيره . وقيل : ليظهره أي ليظهر الدين دين الإسلام على كل دين . قال أبو هريرة والضحاك : هذا عند نزول عيسى عليه السلام . وقال السدي : ذاك عند خروج المهدي ، لا يبقى أحد إلا دخل في الإسلام أو أدى الجزية . وقيل : المهدي هو ",
        "char_start": 0,
        "char_end": 1128,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_046_chunk00",
        "verse_key": "9:46",
        "text_ar": "قوله تعالى ولو أرادوا الخروج لأعدوا له عدة ولكن كره الله انبعاثهم فثبطهم وقيل اقعدوا مع القاعدينقوله تعالى ولو أرادوا الخروج لأعدوا له عدة أي لو أرادوا الجهاد لتأهبوا أهبة السفر . فتركهم الاستعداد دليل على إرادتهم التخلف .ولكن كره الله انبعاثهم أي خروجهم معك فثبطهم أي حبسهم عنك وخذلهم ؛ لأنهم قالوا : إن لم يؤذن لنا في الجلوس أفسدنا وحرضنا على المؤمنين . ويدل على هذا أن بعده لو خرجوا فيكم ما زادوكم إلا خبالا .وقيل اقعدوا مع القاعدين قيل : هو من قول بعضهم لبعض . وقيل : هو من قول النبي صلى الله علي",
        "char_start": 0,
        "char_end": 755,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_053_chunk00",
        "verse_key": "9:53",
        "text_ar": "قوله تعالى قل أنفقوا طوعا أو كرها لن يتقبل منكم إنكم كنتم قوما فاسقينفيه أربع مسائل الأولى : قال ابن عباس : نزلت في الجد بن قيس إذ قال ائذن لي في القعود وهذا مالي أعينك به . ولفظ ( أنفقوا ) أمر ، ومعناه الشرط والجزاء . وهكذا تستعمل العرب في مثل هذا تأتي ب \" أو \" كما قال الشاعر :أسيئي بنا أو أحسني لا ملومة لدينا ولا مقلية إن تقلتوالمعنى إن أسأت أو أحسنت فنحن على ما تعرفين .ومعنى الآية : إن أنفقتم طائعين أو مكرهين فلن يقبل منكم . ثم بين جل وعز لم لا يقبل منهم فقال : وما منعهم أن تقبل منهم نفقاتهم ",
        "char_start": 0,
        "char_end": 3428,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_009_081_chunk00",
        "verse_key": "9:81",
        "text_ar": "قوله تعالى فرح المخلفون بمقعدهم خلاف رسول الله وكرهوا أن يجاهدوا بأموالهم وأنفسهم في سبيل الله وقالوا لا تنفروا في الحر قل نار جهنم أشد حرا لو كانوا يفقهونقوله تعالى فرح المخلفون بمقعدهم أي بقعودهم . قعد قعودا ومقعدا ; أي جلس . وأقعده غيره ; عن الجوهري . والمخلف المتروك ; أي خلفهم الله وثبطهم ، أو خلفهم رسول الله والمؤمنون لما علموا تثاقلهم عن الجهاد ; قولان ، وكان هذا في غزوة تبوك .خلاف رسول الله مفعول من أجله ، وإن شئت كان مصدرا . والخلاف المخالفة . ومن [ ص: 140 ] قرأ \" خلف رسول الله \" أراد ال",
        "char_start": 0,
        "char_end": 705,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_010_082_chunk00",
        "verse_key": "10:82",
        "text_ar": "قوله تعالى ويحق الله الحق بكلماته ولو كره المجرمون قوله تعالى ويحق الله الحق أي يبينه ويوضحه .بكلماته أي بكلامه وحججه وبراهينه . وقيل : بعداته بالنصر .ولو كره المجرمون من آل فرعون .",
        "char_start": 0,
        "char_end": 181,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_010_099_chunk00",
        "verse_key": "10:99",
        "text_ar": "قوله تعالى ولو شاء ربك لآمن من في الأرض كلهم جميعا أفأنت تكره الناس حتى يكونوا مؤمنينقوله تعالى ولو شاء ربك لآمن من في الأرض كلهم جميعا أي لاضطرهم إليه [ ص: 291 ] . كلهم تأكيد ل \" من \" . جميعا عند سيبويه نصب على الحال . وقال الأخفش : جاء بقوله جميعا بعد \" كل \" تأكيدا ; كقوله : لا تتخذوا إلهين اثنينقوله تعالى أفأنت تكره الناس حتى يكونوا مؤمنين قال ابن عباس : كان النبي صلى الله عليه وسلم حريصا على إيمان جميع الناس ; فأخبره الله تعالى أنه لا يؤمن إلا من سبقت له السعادة في الذكر الأول ، ولا يضل إلا ",
        "char_start": 0,
        "char_end": 594,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_011_070_chunk00",
        "verse_key": "11:70",
        "text_ar": "قوله تعالى : فلما رأى أيديهم لا تصل إليه نكرهم يقول : أنكرهم ; تقول : نكرتك وأنكرتك واستنكرتك إذا وجدته على غير ما عهدته ; قال الشاعر :وأنكرتني وما كان الذي نكرت من الحوادث إلا الشيب والصلعافجمع بين اللغتين . ويقال : نكرت لما تراه بعينك . وأنكرت لما تراه بقلبك .",
        "char_start": 0,
        "char_end": 262,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "اي: واذكروا, اذ قلتم لموسي, علي وجه التملل لنعم الله والاحتقار لها، { لَنْ نَصْبِرَ عَلَي طَعَامٍ وَاحِدٍ } اي: جنس من الطعام, وان كان كما تقدم انواعا, لكنها لا تتغير، { فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنْبِتُ الْاَرْضُ مِنْ بَقْلِهَا } اي: نباتها الذي ليس بشجر يقوم علي ساقه، { وَقِثَّايِهَا } وهو الخيار { وَفُومِهَا } اي: ثومها، والعدس والبصل معروف، قال لهم موسي { اَتَسْتَبْدِلُونَ الَّذِي هُوَ اَدْنَي } وهو الاطعمه المذكوره، { بِالَّذِي هُوَ خَيْرٌ } وهو المن والسلوي, فهذا غير لاي",
        "char_start": 0,
        "char_end": 2617,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_090_chunk00",
        "verse_key": "2:90",
        "text_ar": "اي: ولما جاءهم كتاب من عند الله علي يد افضل الخلق وخاتم الانبياء, المشتمل علي تصديق ما معهم من التوراه, وقد علموا به, وتيقنوه حتي انهم كانوا اذا وقع بينهم وبين المشركين في الجاهليه حروب, استنصروا بهذا النبي, وتوعدوهم بخروجه, وانهم يقاتلون المشركين معه، فلما جاءهم هذا الكتاب والنبي الذي عرفوا, كفروا به, بغيا وحسدا, ان ينزل الله من فضله علي من يشاء من عباده، فلعنهم الله, وغضب عليهم غضبا بعد غضب, لكثره كفرهم وتوالي شكهم وشركهم. ولهم في الاخره { عذاب مهين } اي: مولم موجع, وهو صلي الجحيم, وفوت النعيم",
        "char_start": 0,
        "char_end": 647,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_216_chunk00",
        "verse_key": "2:216",
        "text_ar": "هذه الايه, فيها فرض القتال في سبيل الله, بعد ما كان المومنون مامورين بتركه, لضعفهم, وعدم احتمالهم لذلك، فلما هاجر النبي صلي الله عليه وسلم الي المدينه, وكثر المسلمون, وقووا امرهم الله تعالي بالقتال، واخبر انه مكروه للنفوس, لما فيه من التعب والمشقه, وحصول انواع المخاوف والتعرض للمتالف، ومع هذا, فهو خير محض, لما فيه من الثواب العظيم, والتحرز من العقاب الاليم, والنصر علي الاعداء والظفر بالغنايم, وغير ذلك, مما هو مرب, علي ما فيه من الكراهه { وَعَسَي اَنْ تُحِبُّوا شَيْيًا وَهُوَ شَرٌّ لَكُمْ } وذلك ",
        "char_start": 0,
        "char_end": 1236,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_083_chunk00",
        "verse_key": "3:83",
        "text_ar": "اي: ايطلب الطالبون ويرغب الراغبون في غير دين الله؟ لا يحسن هذا ولا يليق، لانه لا احسن دينا من دين الله { وله اسلم من في السماوات والارض طوعا وكرها } اي: الخلق كلهم منقادون بتسخيره مستسلمون له طوعا واختيارا، وهم المومنون المسلمون المنقادون لعباده ربهم، وكرها وهم ساير الخلق، حتي الكافرون مستسلمون لقضايه وقدره لا خروج لهم عنه، ولا امتناع لهم منه، واليه مرجع الخلايق كلها، فيحكم بينهم ويجازيهم بحكمه الداير بين الفضل والعدل.",
        "char_start": 0,
        "char_end": 422,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_112_chunk00",
        "verse_key": "3:112",
        "text_ar": "اخبر تعالي انه عاقبهم بالذله في بواطنهم والمسكنه علي ظواهرهم، فلا يستقرون ولا يطمينون { الا بحبل } اي: عهد { من الله وحبل من الناس } فلا يكون اليهود الا تحت احكام المسلمين وعهدهم، توخذ منهم الجزيه ويستذلون، او تحت احكام النصاري وقد { باءوا } مع ذلك { بغضب من الله } وهذا اعظم العقوبات، والسبب الذي اوصلهم الي هذه الحال ذكره الله بقوله: { ذلك بانهم كانوا يكفرون بايات الله } التي انزلها الله علي رسوله محمد صلي الله عليه وسلم الموجبه لليقين والايمان، فكفروا بها بغيا وعنادا { ويقتلون الانبياء بغير حق ",
        "char_start": 0,
        "char_end": 705,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_118_chunk00",
        "verse_key": "3:118",
        "text_ar": "ينهي تعالي عباده المومنين ان يتخذوا بطانه من المنافقين من اهل الكتاب وغيرهم يظهرونهم علي سرايرهم او يولونهم بعض الاعمال الاسلاميه وذلك انهم هم الاعداء الذين امتلات قلوبهم من العداوه والبغضاء فظهرت علي افواههم { وما تخفي صدورهم اكبر } مما يسمع منهم فلهذا { لا يالونكم خبالا } اي: لا يقصرون في حصول الضرر عليكم والمشقه وعمل الاسباب التي فيها ضرركم ومساعده الاعداء عليكم قال الله للمومنين { قد بينا لكم الايات } اي: التي فيها مصالحكم الدينيه والدنيويه { لعلكم تعقلون } فتعرفونها وتفرقون بين الصديق والعد",
        "char_start": 0,
        "char_end": 651,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "كانوا في الجاهليه اذا مات احدهم عن زوجته، راي قريبُه كاخيه وابن عمه ونحوهما انه احق بزوجته من كل احد، وحماها عن غيره، احبت او كرهت. فان احبها تزوجها علي صداق يحبه دونها، وان لم يرضها عضلها فلا يزوجها الا من يختاره هو، وربما امتنع من تزويجها حتي تبذل له شييًا من ميراث قريبه او من صداقها، وكان الرجل ايضا يعضل زوجته التي يكون يكرهها ليذهب ببعض ما اتاها، فنهي الله المومنين عن جميع هذه الاحوال الا حالتين: اذا رضيت واختارت نكاح قريب زوجها الاول، كما هو مفهوم قوله: { كَرْهًا } واذا اتين بفاحشه مبينه كا",
        "char_start": 0,
        "char_end": 1498,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_014_chunk00",
        "verse_key": "5:14",
        "text_ar": "اي: وكما اخذنا علي اليهود العهد والميثاق، فكذلك اخذنا علي { الَّذِينَ قَالُوا اِنَّا نَصَارَي ْ} لعيسي ابن مريم، وزكوا انفسهم بالايمان بالله ورسله وما جاءوا به، فنقضوا العهد، { فَنَسُوا حَظًّا مِّمَّا ذُكِّرُوا بِهِ ْ} نسيانا علميا، ونسيانا عمليا. { فَاَغْرَيْنَا بَيْنَهُمُ الْعَدَاوَهَ وَالْبَغْضَاءَ اِلَي يَوْمِ الْقِيَامَهِ ْ} اي: سلطنا بعضهم علي بعض، وصار بينهم من الشرور والاحن ما يقتضي بغض بعضهم بعضا ومعاداه بعضهم بعضا الي يوم القيامه، وهذا امر مشاهد، فان النصاري لم يزالوا ولا يزالون في بغض",
        "char_start": 0,
        "char_end": 591,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_064_chunk00",
        "verse_key": "5:64",
        "text_ar": "يخبر تعالي عن مقاله اليهود الشنيعه، وعقيدتهم الفظيعه، فقال: { وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَهٌ ْ} اي: عن الخير والاحسان والبر. { غُلَّتْ اَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا ْ} وهذا دعاء عليهم بجنس مقالتهم. فان كلامهم متضمن لوصف الله الكريم، بالبخل وعدم الاحسان. فجازاهم بان كان هذا الوصف منطبقا عليهم. فكانوا ابخل الناس واقلهم احسانا، واسواهم ظنا بالله، وابعدهم الله عن رحمته التي وسعت كل شيء، وملات اقطار العالم العلوي والسفلي. ولهذا قال: { بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنْفِقُ كَيْفَ ",
        "char_start": 0,
        "char_end": 2795,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_091_chunk00",
        "verse_key": "5:91",
        "text_ar": "ومنها: ان هذه موجبه للعداوه والبغضاء بين الناس، والشيطان حريص علي بثها، خصوصا الخمر والميسر، ليوقع بين المومنين العداوه والبغضاء. فان في الخمر من انغلاب العقل وذهاب حجاه، ما يدعو الي البغضاء بينه وبين اخوانه المومنين، خصوصا اذا اقترن بذلك من السباب ما هو من لوازم شارب الخمر، فانه ربما اوصل الي القتل. وما في الميسر من غلبه احدهما للاخر، واخذ ماله الكثير في غير مقابله، ما هو من اكبر الاسباب للعداوه والبغضاء. ومنها: ان هذه الاشياء تصد القلب، ويتبعه البدن عن ذكر الله وعن الصلاه، اللذين خلق لهما العب",
        "char_start": 0,
        "char_end": 1102,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_008_008_chunk00",
        "verse_key": "8:8",
        "text_ar": ". لِيُحِقَّ الْحَقَّ بما يظهر من الشواهد والبراهين على صحته وصدقه،. وَيُبْطِلَ الْبَاطِلَ بما يقيم من الأدلة والشواهد على بطلانه وَلَوْ كَرِهَ الْمُجْرِمُونَ فلا يبالي اللّه بهم.",
        "char_start": 0,
        "char_end": 178,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_008_016_chunk00",
        "verse_key": "8:16",
        "text_ar": "‏{‏وَمَنْ يُوَلِّهِمْ يَوْمَيِذٍ دُبُرَهُ اِلا مُتَحَرِّفًا لِقِتَالٍ اَوْ مُتَحَيِّزًا اِلَي فِيَهٍ فَقَدْ بَاءَ‏}‏ اي‏:‏ رجع ‏{‏بِغَضَبٍ مِنَ اللَّهِ وَمَاْوَاهُ‏}‏ اي‏:‏ مقره ‏{‏جَهَنَّمُ وَبِيْسَ الْمَصِيرُ‏}‏‏.‏ وهذا يدل علي ان الفرار من الزحف من غير عذر من اكبر الكباير، كما وردت بذلك الاحاديث الصحيحه وكما نص هنا علي وعيده بهذا الوعيد الشديد‏.‏ ومفهوم الايه‏:‏ ان المتحرف للقتال، وهو الذي ينحرف من جهه الي اخري، ليكون امكن له في القتال، وانكي لعدوه، فانه لا باس بذلك، لانه لم يول دبره فارا، وا",
        "char_start": 0,
        "char_end": 1178,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_032_chunk00",
        "verse_key": "9:32",
        "text_ar": "فلما تبين انه لا حجه لهم علي ما قالوه، ولا برهان لما اصَّلوه، وانما هو مجرد قول قالوه وافتراء افتروه اخبر انهم ‏{‏يُرِيدُونَ‏}‏ بهذا ‏{‏اَنْ يُطْفِيُوا نُورَ اللَّهِ بِاَفْوَاهِهِمْ‏}‏‏.‏ ونور اللّه‏:‏ دينه الذي ارسل به الرسل، وانزل به الكتب، وسماه اللّه نورا، لانه يستنار به في ظلمات الجهل والاديان الباطله، فانه علم بالحق، وعمل بالحق، وما عداه فانه بضده، فهولاء اليهود والنصاري ومن ضاهوه من المشركين، يريدون ان يطفيوا نور اللّه بمجرد اقوالهم، التي ليس عليها دليل اصلا‏.‏ ‏{‏وَيَاْبَي اللَّهُ اِلَّا",
        "char_start": 0,
        "char_end": 828,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "ثم بين تعالي هذا النور الذي قد تكفل باتمامه وحفظه فقال‏:‏ ‏{‏هُوَ الَّذِي اَرْسَلَ رَسُولَهُ بِالْهُدَي‏}‏ الذي هو العلم النافع ‏{‏وَدِينِ الْحَقِّ‏}‏ الذي هو العمل الصالح فكان ما بعث اللّه به محمدا ـ صلي الله عليه وسلم ـ مشتملًا علي بيان الحق من الباطل في اسماء اللّه واوصافه وافعاله، وفي احكامه واخباره، والامر بكل مصلحه نافعه للقلوب، والارواح والابدان من اخلاص الدين للّه وحده، ومحبه اللّه وعبادته، والامر بمكارم الاخلاق ومحاسن الشيم، والاعمال الصالحه والاداب النافعه، والنهي عن كل ما يضاد ذلك وين",
        "char_start": 0,
        "char_end": 881,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_046_chunk00",
        "verse_key": "9:46",
        "text_ar": "يقول تعالي مبينا ان المتخلفين من المنافقين قد ظهر منهم من القراين ما يبين انهم ما قصدوا الخروج للجهاد بالكليه، وان اعذارهم التي اعتذروها باطله، فان العذر هو المانع الذي يمنع اذا بذل العبد وسعه، وسعي في اسباب الخروج، ثم منعه مانع شرعي، فهذا الذي يعذر‏.‏ ‏{‏و‏}‏ اما هولاء المنافقون فـ ‏{‏لَوْ اَرَادُوا الْخُرُوجَ لَاَعَدُّوا لَهُ عُدَّهً‏}‏ اي‏:‏ لاستعدوا وعملوا ما يمكنهم من الاسباب، ولكن لما لم يعدوا له عده، علم انهم ما ارادوا الخروج‏.‏ ‏{‏وَلَكِنْ كَرِهَ اللَّهُ انْبِعَاثَهُمْ‏}‏ معكم في الخروج ",
        "char_start": 0,
        "char_end": 705,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_053_chunk00",
        "verse_key": "9:53",
        "text_ar": "يقول تعالي مبينا بطلان نفقات المنافقين، وذاكرا السبب في ذلك ‏{‏قُلْ‏}‏ لهم ‏{‏اَنْفِقُوا طَوْعًا‏}‏ من انفسكم ‏{‏اَوْ كَرْهًا‏}‏ علي ذلك، بغير اختياركم‏.‏ ‏{‏لَنْ يُتَقَبَّلَ مِنْكُمْ‏}‏ شيء من اعمالكم ‏{‏اِنَّكُمْ كُنْتُمْ قَوْمًا فَاسِقِينَ‏}‏ خارجين عن طاعه اللّه .",
        "char_start": 0,
        "char_end": 268,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_009_081_chunk00",
        "verse_key": "9:81",
        "text_ar": "يقول تعالي مبينا تبجح المنافقين بتخلفهم وعدم مبالاتهم بذلك، الدال علي عدم الايمان، واختيار الكفر علي الايمان‏.‏ ‏{‏فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلَافَ رَسُولِ اللَّهِ‏}‏ وهذا قدر زايد علي مجرد التخلف، فان هذا تخلف محرم، وزياده رضا بفعل المعصيه، وتبجح به‏.‏ ‏{‏وَكَرِهُوا اَنْ يُجَاهِدُوا بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ‏}‏ وهذا بخلاف المومنين الذين اذا تخلفوا ـ ولو لعذر ـ حزنوا علي تخلفهم وتاسفوا غايه الاسف، ويحبون ان يجاهدوا باموالهم وانفسهم في سبيل اللّه، لما في قلوب",
        "char_start": 0,
        "char_end": 1021,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_010_082_chunk00",
        "verse_key": "10:82",
        "text_ar": "فألقي السحرة سجدًا حين تبين لهم الحق. فتوعدهم فرعون بالصلب، وتقطيع الأيدي والأرجل، فلم يبالوا بذلك وثبتوا على إيمانهم. وأما فرعون وملؤه، وأتباعهم، فلم يؤمن منهم أحد، بل استمروا في طغيانهم يعمهون.",
        "char_start": 0,
        "char_end": 195,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_010_099_chunk00",
        "verse_key": "10:99",
        "text_ar": "يقول تعالي لنبيه محمد صلي الله عليه وسلم: { وَلَوْ شَاءَ رَبُّكَ لَامَنَ مَنْ فِي الْاَرْضِ كُلُّهُمْ جَمِيعًا ْ} بان يلهمهم الايمان، ويوزع قلوبهم للتقوي، فقدرته صالحه لذلك، ولكنه اقتضت حكمته ان كان بعضهم مومنين، وبعضهم كافرين. { اَفَاَنْتَ تُكْرِهُ النَّاسَ حَتَّي يَكُونُوا مُوْمِنِينَ ْ} اي: لا تقدر علي ذلك، وليس في امكانك، ولا قدره لغير الله علي شيء من ذلك.",
        "char_start": 0,
        "char_end": 362,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_011_070_chunk00",
        "verse_key": "11:70",
        "text_ar": "{ فَلَمَّا رَاَي اَيْدِيَهُمْ لَا تَصِلُ اِلَيْهِ } اي: الي تلك الضيافه { نَكِرَهُمْ وَاَوْجَسَ مِنْهُمْ خِيفَهً } وظن انهم اتوه بشر ومكروه، وذلك قبل ان يعرف امرهم. فـ { قَالُوا لَا تَخَفْ اِنَّا اُرْسِلْنَا اِلَي قَوْمِ لُوطٍ } اي: انا رسل الله, ارسلنا الله الي اهلاك قوم لوط.",
        "char_start": 0,
        "char_end": 277,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذْ قُلْتُمْ يَا مُوسَي لَنْ نَصْبِرَ عَلَي طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنْبِتُ الاَرْضُ مِنْ بَقْلِهَا وَقِثَّايِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَاقد دللنا -فيما مضي قبل- علي معني \" الصبر \" وانه كف النفس وحبسها عن الشيء. (46) فاذ كان ذلك كذلك , فمعني الايه اذا: واذكروا اذا قلتم -يا معشر بني اسراييل-: لن نطيق حبس انفسنا علي طعام واحد - وذلك \" الطعام الواحد \"، هو ما اخبر الله جل ثناوه انه اطعمهموه في تيههم، وهو \" السلوي \" &; 2-12",
        "char_start": 0,
        "char_end": 26605,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_090_chunk00",
        "verse_key": "2:90",
        "text_ar": "القول في تاويل قوله تعالي : بِيْسَمَا اشْتَرَوْا بِهِ اَنْفُسَهُمْ اَنْ يَكْفُرُوا بِمَا اَنْزَلَ اللَّهُ بَغْيًاقال ابوجعفر ومعني قوله جل ثناوه: (بيس ما اشتروا به انفسهم): ساء ما اشتروا به انفسهم.* * *واصل \" بيس \" \" بَيِس \" من \" البوس \", سكنت همزتها، ثم نقلت حركتها الي \" الباء \", كما قيل في\" ظللت \"\" ظلت \", وكما قيل \" للكبد \"،\" كِبْد \" - فنقلت حركه \" الباء \" الي \" الكاف \" لما سكنت \" الباء \".وقد يحتمل ان تكون \" بيس \"، وان كان اصلها \" بَيِس \"، من لغه الذين ينقلون حركه العين من \" فعل \" الي الفاء، ا",
        "char_start": 0,
        "char_end": 15062,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_216_chunk00",
        "verse_key": "2:216",
        "text_ar": "القول في تاويل قوله عز ذكره : كُتِبَ عَلَيْكُمُ الْقِتَالُقال ابو جعفر: يعني بذلك جل ثناوه بقوله : \" كتب عليكم القتال \"، فُرض عليكم القتال، يعني قتال المشركين= وَهُوَ كُرْهٌ لَكُمْ .* * *واختلف اهل العلم في الذين عُنوا بفرض القتال.فقال بعضهم: عني بذلك اصحابُ رسول الله صلي الله عليه وسلم خاصهً دون غيرهم.* ذكر من قال ذلك:4072 - حدثنا القاسم، قال: حدثنا الحسين، قال: حدثني حجاج، عن ابن جريج، قال: سالت عطاء قلت له: \" كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَكُمْ\" ، اواجبٌ الغزوُ علي الناس من اجله",
        "char_start": 0,
        "char_end": 5430,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_083_chunk00",
        "verse_key": "3:83",
        "text_ar": "القول في تاويل قوله : اَفَغَيْرَ دِينِ اللَّهِ يَبْغُونَ وَلَهُ اَسْلَمَ مَنْ فِي السَّمَاوَاتِ وَالاَرْضِ طَوْعًا وَكَرْهًا وَاِلَيْهِ يُرْجَعُونَ (83)قال ابو جعفر: اختلفت القراه في قراءه ذلك:فقراته عامه قراه الحجاز من مكه والمدينه، وقراهُ الكوفه: ( \" اَفَغَيْرَ دِينِ اللَّهِ تَبْغُونَ \" ) ، ( وَاِلَيْهِ تُرْجَعُونَ ) علي وجه الخطاب.* * *وقرا ذلك بعض اهل الحجاز ( اَفَغَيْرَ دِينِ اللَّهِ يَبْغُونَ )( وَاِلَيْهِ يُرْجَعُونَ ) بالياء كلتيهما، علي وجه الخبر عن الغايب.* * *وقرا ذلك بعض اهل البصره: ",
        "char_start": 0,
        "char_end": 6359,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_112_chunk00",
        "verse_key": "3:112",
        "text_ar": "القول في تاويل قوله : لَنْ يَضُرُّوكُمْ اِلا اَذًيقال ابو جعفر: يعني بذلك جل ثناوه: لن يضركم، يا اهل الايمان بالله ورسوله، هولاء الفاسقون من اهل الكتاب بكفرهم وتكذيبهم نبيَّكم محمدًا صلي الله عليه وسلم شييا =\" الا اذي \"، يعني بذلك: ولكنهم يوذونكم بشركهم، واسماعكم كفرهم، وقولهم في عيسي وامه وعزير، ودعايهم اياكم الي الضلاله، ولن يضروكم بذلك، (23) .* * *وهذا من الاستثناء المنقطع الذي هو مخالف معني ما قبله، كما قيل: \" ما اشتكي شييًا الا خيرًا \"، وهذه كلمه محكيه عن العرب سماعًا.* * *وبنحو ما قلنا في ",
        "char_start": 0,
        "char_end": 2486,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_118_chunk00",
        "verse_key": "3:118",
        "text_ar": "القول في تاويل قوله : مَثَلُ مَا يُنْفِقُونَ فِي هَذِهِ الْحَيَاهِ الدُّنْيَا كَمَثَلِ رِيحٍ فِيهَا صِرٌّ اَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوا اَنْفُسَهُمْ فَاَهْلَكَتْهُقال ابو جعفر: يعني بذلك جل ثناوه: شَبَهُ ما ينفق الذين كفروا، اي: شَبَهُ ما يتصدق به الكافر من ماله، (4) فيعطيه من يعطيه علي وجه القُربه الي ربّه وهو لوحدانيه الله جاحد، ولمحمد صلي الله عليه وسلم مكذب، في ان ذلك غير نافعه مع كفره، وانه مضمحلّ عند حاجته اليه، ذاهبٌ بعد الذي كان يرجو من عايده نفعه عليه = كشبه ريح فيها برد شديد، اصابت ",
        "char_start": 0,
        "char_end": 5056,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_019_chunk00",
        "verse_key": "4:19",
        "text_ar": "القول في تاويل قوله : يَا اَيُّهَا الَّذِينَ امَنُوا لا يَحِلُّ لَكُمْ اَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا اتَيْتُمُوهُنَّ اِلا اَنْ يَاْتِينَ بِفَاحِشَهٍ مُبَيِّنَهٍقال ابو جعفر: يعني تبارك وتعالي [بقوله]: (60) \" يا ايها الذين امنوا \"، يا ايها الذين صدَّقوا الله ورسوله =\" لا يحل لكم ان ترثوا النساء كَرهًا \"، يقول: لا يحل لكم ان ترثوا نكاحَ نساء اقاربكم وابايكم كَرْهًا. (61)* * *فان قال قايل: كيف كانوا يرثونهن؟ وما وجه تحريم وراثتهن؟ فقد علمت ان النساء ",
        "char_start": 0,
        "char_end": 29259,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_014_chunk00",
        "verse_key": "5:14",
        "text_ar": "القول في تاويل قوله عز ذكره : وَمِنَ الَّذِينَ قَالُوا اِنَّا نَصَارَي اَخَذْنَا مِيثَاقَهُمْ فَنَسُوا حَظًّا مِمَّا ذُكِّرُوا بِهِقال ابو جعفر: يقول عز ذكره: واخذنا من النصاري الميثاقَ علي طاعتي واداء فرايضي، واتباع رسلي والتصديق بهم، فسلكوا في ميثاقي الذي اخذتُه عليهم منهاج الامه الضاله من اليهود، فبدلوا كذلك دينَهم، ونقضوه نقضَهم، (1) وتركوا حظّهم من ميثاقي الذي اخذته عليهم بالوفاء بعهدي، وضيَّعوا امري، (2) كما:-11596 - حدثنا بشر قال، حدثنا يزيد قال، حدثنا سعيد، عن قتاده: \" ومن الذين قالوا ان",
        "char_start": 0,
        "char_end": 6394,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_064_chunk00",
        "verse_key": "5:64",
        "text_ar": "القول في تاويل قوله : وَقَالَتِ الْيَهُودُ يَدُ اللَّهِ مَغْلُولَهٌ غُلَّتْ اَيْدِيهِمْ وَلُعِنُوا بِمَا قَالُوا بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنْفِقُ كَيْفَ يَشَاءُقال ابو جعفر: وهذا خبر من الله تعالي ذكره عن جراه اليهود علي ربهم، ووصفهم اياه بما ليس من صفته، توبيخًا لهم بذلك، وتعريفًا منه نبيَّه صلي الله عليه وسلم قديمَ جهلهم واغترارهم به، وانكارهم جميع جميل اياديه عندهم، وكثره صفحه عنهم وعفوه عن عظيم اجرامهم= واحتجاجًا لنبيه محمد صلي الله عليه وسلم بانه له نبيٌّ مبعوث ورسول مرسل: انْ كانت هذه ",
        "char_start": 0,
        "char_end": 15470,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_091_chunk00",
        "verse_key": "5:91",
        "text_ar": "القول في تاويل قوله : اِنَّمَا يُرِيدُ الشَّيْطَانُ اَنْ يُوقِعَ بَيْنَكُمُ الْعَدَاوَهَ وَالْبَغْضَاءَ فِي الْخَمْرِ وَالْمَيْسِرِ وَيَصُدَّكُمْ عَنْ ذِكْرِ اللَّهِ وَعَنِ الصَّلاهِ فَهَلْ اَنْتُمْ مُنْتَهُونَ (91)قال ابو جعفر: يقول تعالي ذكره: انما يُريد لكم الشيطانُ شربَ الخمر والمياسرهَ بالقِدَاح، ويحسِّن ذلك لكم، ارادهً منه ان يوقع بينكم العَداوَه والبغضاءَ في شربكم الخمر ومياسرتكم بالقداح، (5) ليعادي بعضكم بعضًا، ويبغِّض بعضَكم الي بعض، فيشتِّت امركم بعد تاليف الله بينكم بالايمان، وجمعه بي",
        "char_start": 0,
        "char_end": 16725,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_008_008_chunk00",
        "verse_key": "8:8",
        "text_ar": "القول في تاويل قوله : لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ (8)قال ابو جعفر: يقول تعالي ذكره: ويريد الله ان يقطع دابر الكافرين، كيما يحق الحق, كيما يُعبد الله وحده دون الالهه والاصنام, ويعزّ الاسلام, وذلك هو \" تحقيق الحق \"=(ويبطل الباطل)، يقول ويبطل عباده الالهه والاوثان والكفر، ولو كره ذلك الذين اجرموا فاكتسبوا الماثم والاوزار من الكفار. (107)15733- حدثنا بشر, قال: حدثنا يزيد, قال: حدثنا سعيد, عن قتاده: (ليحق الحق ويبطل الباطل ولو كره المجرمون)، هم المشركون.* * *",
        "char_start": 0,
        "char_end": 650,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_008_016_chunk00",
        "verse_key": "8:16",
        "text_ar": "ومن يولهم يوميذ دبره \"، يقول: ومن يولهم منكم ظهره =(الا متحرفًا لقتال)، يقول: الا مستطردًا لقتال عدوه، يطلب عورهً له يمكنه اصابتها فيكرّ عليه =(او متحيزًا الي فيه) او: الا ان يوليهم ظهره متحيزًا الي فيه, يقول: صايرًا الي حَيِّز المومنين الذين يفييون به معهم اليهم لقتالهم، (66) ويرجعون به معهم اليهم. (67)* * *وبنحو الذي قلنا في ذلك قال اهل التاويل.* ذكر من قال ذلك:15795- حدثنا ابن وكيع قال، حدثنا ابو خالد الاحمر, عن جويبر, عن الضحاك: (الا متحرفًا لقتال او متحيزًا الي فيه)، قال: \" المتحرف \"، المتق",
        "char_start": 0,
        "char_end": 8591,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_032_chunk00",
        "verse_key": "9:32",
        "text_ar": "القول في تاويل قوله : يُرِيدُونَ اَنْ يُطْفِيُوا نُورَ اللَّهِ بِاَفْوَاهِهِمْ وَيَاْبَي اللَّهُ اِلا اَنْ يُتِمَّ نُورَهُ وَلَوْ كَرِهَ الْكَافِرُونَ (32)قال ابو جعفر: يقول تعالي ذكره: يريد هولاء المتخذون احبارَهم ورهبانهم والمسيحَ ابن مريم اربابًا =(ان يطفيوا نور الله بافواههم)، يعني: انهم يحاولون بتكذيبهم بدين الله الذي ابتعثَ به رسوله، وصدِّهم الناسَ عنه بالسنتهم، ان يبطلوه, وهو النُّور الذي جعله الله لخلقه ضياءً (1) =(ويابي الله الا ان يتم نوره)، يعلو دينُه، وتظهر كلمته, ويتم الحقّ الذي بعث",
        "char_start": 0,
        "char_end": 896,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_033_chunk00",
        "verse_key": "9:33",
        "text_ar": "القول في تاويل قوله : هُوَ الَّذِي اَرْسَلَ رَسُولَهُ بِالْهُدَي وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَي الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ (33)قال ابو جعفر: يقول تعالي ذكره: الله الذي يابي الا اتمام دينه ولو كره ذلك جاحدوه ومنكروه =(الذي ارسل رسوله)، محمدًا صلي الله عليه وسلم =(بالهدي), يعني: ببيان فرايض الله علي خلقه, وجميع اللازم لهم (2) = وبدين الحق، وهو الاسلام =(ليظهره علي الدين كله)، يقول: ليعلي الاسلام علي الملل كلها =(ولو كره المشركون)، بالله ظهورَه عليها.* * *وقد اختلف اهل التاو",
        "char_start": 0,
        "char_end": 1480,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_046_chunk00",
        "verse_key": "9:46",
        "text_ar": "القول في تاويل قوله : وَلَوْ اَرَادُوا الْخُرُوجَ لاَعَدُّوا لَهُ عُدَّهً وَلَكِنْ كَرِهَ اللَّهُ انْبِعَاثَهُمْ فَثَبَّطَهُمْ وَقِيلَ اقْعُدُوا مَعَ الْقَاعِدِينَ (46)قال ابو جعفر: يقول تعالي ذكره: ولو اراد هولاء المستاذنوك، يا محمد، في ترك الخروج معك لجهاد عدوّك، الخروجَ معك =(لاعدوا له عده)، يقول: لاعدوا للخروج عده, ولتاهّبوا للسفر والعدوِّ اهْبَتهما (30) =(ولكن كره الله انبعاثهم)، يعني: خروجهم لذلك (31) (فثبطهم)، يقول: فثقَّل عليهم الخروجَ حتي استخفُّوا القعودَ في منازلهم خِلافك, واستثقلوا ا",
        "char_start": 0,
        "char_end": 1793,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_053_chunk00",
        "verse_key": "9:53",
        "text_ar": "القول في تاويل قوله : قُلْ اَنْفِقُوا طَوْعًا اَوْ كَرْهًا لَنْ يُتَقَبَّلَ مِنْكُمْ اِنَّكُمْ كُنْتُمْ قَوْمًا فَاسِقِينَ (53)قال ابو جعفر: يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم: (قل)، يا محمد، لهولاء المنافقين: انفقوا كيف شيتم اموالكم في سفركم هذا وغيره, وعلي اي حال شيتم، من حال الطوع والكره, (33) فانكم ان تنفقوها لن يتقبَّل الله منكم نفقاتكم, وانتم في شك من دينكم، وجهلٍ منكم بنبوه نبيكم، وسوء معرفه منكم بثواب الله وعقابه =(انكم كنتم قومًا فاسقين)، يقول: خارجين عن الايمان بربكم. (34)* ",
        "char_start": 0,
        "char_end": 1944,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_009_081_chunk00",
        "verse_key": "9:81",
        "text_ar": "القول في تاويل قوله : فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلافَ رَسُولِ اللَّهِ وَكَرِهُوا اَنْ يُجَاهِدُوا بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ فِي سَبِيلِ اللَّهِ وَقَالُوا لا تَنْفِرُوا فِي الْحَرِّ قُلْ نَارُ جَهَنَّمَ اَشَدُّ حَرًّا لَوْ كَانُوا يَفْقَهُونَ (81)قال ابو جعفر: يقول تعالي ذكره: فرح الذين خلَّفهم الله عن الغزو مع رسوله والمومنين به وجهاد اعدايه =(بمقعدهم خلاف رسول الله)، يقول: بجلوسهم في منازلهم (7) =(خلاف رسول الله)، يقول: علي الخلاف لرسول الله في جلوسه ومقعده. وذلك ان رسول الله ",
        "char_start": 0,
        "char_end": 4815,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_010_082_chunk00",
        "verse_key": "10:82",
        "text_ar": "القول في تاويل قوله تعالي : وَيُحِقُّ اللَّهُ الْحَقَّ بِكَلِمَاتِهِ وَلَوْ كَرِهَ الْمُجْرِمُونَ (82)قال ابو جعفر: يقول تعالي ذكره مخبرًا عن موسي انه قال للسحره: (ويحق الله الحق) ، يقول: ويثبت الله الحق الذي جيتكم به من عنده، فيعليه علي باطلكم، ويصححه ، \" بكلماته \"، يعني : بامره (10) ، (ولو كره المجرمون) ، يعني الذين اكتسبوا الاثم بربِّهم ، (11) بمعصيتهم اياه.-----------------------الهوامش :(10) انظر تفسير \" يحق الحق بكلماته \" فيما سلف 13 : 407 ، تعليق : 2 ، 3 ، والمراجع هناك .(11) انظر بيان مع",
        "char_start": 0,
        "char_end": 564,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_010_099_chunk00",
        "verse_key": "10:99",
        "text_ar": "القول في تاويل قوله تعالي : وَلَوْ شَاءَ رَبُّكَ لامَنَ مَنْ فِي الاَرْضِ كُلُّهُمْ جَمِيعًا اَفَاَنْتَ تُكْرِهُ النَّاسَ حَتَّي يَكُونُوا مُوْمِنِينَ (99)قال ابو جعفر : يقول تعالي ذكر لنبيه: (ولو شاء) ، يا محمد ، (ربك لامن من في الارض كلهم جميعًا)، بك، فصدَّقوك انك لي رسول ، وان ما جيتهم به وما تدعوهم اليه من توحيد الله واخلاص العبوده له ، حقٌّ، ولكن لا يشاء ذلك، لانه قد سبق من قضاء الله قبل ان يبعثك رسولا انه لا يومن بك ، ولا يتّبعك فيصدقوك بما بعثك الله به من الهدي والنور ، الا من سبقت له الس",
        "char_start": 0,
        "char_end": 3234,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_011_070_chunk00",
        "verse_key": "11:70",
        "text_ar": "القول في تاويل قوله تعالي : فَلَمَّا رَاَي اَيْدِيَهُمْ لا تَصِلُ اِلَيْهِ نَكِرَهُمْ وَاَوْجَسَ مِنْهُمْ خِيفَهً قَالُوا لا تَخَفْ اِنَّا اُرْسِلْنَا اِلَي قَوْمِ لُوطٍ (70)قال ابو جعفر : يقول تعالي ذكره: فلما راي ابراهيم ايديَهم لا تصل الي العجل الذي اتاهم به، والطعام الذي قدّم اليهم ، نكرهم، وذلك انه لما قدم طعامه صلي الله عليه وسلم اليهم ، فيما ذكر، كفّوا عن اكله، لانهم لم يكونوا ممن ياكله. وكان امساكهم عن اكله ، عند ابراهيم ، وهم ضِيَفانه مستنكرًا. ولم تكن بينهم معرفهٌ، وراعه امرهم، واوجس ف",
        "char_start": 0,
        "char_end": 3567,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 6,
      "evidence_refs": [
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "tabari",
          "chunk_id": "tabari_005_091_chunk07",
          "char_start": 535,
          "char_end": 699,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "tabari",
          "chunk_id": "tabari_005_091_chunk07",
          "char_start": 551,
          "char_end": 715,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "tabari",
          "chunk_id": "tabari_005_091_chunk07",
          "char_start": 536,
          "char_end": 699,
          "relevance": "direct"
        }
      ],
      "confidence": 0.86
    },
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 16,
      "evidence_refs": [
        {
          "verse_key": "2:90",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_090_chunk02",
          "char_start": 539,
          "char_end": 701,
          "relevance": "direct"
        },
        {
          "verse_key": "2:90",
          "source": "tabari",
          "chunk_id": "tabari_002_090_chunk10",
          "char_start": 175,
          "char_end": 337,
          "relevance": "direct"
        },
        {
          "verse_key": "3:159",
          "source": "saadi",
          "chunk_id": "saadi_003_159_chunk00",
          "char_start": 372,
          "char_end": 534,
          "relevance": "direct"
        },
        {
          "verse_key": "3:159",
          "source": "saadi",
          "chunk_id": "saadi_003_159_chunk00",
          "char_start": 423,
          "char_end": 585,
          "relevance": "direct"
        },
        {
          "verse_key": "4:90",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_004_090_chunk02",
          "char_start": 0,
          "char_end": 152,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_SHAYTAN",
      "target_label_ar": "شيطان",
      "target_label_en": "Satan/Devil",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:219",
          "source": "tabari",
          "chunk_id": "tabari_002_219_chunk07",
          "char_start": 20,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "2:219",
          "source": "tabari",
          "chunk_id": "tabari_002_219_chunk07",
          "char_start": 21,
          "char_end": 184,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "12:30",
          "source": "tabari",
          "chunk_id": "tabari_012_030_chunk06",
          "char_start": 521,
          "char_end": 683,
          "relevance": "direct"
        },
        {
          "verse_key": "18:101",
          "source": "saadi",
          "chunk_id": "saadi_018_101_chunk00",
          "char_start": 307,
          "char_end": 469,
          "relevance": "direct"
        },
        {
          "verse_key": "43:26",
          "source": "saadi",
          "chunk_id": "saadi_043_026_chunk00",
          "char_start": 200,
          "char_end": 362,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_PHY_STANDING",
      "target_label_ar": "القيام",
      "target_label_en": "Standing",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "5:14",
          "source": "saadi",
          "chunk_id": "saadi_005_014_chunk00",
          "char_start": 267,
          "char_end": 429,
          "relevance": "direct"
        },
        {
          "verse_key": "8:16",
          "source": "tabari",
          "chunk_id": "tabari_008_016_chunk07",
          "char_start": 376,
          "char_end": 538,
          "relevance": "direct"
        },
        {
          "verse_key": "60:4",
          "source": "saadi",
          "chunk_id": "saadi_060_004_chunk00",
          "char_start": 611,
          "char_end": 723,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SOC_OPPRESSION",
      "target_label_ar": "الظلم",
      "target_label_en": "Oppression",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:61",
          "source": "jalalayn",
          "chunk_id": "jalalayn_002_061_chunk00",
          "char_start": 502,
          "char_end": 666,
          "relevance": "direct"
        },
        {
          "verse_key": "2:61",
          "source": "jalalayn",
          "chunk_id": "jalalayn_002_061_chunk00",
          "char_start": 503,
          "char_end": 666,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "BEH_SPEECH_REMEMBRANCE",
      "target_label_ar": "ذكر الله",
      "target_label_en": "Verbal Remembrance",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "BEH_SPEECH_REMEMBRANCE",
      "target_label_ar": "ذكر الله",
      "target_label_en": "Verbal Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:91",
          "source": "tabari",
          "chunk_id": "tabari_005_091_chunk00",
          "char_start": 319,
          "char_end": 481,
          "relevance": "direct"
        },
        {
          "verse_key": "24:48",
          "source": "qurtubi",
          "chunk_id": "qurtubi_024_048_chunk00",
          "char_start": 565,
          "char_end": 727,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_DISBELIEF",
      "target_label_ar": "الكفر",
      "target_label_en": "Disbelief",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 5,
      "evidence_refs": [
        {
          "verse_key": "2:61",
          "source": "jalalayn",
          "chunk_id": "jalalayn_002_061_chunk00",
          "char_start": 502,
          "char_end": 666,
          "relevance": "direct"
        },
        {
          "verse_key": "2:61",
          "source": "jalalayn",
          "chunk_id": "jalalayn_002_061_chunk00",
          "char_start": 503,
          "char_end": 666,
          "relevance": "direct"
        },
        {
          "verse_key": "3:112",
          "source": "jalalayn",
          "chunk_id": "jalalayn_003_112_chunk00",
          "char_start": 163,
          "char_end": 327,
          "relevance": "direct"
        },
        {
          "verse_key": "3:112",
          "source": "jalalayn",
          "chunk_id": "jalalayn_003_112_chunk00",
          "char_start": 164,
          "char_end": 327,
          "relevance": "direct"
        },
        {
          "verse_key": "3:112",
          "source": "saadi",
          "chunk_id": "saadi_003_112_chunk00",
          "char_start": 209,
          "char_end": 372,
          "relevance": "direct"
        }
      ],
      "confidence": 0.86
    },
    {
      "target_id": "BEH_SPI_DISBELIEF",
      "target_label_ar": "الكفر",
      "target_label_en": "Disbelief",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 6,
      "evidence_refs": [
        {
          "verse_key": "2:90",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_090_chunk02",
          "char_start": 539,
          "char_end": 701,
          "relevance": "direct"
        },
        {
          "verse_key": "2:90",
          "source": "tabari",
          "chunk_id": "tabari_002_090_chunk10",
          "char_start": 175,
          "char_end": 337,
          "relevance": "direct"
        },
        {
          "verse_key": "6:153",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_153_chunk09",
          "char_start": 116,
          "char_end": 278,
          "relevance": "direct"
        },
        {
          "verse_key": "11:5",
          "source": "tabari",
          "chunk_id": "tabari_011_005_chunk04",
          "char_start": 52,
          "char_end": 214,
          "relevance": "direct"
        },
        {
          "verse_key": "18:101",
          "source": "saadi",
          "chunk_id": "saadi_018_101_chunk00",
          "char_start": 375,
          "char_end": 537,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_FAITH",
      "target_label_ar": "الإيمان",
      "target_label_en": "Faith",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 5,
      "evidence_refs": [
        {
          "verse_key": "2:8",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_008_chunk02",
          "char_start": 493,
          "char_end": 655,
          "relevance": "direct"
        },
        {
          "verse_key": "3:119",
          "source": "tabari",
          "chunk_id": "tabari_003_119_chunk08",
          "char_start": 336,
          "char_end": 498,
          "relevance": "direct"
        },
        {
          "verse_key": "8:1",
          "source": "saadi",
          "chunk_id": "saadi_008_001_chunk00",
          "char_start": 732,
          "char_end": 894,
          "relevance": "direct"
        },
        {
          "verse_key": "9:100",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_009_100_chunk01",
          "char_start": 626,
          "char_end": 788,
          "relevance": "direct"
        },
        {
          "verse_key": "60:4",
          "source": "saadi",
          "chunk_id": "saadi_060_004_chunk00",
          "char_start": 611,
          "char_end": 723,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_PRAYER",
      "target_label_ar": "الصلاة",
      "target_label_en": "Prayer",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 5,
      "evidence_refs": [
        {
          "verse_key": "3:112",
          "source": "saadi",
          "chunk_id": "saadi_003_112_chunk00",
          "char_start": 209,
          "char_end": 372,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "tabari",
          "chunk_id": "tabari_005_091_chunk07",
          "char_start": 551,
          "char_end": 715,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "tabari",
          "chunk_id": "tabari_005_091_chunk07",
          "char_start": 552,
          "char_end": 715,
          "relevance": "direct"
        }
      ],
      "confidence": 0.94
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "4:128",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_004_128_chunk10",
          "char_start": 51,
          "char_end": 213,
          "relevance": "direct"
        },
        {
          "verse_key": "5:14",
          "source": "tabari",
          "chunk_id": "tabari_005_014_chunk04",
          "char_start": 277,
          "char_end": 439,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "tabari",
          "chunk_id": "tabari_005_091_chunk00",
          "char_start": 319,
          "char_end": 481,
          "relevance": "direct"
        },
        {
          "verse_key": "11:20",
          "source": "saadi",
          "chunk_id": "saadi_011_020_chunk00",
          "char_start": 266,
          "char_end": 428,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "CSQ_DALAL",
      "target_label_ar": "الضلال",
      "target_label_en": "Misguidance",
      "edge_type": "STRENGTHENS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "35:39",
          "source": "muyassar",
          "chunk_id": "muyassar_035_039_chunk00",
          "char_start": 78,
          "char_end": 194,
          "relevance": "direct"
        },
        {
          "verse_key": "35:39",
          "source": "qurtubi",
          "chunk_id": "qurtubi_035_039_chunk00",
          "char_start": 405,
          "char_end": 532,
          "relevance": "direct"
        }
      ],
      "confidence": 0.64
    },
    {
      "target_id": "CSQ_GHADAB",
      "target_label_ar": "غضب الله",
      "target_label_en": "Allah's Wrath",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:90",
          "source": "muyassar",
          "chunk_id": "muyassar_002_090_chunk00",
          "char_start": 91,
          "char_end": 255,
          "relevance": "direct"
        },
        {
          "verse_key": "2:90",
          "source": "muyassar",
          "chunk_id": "muyassar_002_090_chunk00",
          "char_start": 92,
          "char_end": 255,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "CSQ_GHADAB",
      "target_label_ar": "غضب الله",
      "target_label_en": "Allah's Wrath",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:61",
          "source": "tabari",
          "chunk_id": "tabari_002_061_chunk20",
          "char_start": 114,
          "char_end": 276,
          "relevance": "direct"
        },
        {
          "verse_key": "2:90",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_090_chunk02",
          "char_start": 539,
          "char_end": 701,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "CSQ_NAAR",
      "target_label_ar": "النار",
      "target_label_en": "Hellfire",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "40:10",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_040_010_chunk00",
          "char_start": 98,
          "char_end": 262,
          "relevance": "direct"
        },
        {
          "verse_key": "40:10",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_040_010_chunk00",
          "char_start": 99,
          "char_end": 262,
          "relevance": "direct"
        },
        {
          "verse_key": "40:10",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_040_010_chunk00",
          "char_start": 143,
          "char_end": 306,
          "relevance": "direct"
        }
      ],
      "confidence": 0.68
    },
    {
      "target_id": "ORG_BRAIN",
      "target_label_ar": "عقل",
      "target_label_en": "Mind/Intellect",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        },
        {
          "verse_key": "5:91",
          "source": "muyassar",
          "chunk_id": "muyassar_005_091_chunk00",
          "char_start": 0,
          "char_end": 160,
          "relevance": "direct"
        }
      ],
      "confidence": 0.63
    },
    {
      "target_id": "ORG_FACE",
      "target_label_ar": "وجه",
      "target_label_en": "Face",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:2",
          "source": "tabari",
          "chunk_id": "tabari_005_002_chunk26",
          "char_start": 304,
          "char_end": 466,
          "relevance": "direct"
        },
        {
          "verse_key": "5:2",
          "source": "tabari",
          "chunk_id": "tabari_005_002_chunk26",
          "char_start": 320,
          "char_end": 482,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    }
  ],
  "incoming_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 17,
      "evidence_refs": [
        {
          "verse_key": "2:8",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_008_chunk02",
          "char_start": 671,
          "char_end": 833,
          "relevance": "direct"
        },
        {
          "verse_key": "2:19",
          "source": "baghawi",
          "chunk_id": "baghawi_002_019_chunk01",
          "char_start": 456,
          "char_end": 618,
          "relevance": "direct"
        },
        {
          "verse_key": "2:186",
          "source": "baghawi",
          "chunk_id": "baghawi_002_186_chunk02",
          "char_start": 905,
          "char_end": 1067,
          "relevance": "direct"
        },
        {
          "verse_key": "4:171",
          "source": "qurtubi",
          "chunk_id": "qurtubi_004_171_chunk08",
          "char_start": 78,
          "char_end": 240,
          "relevance": "direct"
        },
        {
          "verse_key": "5:2",
          "source": "muyassar",
          "chunk_id": "muyassar_005_002_chunk00",
          "char_start": 307,
          "char_end": 469,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "OPPOSITE_OF",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "2:229",
          "source": "baghawi",
          "chunk_id": "baghawi_002_229_chunk02",
          "char_start": 395,
          "char_end": 559,
          "relevance": "direct"
        },
        {
          "verse_key": "4:107",
          "source": "saadi",
          "chunk_id": "saadi_004_107_chunk00",
          "char_start": 255,
          "char_end": 379,
          "relevance": "direct"
        },
        {
          "verse_key": "42:52",
          "source": "qurtubi",
          "chunk_id": "qurtubi_042_052_chunk07",
          "char_start": 210,
          "char_end": 374,
          "relevance": "direct"
        }
      ],
      "confidence": 0.84
    },
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "STRENGTHENS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "5:64",
          "source": "qurtubi",
          "chunk_id": "qurtubi_005_064_chunk00",
          "char_start": 16,
          "char_end": 180,
          "relevance": "direct"
        },
        {
          "verse_key": "17:60",
          "source": "saadi",
          "chunk_id": "saadi_017_060_chunk00",
          "char_start": 1026,
          "char_end": 1190,
          "relevance": "direct"
        },
        {
          "verse_key": "35:39",
          "source": "muyassar",
          "chunk_id": "muyassar_035_039_chunk00",
          "char_start": 29,
          "char_end": 193,
          "relevance": "direct"
        }
      ],
      "confidence": 0.77
    },
    {
      "target_id": "AGT_ANGEL",
      "target_label_ar": "ملك",
      "target_label_en": "Angel",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:14",
          "source": "qurtubi",
          "chunk_id": "qurtubi_005_014_chunk02",
          "char_start": 240,
          "char_end": 402,
          "relevance": "direct"
        },
        {
          "verse_key": "38:35",
          "source": "qurtubi",
          "chunk_id": "qurtubi_038_035_chunk00",
          "char_start": 38,
          "char_end": 200,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "AGT_BELIEVER",
      "target_label_ar": "مؤمن",
      "target_label_en": "Believer",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "2:186",
          "source": "baghawi",
          "chunk_id": "baghawi_002_186_chunk02",
          "char_start": 905,
          "char_end": 1067,
          "relevance": "direct"
        },
        {
          "verse_key": "3:112",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_112_chunk00",
          "char_start": 240,
          "char_end": 402,
          "relevance": "direct"
        },
        {
          "verse_key": "4:19",
          "source": "qurtubi",
          "chunk_id": "qurtubi_004_019_chunk08",
          "char_start": 383,
          "char_end": 545,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_DISBELIEVER",
      "target_label_ar": "كافر",
      "target_label_en": "Disbeliever",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:8",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_008_chunk02",
          "char_start": 671,
          "char_end": 833,
          "relevance": "direct"
        },
        {
          "verse_key": "18:101",
          "source": "jalalayn",
          "chunk_id": "jalalayn_018_101_chunk00",
          "char_start": 26,
          "char_end": 179,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_COG_ARROGANCE",
      "target_label_ar": "الكبر",
      "target_label_en": "Arrogance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "3:118",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_003_118_chunk03",
          "char_start": 627,
          "char_end": 789,
          "relevance": "direct"
        },
        {
          "verse_key": "12:10",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_012_010_chunk00",
          "char_start": 43,
          "char_end": 205,
          "relevance": "direct"
        },
        {
          "verse_key": "61:3",
          "source": "baghawi",
          "chunk_id": "baghawi_061_003_chunk00",
          "char_start": 0,
          "char_end": 155,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "4:171",
          "source": "qurtubi",
          "chunk_id": "qurtubi_004_171_chunk08",
          "char_start": 78,
          "char_end": 240,
          "relevance": "direct"
        },
        {
          "verse_key": "5:67",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_005_067_chunk08",
          "char_start": 311,
          "char_end": 473,
          "relevance": "direct"
        },
        {
          "verse_key": "38:26",
          "source": "saadi",
          "chunk_id": "saadi_038_026_chunk00",
          "char_start": 130,
          "char_end": 292,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_DISBELIEF",
      "target_label_ar": "الكفر",
      "target_label_en": "Disbelief",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 6,
      "evidence_refs": [
        {
          "verse_key": "2:8",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_008_chunk02",
          "char_start": 671,
          "char_end": 833,
          "relevance": "direct"
        },
        {
          "verse_key": "5:14",
          "source": "qurtubi",
          "chunk_id": "qurtubi_005_014_chunk02",
          "char_start": 240,
          "char_end": 402,
          "relevance": "direct"
        },
        {
          "verse_key": "5:64",
          "source": "saadi",
          "chunk_id": "saadi_005_064_chunk02",
          "char_start": 382,
          "char_end": 544,
          "relevance": "direct"
        },
        {
          "verse_key": "5:64",
          "source": "saadi",
          "chunk_id": "saadi_005_064_chunk02",
          "char_start": 398,
          "char_end": 560,
          "relevance": "direct"
        },
        {
          "verse_key": "6:153",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_153_chunk09",
          "char_start": 541,
          "char_end": 703,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_DISBELIEF",
      "target_label_ar": "الكفر",
      "target_label_en": "Disbelief",
      "edge_type": "STRENGTHENS",
      "direction": "incoming",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "3:119",
          "source": "tabari",
          "chunk_id": "tabari_003_119_chunk07",
          "char_start": 330,
          "char_end": 494,
          "relevance": "direct"
        },
        {
          "verse_key": "35:39",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_035_039_chunk00",
          "char_start": 132,
          "char_end": 296,
          "relevance": "direct"
        },
        {
          "verse_key": "35:39",
          "source": "muyassar",
          "chunk_id": "muyassar_035_039_chunk00",
          "char_start": 29,
          "char_end": 193,
          "relevance": "direct"
        },
        {
          "verse_key": "35:39",
          "source": "qurtubi",
          "chunk_id": "qurtubi_035_039_chunk00",
          "char_start": 347,
          "char_end": 511,
          "relevance": "direct"
        }
      ],
      "confidence": 0.9
    },
    {
      "target_id": "BEH_SPI_HAJJ",
      "target_label_ar": "الحج",
      "target_label_en": "Pilgrimage",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:2",
          "source": "muyassar",
          "chunk_id": "muyassar_005_002_chunk00",
          "char_start": 307,
          "char_end": 469,
          "relevance": "direct"
        },
        {
          "verse_key": "6:149",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_006_149_chunk00",
          "char_start": 158,
          "char_end": 320,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:61",
          "source": "tabari",
          "chunk_id": "tabari_002_061_chunk24",
          "char_start": 136,
          "char_end": 298,
          "relevance": "direct"
        },
        {
          "verse_key": "18:101",
          "source": "jalalayn",
          "chunk_id": "jalalayn_018_101_chunk00",
          "char_start": 26,
          "char_end": 179,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "STRENGTHENS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "3:119",
          "source": "tabari",
          "chunk_id": "tabari_003_119_chunk07",
          "char_start": 330,
          "char_end": 494,
          "relevance": "direct"
        },
        {
          "verse_key": "17:60",
          "source": "saadi",
          "chunk_id": "saadi_017_060_chunk00",
          "char_start": 1026,
          "char_end": 1190,
          "relevance": "direct"
        }
      ],
      "confidence": 0.64
    },
    {
      "target_id": "CSQ_DALAL",
      "target_label_ar": "الضلال",
      "target_label_en": "Misguidance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "6:149",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_006_149_chunk00",
          "char_start": 158,
          "char_end": 320,
          "relevance": "direct"
        },
        {
          "verse_key": "6:149",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_006_149_chunk00",
          "char_start": 203,
          "char_end": 365,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "CSQ_FAQR",
      "target_label_ar": "الفقر",
      "target_label_en": "Poverty",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:2",
          "source": "tabari",
          "chunk_id": "tabari_005_002_chunk25",
          "char_start": 623,
          "char_end": 785,
          "relevance": "direct"
        },
        {
          "verse_key": "5:2",
          "source": "tabari",
          "chunk_id": "tabari_005_002_chunk27",
          "char_start": 650,
          "char_end": 812,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "ORG_EYE",
      "target_label_ar": "عين",
      "target_label_en": "Eye",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "6:149",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_006_149_chunk00",
          "char_start": 203,
          "char_end": 365,
          "relevance": "direct"
        },
        {
          "verse_key": "68:51",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_068_051_chunk00",
          "char_start": 60,
          "char_end": 222,
          "relevance": "direct"
        },
        {
          "verse_key": "68:51",
          "source": "qurtubi",
          "chunk_id": "qurtubi_068_051_chunk01",
          "char_start": 258,
          "char_end": 420,
          "relevance": "direct"
        },
        {
          "verse_key": "68:51",
          "source": "qurtubi",
          "chunk_id": "qurtubi_068_051_chunk01",
          "char_start": 283,
          "char_end": 445,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_HEART",
      "target_label_ar": "قلب",
      "target_label_en": "Heart",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "6:68",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_068_chunk02",
          "char_start": 392,
          "char_end": 554,
          "relevance": "direct"
        },
        {
          "verse_key": "26:215",
          "source": "saadi",
          "chunk_id": "saadi_026_215_chunk00",
          "char_start": 456,
          "char_end": 618,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "ORG_SOUL",
      "target_label_ar": "نفس",
      "target_label_en": "Soul",
      "edge_type": "STRENGTHENS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "35:39",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_035_039_chunk00",
          "char_start": 132,
          "char_end": 296,
          "relevance": "direct"
        },
        {
          "verse_key": "35:39",
          "source": "muyassar",
          "chunk_id": "muyassar_035_039_chunk00",
          "char_start": 29,
          "char_end": 193,
          "relevance": "direct"
        }
      ],
      "confidence": 0.64
    }
  ],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [
      {
        "value": "ORG_HEART",
        "citation_type": "rule",
        "confidence": 0.9,
        "citation_ref": "RULE_EMOTION_HEART"
      }
    ],
    "internal_external": {
      "value": "باطن",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_INTERNAL_BEH_EMO_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 46,
    "quran_direct_count": 46,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 38,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.914,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.121261Z",
  "schema_version": "1.0.0"
}