{
  "behavior_id": "BEH_FIN_SPENDING",
  "label_ar": "الإنفاق",
  "label_en": "Spending in Allah's Way",
  "category": "financial",
  "roots": [
    "ن-ف-ق"
  ],
  "stems": [],
  "synonyms_ar": [
    "أنفقوا",
    "ينفقون",
    "المنفقين",
    "المنفقون",
    "أنفق",
    "انفاق"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:3",
      "text_ar": "ٱلَّذِينَ يُؤْمِنُونَ بِٱلْغَيْبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:195",
      "text_ar": "وَأَنفِقُوا۟ فِى سَبِيلِ ٱللَّهِ وَلَا تُلْقُوا۟ بِأَيْدِيكُمْ إِلَى ٱلتَّهْلُكَةِ ۛ وَأَحْسِنُوٓا۟ ۛ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُحْسِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:215",
      "text_ar": "يَسْـَٔلُونَكَ مَاذَا يُنفِقُونَ ۖ قُلْ مَآ أَنفَقْتُم مِّنْ خَيْرٍ فَلِلْوَٰلِدَيْنِ وَٱلْأَقْرَبِينَ وَٱلْيَتَـٰمَىٰ وَٱلْمَسَـٰكِينِ وَٱبْنِ ٱلسَّبِيلِ ۗ وَمَا تَفْعَلُوا۟ مِنْ خَيْرٍ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:219",
      "text_ar": "يَسْـَٔلُونَكَ عَنِ ٱلْخَمْرِ وَٱلْمَيْسِرِ ۖ قُلْ فِيهِمَآ إِثْمٌ كَبِيرٌ وَمَنَـٰفِعُ لِلنَّاسِ وَإِثْمُهُمَآ أَكْبَرُ مِن نَّفْعِهِمَا ۗ وَيَسْـَٔلُونَكَ مَاذَا يُنفِقُونَ قُلِ ٱلْعَفْوَ ۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْـَٔايَـٰتِ لَعَلَّكُمْ تَتَفَكَّرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:254",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَنفِقُوا۟ مِمَّا رَزَقْنَـٰكُم مِّن قَبْلِ أَن يَأْتِىَ يَوْمٌ لَّا بَيْعٌ فِيهِ وَلَا خُلَّةٌ وَلَا شَفَـٰعَةٌ ۗ وَٱلْكَـٰفِرُونَ هُمُ ٱلظَّـٰلِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:261",
      "text_ar": "مَّثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ كَمَثَلِ حَبَّةٍ أَنۢبَتَتْ سَبْعَ سَنَابِلَ فِى كُلِّ سُنۢبُلَةٍ مِّا۟ئَةُ حَبَّةٍ ۗ وَٱللَّهُ يُضَـٰعِفُ لِمَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:262",
      "text_ar": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ ثُمَّ لَا يُتْبِعُونَ مَآ أَنفَقُوا۟ مَنًّا وَلَآ أَذًى ۙ لَّهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:264",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تُبْطِلُوا۟ صَدَقَـٰتِكُم بِٱلْمَنِّ وَٱلْأَذَىٰ كَٱلَّذِى يُنفِقُ مَالَهُۥ رِئَآءَ ٱلنَّاسِ وَلَا يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ ۖ فَمَثَلُهُۥ كَمَثَلِ صَفْوَانٍ عَلَيْهِ تُرَابٌ فَأَصَابَهُۥ وَابِلٌ فَتَرَكَهُۥ صَلْدًا ۖ لَّا يَقْدِرُونَ عَلَىٰ شَىْءٍ مِّمَّا كَسَبُوا۟ ۗ وَٱللَّهُ لَا يَهْدِى ٱلْقَوْمَ ٱلْكَـٰفِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:265",
      "text_ar": "وَمَثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمُ ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ وَتَثْبِيتًا مِّنْ أَنفُسِهِمْ كَمَثَلِ جَنَّةٍۭ بِرَبْوَةٍ أَصَابَهَا وَابِلٌ فَـَٔاتَتْ أُكُلَهَا ضِعْفَيْنِ فَإِن لَّمْ يُصِبْهَا وَابِلٌ فَطَلٌّ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:267",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَنفِقُوا۟ مِن طَيِّبَـٰتِ مَا كَسَبْتُمْ وَمِمَّآ أَخْرَجْنَا لَكُم مِّنَ ٱلْأَرْضِ ۖ وَلَا تَيَمَّمُوا۟ ٱلْخَبِيثَ مِنْهُ تُنفِقُونَ وَلَسْتُم بِـَٔاخِذِيهِ إِلَّآ أَن تُغْمِضُوا۟ فِيهِ ۚ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَنِىٌّ حَمِيدٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:270",
      "text_ar": "وَمَآ أَنفَقْتُم مِّن نَّفَقَةٍ أَوْ نَذَرْتُم مِّن نَّذْرٍ فَإِنَّ ٱللَّهَ يَعْلَمُهُۥ ۗ وَمَا لِلظَّـٰلِمِينَ مِنْ أَنصَارٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:272",
      "text_ar": "لَّيْسَ عَلَيْكَ هُدَىٰهُمْ وَلَـٰكِنَّ ٱللَّهَ يَهْدِى مَن يَشَآءُ ۗ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍ فَلِأَنفُسِكُمْ ۚ وَمَا تُنفِقُونَ إِلَّا ٱبْتِغَآءَ وَجْهِ ٱللَّهِ ۚ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍ يُوَفَّ إِلَيْكُمْ وَأَنتُمْ لَا تُظْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:273",
      "text_ar": "لِلْفُقَرَآءِ ٱلَّذِينَ أُحْصِرُوا۟ فِى سَبِيلِ ٱللَّهِ لَا يَسْتَطِيعُونَ ضَرْبًا فِى ٱلْأَرْضِ يَحْسَبُهُمُ ٱلْجَاهِلُ أَغْنِيَآءَ مِنَ ٱلتَّعَفُّفِ تَعْرِفُهُم بِسِيمَـٰهُمْ لَا يَسْـَٔلُونَ ٱلنَّاسَ إِلْحَافًا ۗ وَمَا تُنفِقُوا۟ مِنْ خَيْرٍ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:274",
      "text_ar": "ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُم بِٱلَّيْلِ وَٱلنَّهَارِ سِرًّا وَعَلَانِيَةً فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:17",
      "text_ar": "ٱلصَّـٰبِرِينَ وَٱلصَّـٰدِقِينَ وَٱلْقَـٰنِتِينَ وَٱلْمُنفِقِينَ وَٱلْمُسْتَغْفِرِينَ بِٱلْأَسْحَارِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:92",
      "text_ar": "لَن تَنَالُوا۟ ٱلْبِرَّ حَتَّىٰ تُنفِقُوا۟ مِمَّا تُحِبُّونَ ۚ وَمَا تُنفِقُوا۟ مِن شَىْءٍ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:117",
      "text_ar": "مَثَلُ مَا يُنفِقُونَ فِى هَـٰذِهِ ٱلْحَيَوٰةِ ٱلدُّنْيَا كَمَثَلِ رِيحٍ فِيهَا صِرٌّ أَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوٓا۟ أَنفُسَهُمْ فَأَهْلَكَتْهُ ۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَـٰكِنْ أَنفُسَهُمْ يَظْلِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:134",
      "text_ar": "ٱلَّذِينَ يُنفِقُونَ فِى ٱلسَّرَّآءِ وَٱلضَّرَّآءِ وَٱلْكَـٰظِمِينَ ٱلْغَيْظَ وَٱلْعَافِينَ عَنِ ٱلنَّاسِ ۗ وَٱللَّهُ يُحِبُّ ٱلْمُحْسِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:34",
      "text_ar": "ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ وَبِمَآ أَنفَقُوا۟ مِنْ أَمْوَٰلِهِمْ ۚ فَٱلصَّـٰلِحَـٰتُ قَـٰنِتَـٰتٌ حَـٰفِظَـٰتٌ لِّلْغَيْبِ بِمَا حَفِظَ ٱللَّهُ ۚ وَٱلَّـٰتِى تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهْجُرُوهُنَّ فِى ٱلْمَضَاجِعِ وَٱضْرِبُوهُنَّ ۖ فَإِنْ أَطَعْنَكُمْ فَلَا تَبْغُوا۟ عَلَيْهِنَّ سَبِيلًا ۗ إِنَّ ٱللَّهَ كَانَ عَلِيًّا كَبِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:38",
      "text_ar": "وَٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ رِئَآءَ ٱلنَّاسِ وَلَا يُؤْمِنُونَ بِٱللَّهِ وَلَا بِٱلْيَوْمِ ٱلْـَٔاخِرِ ۗ وَمَن يَكُنِ ٱلشَّيْطَـٰنُ لَهُۥ قَرِينًا فَسَآءَ قَرِينًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:39",
      "text_ar": "وَمَاذَا عَلَيْهِمْ لَوْ ءَامَنُوا۟ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَأَنفَقُوا۟ مِمَّا رَزَقَهُمُ ٱللَّهُ ۚ وَكَانَ ٱللَّهُ بِهِمْ عَلِيمًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:64",
      "text_ar": "وَقَالَتِ ٱلْيَهُودُ يَدُ ٱللَّهِ مَغْلُولَةٌ ۚ غُلَّتْ أَيْدِيهِمْ وَلُعِنُوا۟ بِمَا قَالُوا۟ ۘ بَلْ يَدَاهُ مَبْسُوطَتَانِ يُنفِقُ كَيْفَ يَشَآءُ ۚ وَلَيَزِيدَنَّ كَثِيرًا مِّنْهُم مَّآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ طُغْيَـٰنًا وَكُفْرًا ۚ وَأَلْقَيْنَا بَيْنَهُمُ ٱلْعَدَٰوَةَ وَٱلْبَغْضَآءَ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ ۚ كُلَّمَآ أَوْقَدُوا۟ نَارًا لِّلْحَرْبِ أَطْفَأَهَا ٱللَّهُ ۚ وَيَسْعَوْنَ فِى ٱلْأَرْضِ فَسَادًا ۚ وَٱللَّهُ لَا يُحِبُّ ٱلْمُفْسِدِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "6:35",
      "text_ar": "وَإِن كَانَ كَبُرَ عَلَيْكَ إِعْرَاضُهُمْ فَإِنِ ٱسْتَطَعْتَ أَن تَبْتَغِىَ نَفَقًا فِى ٱلْأَرْضِ أَوْ سُلَّمًا فِى ٱلسَّمَآءِ فَتَأْتِيَهُم بِـَٔايَةٍ ۚ وَلَوْ شَآءَ ٱللَّهُ لَجَمَعَهُمْ عَلَى ٱلْهُدَىٰ ۚ فَلَا تَكُونَنَّ مِنَ ٱلْجَـٰهِلِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:3",
      "text_ar": "ٱلَّذِينَ يُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:36",
      "text_ar": "إِنَّ ٱلَّذِينَ كَفَرُوا۟ يُنفِقُونَ أَمْوَٰلَهُمْ لِيَصُدُّوا۟ عَن سَبِيلِ ٱللَّهِ ۚ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ ۗ وَٱلَّذِينَ كَفَرُوٓا۟ إِلَىٰ جَهَنَّمَ يُحْشَرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:60",
      "text_ar": "وَأَعِدُّوا۟ لَهُم مَّا ٱسْتَطَعْتُم مِّن قُوَّةٍ وَمِن رِّبَاطِ ٱلْخَيْلِ تُرْهِبُونَ بِهِۦ عَدُوَّ ٱللَّهِ وَعَدُوَّكُمْ وَءَاخَرِينَ مِن دُونِهِمْ لَا تَعْلَمُونَهُمُ ٱللَّهُ يَعْلَمُهُمْ ۚ وَمَا تُنفِقُوا۟ مِن شَىْءٍ فِى سَبِيلِ ٱللَّهِ يُوَفَّ إِلَيْكُمْ وَأَنتُمْ لَا تُظْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:63",
      "text_ar": "وَأَلَّفَ بَيْنَ قُلُوبِهِمْ ۚ لَوْ أَنفَقْتَ مَا فِى ٱلْأَرْضِ جَمِيعًا مَّآ أَلَّفْتَ بَيْنَ قُلُوبِهِمْ وَلَـٰكِنَّ ٱللَّهَ أَلَّفَ بَيْنَهُمْ ۚ إِنَّهُۥ عَزِيزٌ حَكِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:34",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِنَّ كَثِيرًا مِّنَ ٱلْأَحْبَارِ وَٱلرُّهْبَانِ لَيَأْكُلُونَ أَمْوَٰلَ ٱلنَّاسِ بِٱلْبَـٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ ۗ وَٱلَّذِينَ يَكْنِزُونَ ٱلذَّهَبَ وَٱلْفِضَّةَ وَلَا يُنفِقُونَهَا فِى سَبِيلِ ٱللَّهِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:53",
      "text_ar": "قُلْ أَنفِقُوا۟ طَوْعًا أَوْ كَرْهًا لَّن يُتَقَبَّلَ مِنكُمْ ۖ إِنَّكُمْ كُنتُمْ قَوْمًا فَـٰسِقِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:54",
      "text_ar": "وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقَـٰتُهُمْ إِلَّآ أَنَّهُمْ كَفَرُوا۟ بِٱللَّهِ وَبِرَسُولِهِۦ وَلَا يَأْتُونَ ٱلصَّلَوٰةَ إِلَّا وَهُمْ كُسَالَىٰ وَلَا يُنفِقُونَ إِلَّا وَهُمْ كَـٰرِهُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:91",
      "text_ar": "لَّيْسَ عَلَى ٱلضُّعَفَآءِ وَلَا عَلَى ٱلْمَرْضَىٰ وَلَا عَلَى ٱلَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُوا۟ لِلَّهِ وَرَسُولِهِۦ ۚ مَا عَلَى ٱلْمُحْسِنِينَ مِن سَبِيلٍ ۚ وَٱللَّهُ غَفُورٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:92",
      "text_ar": "وَلَا عَلَى ٱلَّذِينَ إِذَا مَآ أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَآ أَجِدُ مَآ أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوا۟ وَّأَعْيُنُهُمْ تَفِيضُ مِنَ ٱلدَّمْعِ حَزَنًا أَلَّا يَجِدُوا۟ مَا يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:98",
      "text_ar": "وَمِنَ ٱلْأَعْرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغْرَمًا وَيَتَرَبَّصُ بِكُمُ ٱلدَّوَآئِرَ ۚ عَلَيْهِمْ دَآئِرَةُ ٱلسَّوْءِ ۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:99",
      "text_ar": "وَمِنَ ٱلْأَعْرَابِ مَن يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَـٰتٍ عِندَ ٱللَّهِ وَصَلَوَٰتِ ٱلرَّسُولِ ۚ أَلَآ إِنَّهَا قُرْبَةٌ لَّهُمْ ۚ سَيُدْخِلُهُمُ ٱللَّهُ فِى رَحْمَتِهِۦٓ ۗ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:121",
      "text_ar": "وَلَا يُنفِقُونَ نَفَقَةً صَغِيرَةً وَلَا كَبِيرَةً وَلَا يَقْطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمْ لِيَجْزِيَهُمُ ٱللَّهُ أَحْسَنَ مَا كَانُوا۟ يَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "11:91",
      "text_ar": "قَالُوا۟ يَـٰشُعَيْبُ مَا نَفْقَهُ كَثِيرًا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِينَا ضَعِيفًا ۖ وَلَوْلَا رَهْطُكَ لَرَجَمْنَـٰكَ ۖ وَمَآ أَنتَ عَلَيْنَا بِعَزِيزٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "12:72",
      "text_ar": "قَالُوا۟ نَفْقِدُ صُوَاعَ ٱلْمَلِكِ وَلِمَن جَآءَ بِهِۦ حِمْلُ بَعِيرٍ وَأَنَا۠ بِهِۦ زَعِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "13:22",
      "text_ar": "وَٱلَّذِينَ صَبَرُوا۟ ٱبْتِغَآءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقْنَـٰهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِٱلْحَسَنَةِ ٱلسَّيِّئَةَ أُو۟لَـٰٓئِكَ لَهُمْ عُقْبَى ٱلدَّارِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "14:31",
      "text_ar": "قُل لِّعِبَادِىَ ٱلَّذِينَ ءَامَنُوا۟ يُقِيمُوا۟ ٱلصَّلَوٰةَ وَيُنفِقُوا۟ مِمَّا رَزَقْنَـٰهُمْ سِرًّا وَعَلَانِيَةً مِّن قَبْلِ أَن يَأْتِىَ يَوْمٌ لَّا بَيْعٌ فِيهِ وَلَا خِلَـٰلٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:75",
      "text_ar": "ضَرَبَ ٱللَّهُ مَثَلًا عَبْدًا مَّمْلُوكًا لَّا يَقْدِرُ عَلَىٰ شَىْءٍ وَمَن رَّزَقْنَـٰهُ مِنَّا رِزْقًا حَسَنًا فَهُوَ يُنفِقُ مِنْهُ سِرًّا وَجَهْرًا ۖ هَلْ يَسْتَوُۥنَ ۚ ٱلْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "17:100",
      "text_ar": "قُل لَّوْ أَنتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّىٓ إِذًا لَّأَمْسَكْتُمْ خَشْيَةَ ٱلْإِنفَاقِ ۚ وَكَانَ ٱلْإِنسَـٰنُ قَتُورًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "18:42",
      "text_ar": "وَأُحِيطَ بِثَمَرِهِۦ فَأَصْبَحَ يُقَلِّبُ كَفَّيْهِ عَلَىٰ مَآ أَنفَقَ فِيهَا وَهِىَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَيَقُولُ يَـٰلَيْتَنِى لَمْ أُشْرِكْ بِرَبِّىٓ أَحَدًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "22:35",
      "text_ar": "ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتْ قُلُوبُهُمْ وَٱلصَّـٰبِرِينَ عَلَىٰ مَآ أَصَابَهُمْ وَٱلْمُقِيمِى ٱلصَّلَوٰةِ وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "25:67",
      "text_ar": "وَٱلَّذِينَ إِذَآ أَنفَقُوا۟ لَمْ يُسْرِفُوا۟ وَلَمْ يَقْتُرُوا۟ وَكَانَ بَيْنَ ذَٰلِكَ قَوَامًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "28:54",
      "text_ar": "أُو۟لَـٰٓئِكَ يُؤْتَوْنَ أَجْرَهُم مَّرَّتَيْنِ بِمَا صَبَرُوا۟ وَيَدْرَءُونَ بِٱلْحَسَنَةِ ٱلسَّيِّئَةَ وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "32:16",
      "text_ar": "تَتَجَافَىٰ جُنُوبُهُمْ عَنِ ٱلْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "34:39",
      "text_ar": "قُلْ إِنَّ رَبِّى يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ مِنْ عِبَادِهِۦ وَيَقْدِرُ لَهُۥ ۚ وَمَآ أَنفَقْتُم مِّن شَىْءٍ فَهُوَ يُخْلِفُهُۥ ۖ وَهُوَ خَيْرُ ٱلرَّٰزِقِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "35:29",
      "text_ar": "إِنَّ ٱلَّذِينَ يَتْلُونَ كِتَـٰبَ ٱللَّهِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقْنَـٰهُمْ سِرًّا وَعَلَانِيَةً يَرْجُونَ تِجَـٰرَةً لَّن تَبُورَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "36:47",
      "text_ar": "وَإِذَا قِيلَ لَهُمْ أَنفِقُوا۟ مِمَّا رَزَقَكُمُ ٱللَّهُ قَالَ ٱلَّذِينَ كَفَرُوا۟ لِلَّذِينَ ءَامَنُوٓا۟ أَنُطْعِمُ مَن لَّوْ يَشَآءُ ٱللَّهُ أَطْعَمَهُۥٓ إِنْ أَنتُمْ إِلَّا فِى ضَلَـٰلٍ مُّبِينٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "42:38",
      "text_ar": "وَٱلَّذِينَ ٱسْتَجَابُوا۟ لِرَبِّهِمْ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَمْرُهُمْ شُورَىٰ بَيْنَهُمْ وَمِمَّا رَزَقْنَـٰهُمْ يُنفِقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_003_chunk00",
        "verse_key": "2:3",
        "text_ar": "قوله تعالى: {الذين يؤمنون}: موضع الذين خفض نعتاً للمتقين. يؤمنون: يصدقون (ويترك الهمزة أبو عمرو وورش، والآخرون يهمزونه وكذلك يتركان كل همزة ساكنة هي فاء الفعل نحو يؤمن ومؤمن إلا أحرفاً معدودة).وحقيقة الإيمان التصديق بالقلب، قال الله تعالى: {وما أنت بمؤمن لنا} [17-يوسف] [ أي بمصدق لنا ] وهو في الشريعة: الاعتقاد بالقلب والإقرار باللسان والعمل بالأركان، فسمي الإقرار والعمل إيماناً، لوجه من المناسبة، لأنه من شرائعه.والإسلام: هو الخضوع والانقياد، فكل إيمان إسلام وليس كل إسلام إيماناً، إذا لم يكن معه ",
        "char_start": 0,
        "char_end": 5422,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_195_chunk00",
        "verse_key": "2:195",
        "text_ar": "قوله تعالى : ( وأنفقوا في سبيل الله ) أراد به الجهاد وكل خير هو في سبيل الله ولكن إطلاقه ينصرف إلى الجهاد ( ولا تلقوا بأيديكم إلى التهلكة ) قيل الباء في قوله تعالى ( بأيديكم ) زائدة يريد ولا تلقوا أيديكم أي أنفسكم ( إلى التهلكة ) عبر عن النفس بالأيدي كقوله تعالى \" بما كسبت أيديكم \" ( 30 - الشورى ) أي بما كسبتم وقيل الباء في موضعها وفيه حذف ، أي لا تلقوا أنفسكم بأيديكم إلى التهلكة أي الهلاك وقيل التهلكة كل شيء يصير عاقبته إلى الهلاك أي ولا تأخذوا في ذلك وقيل التهلكة ما يمكن الاحتراز عنه والهلاك م",
        "char_start": 0,
        "char_end": 2881,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_215_chunk00",
        "verse_key": "2:215",
        "text_ar": "قوله تعالى : ( يسألونك ماذا ينفقون ) نزلت في عمرو بن الجموح وكان شيخا كبيرا ذا مال فقال : يا رسول الله بماذا نتصدق وعلى من ننفق؟ فأنزل الله تعالى ( يسألونك ماذا ينفقون ) وفي قوله ) ( ماذا ) وجهان من الإعراب أحدهما أن يكون محله نصبا بقوله ) ( ينفقون ) تقديره : أي شيء ينفقون؟ والآخر أن يكون رفعا بما ومعناه : ما الذي ينفقون؟ ( قل ما أنفقتم من خير ) أي من مال ( فللوالدين والأقربين واليتامى والمساكين وابن السبيل وما تفعلوا من خير فإن الله به عليم ) يجازيكم به قال أهل التفسير : كان هذا قبل فرض الزكاة ",
        "char_start": 0,
        "char_end": 515,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_219_chunk00",
        "verse_key": "2:219",
        "text_ar": "قوله تعالى : ( يسألونك عن الخمر والميسر ) الآية نزلت في عمر بن الخطاب ومعاذ بن جبل رضي الله عنهما ونفر من الأنصار أتوا إلى رسول الله صلى الله عليه وسلم فقالوا : يا رسول الله أفتنا في الخمر والميسر فإنهما مذهبة للعقل مسلبة للمال؟ فأنزل الله هذه الآية .وجملة القول في تحريم الخمر على ما قال المفسرون أن الله أنزل في الخمر أربع آيات نزلت بمكة وهي : \" ومن ثمرات النخيل والأعناب تتخذون منه سكرا ورزقا حسنا \" ( 67 - النحل ) فكان المسلمون يشربونها وهي لهم حلال يومئذ ثم نزلت في مسألة عمر ومعاذ بن جبل ( يسأل",
        "char_start": 0,
        "char_end": 9113,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_254_chunk00",
        "verse_key": "2:254",
        "text_ar": "قوله تعالى : ( يا أيها الذين آمنوا أنفقوا مما رزقناكم ) قال السدي : أراد به الزكاة المفروضة وقال غيره : أراد به صدقة التطوع والنفقة في الخير ( من قبل أن يأتي يوم لا بيع فيه ) أي لا فداء فيه سماه بيعا لأن الفداء شراء نفسه ( ولا خلة ) لا صداقة ( ولا شفاعة ) إلا بإذن الله قرأ ابن كثير ونافع وأهل البصرة كلها بالنصب وكذلك في سورة إبراهيم ( الآية 31 ) \" لا بيع فيه ولا خلال \" وفي سورة الطور ( الآية 23 ) \" لا لغو فيها ولا تأثيم \" وقرأ الآخرون كلها بالرفع والتنوين ( والكافرون هم الظالمون ) لأنهم وضعوا ال",
        "char_start": 0,
        "char_end": 521,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_261_chunk00",
        "verse_key": "2:261",
        "text_ar": "قوله تعالى : ( مثل الذين ينفقون أموالهم في سبيل الله ) فيه إضمار تقديره مثل صدقات الذين ينفقون أموالهم ( كمثل ) زارع ( حبة ) وأراد بسبيل الله الجهاد وقيل جميع أبواب الخير ( أنبتت ) أخرجت ( سبع سنابل ) جمع سنبلة ( في كل سنبلة مائة حبة ) فإن قيل فما رأينا سنبلة فيها مائة حبة فكيف ضرب المثل به؟ قيل : ذلك متصور غير مستحيل وما لا يكون مستحيلا جاز ضرب المثل به وإن لم يوجد معناه : ( في كل سنبلة مائة حبة ) فما حدث من البذر الذي كان فيها كان مضاعفا إليها وكذلك تأوله الضحاك فقال : كل سنبلة أنبتت مائة حبة ",
        "char_start": 0,
        "char_end": 748,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "قوله تعالى : ( الذين ينفقون أموالهم في سبيل الله ) قال الكلبي : نزلت هذه الآية في عثمان بن عفان وعبد الرحمن بن عوف رضي الله تعالى عنهما جاء عبد الرحمن بأربعة آلاف درهم صدقة إلى رسول الله صلى الله عليه وسلم فقال : يا رسول الله كانت عندي ثمانية آلاف فأمسكت منها لنفسي وعيالي أربعة آلاف درهم وأربعة آلاف أقرضتها ربي فقال له رسول الله صلى الله عليه وسلم : بارك الله فيما أمسكت لك وفيما أعطيت وأما عثمان فجهز جيش المسلمين في غزوة تبوك بألف بعير بأقتابها وأحلاسها فنزلت فيهما هذه الآية .وقال عبد الرحمن بن ",
        "char_start": 0,
        "char_end": 1308,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_264_chunk00",
        "verse_key": "2:264",
        "text_ar": "قوله تعالى : ( يا أيها الذين آمنوا لا تبطلوا صدقاتكم ) أي أجور صدقاتكم ( بالمن ) على السائل وقال ابن عباس رضي الله عنهما : بالمن على الله تعالى ( والأذى ) لصاحبها ثم ضرب لذلك مثلا فقال ( كالذي ينفق ماله ) أي كإبطال الذي ينفق ماله ( رئاء الناس ) أي مراءاة وسمعة ليروا نفقته ويقولوا إنه كريم سخي ( ولا يؤمن بالله واليوم الآخر ) يريد أن الرياء يبطل الصدقة ولا تكون النفقة مع الرياء من فعل المؤمنين وهذا للمنافقين لأن الكافر معلن بكفره غير مراء ( فمثله ) أي مثل هذا المرائي ( كمثل صفوان ) الحجر الأملس وه",
        "char_start": 0,
        "char_end": 3088,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_265_chunk00",
        "verse_key": "2:265",
        "text_ar": "قوله تعالى : ( ومثل الذين ينفقون أموالهم ابتغاء مرضاة الله ) أي طلب رضا الله تعالى ( وتثبيتا من أنفسهم ) قال قتادة : احتسابا وقال الشعبي والكلبي : تصديقا من أنفسهم أي يخرجون الزكاة طيبة بها أنفسهم على يقين بالثواب وتصديق بوعد الله ويعلمون أن ما أخرجوا خير لهم مما تركوا وقيل على يقين بإخلاف الله عليهم .وقال عطاء ومجاهد : يثبتون أي يضعون أموالهم قال الحسن : كان الرجل إذا هم بصدقة تثبت فإن كان لله أمضى وإن كان يخالطه شك أمسك وعلى هذا القول يكون التثبيت بمعنى التثبت كقوله تعالى : \" وتبتل إليه تبتيلا",
        "char_start": 0,
        "char_end": 1520,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "يا أيها الذين آمنوا أنفقوا من طيبات ) خيار قال ابن مسعود رضي الله عنه ومجاهد : من حلالات ( ما كسبتم ) بالتجارة والصناعة وفيه دلالة على إباحة الكسب وأنه ينقسم إلى طيب وخبيث .أخبرنا عبد الواحد بن أحمد المليحي ، أخبرنا أبو منصور محمد بن محمد بن سمعان ، أخبرنا أبو جعفر الرياني ، أخبرنا حميد بن زنجويه ، أخبرنا يعلى بن عبيد ، أخبرنا الأعمش عن إبراهيم عن الأسود عن عائشة رضي الله عنها قالت : قال رسول الله صلى الله عليه وسلم \" إن أطيب ما يأكل الرجل من كسبه وإن ولده من كسبه \" .أخبرنا عبد الواحد بن أحمد ال",
        "char_start": 0,
        "char_end": 5435,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_270_chunk00",
        "verse_key": "2:270",
        "text_ar": "قوله تعالى : ( وما أنفقتم من نفقة ) فيما فرض الله عليكم ( أو نذرتم من نذر ) أي : ما أوجبتموه [ أنتم ] على أنفسكم في طاعة الله فوفيتم به ( فإن الله يعلمه ) يحفظه حتى يجازيكم به وإنما قال : يعلمه ولم يقل : يعلمها لأنه رده إلى الآخر منهما كقوله تعالى : \" ومن يكسب خطيئة أو إثما ثم يرم به بريئا \" ( 112 - النساء ) وإن شئت حملته على \" ما \" كقوله : \" وما أنزل عليكم من الكتاب والحكمة يعظكم به \" ( 231 - البقرة ) ولم يقل بهما ( وما للظالمين ) الواضعين الصدقة في غير موضعها بالرياء أو يتصدقون من الحرام ( من ",
        "char_start": 0,
        "char_end": 568,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_272_chunk00",
        "verse_key": "2:272",
        "text_ar": "( ليس عليك هداهم ) قال الكلبي سبب نزول هذه الآية أن ناسا من المسلمين كانت لهم قرابة وأصهار في اليهود وكانوا ينفقون عليهم قبل أن يسلموا فلما أسلموا كرهوا أن ينفقوا عليهم وأرادوهم على أن يسلموا وقال سعيد بن جبير كانوا يتصدقون على فقراء أهل الذمة فلما كثر فقراء المسلمين نهى رسول الله صلى الله عليه وسلم عن التصدق على المشركين كي تحملهم الحاجة على الدخول في الإسلام فنزل قوله ( ليس عليك هداهم ) فتمنعهم الصدقة ليدخلوا في الإسلام حاجة منهم إليها ( ولكن الله يهدي من يشاء ) وأراد به هداية التوفيق أما هدى ",
        "char_start": 0,
        "char_end": 1074,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_273_chunk00",
        "verse_key": "2:273",
        "text_ar": "قوله تعالى : ( للفقراء الذين أحصروا في سبيل الله ) اختلفوا في موضع هذه اللام قيل هي مردودة على موضع اللام من قوله \" فلأنفسكم \" كأنه قال : وما تنفقوا من خير فللفقراء وإنما تنفقون لأنفسكم وقيل : معناها الصدقات التي سبق ذكرها وقيل : خبره محذوف تقديره : للفقراء الذين صفتهم كذا حق واجب وهم فقراء المهاجرين كانوا نحوا من أربعمائة رجل لم يكن لهم مساكن بالمدينة ولا عشائر وكانوا في المسجد يتعلمون القرآن ويرضخون النوى بالنهار وكانوا يخرجون في كل سرية يبعثها رسول الله صلى الله عليه وسلم وهم أصحاب الصفة ، فح",
        "char_start": 0,
        "char_end": 4095,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "( الذين ينفقون أموالهم بالليل والنهار سرا وعلانية ) روي عن مجاهد عن ابن عباس رضي الله عنهما قال : نزلت هذه الآية في علي بن أبي طالب رضي الله عنه كانت عنده أربعة دراهم لا يملك غيرها فتصدق بدرهم ليلا وبدرهم نهارا وبدرهم سرا وبدرهم علانية .وعن الضحاك عن ابن عباس رضي الله عنهم قال لما نزلت ( للفقراء الذين أحصروا في سبيل الله ) بعث عبد الرحمن بن عوف بدنانير كثيرة إلى أصحاب الصفة ، وبعث علي بن أبي طالب رضي الله عنه في جوف الليل بوسق من تمر فأنزل الله تعالى فيهما ( الذين ينفقون أموالهم بالليل والنهار )",
        "char_start": 0,
        "char_end": 1293,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_017_chunk00",
        "verse_key": "3:17",
        "text_ar": "( الصابرين والصادقين ) إن شئت نصبتها على المدح ، وإن شئت خفضتها على النعت ، يعني الصابرين في أداء الأمر وعن ارتكاب النهي ، وعلى البأساء والضراء وحين البأس ، والصادقين في إيمانهم ، قال قتادة : هم قوم صدقت نياتهم واستقامت قلوبهم وألسنتهم فصدقوا في السر والعلانية ( والقانتين ) المطيعين المصلين ( والمنفقين ) أموالهم في طاعة الله ( والمستغفرين بالأسحار ) قال مجاهد وقتادة والكلبي : يعني المصلين بالأسحار وعن زيد بن أسلم أنه قال : هم الذين يصلون الصبح في الجماعة ، وقيل بالسحر لقربه من الصبح وقال الحسن :",
        "char_start": 0,
        "char_end": 1221,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_092_chunk00",
        "verse_key": "3:92",
        "text_ar": "قوله تعالى : ( لن تنالوا البر ) يعني : الجنة ، قاله ابن عباس وابن مسعود ومجاهد ، وقال مقاتل بن حيان : التقوى ، وقيل : الطاعة ، وقيل : الخير ، وقال الحسن : أن تكونوا أبرارا .أخبرنا محمد بن عبد الله الصالحي ، أنا أبو بكر أحمد بن الحسن الحيري ، أنا حاجب بن أحمد الطوسي أخبرنا محمد بن حماد قال : أخبرنا أبو معاوية عن الأعمش عن شقيق عن عبد الله رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : \" عليكم بالصدق فإن الصدق يهدي إلى البر وإن البر يهدي إلى الجنة ، وما يزال الرجل يصدق ويتحرى الصدق حتى يكتب",
        "char_start": 0,
        "char_end": 2317,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_117_chunk00",
        "verse_key": "3:117",
        "text_ar": "( مثل ما ينفقون في هذه الحياة الدنيا ) قيل : أراد نفقات أبي سفيان وأصحابه ببدر وأحد على عداوة رسول الله صلى الله عليه وسلم وقال مقاتل : نفقة اليهود على علمائهم ، قال مجاهد : يعني جميع نفقات الكفار [ في الدنيا ] وصدقاتهم وقيل : أراد إنفاق المرائي الذي لا يبتغي به وجه الله تعالى ، ( كمثل ريح فيها صر ) [ حكي عن ابن عباس رضي الله عنهما : أنها السموم الحارة التي تقتل وقيل : ] فيها صر أي : صوت ، وأكثر المفسرين قالوا : فيها برد شديد ، ( أصابت حرث قوم ) زرع قوم ، ( ظلموا أنفسهم ) بالكفر والمعصية ومنع حق",
        "char_start": 0,
        "char_end": 726,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_134_chunk00",
        "verse_key": "3:134",
        "text_ar": "( الذين ينفقون في السراء والضراء ) أي : في اليسر والعسر فأول ما ذكر من أخلاقهم الموجبة للجنة ذكر السخاوة وقد جاء في الحديث . أخبرنا أبو سعيد الشريحي ، أخبرنا أبو إسحاق الثعلبي ، أخبرنا أبو عمرو الفراتي ، أخبرنا أبو العباس أحمد بن إسماعيل العنبري ، أخبرنا أبو عبد الله بن حازم البغوي بمكة ، أخبرنا أبو صالح بن أيوب الهاشمي ، أخبرنا إبراهيم بن سعد ، أخبرنا سعيد بن محمد ، عن يحيى بن سعيد عن الأعرج عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : \" السخي قريب من الله قريب من الجنة قر",
        "char_start": 0,
        "char_end": 1435,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_034_chunk00",
        "verse_key": "4:34",
        "text_ar": "قوله عز وجل : ( الرجال قوامون على النساء ) الآية نزلت في سعد بن الربيع وكان من النقباء وفي امرأته حبيبة بنت زيد بن أبي زهير ، قاله مقاتل ، وقال الكلبي : امرأته حبيبة بنت محمد بن مسلمة ، وذلك أنها نشزت عليه فلطمها ، فانطلق أبوها معها إلى النبي صلى الله عليه وسلم [ فقال : أفرشته كريمتي فلطمها ، فقال النبي صلى الله عليه وسلم : \" لتقتص من زوجها \" ، فانصرفت مع أبيها ] لتقتص منه فجاءجبريل عليه السلام [ فقال النبي صلى الله عليه وسلم : \" ارجعوا هذا جبريل أتاني بشيء \" ، فأنزل الله هذه الآية ] ، فقال النب",
        "char_start": 0,
        "char_end": 3485,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_038_chunk00",
        "verse_key": "4:38",
        "text_ar": "( والذين ينفقون أموالهم رئاء الناس ولا يؤمنون بالله ولا باليوم الآخر ) محل \" الذين \" نصب ، عطفا على الذين يبخلون ، وقيل : خفض عطفا على قوله : و ( أعتدنا للكافرين ) نزلت في اليهود ، وقال السدي : في المنافقين ، وقيل : في مشركي مكة المتفقين على عداوة الرسول صلى الله عليه وسلم .( ومن يكن الشيطان له قرينا ) صاحبا وخليلا ( فساء قرينا ) أي : فبئس الشيطان قرينا وهو نصب على التفسير ، وقيل : على القطع بإلقاء الألف واللام كما تقول : نعم رجلا عبد الله ، وكما قال تعالى : \" بئس للظالمين بدلا \" ( الكهف - 50 ) ",
        "char_start": 0,
        "char_end": 532,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_003_chunk00",
        "verse_key": "2:3",
        "text_ar": "( الذين يومنون بالغيب )قال ابو جعفر الرازي ، عن العلاء بن المسيب بن رافع ، عن ابي اسحاق ، عن ابي الاحوص ، عن عبد الله ، قال : الايمان التصديق .وقال علي بن ابي طلحه وغيره ، عن ابن عباس ، ( يومنون ) يصدقون .وقال معمر عن الزهري : الايمان العمل .وقال ابو جعفر الرازي ، عن الربيع بن انس : ( يومنون ) يخشون .قال ابن جرير وغيره : والاولي ان يكونوا موصوفين بالايمان بالغيب قولا واعتقادا وعملا قال : وقد تدخل الخشيه لله في معني الايمان ، الذي هو تصديق القول بالعمل ، والايمان كلمه جامعه للاقرار بالله وكتبه ور",
        "char_start": 0,
        "char_end": 9083,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_195_chunk00",
        "verse_key": "2:195",
        "text_ar": "قال البخاري : حدثنا اسحاق ، اخبرنا النضر ، اخبرنا شعبه عن سليمان قال : سمعت ابا وايل ، عن حذيفه : ( وانفقوا في سبيل الله ولا تلقوا بايديكم الي التهلكه ) قال : نزلت في النفقه .ورواه ابن ابي حاتم ، عن الحسن بن محمد بن الصباح ، عن ابي معاويه عن الاعمش ، به مثله . قال : وروي عن ابن عباس ، ومجاهد ، وعكرمه ، وسعيد بن جبير ، وعطاء ، والضحاك ، والحسن ، وقتاده ، والسدي ، ومقاتل بن حيان ، نحو ذلك .وقال الليث بن سعد ، عن يزيد بن ابي حبيب ، عن اسلم ابي عمران قال : حمل رجل من المهاجرين بالقسطنطينيه علي صف ال",
        "char_start": 0,
        "char_end": 4903,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_215_chunk00",
        "verse_key": "2:215",
        "text_ar": "قال مقاتل بن حيان : هذه الايه في نفقه التطوع . وقال السدي : نسختها الزكاه . وفيه نظر . ومعني الايه : يسالونك كيف ينفقون ؟ قاله ابن عباس ومجاهد ، فبين لهم تعالي ذلك ، فقال : ( قل ما انفقتم من خير فللوالدين والاقربين واليتامي والمساكين وابن السبيل ) اي : اصرفوها في هذه الوجوه . كما جاء في الحديث : \" امك واباك ، واختك واخاك ، ثم ادناك ادناك \" . وتلا ميمون بن مهران هذه الايه ، ثم قال : هذه مواضع النفقه ما ذكر فيها طبلا ولا مزمارا ، ولا تصاوير الخشب ، ولا كسوه الحيطان .ثم قال تعالي : ( وما تفعلوا من ",
        "char_start": 0,
        "char_end": 634,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_219_chunk00",
        "verse_key": "2:219",
        "text_ar": "قال الامام احمد : حدثنا خلف بن الوليد ، حدثنا اسراييل ، عن ابي اسحاق ، عن ابي ميسره ، عن عمر انه قال : لما نزل تحريم الخمر قال : اللهم بين لنا في الخمر بيانا شافيا . فنزلت هذه الايه التي في البقره : ( يسالونك عن الخمر والميسر قل فيهما اثم كبير [ ومنافع للناس ] ) فدعي عمر فقريت عليه ، فقال : اللهم بين لنا في الخمر بيانا شافيا . فنزلت الايه التي في النساء : ( يا ايها الذين امنوا لا تقربوا الصلاه وانتم سكاري ) [ النساء : 43 ] ، فكان منادي رسول الله صلي الله عليه وسلم اذا اقام الصلاه نادي : الا يقرب",
        "char_start": 0,
        "char_end": 4549,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_254_chunk00",
        "verse_key": "2:254",
        "text_ar": "يامر تعالي عباده بالانفاق مما رزقهم في سبيله سبيل الخير ليدخروا ثواب ذلك عند ربهم ومليكهم وليبادروا الي ذلك في هذه الحياه الدنيا ( من قبل ان ياتي يوم ) يعني : يوم القيامه ( لا بيع فيه ولا خله ولا شفاعه ) اي : لا يباع احد من نفسه ولا يفادي بمال لو بذله ، ولو جاء بملء الارض ذهبا ولا تنفعه خله احد ، يعني : صداقته بل ولا نسابته كما قال : ( فاذا نفخ في الصور فلا انساب بينهم يوميذ ولا يتساءلون ) [ المومنون : 101 ] ( ولا شفاعه ) اي : ولا تنفعهم شفاعه الشافعين .وقوله : ( والكافرون هم الظالمون ) مبتدا مح",
        "char_start": 0,
        "char_end": 687,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_261_chunk00",
        "verse_key": "2:261",
        "text_ar": "هذا مثل ضربه الله تعالي لتضعيف الثواب لمن انفق في سبيله وابتغاء مرضاته ، وان الحسنه تضاعف بعشر امثالها الي سبعمايه ضعف ، فقال : ( مثل الذين ينفقون اموالهم في سبيل الله ) قال سعيد بن جبير : في طاعه الله . وقال مكحول : يعني به : الانفاق في الجهاد ، من رباط الخيل واعداد السلاح وغير ذلك ، وقال شبيب بن بشر ، عن عكرمه ، عن ابن عباس : الجهاد والحج ، يضعف الدرهم فيهما الي سبعمايه ضعف ; ولهذا قال الله تعالي : ( كمثل حبه انبتت سبع سنابل في كل سنبله مايه حبه )وهذا المثل ابلغ في النفوس ، من ذكر عدد السبعماي",
        "char_start": 0,
        "char_end": 4482,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "يمدح تعالي الذين ينفقون اموالهم في سبيل الله ، ثم لا يتبعون ما انفقوا من الخيرات والصدقات منا علي من اعطوه ، فلا يمنون علي احد ، ولا يمنون به لا بقول ولا فعل .وقوله : ( ولا اذي ) اي : لا يفعلون مع من احسنوا اليه مكروها يحبطون به ما سلف من الاحسان . ثم وعدهم تعالي الجزاء الجزيل علي ذلك ، فقال : ( لهم اجرهم عند ربهم ) اي : ثوابهم علي الله ، لا علي احد سواه ( ولا خوف عليهم ) اي : فيما يستقبلونه من اهوال يوم القيامه ( ولا هم يحزنون ) اي : [ علي ] ما خلفوه من الاولاد وما فاتهم من الحياه الدنيا وزهرته",
        "char_start": 0,
        "char_end": 561,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_264_chunk00",
        "verse_key": "2:264",
        "text_ar": "ولهذا قال تعالي : ( يا ايها الذين امنوا لا تبطلوا صدقاتكم بالمن والاذي ) فاخبر ان الصدقه تبطل بما يتبعها من المن والاذي ، فما يفي ثواب الصدقه بخطييه المن والاذي .ثم قال تعالي : ( كالذي ينفق ماله رياء الناس ) اي : لا تبطلوا صدقاتكم بالمن والاذي ، كما تبطل صدقه من راءي بها الناس ، فاظهر لهم انه يريد وجه الله وانما قصده مدح الناس له او شهرته بالصفات الجميله ، ليشكر بين الناس ، او يقال : انه كريم ونحو ذلك من المقاصد الدنيويه ، مع قطع نظره عن معامله الله تعالي وابتغاء مرضاته وجزيل ثوابه ; ولهذا قال :",
        "char_start": 0,
        "char_end": 1053,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_265_chunk00",
        "verse_key": "2:265",
        "text_ar": "وهذا مثل المومنين المنفقين ( اموالهم ابتغاء مرضاه الله ) عنهم في ذلك ( وتثبيتا من انفسهم ) اي : وهم متحققون مثبتون ان الله سيجزيهم علي ذلك اوفر الجزاء ، ونظير هذا في المعني ، قوله عليه السلام في الحديث المتفق علي صحته : \" من صام رمضان ايمانا واحتسابا . . . \" اي : يومن ان الله شرعه ، ويحتسب عند الله ثوابه .قال الشعبي : ( وتثبيتا من انفسهم ) اي : تصديقا ويقينا . وكذا قال قتاده ، وابو صالح ، وابن زيد . واختاره ابن جرير . وقال مجاهد والحسن : اي : يتثبتون اين يضعون صدقاتهم .وقوله : ( كمثل جنه بربوه )",
        "char_start": 0,
        "char_end": 1286,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "يامر تعالي عباده المومنين بالانفاق والمراد به الصدقه هاهنا ; قاله ابن عباس من طيبات ما رزقهم من الاموال التي اكتسبوها . قال مجاهد : يعني التجاره بتيسيره اياها لهم .وقال علي والسدي : ( من طيبات ما كسبتم ) يعني : الذهب والفضه ، ومن الثمار والزروع التي انبتها لهم من الارض .قال ابن عباس : امرهم بالانفاق من اطيب المال واجوده وانفسه ، ونهاهم عن التصدق برذاله المال ودنيه وهو خبيثه فان الله طيب لا يقبل الا طيبا ، ولهذا قال : ( ولا تيمموا ) اي : تقصدوا ( الخبيث منه تنفقون ولستم باخذيه ) اي : لو اعطيتموه ",
        "char_start": 0,
        "char_end": 5451,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_270_chunk00",
        "verse_key": "2:270",
        "text_ar": "يخبر تعالي بانه عالم بجميع ما يفعله العاملون من الخيرات من النفقات والمنذورات وتضمن ذلك مجازاته علي ذلك اوفر الجزاء للعاملين لذلك ابتغاء وجهه ورجاء موعوده . وتوعد من لا يعمل بطاعته ، بل خالف امره وكذب خبره وعبد معه غيره ، فقال : ( وما للظالمين من انصار ) اي : يوم القيامه ينقذونهم من عذاب الله ونقمته .",
        "char_start": 0,
        "char_end": 302,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_272_chunk00",
        "verse_key": "2:272",
        "text_ar": "قال ابو عبد الرحمن النسايي : اخبرنا محمد بن عبد الله بن عبد الرحيم ، اخبرنا الفريابي ، حدثنا سفيان ، عن الاعمش ، عن جعفر بن اياس ، عن سعيد بن جبير ، عن ابن عباس قال : كانوا يكرهون ان يرضخوا لانسابهم من المشركين فسالوا ، فرخص لهم ، فنزلت هذه الايه : ( ليس عليك هداهم ولكن الله يهدي من يشاء وما تنفقوا من خير فلانفسكم وما تنفقون الا ابتغاء وجه الله وما تنفقوا من خير يوف اليكم وانتم لا تظلمون ) .وكذا رواه ابو حذيفه ، وابن المبارك ، وابو احمد الزبيري ، وابو داود الحفري ، عن سفيان وهو الثوري به .وقال ا",
        "char_start": 0,
        "char_end": 2285,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_273_chunk00",
        "verse_key": "2:273",
        "text_ar": "وقوله : ( للفقراء الذين احصروا في سبيل الله ) يعني : المهاجرين الذين قد انقطعوا الي الله والي رسوله ، وسكنوا المدينه وليس لهم سبب يردون به علي انفسهم ما يغنيهم و ( لا يستطيعون ضربا في الارض ) يعني : سفرا للتسبب في طلب المعاش . والضرب في الارض : هو السفر ; قال الله تعالي : ( واذا ضربتم في الارض فليس عليكم جناح ان تقصروا من الصلاه ) [ النساء : 101 ] ، وقال تعالي : ( علم ان سيكون منكم مرضي واخرون يضربون في الارض يبتغون من فضل الله واخرون يقاتلون في سبيل الله ) الايه [ المزمل : 20 ] .وقوله : ( يحسبه",
        "char_start": 0,
        "char_end": 5550,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "وقوله : ( الذين ينفقون اموالهم بالليل والنهار سرا وعلانيه فلهم اجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون ) هذا مدح منه تعالي للمنفقين في سبيله ، وابتغاء مرضاته في جميع الاوقات من ليل او نهار ، والاحوال من سر وجهار ، حتي ان النفقه علي الاهل تدخل في ذلك ايضا ، كما ثبت في الصحيحين ان رسول الله صلي الله عليه وسلم قال لسعد بن ابي وقاص حين عاده مريضا عام الفتح ، وفي روايه عام حجه الوداع : \" وانك لن تنفق نفقه تبتغي بها وجه الله الا ازددت بها درجه ورفعه ، حتي ما تجعل في في امراتك \" .وقال الامام احمد : ",
        "char_start": 0,
        "char_end": 1790,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_017_chunk00",
        "verse_key": "3:17",
        "text_ar": "ثم قال : ( الصابرين ) اي : في قيامهم بالطاعات وتركهم المحرمات ( والصادقين ) فيما اخبروا به من ايمانهم بما يلتزمونه من الاعمال الشاقه ( والقانتين ) والقنوت : الطاعه والخضوع ( والمنفقين ) اي : من اموالهم في جميع ما امروا به من الطاعات ، وصله الارحام والقربات ، وسد الخلات ، ومواساه ذوي الحاجات ( والمستغفرين بالاسحار ) دل علي فضيله الاستغفار وقت الاسحار .وقد قيل : ان يعقوب ، عليه السلام ، لما قال لبنيه : ( سوف استغفر لكم ربي ) [ يوسف : 98 ] انه اخرهم الي وقت السحر . وثبت في الصحيحين وغيرهما من المسا",
        "char_start": 0,
        "char_end": 1441,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_092_chunk00",
        "verse_key": "3:92",
        "text_ar": "[ روي وكيع في تفسيره عن شريك ، عن ابي اسحاق ، عن عمرو بن ميمون ( لن تنالوا البر ) قال : البر الجنه ] وقال الامام احمد : حدثنا روح ، حدثنا مالك ، عن اسحاق بن عبد الله بن ابي طلحه ، سمع انس بن مالك يقول : كان ابو طلحه اكثر انصاري بالمدينه مالا وكان احب امواله اليه بيرحاء - وكانت مستقبله المسجد ، وكان النبي صلي الله عليه وسلم يدخلها ويشرب من ماء فيها طيب - قال انس : فلما نزلت : ( لن تنالوا البر حتي تنفقوا مما تحبون ) قال ابو طلحه : يا رسول الله ، ان الله يقول : ( لن تنالوا البر حتي تنفقوا مما تحبون",
        "char_start": 0,
        "char_end": 1354,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_117_chunk00",
        "verse_key": "3:117",
        "text_ar": "ثم ضرب مثلا لما ينفقه الكفار في هذه الدار ، قاله مجاهد والحسن ، والسدي ، فقال تعالي : ( مثل ما ينفقون في هذه الحياه الدنيا كمثل ريح فيها صر ) اي : برد شديد ، قاله ابن عباس ، وعكرمه ، وسعيد بن جبير وقتاده والحسن ، والضحاك ، والربيع بن انس ، وغيرهم . وقال عطاء : برد وجليد . وعن ابن عباس ايضا ومجاهد ( فيها صر ) اي : نار . وهو يرجع الي الاول ، فان البرد الشديد - سيما الجليد - يحرق الزروع والثمار ، كما يحرق الشيء بالنار ( اصابت حرث قوم ظلموا انفسهم فاهلكته ) اي : احرقته ، يعني بذلك السفعه اذا نزلت عل",
        "char_start": 0,
        "char_end": 791,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_134_chunk00",
        "verse_key": "3:134",
        "text_ar": "ثم ذكر تعالي صفه اهل الجنه ، فقال : ( الذين ينفقون في السراء والضراء ) اي : في الشده والرخاء ، والمنشط والمكره ، والصحه والمرض ، وفي جميع الاحوال ، كما قال : ( الذين ينفقون اموالهم بالليل والنهار سرا وعلانيه ) [ البقره : 274 ] . والمعني : انهم لا يشغلهم امر عن طاعه الله تعالي والانفاق في مراضيه ، والاحسان الي خلقه من قراباتهم وغيرهم بانواع البر .وقوله : ( والكاظمين الغيظ والعافين عن الناس ) اي : اذا ثار بهم الغيظ كظموه ، بمعني : كتموه فلم يعملوه ، وعفوا مع ذلك عمن اساء اليهم وقد ورد في بعض الاثا",
        "char_start": 0,
        "char_end": 7472,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_034_chunk00",
        "verse_key": "4:34",
        "text_ar": "يقول تعالي : ( الرجال قوامون علي النساء ) اي : الرجل قيم علي المراه ، اي هو رييسها وكبيرها والحاكم عليها ومودبها اذا اعوجت ( بما فضل الله بعضهم علي بعض ) اي : لان الرجال افضل من النساء ، والرجل خير من المراه; ولهذا كانت النبوه مختصه بالرجال وكذلك الملك الاعظم; لقوله صلي الله عليه وسلم : \" لن يفلح قوم ولوا امرهم امراه \" رواه البخاري من حديث عبد الرحمن بن ابي بكره ، عن ابيه وكذا منصب القضاء وغير ذلك .( وبما انفقوا من اموالهم ) اي : من المهور والنفقات والكلف التي اوجبها الله عليهم لهن في كتابه وسنه",
        "char_start": 0,
        "char_end": 6478,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_038_chunk00",
        "verse_key": "4:38",
        "text_ar": "(والذين ينفقون اموالهم رياء الناس ) فذكر الممسكين المذمومين وهم البخلاء ، ثم ذكر الباذلين المرايين الذي يقصدون باعطايهم السمعه وان يمدحوا بالكرم ، ولا يريدون بذلك وجه الله ، وفي الحديث الذي فيه الثلاثه الذين هم اول من تسجر بهم النار ، وهم : العالم والغازي والمنفق ، والمراءون باعمالهم ، يقول صاحب المال : ما تركت من شيء تحب ان ينفق فيه الا انفقت في سبيلك . فيقول الله : كذبت ; انما اردت ان يقال : جواد فقد قيل . اي : فقد اخذت جزاءك في الدنيا وهو الذي اردت بفعلك .وفي الحديث : ان رسول الله صلي الله عل",
        "char_start": 0,
        "char_end": 1048,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_003_chunk00",
        "verse_key": "2:3",
        "text_ar": "«الذين يؤمنون» يصدِّقون «بالغيب» بما غاب عنهم من البعث والجنة والنار «ويقيمون الصلاة» أي يأتون بها بحقوقها «ومما رزقناهم» أعطيناهم «ينفقون» في طاعة الله.",
        "char_start": 0,
        "char_end": 153,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_195_chunk00",
        "verse_key": "2:195",
        "text_ar": "«وأنفقوا في سبيل الله» طاعته بالجهاد وغيره «ولا تلقوا بأيديكم» أي أنفسكم والباء زائدة «إلى التهلكة» الهلاك بالإمساك عن النفقة في الجهاد أو تركه لأنه يقوي العدو عليكم «وأحسنوا» بالنفقة وغيرها «إن الله يحب المحسنين» أي يثيبهم.",
        "char_start": 0,
        "char_end": 224,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_215_chunk00",
        "verse_key": "2:215",
        "text_ar": "«يسألونك» يا محمد «ماذا ينفقون» أي الذي ينفقونه والسائل عمرو بن الجموح وكان شيخاً ذا مال فسأل النبي صلى الله عليه وسلم عما ينفق وعلى من ينفق «قل» لهم «ما أنفقتم من خير» بيان لما شامل للقليل والكثير وفيه بيان المنفق الذي هو أحد شقي السؤال وأجاب عن المصرف الذي هو الشق الآخر بقوله: «فللوالدين والأقربين واليتامى والمساكين وابن السبيل» أي هم أولى به «وما تفعلوا من خير» إنفاق أو غيره «فإن الله به عليم» فمجاز عليه.",
        "char_start": 0,
        "char_end": 411,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_219_chunk00",
        "verse_key": "2:219",
        "text_ar": "«يسألونك عن الخمر والميسر» القمار ما حكمهما «قل» لهم «فيهما» أي في تعاطيهما «إثم كبير» عظيم وفي قراءة بالمثلثة لما يحصل بسببهما من المخاصمة والمشاتمة وقول الفحش «ومنافع للناس» باللذة والفرح في الخمر وإصابة المال بلا كد في الميسر «وإثمهما» أي ما ينشأ عنهما من المفاسد «أكبر» أعظم «من نفعهما» ولما نزلت شربها قوم وامتنع عنها آخرون إلى أن حرمتها آية المائدة «ويسألونك ماذا ينفقون» أي ما قدره «قل» أنفقوا «العفو» أي الفاضل عن الحاجة ولا تنفقوا ما تحتاجون إليه وتضيعوا أنفسكم وفي قراءة بالرفع بتقدير هو «ك",
        "char_start": 0,
        "char_end": 564,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_254_chunk00",
        "verse_key": "2:254",
        "text_ar": "«يا أيها الذين آمنوا أنفقوا مما رزقناكم» زكاته «من قبل أن يأتي يوم لا بيْعٌ» فداء «فيه ولا خُلَّة» صداقة تنفع «ولا شَفَاعَةَ» بغير إذنه وهو يوم القيامة وفي قراءة برفع الثلاثة «والكافرون» بالله أو بما فرض عليهم «هم الظالمون» لوضعهم أمر الله في غير محله.",
        "char_start": 0,
        "char_end": 252,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_261_chunk00",
        "verse_key": "2:261",
        "text_ar": "«مثل» صفة نفقات «الذين ينفقون أموالهم في سبيل لله» أي طاعته «كمَثل حبة أنبتت سبع سنابل في كل سنبلة مائة حبة» فكذلك نفقاتهم تضاعفت لسبعمائة ضعف «والله يضاعف» أكثر من ذلك «لمن يشاء والله واسع» فضله «عليم» بمن يستحق المضاعفة.",
        "char_start": 0,
        "char_end": 222,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "«الذين ينفقون أموالهم في سبيل الله ثم لا يُتبِعون ما أنفقوا مَنًّا» على المنفق عليه بقولهم مثلا: قد أحسنت إليه وجبرت حاله «ولا أذًى» له بذكر ذلك إلى من لا يجب وقوفه عليه ونحو «لهم أجرهم» ثواب إنفاقهم «عند ربهم ولا خوف عليهم ولا هم يحزنون» في الآخرة.",
        "char_start": 0,
        "char_end": 249,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_264_chunk00",
        "verse_key": "2:264",
        "text_ar": "«يأيها الذين آمنوا لا تبطلوا صدقاتكم» أي أجورها «بالمن والأذى» إبطالا «كالذي» أي كإبطال نفقة الذي «ينفق ماله رئاء الناس» مرائيا لهم «ولا يؤمن بالله واليوم الآخر» هو المنافق «فمثله كمثل صفوان» حجر أملس «عليه تراب فأصابه وابل» مطر شديد «فتركه صلدا» صلبا أملس لا شيء عليه «لا يقدرون» استئناف لبيان مثل المنافق المنفق رئاء الناس وجمع الضمير باعتبار معنى الذي «على شيء مما كسبوا» عملوا أي لا يجدون له ثوابا في الآخرة كما لا يوجد على الصفوان شئ من التراب الذي كان عليه لإذهاب المطر له «والله لا يهدى القوم ",
        "char_start": 0,
        "char_end": 510,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_265_chunk00",
        "verse_key": "2:265",
        "text_ar": "«ومثل» نفقات «الذين ينفقون أموالهم ابتغاء» طلب «مرضات الله وتثبيتا من أنفسهم» أي تحقيقا للثواب عليه بخلاف المنافقين الذين لا يرجونه لإنكارهم له ومَن ابتدائية «كمثل جنة» بستان «بِرُبْوَةٍ» بضم الراء وفتحتها مكان مرتفع مستو «أصابها وابل فآتت» أعطت «أكلَها» بضم الكاف وسكونها ثمرها «ضعفين» مثلَيْ ما يثمر غيرها «فإن لم يصبها وابل فطلٌ» مطر خفيف يصيبها ويكفيها لارتفاعها، المعنى: تثمر وتزكو كثر المطر أم قل فكذلك نفقات من ذكر تزكو عند الله كثرت أم قلت «والله بما تعلمون بصير» فيجازيكم به.",
        "char_start": 0,
        "char_end": 484,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "«يا أيها الذين آمنوا أنفقوا» أي زكوا «من طيبات» جياد «ما كسبتم» من المال «ومـ» ـن طيبات «ما أخرجنا لكم من الأرض» من الحبوب والثمار «ولا تيمموا» تقصدوا «الخبيث» الرديء «منه» أي من المذكور «تنفقونـ» ـه في الزكاة حال من ضمير تيمموا «ولستم بآخذيه» أي الخبيث لو أعطيتموه في حقوقكم «إلا أن تغمضوا فيه» بالتساهل وغض البصر فكيف تؤدون منه حق الله «واعلموا أن الله غني» عن نفقاتكم «حميد» محمود على كل حال.",
        "char_start": 0,
        "char_end": 395,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_270_chunk00",
        "verse_key": "2:270",
        "text_ar": "«وما أنفقتم من نفقة» أديتم من زكاة أو صدقة «أو نذرتم من نذر» فوفيتم به «فإن الله يعلمه» فيجازيكم عليه «وما للظالمين» بمنع الزكاة والنذر أو بوضع الإنفاق في غير محله من معاصي الله «من أنصار» مانعين لهم من عذابه.",
        "char_start": 0,
        "char_end": 209,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_272_chunk00",
        "verse_key": "2:272",
        "text_ar": "ولما منع صلى الله عليه وسلم من التصدق على المشركين ليسلموا نزل: «ليس عليك هداهم» أي الناس إلى الدخول في الإسلام إنما عليك البلاغ «ولكن الله يهدي من يشاء» هدايته إلى الدخول فيه «وما تنفقوا من خير» مال «فلأنفسكم» لأن ثوابه لها «وما تنفقون إلا ابتغاء وجه الله» أي ثوابه لاغيره من أعراض الدنيا خبر بمعنى النهي «وما تنفقوا من خير يوفَّ إليكم» جزاؤه «وأنتم لا تُظلمون» تنقصون منه شيئاً والجملتان تأكيد للأولى.",
        "char_start": 0,
        "char_end": 403,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_273_chunk00",
        "verse_key": "2:273",
        "text_ar": "«للفقراء» خبر مبتدأ محذوف أي الصدقات «الذين أحصروا في سبيل الله» أي حبسوا أنفسهم على الجهاد، نزلت في أهل الصُّفَّةِ وهم أربعمائة من المهاجرين أرصدوا لتعلم القرآن والخروج مع السرايا «لا يستطيعون ضربا» سفرا «في الأرض» للتجارة والمعاش لشغلهم عنه بالجهاد «يحسبهم الجاهل» بحالهم «أغنياء من التعفف» أي لتعففهم عن السؤال وتركه «تعرفهم» يا مخاطب «بسيماهم» علامتهم من التواضع وأثر الجهد «لا يسألون الناس» شيئا فيلحفون «إلحافا» أي لا سؤال لهم أصلا فلا يقع منهم إلحاف وهو الإلحاح «وما تنفقوا من خير فإن الله به ",
        "char_start": 0,
        "char_end": 517,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "«الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربَّهم ولا خوف عليهم ولا هم يحزنون».",
        "char_start": 0,
        "char_end": 100,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_017_chunk00",
        "verse_key": "3:17",
        "text_ar": "«الصابرين» على الطاعة وعن المعصية نعت «والصادقين» في الإيمان «والقانتين» المطيعين لله «والمنفقين» المتصدقين «والمستغفرين» الله بأن يقولوا اللهم اغفر لنا «بالأسحار» أواخر الليل خُصت بالذكر لأنها وقت الغفلة ولذة النوم.",
        "char_start": 0,
        "char_end": 216,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_092_chunk00",
        "verse_key": "3:92",
        "text_ar": "«لن تنالوا البرَّ» أي ثوابه وهو الجنَّةُ «حتى تنفقوا» تَصَّدَّقُوا «مما تحبون» من أموالكم «وما تنفقوا من شيء فإن الله به عليم» فيجازي عليه.",
        "char_start": 0,
        "char_end": 139,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_117_chunk00",
        "verse_key": "3:117",
        "text_ar": "«مثل» صفة «ما ينفقون» أي الكفار «في هذه الحياة الدنيا» في عداوة النبي أو صدقة ونحوها «كمثل ريح فيها صِرّ» حر أو برد شديد «أصابت حرث» زرع «قوم ظلموا أنفسهم» بالكفر والمعصية «فأهلكته» فلم ينتفعوا به فكذلك نفقاتهم ذاهبة لا ينتفعون بها «وما ظلمهم الله» بضياع نفقاتهم «ولكن أنفسهم يظلمون» بالكفر الموجب لضياعها.",
        "char_start": 0,
        "char_end": 306,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_134_chunk00",
        "verse_key": "3:134",
        "text_ar": "«الذين ينفقون» في طاعة الله «في السراء والضراء» اليُسر والعسر «والكاظمين الغيظ» الكافين عن إمضائه مع القدرة «والعافين عن الناس» ممن ظلمهم أي التاركين عقوبتهم «والله يحب المحسنين» بهذه الأفعال، أي يثبهم.",
        "char_start": 0,
        "char_end": 202,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_034_chunk00",
        "verse_key": "4:34",
        "text_ar": "«الرِّجال قوَّامون» مسلطون «على النساء» يؤدبونهن ويأخذون على أيديهن «بما فضَّل الله بعضهم على بعض» أي بتفضيله لهم عليهن بالعلم والعقل والولاية وغير ذلك «وبما أنفقوا» عليهن «من أموالهم فالصالحات» منهن «قانتات» مطيعات لأزواجهن «حافظات للغيب» أي لفروجهن وغيرها في غيبة أزواجهن «بما حفظ» لهن «اللهُ» حيث أوصى عليهن الأزواج «والَّتي تخافون نشوزهن» عصيانهن لكم بأن ظهرت أمارته «فعظوهن» فخوِّفوهن الله «واهجروهن في المضاجع» اعتزلوا إلى فراش آخر إن أظهرن النشوز «واضربوهن» ضربا غير مبرح إن لم يرجعن بالهجران ",
        "char_start": 0,
        "char_end": 638,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_038_chunk00",
        "verse_key": "4:38",
        "text_ar": "«والذين» عطف على الذين قبله «ينفقون أموالهم رئاء الناس» مرائين لهم «ولا يؤمنون بالله ولا باليوم الآخر» كالمنافقين وأهل مكة «ومن يكن الشيطان له قرينا» صاحبا يعمل بأمره كهؤلاء «فساء» بئس «قرينا» هو.",
        "char_start": 0,
        "char_end": 196,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_003_chunk00",
        "verse_key": "2:3",
        "text_ar": "وهم الذين يُصَدِّقون بالغيب الذي لا تدركه حواسُّهم ولا عقولهم وحدها; لانه لا يُعْرف الا بوحي الله الي رسله، مثل الايمان بالملايكه، والجنه، والنار، وغير ذلك مما اخبر الله به او اخبر به رسوله صلي الله عليه وسلم، (والايمان: كلمه جامعه للاقرار بالله وملايكته وكتبه ورسله واليوم الاخر والقدر خيره وشره، وتصديق الاقرار بالقول والعمل بالقلب واللسان والجوارح) وهم مع تصديقهم بالغيب يحافظون علي اداء الصلاه في مواقيتها اداءً صحيحًا وَفْق ما شرع الله لنبيه محمد صلي الله عليه وسلم، ومما اعطيناهم من المال يخرجو",
        "char_start": 0,
        "char_end": 533,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_195_chunk00",
        "verse_key": "2:195",
        "text_ar": "واستمروا -أيها المؤمنون- في إنفاق الأموال لنصرة دين الله تعالى، والجهاد في سبيله، ولا توقعوا أنفسكم في المهالك بترك الجهاد في سبيل الله، وعدم الإنفاق فيه، وأحسنوا في الانفاق والطاعة، واجعلوا عَمَلَكُم كله خالصًا لوجه الله تعالى. إن الله يحب أهل الإخلاص والإحسان.",
        "char_start": 0,
        "char_end": 262,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_215_chunk00",
        "verse_key": "2:215",
        "text_ar": "يسالك اصحابك -ايها النبي- اي شيء ينفقون من اصناف اموالهم تقربًا الي الله تعالي، وعلي مَن ينفقون؟ قل لهم: انفقوا ايَّ خير يتيسر لكم من اصناف المال الحلال الطيب، واجعلوا نفقتكم للوالدين، والاقربين من اهلكم وذوي ارحامكم، واليتامي الذين مات اباوهم وهم دون سن البلوغ، والمحتاجين الذين لا يملكون ما يكفيهم ويسد حاجتهم، والمسافر المحتاج الذي بَعُدَ عن اهله وماله. وما تفعلوا من خير فان الله تعالي به عليم.",
        "char_start": 0,
        "char_end": 398,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_219_chunk00",
        "verse_key": "2:219",
        "text_ar": "يسالك المسلمون -ايها النبي- عن حكم تعاطي الخمر شربًا وبيعًا وشراءً، والخمر كل مسكر خامر العقل وغطاه مشروبًا كان او ماكولا ويسالونك عن حكم القمار -وهو اَخْذُ المال او اعطاوه بالمقامره وهي المغالبات التي فيها عوض من الطرفين-، قل لهم: في ذلك اضرار ومفاسد كثيره في الدين والدنيا، والعقول والاموال، وفيهما منافع للناس من جهه كسب الاموال وغيرها، واثمهما اكبر من نفعهما; اذ يصدَّان عن ذكر الله وعن الصلاه، ويوقعان العداوه والبغضاء بين الناس، ويتلفان المال. وكان هذا تمهيدًا لتحريمهما. ويسالونك عن القَدْر ال",
        "char_start": 0,
        "char_end": 684,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_254_chunk00",
        "verse_key": "2:254",
        "text_ar": "يا من آمنتم بالله وصدَّقتم رسوله وعملتم بهديه أخرجوا الزكاة المفروضة، وتصدَّقوا مما أعطاكم الله قبل مجيء يوم القيامة حين لا بيع فيكون ربح، ولا مال تفتدون به أنفسكم مِن عذاب الله، ولا صداقة صديق تُنقذكم، ولا شافع يملك تخفيف العذاب عنكم. والكافرون هم الظالمون المتجاوزون حدود الله.",
        "char_start": 0,
        "char_end": 279,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_261_chunk00",
        "verse_key": "2:261",
        "text_ar": "ومِن أعظم ما ينتفع به المؤمنون الإنفاقُ في سبيل الله. ومثل المؤمنين الذين ينفقون أموالهم في سبيل الله كمثل حبة زُرِعتْ في أرض طيبة، فإذا بها قد أخرجت ساقًا تشعب منها سبع شعب، لكل واحدة سنبلة، في كل سنبلة مائة حبة. والله يضاعف الأجر لمن يشاء، بحسب ما يقوم بقلب المنفق من الإيمان والإخلاص التام. وفضل الله واسع، وهو سبحانه عليم بمن يستحقه، مطلع على نيات عباده.",
        "char_start": 0,
        "char_end": 358,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "الذين يخرجون أموالهم في الجهاد وأنواع الخير، ثم لا يتبعون ما أنفقوا من الخيرات مَنّاً على مَن أعطَوه ولا أذى بقول أو فِعْلٍ يشعره بالتفضل عليه، لهم ثوابهم العظيم عند ربهم، ولا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على شيء فاتهم في هذه الدنيا.",
        "char_start": 0,
        "char_end": 258,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_264_chunk00",
        "verse_key": "2:264",
        "text_ar": "يا من آمنتم بالله واليوم الآخر لا تُذْهِبُوا ثواب ما تتصدقون به بالمنِّ والأذى، فهذا شبيه بالذي يخرج ماله ليراه الناس، فيُثنوا عليه، وهو لا يؤمن بالله ولا يوقن باليوم الآخر، فمثل ذلك مثل حجر أملس عليه تراب هطل عليه مطر غزير فأزاح عنه التراب، فتركه أملس لا شيء عليه، فكذلك هؤلاء المراؤون تضمحلُّ أعمالهم عند الله، ولا يجدون شيئًا من الثواب على ما أنفقوه. والله لا يوفق الكافرين لإصابة الحق في نفقاتهم وغيرها.",
        "char_start": 0,
        "char_end": 407,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_265_chunk00",
        "verse_key": "2:265",
        "text_ar": "ومثل الذين ينفقون أموالهم طلبًا لرضا الله واعتقادًا راسخًا بصدق وعده، كمثل بستان عظيم بأرض عالية طيبة هطلت عليه أمطار غزيرة، فتضاعفت ثمراته، وإن لم تسقط عليه الأمطار الغزيرة فيكفيه رذاذ المطر ليعطي الثمرة المضاعفة، وكذلك نفقات المخلصين تُقبل عند الله وتُضاعف، قلَّت أم كثُرت، فالله المُطَّلِع على السرائر، البصير بالظواهر والبواطن، يثيب كلا بحسب إخلاصه.",
        "char_start": 0,
        "char_end": 353,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "يا من آمنتم بي واتبعتم رسلي أنفقوا من الحلال الطيب الذي كسبتموه ومما أخرجنا لكم من الأرض، ولا تقصدوا الرديء منه لتعطوه الفقراء، ولو أُعطِيتموه لم تأخذوه إلا إذا تغاضيتم عما فيه من رداءة ونقص. فكيف ترضون لله ما لا ترضونه لأنفسكم؟ واعلموا أن الله الذي رزقكم غني عن صدقاتكم، مستحق للثناء، محمود في كل حال.",
        "char_start": 0,
        "char_end": 302,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_270_chunk00",
        "verse_key": "2:270",
        "text_ar": "وما أعطيتم من مال أو غيره كثير أو قليل تتصدقون به ابتغاء مرضات الله أو أوجبتم على أنفسكم شيئًا من مال أو غيره، فإن الله يعلمه، وهو المُطَّلِع على نياتكم، وسوف يثيبكم على ذلك. ومَن منع حق الله فهو ظالم، والظالمون ليس لهم أنصار يمنعونهم من عذاب الله.",
        "char_start": 0,
        "char_end": 248,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_272_chunk00",
        "verse_key": "2:272",
        "text_ar": "لست -أيها الرسول- مسئولا عن توفيق الكافرين للهداية، ولكن الله يشرح صدور مَن يشاء لدينه، ويوفقه له. وما تبذلوا من مال يَعُدْ عليكم نَفْعُه من الله، والمؤمنون لا ينفقون إلا طلبًا لمرضاة الله. وما تنفقوا من مال -مخلصين لله- توفوا ثوابه، ولا تُنْقَصُوا شيئا من ذلك. وفي الآية إثبات صفة الوجه لله تعالى على ما يليق به سبحانه.",
        "char_start": 0,
        "char_end": 320,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_273_chunk00",
        "verse_key": "2:273",
        "text_ar": "اجعلوا صدقاتكم لفقراء المسلمين الذين لا يستطيعون السفر; طلبًا للرزق لاشتغالهم بالجهاد في سبيل الله، يظنهم مَن لا يعرفهم غير محتاجين إلى الصدقة; لتعففهم عن السؤال، تعرفهم بعلاماتهم وآثار الحاجة فيهم، لا يسألون الناس بالكُليَّة، وإن سألوا اضطرارًا لم يُلِحُّوا في السؤال. وما تنفقوا مِن مال في سبيل الله فلا يخفى على الله شيء منه، وسيجزي عليه أوفر الجزاء وأتمَّه يوم القيامة.",
        "char_start": 0,
        "char_end": 373,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "الذين يُخْرجون أموالهم مرضاة لله ليلا ونهارًا مسرِّين ومعلنين، فلهم أجرهم عند ربهم، ولا خوف عليهم فيما يستقبلونه من أمر الآخرة، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا. ذلك التشريع الإلهي الحكيم هو منهاج الإسلام في الإنفاق لما فيه مِن سدِّ حاجة الفقراء في كرامة وعزة، وتطهير مال الأغنياء، وتحقيق التعاون على البر والتقوى; ابتغاء وجه الله دون قهر أو إكراه.",
        "char_start": 0,
        "char_end": 357,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_017_chunk00",
        "verse_key": "3:17",
        "text_ar": "هم الذين اتصفوا بالصبر على الطاعات، وعن المعاصي، وعلى ما يصيبهم من أقدار الله المؤلمة، وبالصدق في الأقوال والأفعال وبالطاعة التامة، وبالإنفاق سرا وعلانية، وبالاستغفار في آخر الليل; لأنه مَظِنَّة القبول وإجابة الدعاء.",
        "char_start": 0,
        "char_end": 216,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_092_chunk00",
        "verse_key": "3:92",
        "text_ar": "لن تدركوا الجنة حتى تتصدقوا مما تحبون، وأي شيء تتصدقوا به مهما كان قليلا أو كثيرًا فإن الله به عليم، وسيجازي كل منفق بحسب عمله.",
        "char_start": 0,
        "char_end": 127,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_117_chunk00",
        "verse_key": "3:117",
        "text_ar": "مَثَلُ ما ينفق الكافرون في وجوه الخير في هذه الحياة الدنيا وما يؤملونه من ثواب، كمثل ريح فيها برد شديد هَبَّتْ على زرع قوم كانوا يرجون خيره، وبسبب ذنوبهم لم تُبْقِ الريح منه شيئًا. وهؤلاء الكافرون لا يجدون في الآخرة ثوابًا، وما ظلمهم الله بذلك، ولكنهم ظلموا أنفسهم بكفرهم وعصيانهم.",
        "char_start": 0,
        "char_end": 281,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_134_chunk00",
        "verse_key": "3:134",
        "text_ar": "الذين ينفقون أموالهم في اليسر والعسر، والذين يمسكون ما في أنفسهم من الغيظ بالصبر، وإذا قَدَروا عَفَوا عمَّن ظلمهم. وهذا هو الإحسان الذي يحب الله أصحابه.",
        "char_start": 0,
        "char_end": 152,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_034_chunk00",
        "verse_key": "4:34",
        "text_ar": "الرجال قوَّامون على توجيه النساء ورعايتهن، بما خصهم الله به من خصائص القِوامَة والتفضيل، وبما أعطوهن من المهور والنفقات. فالصالحات المستقيمات على شرع الله منهن، مطيعات لله تعالى ولأزواجهن، حافظات لكل ما غاب عن علم أزواجهن بما اؤتمنَّ عليه بحفظ الله وتوفيقه، واللاتي تخشون منهن ترفُّعهن عن طاعتكم، فانصحوهن بالكلمة الطيبة، فإن لم تثمر معهن الكلمة الطيبة، فاهجروهن في الفراش، ولا تقربوهن، فإن لم يؤثر فعل الهِجْران فيهن، فاضربوهن ضربًا لا ضرر فيه، فإن أطعنكم فاحذروا ظلمهن، فإن الله العليَّ الكبير وليّ",
        "char_start": 0,
        "char_end": 540,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_038_chunk00",
        "verse_key": "4:38",
        "text_ar": "وأعتدنا هذا العذاب كذلك للذين ينفقون أموالهم رياءً وسمعةً، ولا يصدقون بالله اعتقادًا وعملا ولا بيوم القيامة. وهذه الأعمال السيئة مما يدعو إليها الشيطان. ومن يكن الشيطان له ملازمًا فبئس الملازم والقرين.",
        "char_start": 0,
        "char_end": 201,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_003_chunk00",
        "verse_key": "2:3",
        "text_ar": "قوله تعالى : الذين يؤمنون بالغيب و يقيمون الصلاة و مما رزقناهم ينفقونفيها ست وعشرون مسألة :الأولى : قوله : الذين في موضع خفض نعت \" للمتقين \" ، ويجوز الرفع على القطع أي : هم الذين ، ويجوز النصب على المدح .( يؤمنون ) يصدقون . والإيمان في اللغة : التصديق ; وفي التنزيل : وما أنت بمؤمن لنا أي بمصدق ; ويتعدى بالباء واللام ; كما قال : ولا تؤمنوا إلا لمن تبع دينكم فما آمن لموسى وروى حجاج بن حجاج الأحول - ويلقب بزق العسل - قال سمعت قتادة يقول : يا ابن آدم ، إن كنت لا تريد أن تأتي الخير إلا عن نشاط فإن نف",
        "char_start": 0,
        "char_end": 27276,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_195_chunk00",
        "verse_key": "2:195",
        "text_ar": "قوله تعالى : وأنفقوا في سبيل الله ولا تلقوا بأيديكم إلى التهلكة وأحسنوا إن الله يحب المحسنينفيه ثلاث مسائل :الأولى : روى البخاري عن حذيفة : وأنفقوا في سبيل الله ولا تلقوا بأيديكم إلى التهلكة قال : نزلت في النفقة ، وروى يزيد بن أبي حبيب عن أسلم أبي عمران قال : غزونا القسطنطينية ، وعلى الجماعة عبد الرحمن بن الوليد والروم ملصقو ظهورهم بحائط المدينة ، فحمل رجل على العدو ، فقال الناس : مه مه ! لا إله إلا الله ، يلقي بيديه إلى التهلكة ! فقال أبو أيوب : سبحان الله ! أنزلت هذه الآية فينا معاشر الأنصار ل",
        "char_start": 0,
        "char_end": 7243,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_215_chunk00",
        "verse_key": "2:215",
        "text_ar": "قوله تعالى : يسألونك ماذا ينفقون قل ما أنفقتم من خير فللوالدين والأقربين واليتامى والمساكين وابن السبيل وما تفعلوا من خير فإن الله به عليمفيه أربع مسائل :الأولى قوله تعالى : \" يسألونك \" إن خففت الهمزة ألقيت حركتها على السين ففتحتها وحذفت الهمزة فقلت : يسلونك . ونزلت الآية في عمرو بن الجموح ، وكان شيخا كبيرا فقال : يا رسول الله ، إن مالي كثير ، فبماذا أتصدق ، وعلى من أنفق ؟ فنزلت يسألونك ماذا ينفقون .الثانية : قوله تعالى : ماذا ينفقون \" ما \" في موضع رفع بالابتداء ، و \" ذا \" الخبر ، وهو بمعنى الذي",
        "char_start": 0,
        "char_end": 2177,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_219_chunk00",
        "verse_key": "2:219",
        "text_ar": "قوله تعالى : يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس وإثمهما أكبر من نفعهما ويسألونك ماذا ينفقون قل العفو كذلك يبين الله لكم الآيات لعلكم تتفكرونقوله تعالى : يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس وإثمهما أكبر من نفعهما فيه تسع مسائل : الأولى : قوله تعالى : يسألونك السائلون هم المؤمنون ، كما تقدم . والخمر مأخوذة من خمر إذا ستر ، ومنه خمار المرأة . وكل شيء غطى شيئا فقد خمره ، ومنه خمروا [ ص: 49 ] آنيتكم فالخمر تخمر العقل ، أي تغطيه وتستره ، ومن ذلك الشجر الملتف يق",
        "char_start": 0,
        "char_end": 16467,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_254_chunk00",
        "verse_key": "2:254",
        "text_ar": "قوله تعالى : يا أيها الذين آمنوا أنفقوا مما رزقناكم من قبل أن يأتي يوم لا بيع فيه ولا خلة ولا شفاعة والكافرون هم الظالمونقال الحسن : هي الزكاة المفروضة . وقال ابن جريج وسعيد بن جبير : هذه الآية تجمع الزكاة المفروضة والتطوع . قال ابن عطية . وهذا صحيح ، ولكن ما تقدم من الآيات في ذكر القتال وأن الله يدفع بالمؤمنين في صدور الكافرين يترجح منه أن هذا الندب إنما هو في سبيل الله ، ويقوي ذلك في آخر الآية قوله : والكافرون هم الظالمون أي فكافحوهم بالقتال بالأنفس وإنفاق الأموال .قلت : وعلى هذا التأويل يكون ",
        "char_start": 0,
        "char_end": 3331,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_261_chunk00",
        "verse_key": "2:261",
        "text_ar": "قوله تعالى : مثل الذين ينفقون أموالهم في سبيل الله كمثل حبة أنبتت سبع سنابل في كل سنبلة مائة حبة والله يضاعف لمن يشاء والله واسع عليمفيه خمس مسائل :الأولى : لما قص الله سبحانه ما فيه من البراهين ، حث على الجهاد ، وأعلم أن من جاهد بعد هذا البرهان الذي لا يأتي به إلا نبي فله في جهاده الثواب العظيم . روى البستي في صحيح مسنده عن ابن عمر قال : لما نزلت هذه الآية قال رسول الله صلى الله عليه وسلم : ( رب زد أمتي ) فنزلت من ذا الذي يقرض الله قرضا حسنا فيضاعفه له أضعافا كثيرة ، قال رسول الله صلى الله عليه",
        "char_start": 0,
        "char_end": 5638,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "قوله تعالى : الذين ينفقون أموالهم في سبيل الله ثم لا يتبعون ما أنفقوا منا ولا أذى لهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنونفيه ثلاث مسائل :الأولى : قوله تعالى : الذين ينفقون أموالهم في سبيل الله قيل : إنها نزلت في عثمان بن عفان رضي الله عنه . قال عبد الرحمن بن سمرة : جاء عثمان بألف دينار في جيش العسرة فصبها في حجر رسول الله صلى الله عليه وسلم فرأيته يدخل يده فيها ويقلبها ويقول : ما ضر ابن عفان ما عمل بعد اليوم اللهم لا تنس هذا اليوم لعثمان . وقال أبو سعيد الخدري : رأيت النبي صلى الله عليه و",
        "char_start": 0,
        "char_end": 3820,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_264_chunk00",
        "verse_key": "2:264",
        "text_ar": "قوله تعالى : ياأيها الذين آمنوا لا تبطلوا صدقاتكم بالمن والأذى كالذي ينفق ماله رئاء الناس ولا يؤمن بالله واليوم الآخر فمثله كمثل صفوان عليه تراب فأصابه وابل فتركه صلدا لا يقدرون على شيء مما كسبوا والله لا يهدي القوم الكافرينفيه ثلاث مسائل :الأولى : قوله تعالى : بالمن والأذى قد تقدم معناه وعبر تعالى عن عدم القبول وحرمان الثواب بالإبطال ، والمراد الصدقة التي يمن بها ويؤذي ، لا غيرها . والعقيدة أن السيئات لا تبطل الحسنات ولا تحبطها ، فالمن والأذى في صدقة لا يبطل صدقة غيرها .قال جمهور العلماء في هذه",
        "char_start": 0,
        "char_end": 4345,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_265_chunk00",
        "verse_key": "2:265",
        "text_ar": "قوله تعالى : ومثل الذين ينفقون أموالهم ابتغاء مرضاة الله وتثبيتا من أنفسهم كمثل جنة بربوة أصابها وابل فآتت أكلها ضعفين فإن لم يصبها وابل فطل والله بما تعملون بصيرقوله تعالى : ومثل الذين ينفقون أموالهم ابتغاء مرضاة الله وتثبيتا من أنفسهم[ ص: 286 ] ( ابتغاء ) مفعول من أجله . وتثبيتا من أنفسهم عطف عليه . وقال مكي في المشكل : كلاهما مفعول من أجله . قال ابن عطية : وهو مردود ، ولا يصح في \" تثبيتا \" أنه مفعول من أجله ؛ لأن الإنفاق ليس من أجل التثبيت . و ( ابتغاء ) نصب على المصدر في موضع الحال ، وكان يت",
        "char_start": 0,
        "char_end": 6342,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "ياأيها الذين آمنوا أنفقوا من طيبات ما كسبتم ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون ولستم بآخذيه إلا أن تغمضوا فيه واعلموا أن الله غني حميد[ ص: 292 ] فيه إحدى عشرة مسألة :الأولى : قوله تعالى : يا أيها الذين آمنوا أنفقوا هذا خطاب لجميع أمة محمد صلى الله عليه وسلم . واختلف العلماء في المعنى المراد بالإنفاق هنا ، فقال علي بن أبي طالب وعبيدة السلماني وابن سيرين : هي الزكاة المفروضة ، نهى الناس عن إنفاق الرديء فيها بدل الجيد . قال ابن عطية : والظاهر من قول البراء بن عازب والحسن وقتادة أ",
        "char_start": 0,
        "char_end": 12342,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_270_chunk00",
        "verse_key": "2:270",
        "text_ar": "قوله تعالى : وما أنفقتم من نفقة أو نذرتم من نذر فإن الله يعلمه وما للظالمين من أنصارشرط وجوابه ، وكانت النذور من سيرة العرب تكثر منها ، فذكر الله تعالى النوعين ، ما يفعله المرء متبرعا ، وما يفعله بعد إلزامه لنفسه . وفي الآية معنى الوعد والوعيد ، أي من كان خالص النية فهو مثاب ، ومن أنفق رياء أو لمعنى آخر مما يكسبه المن والأذى ونحو ذلك فهو ظالم ، يذهب فعله باطلا ولا يجد له ناصرا فيه . ومعنى ( يعلمه ) يحصيه ، قاله مجاهد . ووحد الضمير وقد ذكر شيئين ، فقال النحاس : التقدير \" وما أنفقتم من نفقة \" فإن ",
        "char_start": 0,
        "char_end": 1123,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_272_chunk00",
        "verse_key": "2:272",
        "text_ar": "قوله تعالى : ليس عليك هداهم ولكن الله يهدي من يشاء وما تنفقوا من خير فلأنفسكم وما تنفقون إلا ابتغاء وجه الله وما تنفقوا من خير يوف إليكم وأنتم لا تظلمونقوله تعالى : ليس عليك هداهم ولكن الله يهدي من يشاء فيه ثلاث مسائل :الأولى : قوله تعالى : ليس عليك هداهم هذا الكلام متصل بذكر الصدقات ، فكأنه بين فيه جواز الصدقة على المشركين . روى سعيد بن جبير مرسلا عن النبي صلى الله عليه وسلم في سبب نزول هذه الآية أن المسلمين كانوا يتصدقون على فقراء أهل الذمة ، فلما كثر فقراء المسلمين قال رسول الله صلى الله عليه",
        "char_start": 0,
        "char_end": 4499,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_273_chunk00",
        "verse_key": "2:273",
        "text_ar": "قوله تعالى : للفقراء الذين أحصروا في سبيل الله لا يستطيعون ضربا في الأرض يحسبهم الجاهل أغنياء من التعفف تعرفهم بسيماهم لا يسألون الناس إلحافا وما تنفقوا من خير فإن الله به عليمفيه عشر مسائل :الأولى : قوله تعالى : ( للفقراء ) اللام متعلقة بقوله وما تنفقوا من خير وقيل : بمحذوف تقديره الإنفاق أو الصدقة للفقراء . قال السدي ومجاهد وغيرهما : المراد بهؤلاء الفقراء فقراء المهاجرين من قريش وغيرهم ، ثم تتناول الآية كل من دخل تحت صفة الفقراء غابر الدهر . وإنما خص فقراء المهاجرين بالذكر لأنه لم يكن هناك سوا",
        "char_start": 0,
        "char_end": 11312,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم عند ربهم ولا خوف عليهم ولا هم يحزنون فيه مسألة واحدة روي عن ابن عباس وأبي ذر وأبي أمامة وأبي الدرداء وعبد الله بن بشر الغافقي والأوزاعي أنها نزلت في علف الخيل المربوطة في سبيل الله . وذكر ابن سعد في الطبقات قال : أخبرت عن محمد بن شعيب بن شابور قال : أنبأنا سعيد بن سنان عن يزيد بن عبد الله بن عريب عن أبيه عن جده عريب أن رسول الله صلى الله عليه وسلم سئل عن قوله تعالى : الذين ينفقون أموالهم بالليل والنهار سرا وعلانية فلهم أجرهم",
        "char_start": 0,
        "char_end": 1206,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_017_chunk00",
        "verse_key": "3:17",
        "text_ar": "الصابرين يعني عن المعاصي والشهوات ، وقيل : على الطاعات . والصادقين أي في الأفعال والأقوال والقانتين الطائعين . والمنفقين يعني في سبيل الله . وقد تقدم في البقرة هذه المعاني على الكمال . ففسر تعالى في هذه الآية أحوال المتقين الموعودين بالجنات .واختلف في معنى قوله تعالى : والمستغفرين بالأسحار فقال أنس بن مالك : هم السائلون المغفرة . قتادة : المصلون .قلت : ولا تناقض ، فإنهم يصلون ويستغفرون . وخص السحر بالذكر لأنه مظان القبول ووقت إجابة الدعاء . قال رسول الله - صلى الله عليه وسلم - في تفسير قوله تعال",
        "char_start": 0,
        "char_end": 3969,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_092_chunk00",
        "verse_key": "3:92",
        "text_ar": "قوله تعالى : لن تنالوا البر حتى تنفقوا مما تحبون وما تنفقوا من شيء فإن الله به عليم[ ص: 125 ] فيه مسألتان :الأولى : روى الأئمة واللفظ للنسائي عن أنس قال : لما نزلت هذه الآية : لن تنالوا البر حتى تنفقوا مما تحبون قال أبو طلحة : إن ربنا ليسألنا من أموالنا فأشهدك يا رسول الله أني جعلت أرضي لله . فقال رسول الله - صلى الله عليه وسلم - : اجعلها في قرابتك في حسان بن ثابت وأبي بن كعب . وفي الموطأ وكانت أحب أمواله إليه بئر حاء ، وكانت مستقبلة المسجد ، وكان رسول الله - صلى الله عليه وسلم - يدخلها ويشرب من",
        "char_start": 0,
        "char_end": 3382,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_117_chunk00",
        "verse_key": "3:117",
        "text_ar": "قوله تعالى : مثل ما ينفقون في هذه الحياة الدنيا كمثل ريح فيها صر أصابت حرث قوم ظلموا أنفسهم فأهلكته وما ظلمهم الله ولكن أنفسهم يظلمونقوله تعالى : مثل ما ينفقون في هذه الحياة الدنيا كمثل ريح فيها صر ما تصلح أن تكون مصدرية ، وتصلح أن تكون بمعنى الذي والعائد محذوف ، أي مثل ما ينفقونه . ومعنى كمثل ريح كمثل مهب ريح . قال ابن عباس : والصر : البرد الشديد . قيل : أصله من الصرير الذي هو الصوت ، فهو صوت الريح الشديدة . الزجاج : هو صوت لهب النار التي كانت في تلك الريح . وقد تقدم هذا المعنى في البقرة . وفي ",
        "char_start": 0,
        "char_end": 917,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_134_chunk00",
        "verse_key": "3:134",
        "text_ar": "قوله تعالى : الذين ينفقون في السراء والضراء والكاظمين الغيظ والعافين عن الناس والله يحب المحسنينفيه أربع مسائل :الأولى : قوله تعالى : الذين ينفقون هذا من صفة المتقين الذين أعدت لهم الجنة ، وظاهر الآية أنها مدح بفعل المندوب إليه . السراء اليسر والضراء العسر ; قاله ابن عباس والكلبي ومقاتل . وقال عبيد بن عمير والضحاك : السراء والضراء الرخاء والشدة . ويقال في حال الصحة والمرض . وقيل : في السراء في الحياة ، وفي الضراء يعني يوصي بعد الموت . وقيل : في السراء في العرس والولائم ، وفي الضراء في النوائب وا",
        "char_start": 0,
        "char_end": 4752,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_034_chunk00",
        "verse_key": "4:34",
        "text_ar": "قوله تعالى : الرجال قوامون على النساء بما فضل الله بعضهم على بعض وبما أنفقوا من أموالهم فالصالحات قانتات حافظات للغيب بما حفظ الله واللاتي تخافون نشوزهن فعظوهن واهجروهن في المضاجع واضربوهن فإن أطعنكم فلا تبغوا عليهن سبيلا إن الله كان عليا كبيرافيه إحدى عشرة مسألة :الأولى : قوله تعالى : الرجال قوامون على النساء ابتداء وخبر ، أي يقومون بالنفقة عليهن والذب عنهن ؛ وأيضا فإن فيهم الحكام والأمراء ومن يغزو ، وليس ذلك في النساء . يقال : قوام وقيم . والآية نزلت في سعد بن الربيع نشزت عليه امرأته حبيبة بنت",
        "char_start": 0,
        "char_end": 10625,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_038_chunk00",
        "verse_key": "4:38",
        "text_ar": "قوله تعالى : والذين ينفقون أموالهم رئاء الناس ولا يؤمنون بالله ولا باليوم الآخر ومن يكن الشيطان له قرينا فساء قرينا فيه مسألتان :الأولى : قوله تعالى : والذين ينفقون أموالهم رئاء الناس الآية . عطف تعالى على الذين يبخلون : الذين ينفقون أموالهم رئاء الناس . وقيل : هو عطف على الكافرين ، فيكون في موضع خفض . ومن رأى زيادة الواو أجاز أن يكون الثاني عنده خبرا للأول . قال الجمهور نزلت في المنافقين : لقوله تعالى : رئاء الناس والرئاء من النفاق . مجاهد : في اليهود . وضعفه الطبري ؛ لأنه تعالى نفى عن هذه الصن",
        "char_start": 0,
        "char_end": 1350,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_003_chunk00",
        "verse_key": "2:3",
        "text_ar": "ثم وصف المتقين بالعقايد والاعمال الباطنه, والاعمال الظاهره, لتضمن التقوي لذلك فقال: { الَّذِينَ يُوْمِنُونَ بِالْغَيْبِ } حقيقه الايمان: هو التصديق التام بما اخبرت به الرسل, المتضمن لانقياد الجوارح، وليس الشان في الايمان بالاشياء المشاهده بالحس, فانه لا يتميز بها المسلم من الكافر. انما الشان في الايمان بالغيب, الذي لم نره ولم نشاهده, وانما نومن به, لخبر الله وخبر رسوله. فهذا الايمان الذي يميز به المسلم من الكافر, لانه تصديق مجرد لله ورسله. فالمومن يومن بكل ما اخبر الله به, او اخبر به رسوله, سواء",
        "char_start": 0,
        "char_end": 2350,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_195_chunk00",
        "verse_key": "2:195",
        "text_ar": "يامر تعالي عباده بالنفقه في سبيله، وهو اخراج الاموال في الطرق الموصله الي الله، وهي كل طرق الخير، من صدقه علي مسكين، او قريب، او انفاق علي من تجب مونته. واعظم ذلك واول ما دخل في ذلك الانفاق في الجهاد في سبيل الله، فان النفقه فيه جهاد بالمال، وهو فرض كالجهاد بالبدن، وفيها من المصالح العظيمه، الاعانه علي تقويه المسلمين، وعلي توهيه الشرك واهله، وعلي اقامه دين الله واعزازه، فالجهاد في سبيل الله لا يقوم الا علي ساق النفقه، فالنفقه له كالروح، لا يمكن وجوده بدونها، وفي ترك الانفاق في سبيل الله، ابطال ل",
        "char_start": 0,
        "char_end": 1970,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_215_chunk00",
        "verse_key": "2:215",
        "text_ar": "اي: يسالونك عن النفقه، وهذا يعم السوال عن المنفق والمنفق عليه، فاجابهم عنهما فقال: {قل ما انفقتم من خير} اي: مال قليل او كثير، فاولي الناس به واحقهم بالتقديم، اعظمهم حقا عليك، وهم الوالدان الواجب برهما، والمحرم عقوقهما، ومن اعظم برهما، النفقه عليهما، ومن اعظم العقوق، ترك الانفاق عليهما، ولهذا كانت النفقه عليهما واجبه، علي الولد الموسر، ومن بعد الوالدين الاقربون، علي اختلاف طبقاتهم، الاقرب فالاقرب، علي حسب القرب والحاجه، فالانفاق عليهم صدقه وصله، {واليتامي} وهم الصغار الذين لا كاسب لهم، فهم في مظ",
        "char_start": 0,
        "char_end": 1089,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_219_chunk00",
        "verse_key": "2:219",
        "text_ar": "اي: يسالك - يا ايها الرسول - المومنون عن احكام الخمر والميسر, وقد كانا مستعمَلَيْنِ في الجاهليه واول الاسلام, فكانه وقع فيهما اشكال، فلهذا سالوا عن حكمهما، فامر الله تعالي نبيه, ان يبين لهم منافعهما ومضارهما, ليكون ذلك مقدمه لتحريمهما, وتحتيم تركهما. فاخبر ان اثمهما ومضارهما, وما يصدر منهما من ذهاب العقل والمال, والصد عن ذكر الله, وعن الصلاه, والعداوه, والبغضاء - اكبر مما يظنونه من نفعهما, من كسب المال بالتجاره بالخمر, وتحصيله بالقمار والطرب للنفوس, عند تعاطيهما، وكان هذا البيان زاجرا للنفوس عنه",
        "char_start": 0,
        "char_end": 2263,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_254_chunk00",
        "verse_key": "2:254",
        "text_ar": "وهذا من لطف الله بعباده ان امرهم بتقديم شيء مما رزقهم الله، من صدقه واجبه ومستحبه، ليكون لهم ذخرا واجرا موفرا في يوم يحتاج فيه العاملون الي مثقال ذره من الخير، فلا بيع فيه ولو افتدي الانسان نفسه بملء الارض ذهبا ليفتدي به من عذاب يوم القيامه ما تقبل منه، ولم ينفعه خليل ولا صديق لا بوجاهه ولا بشفاعه، وهو اليوم الذي فيه يخسر المبطلون ويحصل الخزي علي الظالمين، وهم الذين وضعوا الشيء في غير موضعه، فتركوا الواجب من حق الله وحق عباده وتعدوا الحلال الي الحرام، واعظم انواع الظلم الكفر بالله الذي هو وضع ال",
        "char_start": 0,
        "char_end": 690,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_261_chunk00",
        "verse_key": "2:261",
        "text_ar": "هذا بيان للمضاعفه التي ذكرها الله في قوله {من ذا الذي يقرض الله قرضا حسنا فيضاعفه له اضعافا كثيره} وهنا قال: {مثل الذين ينفقون اموالهم في سبيل الله} اي: في طاعته ومرضاته، واولاها انفاقها في الجهاد في سبيله {كمثل حبه انبتت سبع سنابل في كل سنبله مايه حبه} وهذا احضار لصوره المضاعفه بهذا المثل، الذي كان العبد يشاهده ببصره فيشاهد هذه المضاعفه ببصيرته، فيقوي شاهد الايمان مع شاهد العيان، فتنقاد النفس مذعنه للانفاق سامحه بها مومله لهذه المضاعفه الجزيله والمنه الجليله، {والله يضاعف} هذه المضاعفه {لمن يشا",
        "char_start": 0,
        "char_end": 939,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "اي: الذين ينفقون اموالهم في طاعه الله وسبيله، ولا يتبعونها بما ينقصها ويفسدها من المن بها علي المنفق عليه بالقلب او باللسان، بان يعدد عليه احسانه ويطلب منه مقابلته، ولا اذيه له قوليه او فعليه، فهولاء لهم اجرهم اللايق بهم ولا خوف عليهم ولا هم يحزنون، فحصل لهم الخير واندفع عنهم الشر لانهم عملوا عملا خالصا لله سالما من المفسدات.",
        "char_start": 0,
        "char_end": 327,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_264_chunk00",
        "verse_key": "2:264",
        "text_ar": "ينهي عباده تعالي لطفا بهم ورحمه عن ابطال صدقاتهم بالمن والاذي ففيه ان المن والاذي يبطل الصدقه، ويستدل بهذا علي ان الاعمال السييه تبطل الاعمال الحسنه، كما قال تعالي: { ولا تجهروا له بالقول كجهر بعضكم لبعض ان تحبط اعمالكم وانتم لا تشعرون } فكما ان الحسنات يذهبن السييات فالسييات تبطل ما قابلها من الحسنات، وفي هذه الايه مع قوله تعالي { ولا تبطلوا اعمالكم } حث علي تكميل الاعمال وحفظها من كل ما يفسدها ليلا يضيع العمل سدي، وقوله: { كالذي ينفق ماله رياء الناس ولا يومن بالله واليوم الاخر } اي: انتم وان ق",
        "char_start": 0,
        "char_end": 1492,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_265_chunk00",
        "verse_key": "2:265",
        "text_ar": "هذا مثل المنفقين اموالهم علي وجه تزكو عليه نفقاتهم وتقبل به صدقاتهم فقال تعالي: { ومثل الذين ينفقون اموالهم ابتغاء مرضاه الله } اي: قصدهم بذلك رضي ربهم والفوز بقربه { وتثبيتا من انفسهم } اي: صدر الانفاق علي وجه منشرحه له النفس سخيه به، لا علي وجه التردد وضعف النفس في اخراجها وذلك ان النفقه يعرض لها افتان اما ان يقصد الانسان بها محمده الناس ومدحهم وهو الرياء، او يخرجها علي خور وضعف عزيمه وتردد، فهولاء سلموا من هاتين الافتين فانفقوا ابتغاء مرضات الله لا لغير ذلك من المقاصد، وتثبيتا من انفسهم، فمثل",
        "char_start": 0,
        "char_end": 1814,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "يامر تعالي عباده المومنين بالنفقه من طيبات ما يسر لهم من المكاسب، ومما اخرج لهم من الارض فكما منَّ عليكم بتسهيل تحصيله فانفقوا منه شكرا لله واداء لبعض حقوق اخوانكم عليكم، وتطهيرا لاموالكم، واقصدوا في تلك النفقه الطيب الذي تحبونه لانفسكم، ولا تيمموا الرديء الذي لا ترغبونه ولا تاخذونه الا علي وجه الاغماض والمسامحه { واعلموا ان الله غني حميد } فهو غني عنكم ونفع صدقاتكم واعمالكم عايد اليكم، ومع هذا فهو حميد علي ما يامركم به من الاوامر الحميده والخصال السديده، فعليكم ان تمتثلوا اوامره لانها قوت القلو",
        "char_start": 0,
        "char_end": 528,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_270_chunk00",
        "verse_key": "2:270",
        "text_ar": "وهذا فيه المجازاه علي النفقات، واجبها ومستحبها، قليلها وكثيرها، التي امر الله بها، والنذور التي الزمها المكلف نفسه، وان الله تعالي يعلمها فلا يخفي عليه منها شيء، ويعلم ما صدرت عنه، هل هو الاخلاص او غيره، فان صدرت عن اخلاص وطلب لمرضاه الله جازي عليها بالفضل العظيم والثواب الجسيم، وان لم ينفق العبد ما وجب عليه من النفقات ولم يوف ما اوجبه علي نفسه من المنذورات، او قصد بذلك رضي المخلوقات، فانه ظالم قد وضع الشيء في غير موضعه، واستحق العقوبه البليغه، ولم ينفعه احد من الخلق ولم ينصره، فلهذا قال: { وما ",
        "char_start": 0,
        "char_end": 519,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_272_chunk00",
        "verse_key": "2:272",
        "text_ar": "يقول تعالي لنبيه صلي الله عليه وسلم ليس عليك هدي الخلق، وانما عليك البلاغ المبين، والهدايه بيد الله تعالي، ففيها دلاله علي ان النفقه كما تكون علي المسلم تكون علي الكافر ولو لم يهتد، فلهذا قال: { وما تنفقوا من خير } اي: قليل او كثير علي اي شخص كان من مسلم وكافر { فلانفسكم } اي: نفعه راجع اليكم { وما تنفقون الا ابتغاء وجه الله } هذا اخبار عن نفقات المومنين الصادره عن ايمانهم انها لا تكون الا لوجه الله تعالي، لان ايمانهم يمنعهم عن المقاصد الرديه ويوجب لهم الاخلاص { وما تنفقوا من خير يوف اليكم } يوم",
        "char_start": 0,
        "char_end": 609,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_273_chunk00",
        "verse_key": "2:273",
        "text_ar": "ثم ذكر مصرف النفقات الذين هم اولي الناس بها فوصفهم بست صفات احدها الفقر، والثاني قوله: { احصروا في سبيل الله } اي: قصروها علي طاعه الله من جهاد وغيره، فهم مستعدون لذلك محبوسون له، الثالث عجزهم عن الاسفار لطلب الرزق فقال: { لا يستطيعون ضربا في الارض } اي: سفرا للتكسب، الرابع قوله: { يحسبهم الجاهل اغنياء من التعفف } وهذا بيان لصدق صبرهم وحسن تعففهم. الخامس: انه قال: { تعرفهم بسيماهم } اي: بالعلامه التي ذكرها الله في وصفهم، وهذا لا ينافي قوله: { يحسبهم الجاهل اغنياء } فان الجاهل بحالهم ليس له فطنه ",
        "char_start": 0,
        "char_end": 906,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "ثم ذكر حاله المتصدقين في جميع الاوقات علي جميع الاحوال فقال: { الذين ينفقون اموالهم في سبيل الله } اي: طاعته وطريق مرضاته، لا في المحرمات والمكروهات وشهوات انفسهم { بالليل والنهار سرا وعلانيه فلهم اجرهم عند ربهم } اي: اجر عظيم من خير عند الرب الرحيم { ولا خوف عليهم } اذا خاف المقصرون { ولا هم يحزنون } اذا حزن المفرطون، ففازوا بحصول المقصود المطلوب، ونجوا من الشرور والمرهوب،",
        "char_start": 0,
        "char_end": 376,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_017_chunk00",
        "verse_key": "3:17",
        "text_ar": "{ الصابرين } انفسهم علي ما يحبه الله من طاعته، وعن معصيته، وعلي اقداره المولمه، { والصادقين } في ايمانهم واقوالهم واحوالهم { والمنفقين } مما رزقهم الله بانواع النفقات علي المحاويج من الاقارب وغيرهم { والمستغفرين بالاسحار } لما بين صفاتهم الحميده ذكر احتقارهم لانفسهم وانهم لا يرون لانفسهم، حالا ولا مقاما، بل يرون انفسهم مذنبين مقصرين فيستغفرون ربهم، ويتوقعون اوقات الاجابه وهي السحر، قال الحسن: مدوا الصلاه الي السحر، ثم جلسوا يستغفرون ربهم. فتضمنت هذه الايات حاله الناس في الدنيا وانها متاع ينقضي، ",
        "char_start": 0,
        "char_end": 710,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_092_chunk00",
        "verse_key": "3:92",
        "text_ar": "هذا حث من الله لعباده علي الانفاق في طرق الخيرات، فقال { لن تنالوا } اي: تدركوا وتبلغوا البر الذي هو كل خير من انواع الطاعات وانواع المثوبات الموصل لصاحبه الي الجنه، { حتي تنفقوا مما تحبون } اي: من اموالكم النفيسه التي تحبها نفوسكم، فانكم اذا قدمتم محبه الله علي محبه الاموال فبذلتموها في مرضاته، دل ذلك علي ايمانكم الصادق وبر قلوبكم ويقين تقواكم، فيدخل في ذلك انفاق نفايس الاموال، والانفاق في حال حاجه المنفق الي ما انفقه، والانفاق في حال الصحه، ودلت الايه ان العبد بحسب انفاقه للمحبوبات يكون بره، و",
        "char_start": 0,
        "char_end": 847,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_117_chunk00",
        "verse_key": "3:117",
        "text_ar": "ثم ضرب مثلا لما ينفقه الكفار من اموالهم التي يصدون بها عن سبيل الله ويستعينون بها علي اطفاء نور الله، بانها تبطل وتضمحل، كمن زرع زرعا يرجو نتيجته ويومل ادراك ريعه، فبينما هو كذلك اذ اصابته ريح فيها صر، اي: برد شديد محرق، فاهلكت زرعه، ولم يحصل له الا التعب والعناء وزياده الاسف، فكذلك هولاء الكفار الذين قال الله فيهم: { ان الذين كفروا ينفقون اموالهم ليصدوا عن سبيل الله فسينفقونها ثم تكون عليهم حسره ثم يغلبون } { وما ظلمهم الله } بابطال اعمالهم { ولكن } كانوا { انفسهم يظلمون } حيث كفروا بايات الله ",
        "char_start": 0,
        "char_end": 587,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_134_chunk00",
        "verse_key": "3:134",
        "text_ar": "ثم وصف المتقين واعمالهم، فقال: { الذين ينفقون في السراء والضراء } اي: في حال عسرهم ويسرهم، ان ايسروا اكثروا من النفقه، وان اعسروا لم يحتقروا من المعروف شييا ولو قل. { والكاظمين الغيظ } اي: اذا حصل لهم من غيرهم اذيه توجب غيظهم -وهو امتلاء قلوبهم من الحنق، الموجب للانتقام بالقول والفعل-، هولاء لا يعملون بمقتضي الطباع البشريه، بل يكظمون ما في القلوب من الغيظ، ويصبرون عن مقابله المسيء اليهم. { والعافين عن الناس } يدخل في العفو عن الناس، العفو عن كل من اساء اليك بقول او فعل، والعفو ابلغ من الكظم، لان",
        "char_start": 0,
        "char_end": 1519,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_034_chunk00",
        "verse_key": "4:34",
        "text_ar": "يخبر تعالي ان الرِّجَال { قَوَّامُونَ عَلَي النِّسَاءِ } اي: قوامون عليهن بالزامهن بحقوق الله تعالي، من المحافظه علي فرايضه وكفهن عن المفاسد، والرجال عليهم ان يلزموهن بذلك، وقوامون عليهن ايضا بالانفاق عليهن، والكسوه والمسكن، ثم ذكر السبب الموجب لقيام الرجال علي النساء فقال: { بِمَا فَضَّلَ اللَّهُ بَعْضَهُمْ عَلَي بَعْضٍ وَبِمَا اَنفَقُوا مِنْ اَمْوَالِهِمْ } اي: بسبب فضل الرجال علي النساء وافضالهم عليهن، فتفضيل الرجال علي النساء من وجوه متعدده: من كون الولايات مختصه بالرجال، والنبوه، والرساله، ",
        "char_start": 0,
        "char_end": 1959,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_038_chunk00",
        "verse_key": "4:38",
        "text_ar": "ثم اخبر عن النفقه الصادره عن رياء وسمعه وعدم ايمان به فقال: { وَالَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ رِيَاءَ النَّاسِ } اي: ليروهم ويمدحوهم ويعظموهم { وَلَا يُوْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْاخِرِ } اي: ليس انفاقهم صادرا عن اخلاص وايمان بالله ورجاء ثوابه. اي: فهذا من خطوات الشيطان واعماله التي يدعو حزبه اليها ليكونوا من اصحاب السعير. وصدرت منهم بسبب مقارنته لهم وازهم اليها فلهذا قال: { وَمَنْ يَكُنِ الشَّيْطَانُ لَهُ قَرِينًا فَسَاءَ قَرِينًا } اي: بيس المقارن والصاحب الذي يريد اهلاك من ",
        "char_start": 0,
        "char_end": 880,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_003_chunk00",
        "verse_key": "2:3",
        "text_ar": "القول في تاويل قوله جل ثناوه: الَّذِينَ يُوْمِنُونَ267- حدثنا محمد بن حُميد الرازي, قال: حدثنا سَلَمه بن الفضل, عن محمد بن اسحاق, عن محمد بن ابي محمد مولي زيد بن ثابت, عن عكرمه, او عن سعيد بن جبير، عن ابن عباس: \" الذين يومنون \"، قال: يصدِّقون.268- حدثني يحيي بن عثمان بن صالح السَّهمي, قال: حدثنا ابو صالح, قال: حدثني معاويه بن صالح، عن علي بن ابي طلحه, عن ابن عباس: \" يومنون \": يصدِّقون (56) .269- حدثني المثني بن ابراهيم, قال: حدثنا اسحاق بن الحجاج, قال: حدثنا عبد الله بن ابي جعفر, عن ابيه, عن الر",
        "char_start": 0,
        "char_end": 15366,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_195_chunk00",
        "verse_key": "2:195",
        "text_ar": "القول في تاويل قوله تعالي : وَاَنْفِقُوا فِي سَبِيلِ اللَّهِ وَلا تُلْقُوا بِاَيْدِيكُمْ اِلَي التَّهْلُكَهِ وَاَحْسِنُوا اِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ (195)قال ابو جعفر: اختلف اهل التاويل في تاويل هذه الايه، ومن عَني بقوله: \" ولا تُلقوا بايديكم الي التهلكه \".فقال بعضهم: عني بذلك: \" وانفقوا في سبيل الله \" - و \" سبيل الله \" (16) طريقه الذي امر ان يُسلك فيه الي عدوِّه من المشركين لجهادهم وَحرْبهم =\" ولا تُلقوا بايديكم الي التهلكه \" - يقول: ولا تتركوا النفقه في سبيل الله، فان الله يُعوِّضكم ",
        "char_start": 0,
        "char_end": 19229,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_215_chunk00",
        "verse_key": "2:215",
        "text_ar": "القول في تاويل قوله تعالي : يَسْاَلُونَكَ مَاذَا يُنْفِقُونَ قُلْ مَا اَنْفَقْتُمْ مِنْ خَيْرٍ فَلِلْوَالِدَيْنِ وَالاَقْرَبِينَ وَالْيَتَامَي وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ وَمَا تَفْعَلُوا مِنْ خَيْرٍ فَاِنَّ اللَّهَ بِهِ عَلِيمٌ (215)قال ابو جعفر: يعني بذلك جل ثناوه: يسالك اصحابك يا محمد، اي شيء ينفقون من اموالهم فيتصدقون به ؟، وعلي مَن ينفقونه فيما ينفقونه ويتصدقون به ؟ فقل لهم: ما انفقتم من اموالكم وتصدقتم به، فانفقوه وتصدقوا به واجعلوه لابايكم وامهاتكم واقربيكم، ولليتامي منكم، والمساكي",
        "char_start": 0,
        "char_end": 6071,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_219_chunk00",
        "verse_key": "2:219",
        "text_ar": "يسالونك عن الخمر والميسرالقول في تاويل قوله تعالي : { يسالونك عن الخمر والميسر } يعني بذلك جل ثناوه : يسالك اصحابك يا محمد عن الخمر وشربها . والخمر : كل شراب خامر العقل فستره وغطي عليه , وهو من قول القايل : خمرت الاناء اذا غطيته , وخمر الرجل : اذا دخل في الخمر , ويقال , هو في خمار الناس وغمارهم , يراد به : دخل في عرض الناس , ويقال للضبع خامري ام عامر , اي استتري . وما خامر العقل من داء وسكر فخالطه وغمره فهو خمر , ومن ذلك ايضا خمار المراه وذلك لانها تستر به راسها فتغطيه , ومنه يقال : هو يمشي لك ا",
        "char_start": 0,
        "char_end": 27379,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_254_chunk00",
        "verse_key": "2:254",
        "text_ar": "القول في تاويل قوله تعالي : يَا اَيُّهَا الَّذِينَ امَنُوا اَنْفِقُوا مِمَّا رَزَقْنَاكُمْ مِنْ قَبْلِ اَنْ يَاْتِيَ يَوْمٌ لا بَيْعٌ فِيهِ وَلا خُلَّهٌ وَلا شَفَاعَهٌ وَالْكَافِرُونَ هُمُ الظَّالِمُونَ (254)قال ابو جعفر: يعني تعالي ذكره بذلك: يا ايها الذين امنوا انفقوا في سبيل الله مما رزقناكم من اموالكم، وتصدقوا منها، واتوا منها الحقوق التي فرضناها عليكم. وكذلك كان ابن جريج يقول فيما بلغنا عنه:5760 - حدثنا القاسم، قال: حدثنا الحسين، قال: حدثني حجاج، عن ابن جريج قوله: \" يا ايها الذين امنوا انفق",
        "char_start": 0,
        "char_end": 5839,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_261_chunk00",
        "verse_key": "2:261",
        "text_ar": "القول في تاويل قوله : مَثَلُ الَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّهٍ اَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَهٍ مِايَهُ حَبَّهٍقال ابو جعفر: وهذه الايه مردوده الي قوله: مَنْ ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ اَضْعَافًا كَثِيرَهً وَاللَّهُ يَقْبِضُ وَيَبْسُطُ وَاِلَيْهِ تُرْجَعُونَ [ البقره: 245 ] والاياتُ التي بعدها الي قوله: ( مثل الذين ينفقون اموالهم في سبيل الله )، من قصص بني اسراييل وخبرهم مع طالوت وجالوت, وما بعد ذلك من نب",
        "char_start": 0,
        "char_end": 7357,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_262_chunk00",
        "verse_key": "2:262",
        "text_ar": "القول في تاويل قوله : الَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ ثُمَّ لا يُتْبِعُونَ مَا اَنْفَقُوا مَنًّا وَلا اَذًي لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (262)قال ابو جعفر: يعني تعالي ذكره بذلك: المعطيَ ماله المجاهدين في سبيل الله معونهً لهم علي جهاد اعداء الله. يقول تعالي ذكره: الذين يعينون المجاهدين في سبيل الله بالانفاق عليهم وفي حَمُولاتهم, وغير ذلك من مونهم, (71) . ثم لم يتْبع نفقته التي انفقها عليهم منًّا عليهم بانفاق ذلك عليهم، ولا",
        "char_start": 0,
        "char_end": 5125,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_264_chunk00",
        "verse_key": "2:264",
        "text_ar": "القول في تاويل قوله : يَا اَيُّهَا الَّذِينَ امَنُوا لا تُبْطِلُوا صَدَقَاتِكُمْ بِالْمَنِّ وَالاَذَي كَالَّذِي يُنْفِقُ مَالَهُ رِيَاءَ النَّاسِ وَلا يُوْمِنُ بِاللَّهِ وَالْيَوْمِ الاخِرِقال ابو جعفر: يعني تعالي ذكره بذلك: ( يا ايها الذين امنوا )، صدّقوا الله ورسوله =( لا تبطلوا صدقاتكم ), يقول: لا تبطلوا اجورَ صدَقاتكم بالمنّ والاذي, كما ابطل كفر الذي ينفق ماله =( رياء الناس ), وهو مراءاته اياهم بعمله، وذلك ان ينفق ماله فيما يري الناسُ في الظاهر انه يريد الله تعالي ذكره فيحمدونه عليه، وهو غير",
        "char_start": 0,
        "char_end": 13658,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_265_chunk00",
        "verse_key": "2:265",
        "text_ar": "القول في تاويل قوله عز وجل : وَمَثَلُ الَّذِينَ يُنْفِقُونَ اَمْوَالَهُمُ ابْتِغَاءَ مَرْضَاهِ اللَّهِ وَتَثْبِيتًا مِنْ اَنْفُسِهِمْقال ابو جعفر: يعني بذلك جل ثناوه: ( ومثل الذين ينفقون اموالهم ) فيصَّدَّقون بها، ويحملون عليها في سبيل الله، ويقوُّون بها اهل الحاجه من الغزاه والمجاهدين في سبيل الله، وفي غير ذلك من طاعات الله، طلب مرضاته = (1) . &; 5-531 &; =( وتثبيتًا من انفسهم ) يعني بذلك: وتثبيتًا لهم علي انفاق ذلك في طاعه الله وتحقيقًا, من قول القايل: \" ثَبَّتُّ فلانًا في هذا الامر \" - اذ صحح",
        "char_start": 0,
        "char_end": 15292,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "القول في تاويل قوله : يَا اَيُّهَا الَّذِينَ امَنُوا اَنْفِقُواقال ابو جعفر: يعني جل ثناوه بقوله: \" يا ايها الذين امنوا \"، صدقوا بالله ورسوله واي كتابه.* * *ويعني بقوله: \" انفقوا \"، زكُّوا وتصدقوا، كما:-6120 - حدثني المثني، قال: حدثنا عبد الله، قال: حدثني معاويه، عن علي، عن ابن عباس قوله: \" انفقوا من طيبات ما كسبتم \" يقول: تصدَّقوا.* * *القول في تاويل قوله : مِنْ طَيِّبَاتِ مَا كَسَبْتُمْيعني بذلك جل ثناوه: زكوا من طيّب ما كسبتم بتصرُّفكم= اما بتجاره، واما بصناعه= من الذهب والفضه.ويعني ب \" الطيب",
        "char_start": 0,
        "char_end": 21666,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_270_chunk00",
        "verse_key": "2:270",
        "text_ar": "القول في تاويل قوله : وَمَا اَنْفَقْتُمْ مِنْ نَفَقَهٍ اَوْ نَذَرْتُمْ مِنْ نَذْرٍ فَاِنَّ اللَّهَ يَعْلَمُهُ وَمَا لِلظَّالِمِينَ مِنْ اَنْصَارٍ (270)قال ابو جعفر: يعني بذلك جل ثناوه: واي نفقه انفقتم- يعني اي صدقه تصدقتم- (1) او اي نذر نذرتم= يعني\" بالنذر \"، ما اوجبه المرء علي نفسه تبررا في طاعه الله، وتقربا به اليه: من صدقه او عمل خير=\" فان الله يعلمه \"، &; 5-581 &; اي ان جميع ذلك بعلم الله، (2) لا يعزب عنه منه شيء، ولا يخفي عليه منه قليل ولا كثير، ولكنه يحصيه ايها الناس عليكم حتي يجازيكم جميع",
        "char_start": 0,
        "char_end": 2188,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_272_chunk00",
        "verse_key": "2:272",
        "text_ar": "القول في تاويل قوله عز وجل : لَيْسَ عَلَيْكَ هُدَاهُمْ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ وَمَا تُنْفِقُوا مِنْ خَيْرٍ فَلاَنْفُسِكُمْ وَمَا تُنْفِقُونَ اِلا ابْتِغَاءَ وَجْهِ اللَّهِ وَمَا تُنْفِقُوا مِنْ خَيْرٍ يُوَفَّ اِلَيْكُمْ وَاَنْتُمْ لا تُظْلَمُونَ (272)قال ابو جعفر: يعني تعالي ذكره بذلك: ليس عليك يا محمد هدي المشركين الي الاسلام، فتمنعهم صدقه التطوع، ولا تعطيهم منها ليدخلوا في الاسلام حاجه منهم اليها، ولكن الله هو يهدي من يشاء من خلقه الي الاسلام فيوفقهم له، فلا تمنعهم الصدقه، كما:",
        "char_start": 0,
        "char_end": 4642,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_273_chunk00",
        "verse_key": "2:273",
        "text_ar": "القول في تاويل قوله : لِلْفُقَرَاءِ الَّذِينَ اُحْصِرُوا فِي سَبِيلِ اللَّهِ لا يَسْتَطِيعُونَ ضَرْبًا فِي الاَرْضِ يَحْسَبُهُمُ الْجَاهِلُ اَغْنِيَاءَ مِنَ التَّعَفُّفِ تَعْرِفُهُمْ بِسِيمَاهُمْ لا يَسْاَلُونَ النَّاسَ اِلْحَافًا وَمَا تُنْفِقُوا مِنْ خَيْرٍ فَاِنَّ اللَّهَ بِهِ عَلِيمٌ (273)قال ابو جعفر: اما قوله: \" للفقراء الذين احصروا في سبيل الله \"، فبيان من الله عز وجل عن سبيل النفقه ووجهها. ومعني الكلام: وما تنفقوا من خير فلانفسكم تنفقون للفقراء الذين احصروا في سبيل الله.\" واللام \" التي ف",
        "char_start": 0,
        "char_end": 17110,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_274_chunk00",
        "verse_key": "2:274",
        "text_ar": "القول في تاويل قوله تعالي : الَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلانِيَهً فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ وَلا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ (274)[قال ابو جعفر]:..........................................................................................................................................................* * *6232 - حدثنا يعقوب بن ابراهيم، قال: حدثنا معتمر، عن ايمن بن نابل، قال: حدثني شيخ من غافق: ان ابا الدرداء كان ينظر الي الخيل مربوطه",
        "char_start": 0,
        "char_end": 3085,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_017_chunk00",
        "verse_key": "3:17",
        "text_ar": "القول في تاويل قوله : الصَّابِرِينَ وَالصَّادِقِينَ وَالْقَانِتِينَ وَالْمُنْفِقِينَقال ابو جعفر: يعني بقوله: \" الصابرين \"، الذين صبروا في الباساء والضراء وحين الباس.ويعني بـ\" الصادقين \"، الذين صدقوا الله في قولهم بتحقيقهم الاقرارَ به وبرسوله وما جاء به من عنده، بالعمل بما امره به والانتهاء عما نهاه عنه.ويعني بـ\" القانتين \"، المطيعين له.* * *وقد اتينا علي الابانه عن كل هذه الحروف ومعانيها بالشواهد علي صحه ما قلنا فيها، وبالاخبار عمن قال فيها قولا فيما مضي، بما اغني عن اعادته في هذا الموضع. (3)* ",
        "char_start": 0,
        "char_end": 3971,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_092_chunk00",
        "verse_key": "3:92",
        "text_ar": "القول في تاويل قوله تعالي : لَنْ تَنَالُوا الْبِرَّ حَتَّي تُنْفِقُوا مِمَّا تُحِبُّونَ وَمَا تُنْفِقُوا مِنْ شَيْءٍ فَاِنَّ اللَّهَ بِهِ عَلِيمٌ (92)قال ابو جعفر: يعني بذلك جل ثناوه: لن تدركوا، ايها المومنون، البرَّ = وهو \" البر \" من الله الذي يطلبونه منه بطاعتهم اياه وعبادتهم له ويرجونه منه، وذلك تفضّله عليهم بادخالهم جنته، وصرف عذابه عنهم.* * *ولذلك قال كثير من اهل التاويل \" البر \" الجنه، لان بر الربّ بعبده في الاخره، اكرامه اياه بادخاله الجنه. (1)ذكر من قال ذلك.7386 - حدثنا ابو كريب قال، حدث",
        "char_start": 0,
        "char_end": 9395,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_117_chunk00",
        "verse_key": "3:117",
        "text_ar": "القول في تاويل قوله : اِنَّ الَّذِينَ كَفَرُوا لَنْ تُغْنِيَ عَنْهُمْ اَمْوَالُهُمْ وَلا اَوْلادُهُمْ مِنَ اللَّهِ شَيْيًا وَاُولَيِكَ اَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ (116)قال ابو جعفر: وهذا وعيدٌ من الله عز وجل للامه الاخري الفاسقه من اهل الكتاب، الذين اخبر عنهم بانهم فاسقون، وانهم قد باووا بغضب منه، ولمن كان من نظرايهم من اهل الكفر بالله ورسوله وما جاء به محمد صلي الله عليه وسلم من عند الله.يقول تعالي ذكره: \" ان الذين كفروا \"، يعني: الذين جحدوا نبوه محمد صلي الله عليه وسلم وكذبوا به ",
        "char_start": 0,
        "char_end": 1940,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_134_chunk00",
        "verse_key": "3:134",
        "text_ar": "القول في تاويل قوله : وَسَارِعُوا اِلَي مَغْفِرَهٍ مِنْ رَبِّكُمْ وَجَنَّهٍ عَرْضُهَا السَّمَاوَاتُ وَالاَرْضُ اُعِدَّتْ لِلْمُتَّقِينَ (133)قال ابو جعفر: يعني تعالي ذكره بقوله: \" وسارعوا \"، وبادروا وسابقوا = (1) \" الي مغفره من ربكم \"، يعني: الي ما يستر عليكم ذنوبكم من رحمته، وما يغطيها عليكم من عفوه عن عقوبتكم عليها =\" وجنه عرضها السموات والارض \"، يعني: وسارعوا ايضًا الي جنه عرضها السموات والارض.* * *ذكر ان معني ذلك: وجنه عرضها كعرض السموات السبع والارضين السبع، اذا ضم بعضها الي بعض.*ذكر من قال",
        "char_start": 0,
        "char_end": 11235,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_034_chunk00",
        "verse_key": "4:34",
        "text_ar": "الرجال قوامون علي النساء بما فضل الله بعضهم علي بعضالقول في تاويل قوله تعالي : { الرجال قوامون علي النساء بما فضل الله بعضهم علي بعض } يعني بقوله جل ثناوه : { الرجال قوامون علي النساء } الرجال اهل قيام علي نسايهم في تاديبهن والاخذ علي ايديهن , فيما يجب عليهن لله ولانفسهم ; { بما فضل الله بعضهم علي بعض } يعني بما فضل الله به الرجال علي ازواجهم من سوقهم اليهن مهورهن , وانفاقهم عليهن اموالهم , وكفايتهم اياهن مونهن. وذلك تفضيل الله تبارك وتعالي اياهن عليهن , ولذلك صاروا قواما عليهن , نافذي الامر علي",
        "char_start": 0,
        "char_end": 27130,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_038_chunk00",
        "verse_key": "4:38",
        "text_ar": "القول في تاويل قوله : وَالَّذِينَ يُنْفِقُونَ اَمْوَالَهُمْ رِيَاءَ النَّاسِ وَلا يُوْمِنُونَ بِاللَّهِ وَلا بِالْيَوْمِ الاخِرِقال ابو جعفر: يعني بذلك جل ثناوه: واعتدنا للكافرين بالله من اليهود الذين وصف الله صِفَتهم، عذابًا مهينًا =\" والذين ينفقون اموالهم رياءَ الناس.\"* * *و \" الذين \" في موضع خفضٍ، عطفًا علي \" الكافرين \".* * *وقوله: \" رياء الناس \"، يعني: ينفقه مُراءاه الناس، في غير طاعه الله او غير سبيله، ولكن في سبيل الشيطان (1) =\" ولا يومنون بالله ولا باليوم الاخر \"، يقول: ولا يصدقون بوحداني",
        "char_start": 0,
        "char_end": 3600,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 16,
      "evidence_refs": [
        {
          "verse_key": "2:215",
          "source": "tabari",
          "chunk_id": "tabari_002_215_chunk04",
          "char_start": 242,
          "char_end": 404,
          "relevance": "direct"
        },
        {
          "verse_key": "2:268",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_268_chunk01",
          "char_start": 417,
          "char_end": 579,
          "relevance": "direct"
        },
        {
          "verse_key": "2:270",
          "source": "jalalayn",
          "chunk_id": "jalalayn_002_270_chunk00",
          "char_start": 87,
          "char_end": 209,
          "relevance": "direct"
        },
        {
          "verse_key": "6:151",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_151_chunk03",
          "char_start": 349,
          "char_end": 511,
          "relevance": "direct"
        },
        {
          "verse_key": "17:64",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_017_064_chunk01",
          "char_start": 7,
          "char_end": 169,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_HUMAN_GENERAL",
      "target_label_ar": "إنسان",
      "target_label_en": "Human",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "4:53",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_004_053_chunk00",
          "char_start": 389,
          "char_end": 551,
          "relevance": "direct"
        },
        {
          "verse_key": "17:100",
          "source": "saadi",
          "chunk_id": "saadi_017_100_chunk00",
          "char_start": 41,
          "char_end": 194,
          "relevance": "direct"
        },
        {
          "verse_key": "17:100",
          "source": "tabari",
          "chunk_id": "tabari_017_100_chunk00",
          "char_start": 419,
          "char_end": 581,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_UNDERSTANDING",
      "target_label_ar": "الفقه",
      "target_label_en": "Understanding",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "6:151",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_151_chunk03",
          "char_start": 349,
          "char_end": 511,
          "relevance": "direct"
        },
        {
          "verse_key": "25:67",
          "source": "baghawi",
          "chunk_id": "baghawi_025_067_chunk00",
          "char_start": 536,
          "char_end": 698,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_FIN_HOARDING",
      "target_label_ar": "البخل",
      "target_label_en": "Hoarding/Miserliness",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "4:37",
          "source": "qurtubi",
          "chunk_id": "qurtubi_004_037_chunk01",
          "char_start": 295,
          "char_end": 457,
          "relevance": "direct"
        },
        {
          "verse_key": "4:53",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_004_053_chunk00",
          "char_start": 389,
          "char_end": 551,
          "relevance": "direct"
        },
        {
          "verse_key": "17:100",
          "source": "saadi",
          "chunk_id": "saadi_017_100_chunk00",
          "char_start": 41,
          "char_end": 194,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SOC_JUSTICE",
      "target_label_ar": "العدل",
      "target_label_en": "Justice",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "25:67",
          "source": "tabari",
          "chunk_id": "tabari_025_067_chunk06",
          "char_start": 427,
          "char_end": 589,
          "relevance": "direct"
        },
        {
          "verse_key": "25:67",
          "source": "tabari",
          "chunk_id": "tabari_025_067_chunk07",
          "char_start": 405,
          "char_end": 567,
          "relevance": "direct"
        },
        {
          "verse_key": "65:2",
          "source": "muyassar",
          "chunk_id": "muyassar_065_002_chunk00",
          "char_start": 5,
          "char_end": 167,
          "relevance": "direct"
        },
        {
          "verse_key": "65:3",
          "source": "muyassar",
          "chunk_id": "muyassar_065_003_chunk00",
          "char_start": 5,
          "char_end": 167,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPEECH_TRUTHFULNESS",
      "target_label_ar": "الصدق",
      "target_label_en": "Truthfulness",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "2:268",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_268_chunk00",
          "char_start": 264,
          "char_end": 426,
          "relevance": "direct"
        },
        {
          "verse_key": "2:268",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_268_chunk00",
          "char_start": 291,
          "char_end": 453,
          "relevance": "direct"
        },
        {
          "verse_key": "42:37",
          "source": "qurtubi",
          "chunk_id": "qurtubi_042_037_chunk01",
          "char_start": 170,
          "char_end": 332,
          "relevance": "direct"
        },
        {
          "verse_key": "53:35",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_053_035_chunk00",
          "char_start": 69,
          "char_end": 231,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_CONTENTMENT",
      "target_label_ar": "الرضا",
      "target_label_en": "Contentment",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 6,
      "evidence_refs": [
        {
          "verse_key": "25:57",
          "source": "baghawi",
          "chunk_id": "baghawi_025_057_chunk00",
          "char_start": 176,
          "char_end": 338,
          "relevance": "direct"
        },
        {
          "verse_key": "92:17",
          "source": "muyassar",
          "chunk_id": "muyassar_092_017_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:18",
          "source": "muyassar",
          "chunk_id": "muyassar_092_018_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:19",
          "source": "muyassar",
          "chunk_id": "muyassar_092_019_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:20",
          "source": "muyassar",
          "chunk_id": "muyassar_092_020_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "CSQ_FAQR",
      "target_label_ar": "الفقر",
      "target_label_en": "Poverty",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:268",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_268_chunk00",
          "char_start": 291,
          "char_end": 453,
          "relevance": "direct"
        },
        {
          "verse_key": "17:100",
          "source": "qurtubi",
          "chunk_id": "qurtubi_017_100_chunk00",
          "char_start": 508,
          "char_end": 670,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "CSQ_JANNAH",
      "target_label_ar": "الجنة",
      "target_label_en": "Paradise",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 5,
      "evidence_refs": [
        {
          "verse_key": "92:17",
          "source": "muyassar",
          "chunk_id": "muyassar_092_017_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:18",
          "source": "muyassar",
          "chunk_id": "muyassar_092_018_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:19",
          "source": "muyassar",
          "chunk_id": "muyassar_092_019_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:20",
          "source": "muyassar",
          "chunk_id": "muyassar_092_020_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:21",
          "source": "muyassar",
          "chunk_id": "muyassar_092_021_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_FACE",
      "target_label_ar": "وجه",
      "target_label_en": "Face",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 5,
      "evidence_refs": [
        {
          "verse_key": "92:17",
          "source": "muyassar",
          "chunk_id": "muyassar_092_017_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:18",
          "source": "muyassar",
          "chunk_id": "muyassar_092_018_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:19",
          "source": "muyassar",
          "chunk_id": "muyassar_092_019_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:20",
          "source": "muyassar",
          "chunk_id": "muyassar_092_020_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        },
        {
          "verse_key": "92:21",
          "source": "muyassar",
          "chunk_id": "muyassar_092_021_chunk00",
          "char_start": 22,
          "char_end": 184,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_FOOT",
      "target_label_ar": "رجل",
      "target_label_en": "Foot",
      "edge_type": "CAUSES",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "2:274",
          "source": "tabari",
          "chunk_id": "tabari_002_274_chunk03",
          "char_start": 431,
          "char_end": 597,
          "relevance": "direct"
        },
        {
          "verse_key": "2:274",
          "source": "tabari",
          "chunk_id": "tabari_002_274_chunk03",
          "char_start": 431,
          "char_end": 594,
          "relevance": "direct"
        },
        {
          "verse_key": "2:274",
          "source": "tabari",
          "chunk_id": "tabari_002_274_chunk03",
          "char_start": 446,
          "char_end": 603,
          "relevance": "direct"
        }
      ],
      "confidence": 0.68
    },
    {
      "target_id": "ORG_FOOT",
      "target_label_ar": "رجل",
      "target_label_en": "Foot",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "65:2",
          "source": "muyassar",
          "chunk_id": "muyassar_065_002_chunk00",
          "char_start": 5,
          "char_end": 167,
          "relevance": "direct"
        },
        {
          "verse_key": "65:3",
          "source": "muyassar",
          "chunk_id": "muyassar_065_003_chunk00",
          "char_start": 5,
          "char_end": 167,
          "relevance": "direct"
        },
        {
          "verse_key": "104:3",
          "source": "tabari",
          "chunk_id": "tabari_104_003_chunk00",
          "char_start": 50,
          "char_end": 212,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_SOUL",
      "target_label_ar": "نفس",
      "target_label_en": "Soul",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "18:7",
          "source": "qurtubi",
          "chunk_id": "qurtubi_018_007_chunk01",
          "char_start": 686,
          "char_end": 848,
          "relevance": "direct"
        },
        {
          "verse_key": "25:57",
          "source": "baghawi",
          "chunk_id": "baghawi_025_057_chunk00",
          "char_start": 176,
          "char_end": 338,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    }
  ],
  "incoming_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 11,
      "evidence_refs": [
        {
          "verse_key": "2:267",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_267_chunk00",
          "char_start": 219,
          "char_end": 381,
          "relevance": "direct"
        },
        {
          "verse_key": "2:268",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_268_chunk01",
          "char_start": 367,
          "char_end": 529,
          "relevance": "direct"
        },
        {
          "verse_key": "3:186",
          "source": "qurtubi",
          "chunk_id": "qurtubi_003_186_chunk00",
          "char_start": 113,
          "char_end": 275,
          "relevance": "direct"
        },
        {
          "verse_key": "4:39",
          "source": "saadi",
          "chunk_id": "saadi_004_039_chunk00",
          "char_start": 54,
          "char_end": 216,
          "relevance": "direct"
        },
        {
          "verse_key": "6:136",
          "source": "qurtubi",
          "chunk_id": "qurtubi_006_136_chunk00",
          "char_start": 414,
          "char_end": 576,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "STRENGTHENS",
      "direction": "incoming",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "2:245",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_245_chunk00",
          "char_start": 0,
          "char_end": 127,
          "relevance": "direct"
        },
        {
          "verse_key": "57:11",
          "source": "qurtubi",
          "chunk_id": "qurtubi_057_011_chunk00",
          "char_start": 0,
          "char_end": 130,
          "relevance": "direct"
        },
        {
          "verse_key": "57:11",
          "source": "tabari",
          "chunk_id": "tabari_057_011_chunk00",
          "char_start": 43,
          "char_end": 208,
          "relevance": "direct"
        },
        {
          "verse_key": "64:17",
          "source": "muyassar",
          "chunk_id": "muyassar_064_017_chunk00",
          "char_start": 0,
          "char_end": 133,
          "relevance": "direct"
        }
      ],
      "confidence": 0.95
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:267",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_267_chunk00",
          "char_start": 219,
          "char_end": 381,
          "relevance": "direct"
        },
        {
          "verse_key": "8:37",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_008_037_chunk00",
          "char_start": 495,
          "char_end": 657,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_COG_UNDERSTANDING",
      "target_label_ar": "الفقه",
      "target_label_en": "Understanding",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "9:55",
          "source": "baghawi",
          "chunk_id": "baghawi_009_055_chunk00",
          "char_start": 510,
          "char_end": 672,
          "relevance": "direct"
        },
        {
          "verse_key": "64:17",
          "source": "saadi",
          "chunk_id": "saadi_064_017_chunk00",
          "char_start": 144,
          "char_end": 306,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_PHY_STANDING",
      "target_label_ar": "القيام",
      "target_label_en": "Standing",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "25:67",
          "source": "tabari",
          "chunk_id": "tabari_025_067_chunk06",
          "char_start": 360,
          "char_end": 522,
          "relevance": "direct"
        },
        {
          "verse_key": "25:67",
          "source": "tabari",
          "chunk_id": "tabari_025_067_chunk06",
          "char_start": 374,
          "char_end": 536,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_SPI_CONTENTMENT",
      "target_label_ar": "الرضا",
      "target_label_en": "Contentment",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:268",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_268_chunk01",
          "char_start": 367,
          "char_end": 529,
          "relevance": "direct"
        },
        {
          "verse_key": "57:24",
          "source": "tabari",
          "chunk_id": "tabari_057_024_chunk00",
          "char_start": 277,
          "char_end": 439,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_CONTENTMENT",
      "target_label_ar": "الرضا",
      "target_label_en": "Contentment",
      "edge_type": "STRENGTHENS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:245",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_245_chunk00",
          "char_start": 0,
          "char_end": 127,
          "relevance": "direct"
        },
        {
          "verse_key": "57:11",
          "source": "qurtubi",
          "chunk_id": "qurtubi_057_011_chunk00",
          "char_start": 0,
          "char_end": 130,
          "relevance": "direct"
        }
      ],
      "confidence": 0.71
    },
    {
      "target_id": "BEH_SPI_DISBELIEF",
      "target_label_ar": "الكفر",
      "target_label_en": "Disbelief",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "9:67",
          "source": "jalalayn",
          "chunk_id": "jalalayn_009_067_chunk00",
          "char_start": 23,
          "char_end": 185,
          "relevance": "direct"
        },
        {
          "verse_key": "9:67",
          "source": "jalalayn",
          "chunk_id": "jalalayn_009_067_chunk00",
          "char_start": 42,
          "char_end": 204,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "BEH_SPI_FAITH",
      "target_label_ar": "الإيمان",
      "target_label_en": "Faith",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:261",
          "source": "saadi",
          "chunk_id": "saadi_002_261_chunk00",
          "char_start": 288,
          "char_end": 450,
          "relevance": "direct"
        },
        {
          "verse_key": "36:8",
          "source": "baghawi",
          "chunk_id": "baghawi_036_008_chunk00",
          "char_start": 647,
          "char_end": 809,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "57:24",
          "source": "tabari",
          "chunk_id": "tabari_057_024_chunk00",
          "char_start": 277,
          "char_end": 439,
          "relevance": "direct"
        },
        {
          "verse_key": "80:33",
          "source": "qurtubi",
          "chunk_id": "qurtubi_080_033_chunk00",
          "char_start": 0,
          "char_end": 126,
          "relevance": "direct"
        },
        {
          "verse_key": "80:33",
          "source": "qurtubi",
          "chunk_id": "qurtubi_080_033_chunk00",
          "char_start": 0,
          "char_end": 141,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "CSQ_FAQR",
      "target_label_ar": "الفقر",
      "target_label_en": "Poverty",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:268",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_268_chunk01",
          "char_start": 367,
          "char_end": 529,
          "relevance": "direct"
        },
        {
          "verse_key": "2:268",
          "source": "muyassar",
          "chunk_id": "muyassar_002_268_chunk00",
          "char_start": 9,
          "char_end": 171,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "CSQ_RIZQ",
      "target_label_ar": "الرزق",
      "target_label_en": "Provision",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:245",
          "source": "tabari",
          "chunk_id": "tabari_002_245_chunk06",
          "char_start": 553,
          "char_end": 715,
          "relevance": "direct"
        },
        {
          "verse_key": "4:39",
          "source": "saadi",
          "chunk_id": "saadi_004_039_chunk00",
          "char_start": 54,
          "char_end": 216,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    }
  ],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [],
    "internal_external": {
      "value": "ظاهر",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_EXTERNAL_BEH_FIN_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 50,
    "quran_direct_count": 50,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 25,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.914,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.292650Z",
  "schema_version": "1.0.0"
}