{
  "behavior_id": "BEH_SPEECH_GOOD_WORD",
  "label_ar": "الكلمة الطيبة",
  "label_en": "Good Word",
  "category": "speech",
  "roots": [
    "ط-ي-ب"
  ],
  "stems": [],
  "synonyms_ar": [
    "قول معروف",
    "قولا سديدا",
    "قولا كريما",
    "كلمة طيبة"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:57",
      "text_ar": "وَظَلَّلْنَا عَلَيْكُمُ ٱلْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ ۖ كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ ۖ وَمَا ظَلَمُونَا وَلَـٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:168",
      "text_ar": "يَـٰٓأَيُّهَا ٱلنَّاسُ كُلُوا۟ مِمَّا فِى ٱلْأَرْضِ حَلَـٰلًا طَيِّبًا وَلَا تَتَّبِعُوا۟ خُطُوَٰتِ ٱلشَّيْطَـٰنِ ۚ إِنَّهُۥ لَكُمْ عَدُوٌّ مُّبِينٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:172",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ وَٱشْكُرُوا۟ لِلَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:267",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ أَنفِقُوا۟ مِن طَيِّبَـٰتِ مَا كَسَبْتُمْ وَمِمَّآ أَخْرَجْنَا لَكُم مِّنَ ٱلْأَرْضِ ۖ وَلَا تَيَمَّمُوا۟ ٱلْخَبِيثَ مِنْهُ تُنفِقُونَ وَلَسْتُم بِـَٔاخِذِيهِ إِلَّآ أَن تُغْمِضُوا۟ فِيهِ ۚ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَنِىٌّ حَمِيدٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:38",
      "text_ar": "هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُۥ ۖ قَالَ رَبِّ هَبْ لِى مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:179",
      "text_ar": "مَّا كَانَ ٱللَّهُ لِيَذَرَ ٱلْمُؤْمِنِينَ عَلَىٰ مَآ أَنتُمْ عَلَيْهِ حَتَّىٰ يَمِيزَ ٱلْخَبِيثَ مِنَ ٱلطَّيِّبِ ۗ وَمَا كَانَ ٱللَّهُ لِيُطْلِعَكُمْ عَلَى ٱلْغَيْبِ وَلَـٰكِنَّ ٱللَّهَ يَجْتَبِى مِن رُّسُلِهِۦ مَن يَشَآءُ ۖ فَـَٔامِنُوا۟ بِٱللَّهِ وَرُسُلِهِۦ ۚ وَإِن تُؤْمِنُوا۟ وَتَتَّقُوا۟ فَلَكُمْ أَجْرٌ عَظِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:2",
      "text_ar": "وَءَاتُوا۟ ٱلْيَتَـٰمَىٰٓ أَمْوَٰلَهُمْ ۖ وَلَا تَتَبَدَّلُوا۟ ٱلْخَبِيثَ بِٱلطَّيِّبِ ۖ وَلَا تَأْكُلُوٓا۟ أَمْوَٰلَهُمْ إِلَىٰٓ أَمْوَٰلِكُمْ ۚ إِنَّهُۥ كَانَ حُوبًا كَبِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:43",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَقْرَبُوا۟ ٱلصَّلَوٰةَ وَأَنتُمْ سُكَـٰرَىٰ حَتَّىٰ تَعْلَمُوا۟ مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِى سَبِيلٍ حَتَّىٰ تَغْتَسِلُوا۟ ۚ وَإِن كُنتُم مَّرْضَىٰٓ أَوْ عَلَىٰ سَفَرٍ أَوْ جَآءَ أَحَدٌ مِّنكُم مِّنَ ٱلْغَآئِطِ أَوْ لَـٰمَسْتُمُ ٱلنِّسَآءَ فَلَمْ تَجِدُوا۟ مَآءً فَتَيَمَّمُوا۟ صَعِيدًا طَيِّبًا فَٱمْسَحُوا۟ بِوُجُوهِكُمْ وَأَيْدِيكُمْ ۗ إِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:160",
      "text_ar": "فَبِظُلْمٍ مِّنَ ٱلَّذِينَ هَادُوا۟ حَرَّمْنَا عَلَيْهِمْ طَيِّبَـٰتٍ أُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَن سَبِيلِ ٱللَّهِ كَثِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:4",
      "text_ar": "يَسْـَٔلُونَكَ مَاذَآ أُحِلَّ لَهُمْ ۖ قُلْ أُحِلَّ لَكُمُ ٱلطَّيِّبَـٰتُ ۙ وَمَا عَلَّمْتُم مِّنَ ٱلْجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُ ۖ فَكُلُوا۟ مِمَّآ أَمْسَكْنَ عَلَيْكُمْ وَٱذْكُرُوا۟ ٱسْمَ ٱللَّهِ عَلَيْهِ ۖ وَٱتَّقُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:5",
      "text_ar": "ٱلْيَوْمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَـٰتُ ۖ وَطَعَامُ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ حِلٌّ لَّكُمْ وَطَعَامُكُمْ حِلٌّ لَّهُمْ ۖ وَٱلْمُحْصَنَـٰتُ مِنَ ٱلْمُؤْمِنَـٰتِ وَٱلْمُحْصَنَـٰتُ مِنَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَـٰبَ مِن قَبْلِكُمْ إِذَآ ءَاتَيْتُمُوهُنَّ أُجُورَهُنَّ مُحْصِنِينَ غَيْرَ مُسَـٰفِحِينَ وَلَا مُتَّخِذِىٓ أَخْدَانٍ ۗ وَمَن يَكْفُرْ بِٱلْإِيمَـٰنِ فَقَدْ حَبِطَ عَمَلُهُۥ وَهُوَ فِى ٱلْـَٔاخِرَةِ مِنَ ٱلْخَـٰسِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:6",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا قُمْتُمْ إِلَى ٱلصَّلَوٰةِ فَٱغْسِلُوا۟ وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى ٱلْمَرَافِقِ وَٱمْسَحُوا۟ بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى ٱلْكَعْبَيْنِ ۚ وَإِن كُنتُمْ جُنُبًا فَٱطَّهَّرُوا۟ ۚ وَإِن كُنتُم مَّرْضَىٰٓ أَوْ عَلَىٰ سَفَرٍ أَوْ جَآءَ أَحَدٌ مِّنكُم مِّنَ ٱلْغَآئِطِ أَوْ لَـٰمَسْتُمُ ٱلنِّسَآءَ فَلَمْ تَجِدُوا۟ مَآءً فَتَيَمَّمُوا۟ صَعِيدًا طَيِّبًا فَٱمْسَحُوا۟ بِوُجُوهِكُمْ وَأَيْدِيكُم مِّنْهُ ۚ مَا يُرِيدُ ٱللَّهُ لِيَجْعَلَ عَلَيْكُم مِّنْ حَرَجٍ وَلَـٰكِن يُرِيدُ لِيُطَهِّرَكُمْ وَلِيُتِمَّ نِعْمَتَهُۥ عَلَيْكُمْ لَعَلَّكُمْ تَشْكُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:87",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تُحَرِّمُوا۟ طَيِّبَـٰتِ مَآ أَحَلَّ ٱللَّهُ لَكُمْ وَلَا تَعْتَدُوٓا۟ ۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْمُعْتَدِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:88",
      "text_ar": "وَكُلُوا۟ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَـٰلًا طَيِّبًا ۚ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِىٓ أَنتُم بِهِۦ مُؤْمِنُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:100",
      "text_ar": "قُل لَّا يَسْتَوِى ٱلْخَبِيثُ وَٱلطَّيِّبُ وَلَوْ أَعْجَبَكَ كَثْرَةُ ٱلْخَبِيثِ ۚ فَٱتَّقُوا۟ ٱللَّهَ يَـٰٓأُو۟لِى ٱلْأَلْبَـٰبِ لَعَلَّكُمْ تُفْلِحُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:32",
      "text_ar": "قُلْ مَنْ حَرَّمَ زِينَةَ ٱللَّهِ ٱلَّتِىٓ أَخْرَجَ لِعِبَادِهِۦ وَٱلطَّيِّبَـٰتِ مِنَ ٱلرِّزْقِ ۚ قُلْ هِىَ لِلَّذِينَ ءَامَنُوا۟ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا خَالِصَةً يَوْمَ ٱلْقِيَـٰمَةِ ۗ كَذَٰلِكَ نُفَصِّلُ ٱلْـَٔايَـٰتِ لِقَوْمٍ يَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:58",
      "text_ar": "وَٱلْبَلَدُ ٱلطَّيِّبُ يَخْرُجُ نَبَاتُهُۥ بِإِذْنِ رَبِّهِۦ ۖ وَٱلَّذِى خَبُثَ لَا يَخْرُجُ إِلَّا نَكِدًا ۚ كَذَٰلِكَ نُصَرِّفُ ٱلْـَٔايَـٰتِ لِقَوْمٍ يَشْكُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:157",
      "text_ar": "ٱلَّذِينَ يَتَّبِعُونَ ٱلرَّسُولَ ٱلنَّبِىَّ ٱلْأُمِّىَّ ٱلَّذِى يَجِدُونَهُۥ مَكْتُوبًا عِندَهُمْ فِى ٱلتَّوْرَىٰةِ وَٱلْإِنجِيلِ يَأْمُرُهُم بِٱلْمَعْرُوفِ وَيَنْهَىٰهُمْ عَنِ ٱلْمُنكَرِ وَيُحِلُّ لَهُمُ ٱلطَّيِّبَـٰتِ وَيُحَرِّمُ عَلَيْهِمُ ٱلْخَبَـٰٓئِثَ وَيَضَعُ عَنْهُمْ إِصْرَهُمْ وَٱلْأَغْلَـٰلَ ٱلَّتِى كَانَتْ عَلَيْهِمْ ۚ فَٱلَّذِينَ ءَامَنُوا۟ بِهِۦ وَعَزَّرُوهُ وَنَصَرُوهُ وَٱتَّبَعُوا۟ ٱلنُّورَ ٱلَّذِىٓ أُنزِلَ مَعَهُۥٓ ۙ أُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "7:160",
      "text_ar": "وَقَطَّعْنَـٰهُمُ ٱثْنَتَىْ عَشْرَةَ أَسْبَاطًا أُمَمًا ۚ وَأَوْحَيْنَآ إِلَىٰ مُوسَىٰٓ إِذِ ٱسْتَسْقَىٰهُ قَوْمُهُۥٓ أَنِ ٱضْرِب بِّعَصَاكَ ٱلْحَجَرَ ۖ فَٱنۢبَجَسَتْ مِنْهُ ٱثْنَتَا عَشْرَةَ عَيْنًا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍ مَّشْرَبَهُمْ ۚ وَظَلَّلْنَا عَلَيْهِمُ ٱلْغَمَـٰمَ وَأَنزَلْنَا عَلَيْهِمُ ٱلْمَنَّ وَٱلسَّلْوَىٰ ۖ كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ ۚ وَمَا ظَلَمُونَا وَلَـٰكِن كَانُوٓا۟ أَنفُسَهُمْ يَظْلِمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:26",
      "text_ar": "وَٱذْكُرُوٓا۟ إِذْ أَنتُمْ قَلِيلٌ مُّسْتَضْعَفُونَ فِى ٱلْأَرْضِ تَخَافُونَ أَن يَتَخَطَّفَكُمُ ٱلنَّاسُ فَـَٔاوَىٰكُمْ وَأَيَّدَكُم بِنَصْرِهِۦ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَـٰتِ لَعَلَّكُمْ تَشْكُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:37",
      "text_ar": "لِيَمِيزَ ٱللَّهُ ٱلْخَبِيثَ مِنَ ٱلطَّيِّبِ وَيَجْعَلَ ٱلْخَبِيثَ بَعْضَهُۥ عَلَىٰ بَعْضٍ فَيَرْكُمَهُۥ جَمِيعًا فَيَجْعَلَهُۥ فِى جَهَنَّمَ ۚ أُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "8:69",
      "text_ar": "فَكُلُوا۟ مِمَّا غَنِمْتُمْ حَلَـٰلًا طَيِّبًا ۚ وَٱتَّقُوا۟ ٱللَّهَ ۚ إِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "9:72",
      "text_ar": "وَعَدَ ٱللَّهُ ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَـٰتِ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ خَـٰلِدِينَ فِيهَا وَمَسَـٰكِنَ طَيِّبَةً فِى جَنَّـٰتِ عَدْنٍ ۚ وَرِضْوَٰنٌ مِّنَ ٱللَّهِ أَكْبَرُ ۚ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:22",
      "text_ar": "هُوَ ٱلَّذِى يُسَيِّرُكُمْ فِى ٱلْبَرِّ وَٱلْبَحْرِ ۖ حَتَّىٰٓ إِذَا كُنتُمْ فِى ٱلْفُلْكِ وَجَرَيْنَ بِهِم بِرِيحٍ طَيِّبَةٍ وَفَرِحُوا۟ بِهَا جَآءَتْهَا رِيحٌ عَاصِفٌ وَجَآءَهُمُ ٱلْمَوْجُ مِن كُلِّ مَكَانٍ وَظَنُّوٓا۟ أَنَّهُمْ أُحِيطَ بِهِمْ ۙ دَعَوُا۟ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ لَئِنْ أَنجَيْتَنَا مِنْ هَـٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّـٰكِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "10:93",
      "text_ar": "وَلَقَدْ بَوَّأْنَا بَنِىٓ إِسْرَٰٓءِيلَ مُبَوَّأَ صِدْقٍ وَرَزَقْنَـٰهُم مِّنَ ٱلطَّيِّبَـٰتِ فَمَا ٱخْتَلَفُوا۟ حَتَّىٰ جَآءَهُمُ ٱلْعِلْمُ ۚ إِنَّ رَبَّكَ يَقْضِى بَيْنَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "14:24",
      "text_ar": "أَلَمْ تَرَ كَيْفَ ضَرَبَ ٱللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِى ٱلسَّمَآءِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:32",
      "text_ar": "ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلْمَلَـٰٓئِكَةُ طَيِّبِينَ ۙ يَقُولُونَ سَلَـٰمٌ عَلَيْكُمُ ٱدْخُلُوا۟ ٱلْجَنَّةَ بِمَا كُنتُمْ تَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:72",
      "text_ar": "وَٱللَّهُ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَٰجًا وَجَعَلَ لَكُم مِّنْ أَزْوَٰجِكُم بَنِينَ وَحَفَدَةً وَرَزَقَكُم مِّنَ ٱلطَّيِّبَـٰتِ ۚ أَفَبِٱلْبَـٰطِلِ يُؤْمِنُونَ وَبِنِعْمَتِ ٱللَّهِ هُمْ يَكْفُرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:97",
      "text_ar": "مَنْ عَمِلَ صَـٰلِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُۥ حَيَوٰةً طَيِّبَةً ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُم بِأَحْسَنِ مَا كَانُوا۟ يَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "16:114",
      "text_ar": "فَكُلُوا۟ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَـٰلًا طَيِّبًا وَٱشْكُرُوا۟ نِعْمَتَ ٱللَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "17:70",
      "text_ar": "وَلَقَدْ كَرَّمْنَا بَنِىٓ ءَادَمَ وَحَمَلْنَـٰهُمْ فِى ٱلْبَرِّ وَٱلْبَحْرِ وَرَزَقْنَـٰهُم مِّنَ ٱلطَّيِّبَـٰتِ وَفَضَّلْنَـٰهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "20:81",
      "text_ar": "كُلُوا۟ مِن طَيِّبَـٰتِ مَا رَزَقْنَـٰكُمْ وَلَا تَطْغَوْا۟ فِيهِ فَيَحِلَّ عَلَيْكُمْ غَضَبِى ۖ وَمَن يَحْلِلْ عَلَيْهِ غَضَبِى فَقَدْ هَوَىٰ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "22:24",
      "text_ar": "وَهُدُوٓا۟ إِلَى ٱلطَّيِّبِ مِنَ ٱلْقَوْلِ وَهُدُوٓا۟ إِلَىٰ صِرَٰطِ ٱلْحَمِيدِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "23:51",
      "text_ar": "يَـٰٓأَيُّهَا ٱلرُّسُلُ كُلُوا۟ مِنَ ٱلطَّيِّبَـٰتِ وَٱعْمَلُوا۟ صَـٰلِحًا ۖ إِنِّى بِمَا تَعْمَلُونَ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "24:26",
      "text_ar": "ٱلْخَبِيثَـٰتُ لِلْخَبِيثِينَ وَٱلْخَبِيثُونَ لِلْخَبِيثَـٰتِ ۖ وَٱلطَّيِّبَـٰتُ لِلطَّيِّبِينَ وَٱلطَّيِّبُونَ لِلطَّيِّبَـٰتِ ۚ أُو۟لَـٰٓئِكَ مُبَرَّءُونَ مِمَّا يَقُولُونَ ۖ لَهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "24:61",
      "text_ar": "لَّيْسَ عَلَى ٱلْأَعْمَىٰ حَرَجٌ وَلَا عَلَى ٱلْأَعْرَجِ حَرَجٌ وَلَا عَلَى ٱلْمَرِيضِ حَرَجٌ وَلَا عَلَىٰٓ أَنفُسِكُمْ أَن تَأْكُلُوا۟ مِنۢ بُيُوتِكُمْ أَوْ بُيُوتِ ءَابَآئِكُمْ أَوْ بُيُوتِ أُمَّهَـٰتِكُمْ أَوْ بُيُوتِ إِخْوَٰنِكُمْ أَوْ بُيُوتِ أَخَوَٰتِكُمْ أَوْ بُيُوتِ أَعْمَـٰمِكُمْ أَوْ بُيُوتِ عَمَّـٰتِكُمْ أَوْ بُيُوتِ أَخْوَٰلِكُمْ أَوْ بُيُوتِ خَـٰلَـٰتِكُمْ أَوْ مَا مَلَكْتُم مَّفَاتِحَهُۥٓ أَوْ صَدِيقِكُمْ ۚ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَأْكُلُوا۟ جَمِيعًا أَوْ أَشْتَاتًا ۚ فَإِذَا دَخَلْتُم بُيُوتًا فَسَلِّمُوا۟ عَلَىٰٓ أَنفُسِكُمْ تَحِيَّةً مِّنْ عِندِ ٱللَّهِ مُبَـٰرَكَةً طَيِّبَةً ۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلْـَٔايَـٰتِ لَعَلَّكُمْ تَعْقِلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "34:15",
      "text_ar": "لَقَدْ كَانَ لِسَبَإٍ فِى مَسْكَنِهِمْ ءَايَةٌ ۖ جَنَّتَانِ عَن يَمِينٍ وَشِمَالٍ ۖ كُلُوا۟ مِن رِّزْقِ رَبِّكُمْ وَٱشْكُرُوا۟ لَهُۥ ۚ بَلْدَةٌ طَيِّبَةٌ وَرَبٌّ غَفُورٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "35:10",
      "text_ar": "مَن كَانَ يُرِيدُ ٱلْعِزَّةَ فَلِلَّهِ ٱلْعِزَّةُ جَمِيعًا ۚ إِلَيْهِ يَصْعَدُ ٱلْكَلِمُ ٱلطَّيِّبُ وَٱلْعَمَلُ ٱلصَّـٰلِحُ يَرْفَعُهُۥ ۚ وَٱلَّذِينَ يَمْكُرُونَ ٱلسَّيِّـَٔاتِ لَهُمْ عَذَابٌ شَدِيدٌ ۖ وَمَكْرُ أُو۟لَـٰٓئِكَ هُوَ يَبُورُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "40:64",
      "text_ar": "ٱللَّهُ ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ قَرَارًا وَٱلسَّمَآءَ بِنَآءً وَصَوَّرَكُمْ فَأَحْسَنَ صُوَرَكُمْ وَرَزَقَكُم مِّنَ ٱلطَّيِّبَـٰتِ ۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمْ ۖ فَتَبَارَكَ ٱللَّهُ رَبُّ ٱلْعَـٰلَمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "45:16",
      "text_ar": "وَلَقَدْ ءَاتَيْنَا بَنِىٓ إِسْرَٰٓءِيلَ ٱلْكِتَـٰبَ وَٱلْحُكْمَ وَٱلنُّبُوَّةَ وَرَزَقْنَـٰهُم مِّنَ ٱلطَّيِّبَـٰتِ وَفَضَّلْنَـٰهُمْ عَلَى ٱلْعَـٰلَمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "46:20",
      "text_ar": "وَيَوْمَ يُعْرَضُ ٱلَّذِينَ كَفَرُوا۟ عَلَى ٱلنَّارِ أَذْهَبْتُمْ طَيِّبَـٰتِكُمْ فِى حَيَاتِكُمُ ٱلدُّنْيَا وَٱسْتَمْتَعْتُم بِهَا فَٱلْيَوْمَ تُجْزَوْنَ عَذَابَ ٱلْهُونِ بِمَا كُنتُمْ تَسْتَكْبِرُونَ فِى ٱلْأَرْضِ بِغَيْرِ ٱلْحَقِّ وَبِمَا كُنتُمْ تَفْسُقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "61:12",
      "text_ar": "يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ وَمَسَـٰكِنَ طَيِّبَةً فِى جَنَّـٰتِ عَدْنٍ ۚ ذَٰلِكَ ٱلْفَوْزُ ٱلْعَظِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_057_chunk00",
        "verse_key": "2:57",
        "text_ar": "{وظللنا عليكم الغمام} في التيه يقيكم حر الشمس، والغمام من الغم وأصله التغطية والستر سمي السحاب غماماً لأنه يغطي وجه الشمس؛ وذلك أنه لم يكن لهم في التيه كن يسترهم فشكوا إلى موسى فأرسل الله تعالى غماماً أبيض رقيقاً أطيب من غمام المطر، وجعل لهم عموداً من نور يضيء لهم الليل إذا لم يكن لهم قمر.{وأنزلنا عليكم المن والسلوى} أي في التيه، الأكثرون على أن المن هو الترنجبين.وقال مجاهد: \"هو شيء كالصمغ كان يقع على الأشجار طعمه كالشهد\".وقال وهب: \"هو الخبز الرقاق\".قال الزجاج: \"جملة المن ما يمن الله به من غير ت",
        "char_start": 0,
        "char_end": 1881,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_168_chunk00",
        "verse_key": "2:168",
        "text_ar": "قوله تعالى: {يا أيها الناس كلوا مما في الأرض حلالاً طيباً} نزلت في ثقيف وخزاعة وعامر بن صعصعة وبني مدلج فيما حرموا على أنفسهم من الحرث والأنعام والبحيرة والسائبة والوصيلة والحام.فالحلال ما أحله الشرع طيباً، قيل: ما يستطاب ويستلذ، والمسلم يستطيب الحلال ويعاف الحرام، وقيل: الطيب الطاهر.{ولا تتبعوا خطوات الشيطان} قرأ أبو جعفر وابن عامر والكسائي وحفص ويعقوب بضم الطاء والباقون بسكونها.وخطوات الشيطان: آثاره وزلاته، وقيل: هي النذر في المعاصي. وقال أبو عبيدة: \"هي المحقرات من الذنوب\"، وقال الزجاج: \"طرقه\"",
        "char_start": 0,
        "char_end": 646,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_172_chunk00",
        "verse_key": "2:172",
        "text_ar": "قوله تعالى ( يا أيها الذين آمنوا كلوا من طيبات ) حلالات ( ما رزقناكم )أخبرنا عبد الواحد المليحي أخبرنا أبو محمد عبد الرحمن بن أبي شريح أخبرنا أبو القاسم عبد الله بن محمد بن عبد العزيز البغوي أخبرنا علي بن الجعد أخبرنا فضيل بن مرزوق عن عدي بن ثابت عن أبي حازم عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم : يا أيها الناس إن الله طيب لا يقبل إلا الطيب وإن الله أمر المؤمنين بما أمر به المرسلين فقال : \" يا أيها الرسل كلوا من الطيبات واعملوا صالحا \" ( 51 - المؤمنون ) وقال ( يا أيها الذين آمنوا كلو",
        "char_start": 0,
        "char_end": 726,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "يا أيها الذين آمنوا أنفقوا من طيبات ) خيار قال ابن مسعود رضي الله عنه ومجاهد : من حلالات ( ما كسبتم ) بالتجارة والصناعة وفيه دلالة على إباحة الكسب وأنه ينقسم إلى طيب وخبيث .أخبرنا عبد الواحد بن أحمد المليحي ، أخبرنا أبو منصور محمد بن محمد بن سمعان ، أخبرنا أبو جعفر الرياني ، أخبرنا حميد بن زنجويه ، أخبرنا يعلى بن عبيد ، أخبرنا الأعمش عن إبراهيم عن الأسود عن عائشة رضي الله عنها قالت : قال رسول الله صلى الله عليه وسلم \" إن أطيب ما يأكل الرجل من كسبه وإن ولده من كسبه \" .أخبرنا عبد الواحد بن أحمد ال",
        "char_start": 0,
        "char_end": 5435,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_038_chunk00",
        "verse_key": "3:38",
        "text_ar": "قال الله تعالى ( هنالك ) أي عند ذلك ( دعا زكريا ربه ) فدخل المحراب [ وأغلق الباب ] وناجى ربه ( قال رب ) أي يا رب ( هب لي ) أعطني ( من لدنك ) أي من عندك ( ذرية طيبة ) أي ولدا مباركا تقيا صالحا رضيا ، والذرية تكون واحدا وجمعا ذكرا وأنثى ، وهو هاهنا واحد ، بدليل قوله عز وجل \" فهب لي من لدنك وليا \" ( 5 - مريم ) وإنما قال : طيبة لتأنيث لفظ الذرية ( إنك سميع الدعاء ) أي سامعه ، وقيل مجيبه ، كقوله تعالى : \" إني آمنت بربكم فاسمعون \" ( 25 - يس ) أي فأجيبوني",
        "char_start": 0,
        "char_end": 452,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_003_179_chunk00",
        "verse_key": "3:179",
        "text_ar": "قوله تعالى : ( ما كان الله ليذر المؤمنين على ما أنتم عليه حتى يميز الخبيث من الطيب ) اختلفوا فيها ، فقال الكلبي : قالت قريش : يا محمد تزعم أن من خالفك فهو في النار والله عليه غضبان ، وأن من اتبعك على دينك فهو في الجنة والله عنه راض ، فأخبرنا بمن يؤمن بك وبمن لا يؤمن بك فأنزل الله تعالى هذه الآية .وقال السدي : قال رسول الله صلى الله عليه وسلم : \" عرضت علي أمتي في صورها في الطين كما عرضت على آدم وأعلمت من يؤمن بي ومن يكفر بي \" فبلغ ذلك المنافقين فقالوا استهزاء : زعم محمد أنه يعلم من يؤمن به ومن يك",
        "char_start": 0,
        "char_end": 2662,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_002_chunk00",
        "verse_key": "4:2",
        "text_ar": "قوله تعالى : ( وآتوا اليتامى أموالهم ) قال مقاتل والكلبي : نزلت في رجل من غطفان كان معه مال كثير لابن أخ له يتيم ، فلما بلغ اليتيم طلب المال فمنعه عمه فترافعا إلى النبي صلى الله عليه وسلم ، فنزلت هذه الآية ، فلما سمعها العم قال : أطعنا الله وأطعنا الرسول نعوذ بالله من الحوب الكبير ، فدفع إليه ماله فقال النبي صلى الله عليه وسلم : \" من يوق شح نفسه ويطع ربه هكذا فإنه يحل داره \" ، يعني : جنته ، فلما قبض الفتى ماله أنفق في سبيل الله ، فقال النبي صلى الله عليه وسلم : \" ثبت الأجر وبقي الوزر \" فقالوا : ",
        "char_start": 0,
        "char_end": 1463,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_043_chunk00",
        "verse_key": "4:43",
        "text_ar": "قوله عز وجل : ( ياأيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى ) الآية ، والمراد من السكر : السكر من الخمر ، عند الأكثرين ، وذلك أن عبد الرحمن بن عوف رضي الله عنه صنع طعاما ودعا ناسا من أصحاب النبي صلى الله عليه وسلم وأتاهم بخمر فشربوها قبل تحريم الخمر وسكروا فحضرت صلاة المغرب فقدموا رجلا ليصلي بهم فقرأ ( قل يا أيها الكافرون ) أعبد ما تعبدون ، بحذف ( لا ) هكذا إلى آخر السورة ، فأنزل الله تعالى هذه الآية ، فكانوا بعد نزول هذه الآية يجتنبون السكر أوقات الصلوات حتى نزل تحريم الخمر .وقال الضحاك بن ",
        "char_start": 0,
        "char_end": 17605,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_004_160_chunk00",
        "verse_key": "4:160",
        "text_ar": "قوله عز وجل : ( فبظلم من الذين هادوا ) وهو ما تقدم ذكره من نقضهم الميثاق وكفرهم بآيات الله وبهتانهم على مريم ، وقولهم : إنا قتلنا المسيح ( حرمنا عليهم طيبات أحلت لهم ) وهي ما ذكر في سورة الأنعام ، فقال : \" وعلى الذين هادوا حرمنا كل ذي ظفر \" ( الأنعام - 146 ) .ونظم الآية : فبظلم من الذين هادوا وهو ما ذكرنا ، ( وبصدهم ) وبصرفهم أنفسهم وغيرهم ، ( عن سبيل الله كثيرا ) أي : عن دين الله صدا كثيرا .",
        "char_start": 0,
        "char_end": 395,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_004_chunk00",
        "verse_key": "5:4",
        "text_ar": "قوله عز وجل : ( يسألونك ماذا أحل لهم ) الآية ، قال سعيد بن جبير : نزلت هذه الآية في عدي بن حاتم وزيد بن المهلهل الطائيين وهو زيد الخيل الذي سماه رسول الله صلى الله عليه وسلم زيد الخير ، قالا يا رسول الله إنا قوم نصيد بالكلاب والبزاة فماذا يحل لنا منها؟ فنزلت هذه الآية .وقيل : سبب نزولها أن النبي صلى الله عليه وسلم لما أمر بقتل الكلاب قالوا : يا رسول الله ماذا يحل لنا من هذه الأمة التي أمرت بقتلها؟ فنزلت هذه الآية فلما نزلت أذن رسول الله صلى الله عليه وسلم في اقتناء الكلاب التي ينتفع بها ، ونهى ع",
        "char_start": 0,
        "char_end": 4420,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "قوله عز وجل : ( اليوم أحل لكم الطيبات ) يعني : الذبائح على اسم الله عز وجل ، ( وطعام الذين أوتوا الكتاب حل لكم ) يريد : ذبائح اليهود والنصارى ومن دخل في دينهم من سائر الأمم قبل مبعث النبي محمد صلى الله عليه وسلم حلال لكم ، فأما من دخل في دينهم بعد مبعث محمد صلى الله عليه وسلم فلا تحل ذبيحته ، ولو ذبح يهودي أو نصراني على اسم غير الله كالنصراني يذبح باسم المسيح فاختلفوا فيه ، قال عمر لا يحل ، وهو قول ربيعة ، وذهب أكثر أهل العلم إلى أنه يحل ، وهو قول الشعبي وعطاء والزهري ومكحول ، سئل الشعبي ومكحول ",
        "char_start": 0,
        "char_end": 2704,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_006_chunk00",
        "verse_key": "5:6",
        "text_ar": "قوله عز وجل : ( يا أيها الذين آمنوا إذا قمتم إلى الصلاة ) أي : إذا أردتم القيام إلى الصلاة ، كقوله تعالى : \" فإذا قرأت القرآن فاستعذ بالله \" ، ( سورة النحل ، 98 ) ، أي : إذا أردت القراءة .وظاهر الآية يقتضي وجوب الوضوء عند كل مرة يريد القيام إلى الصلاة ، لكن أعلمنا ببيان السنة وفعل النبي صلى الله عليه وسلم أن المراد من الآية : \" إذا قمتم إلى الصلاة \" وأنتم على غير طهر ، قال النبي صلى الله عليه وسلم : \" لا يقبل الله صلاة أحدكم إذا أحدث حتى يتوضأ \" .وقد جمع النبي صلى الله عليه وسلم يوم الخندق بين أ",
        "char_start": 0,
        "char_end": 10281,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_087_chunk00",
        "verse_key": "5:87",
        "text_ar": "قوله تعالى : ( ياأيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ) الآية قال أهل التفسير : ذكر النبي صلى الله عليه وسلم الناس يوما ووصف القيامة ، فرق له الناس وبكوا ، فاجتمع عشرة من أصحابه في بيت عثمان بن مظعون الجمحي ، وهم أبو بكر الصديق رضي الله عنه وعلي بن أبي طالب رضي الله عنه ، وعبد الله بن مسعود وعبد الله بن عمر ، وأبو ذر الغفاري وسالم مولى أبي حذيفة ، والمقداد بن الأسود وسلمان الفارسي ، ومعقل بن مقرن رضي الله عنهم ، وتشاوروا واتفقوا على أن يترهبوا ويلبسوا المسوح ويجبوا مذاكيرهم ، ويصوموا",
        "char_start": 0,
        "char_end": 2839,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_088_chunk00",
        "verse_key": "5:88",
        "text_ar": "( وكلوا مما رزقكم الله حلالا طيبا ) قال عبد الله بن المبارك : الحلال ما أخذته من وجهه ، والطيب ما غذى وأنمى ، فأما الجوامد كالطين والتراب وما لا يغذي فمكروه إلا على وجه التداوي .( واتقوا الله الذي أنتم به مؤمنون ) أخبرنا أبو محمد عبد الله بن عبد الصمد الجوزجاني أنا أبو القاسم علي بن أحمد الخزاعي أنا أبو سعيد الهيثم بن كليب أنا أبو عيسى الترمذي أخبرنا أحمد بن إبراهيم الدورقي وسلمة بن شبيب ومحمود بن غيلان قالوا : أخبرنا أبو أسامة عن هشام بن عروة عن أبيه عن عائشة رضي الله عنها قالت : ( كان النبي صل",
        "char_start": 0,
        "char_end": 539,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_005_100_chunk00",
        "verse_key": "5:100",
        "text_ar": "( قل لا يستوي الخبيث والطيب ) أي الحلال والحرام ، ) ( ولو أعجبك ) سرك ) ( كثرة الخبيث ) نزلت في شريح بن [ ضبيعة ] البكري ، وحجاج بن بكر بن وائل ) ( فاتقوا الله ) ولا تتعرضوا للحجاج وإن كانوا مشركين ، وقد مضت القصة في أول السورة ، ( ياأولي الألباب لعلكم تفلحون ) .",
        "char_start": 0,
        "char_end": 263,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_032_chunk00",
        "verse_key": "7:32",
        "text_ar": "قوله - عز وجل - : ( قل من حرم زينة الله التي أخرج لعباده ) يعني لبس الثياب في الطواف ، ( والطيبات من الرزق ) يعني اللحم والدسم في أيام الحج .وعن ابن عباس وقتادة : والطيبات من الرزق ما حرم أهل الجاهلية من البحائر والسوائب .( قل هي للذين آمنوا في الحياة الدنيا خالصة يوم القيامة ) فيه حذف تقديره : هي للذين آمنوا وللمشركين في الحياة الدنيا فإن أهل الشرك يشاركون المؤمنين في طيبات الدنيا ، وهي في الآخرة خالصة للمؤمنين لا حظ للمشركين فيها .وقيل : هي خالصة يوم القيامة من التنغيص والغم للمؤمنين ، فإنها ل",
        "char_start": 0,
        "char_end": 708,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_058_chunk00",
        "verse_key": "7:58",
        "text_ar": "قوله - عز وجل - : ( والبلد الطيب يخرج نباته بإذن ربه ) هذا مثل ضربه الله - عز وجل - للمؤمن والكافر فمثل المؤمن مثل البلد الطيب ، يصيبه المطر فيخرج نباته بإذن ربه ، ( والذي خبث ) يريد الأرض السبخة التي ( لا يخرج ) نباتها ، ( إلا نكدا ) قرأ أبو جعفر بفتح الكاف ، وقرأ الآخرون بكسرها ، أي : عسرا قليلا بعناء ومشقة .فالأول : مثل المؤمن الذي إذا سمع القرآن وعاه وعقله وانتفع به ، والثاني : مثل الكافر الذي يسمع القرآن فلا يؤثر فيه ، كالبلد الخبيث الذي لا يتبين أثر المطر فيه ( كذلك نصرف الآيات ) نبينها ، ",
        "char_start": 0,
        "char_end": 1144,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_157_chunk00",
        "verse_key": "7:157",
        "text_ar": "( الذين يتبعون الرسول النبي الأمي ) الآية . قال نوف البكالي الحميري : لما اختار موسى قومه سبعين رجلا قال الله تعالى لموسى : أجعل لكم الأرض مسجدا وطهورا ، تصلون حيث أدركتكم الصلاة إلا عند مرحاض أو حمام أو قبر ، وأجعل السكينة في قلوبكم ، وأجعلكم تقرأون التوراة عن ظهر قلوبكم ، يقرؤها الرجل والمرأة ، والحر والعبد ، والصغير والكبير ، فقال ذلك موسى لقومه ، فقالوا : لا نريد أن نصلي إلا في الكنائس ، ولا نستطيع حمل السكينة في قلوبنا ، ولا نستطيع أن نقرأ التوراة عن ظهور قلوبنا ، ولا نريد أن نقرأها إلا نظر",
        "char_start": 0,
        "char_end": 3914,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_007_160_chunk00",
        "verse_key": "7:160",
        "text_ar": "قوله - عز وجل - : ( وقطعناهم ) أي : فرقناهم ، يعني بني إسرائيل ، ( اثنتي عشرة أسباطا أمما )قال الفراء : إنما قال : \" اثنتي عشرة \" ، والسبط مذكر لأنه قال : \" أمما \" فرجع التأنيث إلى الأمم ، وقال الزجاج : المعنى وقطعناهم اثنتي عشرة أمما ، وإنما قال : \" أسباطا أمما \" ، بالجمع وما فوق العشرة لا يفسر بالجمع ، فلا يقال : أتاني اثنا عشر رجالا لأن الأسباط في الحقيقة نعت المفسر المحذوف وهو الفرقة ، أي : وقطعناهم اثنتي عشرة فرقة أمما .وقيل : فيه تقديم وتأخير ، تقديره : وقطعناهم أسباطا أمما اثنتي عشرة ، وا",
        "char_start": 0,
        "char_end": 937,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_008_026_chunk00",
        "verse_key": "8:26",
        "text_ar": "قوله تعالى : ( واذكروا إذ أنتم قليل مستضعفون في الأرض ) يقول : واذكروا يا معشر المهاجرين إذ أنتم قليل في العدد ، مستضعفون في أرض مكة ، في ابتداء الإسلام ، ( تخافون أن يتخطفكم الناس ) يذهب بكم الناس ، يعني : كفار مكة . وقال عكرمة : كفار العرب : وقال وهب : فارس والروم ، ( فآواكم ) إلى المدينة ، ( وأيدكم بنصره ) أي : قواكم يوم بدر بالأنصار . وقال الكلبي : قواكم يوم بدر بالملائكة ، ( ورزقكم من الطيبات ) يعني : الغنائم ، أحلها لكم ولم يحلها لأحد قبلكم ، ( لعلكم تشكرون )",
        "char_start": 0,
        "char_end": 469,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_057_chunk00",
        "verse_key": "2:57",
        "text_ar": "لما ذكر تعالي ما دفعه عنهم من النقم ، شرع يذكرهم - ايضا - بما اسبغ عليهم من النعم ، فقال : ( وظللنا عليكم الغمام ) وهو جمع غمامه ، سمي بذلك لانه يغم السماء ، اي : يواريها ويسترها . وهو السحاب الابيض ، ظللوا به في التيه ليقيهم حر الشمس . كما رواه النسايي وغيره عن ابن عباس في حديث الفتون ، قال : ثم ظلل عليهم في التيه بالغمام .قال ابن ابي حاتم : وروي عن ابن عمر ، والربيع بن انس ، وابي مجلز ، والضحاك ، والسدي ، نحو قول ابن عباس .وقال الحسن وقتاده : ( وظللنا عليكم الغمام ) [ قال ] كان هذا في البريه ظ",
        "char_start": 0,
        "char_end": 12018,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_168_chunk00",
        "verse_key": "2:168",
        "text_ar": "ما بين تعالي انه لا اله الا هو ، وانه المستقل بالخلق ، شرع يبين انه الرزاق لجميع خلقه ، فذكر [ ذلك ] في مقام الامتنان انه اباح لهم ان ياكلوا مما في الارض في حال كونه حلالا من الله طيبا ، اي : مستطابا في نفسه غير ضار للابدان ولا للعقول ، ونهاهم عن اتباع خطوات الشيطان ، وهي : طرايقه ومسالكه فيما اضل اتباعه فيه من تحريم البحاير والسوايب والوصايل ونحوها مما زينه لهم في جاهليتهم ، كما في حديث عياض بن حمار الذي في صحيح مسلم ، عن رسول الله صلي الله عليه وسلم انه قال : \" يقول الله تعالي : ان كل ما امنحه",
        "char_start": 0,
        "char_end": 2758,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_172_chunk00",
        "verse_key": "2:172",
        "text_ar": "يقول تعالي امرا عباده المومنين بالاكل من طيبات ما رزقهم تعالي ، وان يشكروه علي ذلك ، ان كانوا عبيده ، والاكل من الحلال سبب لتقبل الدعاء والعباده ، كما ان الاكل من الحرام يمنع قبول الدعاء والعباده ، كما جاء في الحديث الذي رواه الامام احمد :حدثنا ابو النضر ، حدثنا الفضيل بن مرزوق ، عن عدي بن ثابت ، عن ابي حازم ، عن ابي هريره قال : قال رسول الله صلي الله عليه وسلم : \" ايها الناس ، ان الله طيب لا يقبل الا طيبا ، وان الله امر المومنين بما امر به المرسلين ، فقال : ( يا ايها الرسل كلوا من الطيبات واعمل",
        "char_start": 0,
        "char_end": 814,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "يامر تعالي عباده المومنين بالانفاق والمراد به الصدقه هاهنا ; قاله ابن عباس من طيبات ما رزقهم من الاموال التي اكتسبوها . قال مجاهد : يعني التجاره بتيسيره اياها لهم .وقال علي والسدي : ( من طيبات ما كسبتم ) يعني : الذهب والفضه ، ومن الثمار والزروع التي انبتها لهم من الارض .قال ابن عباس : امرهم بالانفاق من اطيب المال واجوده وانفسه ، ونهاهم عن التصدق برذاله المال ودنيه وهو خبيثه فان الله طيب لا يقبل الا طيبا ، ولهذا قال : ( ولا تيمموا ) اي : تقصدوا ( الخبيث منه تنفقون ولستم باخذيه ) اي : لو اعطيتموه ",
        "char_start": 0,
        "char_end": 5451,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_038_chunk00",
        "verse_key": "3:38",
        "text_ar": "لما راي زكريا ، عليه السلام ، ان الله تعالي يرزق مريم ، عليها السلام ، فاكهه الشتاء في الصيف ، وفاكهه الصيف في الشتاء ، طمع حينيذ في الولد ، و [ ان ] كان شيخا كبيرا قد [ ضعف و ] وهن منه العظم ، واشتعل راسه شيبا ، وان كانت امراته مع ذلك كبيره وعاقرا ، لكنه مع هذا كله سال ربه وناداه نداء خفيا ، وقال : ( رب هب لي من لدنك ) اي : من عندك ( ذريه طيبه ) اي : ولدا صالحا ( انك سميع الدعاء ) .",
        "char_start": 0,
        "char_end": 386,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_003_179_chunk00",
        "verse_key": "3:179",
        "text_ar": "م قال تعالي : ( ما كان الله ليذر المومنين علي ما انتم عليه حتي يميز الخبيث من الطيب ) اي : لا بد ان يعقد سببا من المحنه ، يظهر فيه وليه ، ويفتضح فيه عدوه . يعرف به المومن الصابر ، والمنافق الفاجر . يعني بذلك يوم احد الذي امتحن به المومنين ، فظهر به ايمانهم وصبرهم وجلدهم [ وثباتهم ] وطاعتهم لله ولرسوله صلي الله عليه وسلم ، وهتك به ستر المنافقين ، فظهر مخالفتهم ونكولهم عن الجهاد وخيانتهم لله ولرسوله [ صلي الله عليه وسلم ] ولهذا قال : ( ما كان الله ليذر المومنين علي ما انتم عليه حتي يميز الخبيث من ",
        "char_start": 0,
        "char_end": 1238,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_002_chunk00",
        "verse_key": "4:2",
        "text_ar": "يامر تعالي بدفع اموال اليتامي اليهم اذا بلغوا الحلم كامله موفره ، وينهي عن اكلها وضمها الي اموالهم; ولهذا قال : ( ولا تتبدلوا الخبيث بالطيب ) قال سفيان الثوري ، عن ابي صالح : لا تعجل بالرزق الحرام قبل ان ياتيك الرزق الحلال الذي قدر لك .وقال سعيد بن جبير : لا تبدلوا الحرام من اموال الناس بالحلال من اموالكم ، يقول : لا تبذروا اموالكم الحلال وتاكلوا اموالهم الحرام .وقال سعيد بن المسيب والزهري : لا تعط مهزولا وتاخذ سمينا .وقال ابراهيم النخعي والضحاك : لا تعط زايفا وتاخذ جيدا .وقال السدي : كان احدهم ",
        "char_start": 0,
        "char_end": 1938,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_043_chunk00",
        "verse_key": "4:43",
        "text_ar": "ينهي تعالي عباده المومنين عن فعل الصلاه في حال السكر ، الذي لا يدري معه المصلي ما يقول ، وعن قربان محلها - وهي المساجد - للجنب ، الا ان يكون مجتازا من باب الي باب من غير مكث وقد كان هذا قبل تحريم الخمر ، كما دل الحديث الذي ذكرناه في سوره البقره ، عند قوله [ تعالي ] ( يسالونك عن الخمر والميسر [ قل فيهما اثم كبير ] ) الايه [ البقره : 219 ] ; فان رسول الله صلي الله عليه وسلم تلاها علي عمر ، فقال : اللهم بين لنا في الخمر بيانا شافيا . فلما نزلت هذه الايه ، تلاها عليه ، فقال : اللهم بين لنا في الخمر ",
        "char_start": 0,
        "char_end": 28999,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_004_160_chunk00",
        "verse_key": "4:160",
        "text_ar": "يخبر ، تعالي ، انه بسبب ظلم اليهود بما ارتكبوه من الذنوب العظيمه ، حرم عليهم طيبات كان احلها لهم ، كما قال ابن ابي حاتم :حدثنا محمد بن عبد الله بن يزيد المقري ، حدثنا سفيان بن عيينه ، عن عمرو ، وقال : قرا ابن عباس : \" طيبات كانت احلت لهم \" .وهذا التحريم قد يكون قدريا ، بمعني : انه تعالي قيضهم لان تاولوا في كتابهم ، وحرفوا وبدلوا اشياء كانت حلالا لهم ، فحرموها علي انفسهم ، تشديدا منهم علي انفسهم وتضييقا وتنطعا . ويحتمل ان يكون شرعيا بمعني : انه تعالي حرم عليهم في التوراه اشياء كانت حلالا لهم قبل ",
        "char_start": 0,
        "char_end": 1413,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_004_chunk00",
        "verse_key": "5:4",
        "text_ar": "لما ذكر تعالي ما حرمه في الايه المتقدمه من الخبايث الضاره لمتناولها ، اما في بدنه ، او في دينه ، او فيهما ، واستثني ما استثناه في حاله الضروره ، كما قال : ( وقد فصل لكم ما حرم عليكم الا ما اضطررتم اليه ) [ الانعام : 119 ] قال بعدها : ( يسالونك ماذا احل لهم قل احل لكم الطيبات ) كما [ قال ] في سوره الاعراف في صفه محمد صلي الله عليه وسلم : انه ( يحل لهم الطيبات ويحرم عليهم الخبايث ) [ الايه : 157 ] .قال ابن ابي حاتم : حدثنا ابو زرعه ، حدثنا يحيي بن عبد الله بن بكير ، حدثني عبد الله بن لهيعه ، حدثني",
        "char_start": 0,
        "char_end": 15452,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "لما ذكر تعالي ما حرمه علي عباده المومنين من الخبايث ، وما احله لهم من الطيبات ، قال بعده : ( اليوم احل لكم الطيبات )ثم ذكر حكم ذبايح اهل الكتابين من اليهود والنصاري فقال : ( وطعام الذين اوتوا الكتب حل لكم ) قال ابن عباس وابو امامه ومجاهد وسعيد بن جبير وعكرمه وعطاء والحسن ومكحول وابراهيم النخعي والسدي ومقاتل بن حيان : يعني ذبايحهم .وهذا امر مجمع عليه بين العلماء ؛ ان ذبايحهم حلال للمسلمين ; لانهم يعتقدون تحريم الذبح لغير الله ، ولا يذكرون علي ذبايحهم الا اسم الله ، وان اعتقدوا فيه تعالي ما هو منز",
        "char_start": 0,
        "char_end": 8045,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_006_chunk00",
        "verse_key": "5:6",
        "text_ar": "قال كثيرون من السلف : قوله : ( اذا قمتم الي الصلاه ) معناه وانتم محدثون .وقال اخرون : اذا قمتم من النوم الي الصلاه ، وكلاهما قريب .وقال اخرون : بل المعني اعم من ذلك ، فالايه امره بالوضوء عند القيام الي الصلاه ، ولكن هو في حق المحدث علي سبيل الايجاب ، وفي حق المتطهر علي سبيل الندب والاستحباب . وقد قيل : ان الامر بالوضوء لكل صلاه كان واجبا في ابتداء الاسلام ، ثم نسخ .قال الامام احمد بن حنبل : حدثنا عبد الرحمن ، حدثنا سفيان ، عن علقمه بن مرثد ، عن سليمان بن بريده عن ابيه قال : كان النبي صلي الله عل",
        "char_start": 0,
        "char_end": 33118,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_087_chunk00",
        "verse_key": "5:87",
        "text_ar": "قال علي بن ابي طلحه ، عن ابن عباس : نزلت هذه الايه في رهط من اصحاب النبي صلي الله عليه وسلم ، قالوا : نقطع مذاكيرنا ، ونترك شهوات الدنيا ، ونسيح في الارض كما يفعل الرهبان . فبلغ ذلك النبي صلي الله عليه وسلم ، فارسل اليهم ، فذكر لهم ذلك : فقالوا : نعم . فقال النبي صلي الله عليه وسلم : \" لكني اصوم وافطر ، واصلي وانام ، وانكح النساء ، فمن اخذ بسنتي فهو مني ، ومن لم ياخذ بسنتي فليس مني \" . رواه ابن ابي حاتم .وروي ابن مردويه من طريق العوفي ، عن ابن عباس نحو ذلك .وفي الصحيحين عن عايشه رضي الله عنها ; ",
        "char_start": 0,
        "char_end": 7434,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_088_chunk00",
        "verse_key": "5:88",
        "text_ar": "ثم قال : ( وكلوا مما رزقكم الله حلالا ) اي : في حال كونه حلالا طيبا ( واتقوا الله ) اي : في جميع اموركم ، واتبعوا طاعته ورضوانه ، واتركوا مخالفته وعصيانه ( الذي انتم به مومنون )",
        "char_start": 0,
        "char_end": 177,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_005_100_chunk00",
        "verse_key": "5:100",
        "text_ar": "قول تعالي لرسوله - صلي الله عليه وسلم - : ( قل ) يا محمد : ( لا يستوي الخبيث والطيب ولو اعجبك ) اي : يا ايها الانسان ( كثره الخبيث ) يعني : ان القليل الحلال النافع خير من الكثير الحرام الضار ، كما جاء في الحديث : \" ما قل وكفي ، خير مما كثر والهي \" .وقال ابو القاسم البغوي في معجمه : حدثنا احمد بن زهير ، حدثنا الحوطي ، حدثنا محمد بن شعيب ، حدثنا معان بن رفاعه ، عن ابي عبد الملك علي بن يزيد ، عن القاسم ، عن ابي امامه انه اخبره عن ثعلبه بن حاطب الانصاري انه قال : يا رسول الله ، ادع الله ان يرزقني ما",
        "char_start": 0,
        "char_end": 744,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_032_chunk00",
        "verse_key": "7:32",
        "text_ar": "يقول تعالي ردا علي من حرم شييا من الماكل او المشارب ، والملابس ، من تلقاء نفسه ، من غير شرع من الله : ( قل ) يا محمد ، لهولاء المشركين الذين يحرمون ما يحرمون بارايهم الفاسده وابتداعهم : ( من حرم زينه الله التي اخرج لعباده والطيبات من الرزق قل هي للذين امنوا في الحياه الدنيا خالصه يوم القيامه ) الايه ، اي : هي مخلوقه لمن امن بالله وعبده في الحياه الدنيا ، وان شركهم فيها الكفار حسا في الدنيا ، فهي لهم خاصه يوم القيامه ، لا يشركهم فيها احد من الكفار ، فان الجنه محرمه علي الكافرين .قال ابو القاسم ال",
        "char_start": 0,
        "char_end": 772,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_058_chunk00",
        "verse_key": "7:58",
        "text_ar": "وقوله : ( والبلد الطيب يخرج نباته باذن ربه ) اي : والارض الطيبه يخرج نباتها سريعا حسنا ، كما قال : ( فتقبلها ربها بقبول حسن وانبتها نباتا حسنا ) [ ال عمران : 37 ] .( والذي خبث لا يخرج الا نكدا ) قال مجاهد وغيره : كالسباخ ونحوها .وقال علي بن ابي طلحه ، عن ابن عباس في الايه : هذا مثل ضربه الله للمومن والكافر .وقال البخاري : حدثنا محمد بن العلاء ، حدثنا حماد بن اسامه عن بريد بن عبد الله ، عن ابي برده ، عن ابي موسي ، رضي الله عنه ، قال : قال رسول الله صلي الله عليه وسلم : \" مثل ما بعثني الله به من ا",
        "char_start": 0,
        "char_end": 923,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_157_chunk00",
        "verse_key": "7:157",
        "text_ar": "الذين يتبعون الرسول النبي الامي الذي يجدونه مكتوبا عندهم في التوراه والانجيل ) وهذه صفه محمد صلي الله عليه وسلم في كتب الانبياء بشروا اممهم ببعثه وامروهم بمتابعته ، ولم تزل صفاته موجوده في كتبهم يعرفها علماوهم واحبارهم كما قال الامام احمد :حدثنا اسماعيل ، عن الجريري ، عن ابي صخر العقيلي ، حدثني رجل من الاعراب ، قال : جلبت جلوبه الي المدينه في حياه رسول الله صلي الله عليه وسلم ، فلما فرغت من بيعتي قلت : لالقين هذا الرجل فلاسمعن منه ، قال : فتلقاني بين ابي بكر وعمر يمشون ، فتبعتهم في اقفايهم حتي ا",
        "char_start": 0,
        "char_end": 13078,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_007_160_chunk00",
        "verse_key": "7:160",
        "text_ar": "يقول تعالي واذكروا نعمتي عليكم في اجابتي لنبيكم موسي عليه السلام حين استسقاني لكم وتيسيري لكم الماء واخراجه لكم من حجر يحمل معكم وتفجيري الماء لكم منه من ثنتي عشره عينا كل سبط من اسباطكم عين قد عرفوها فكلو من المن والسلوي واشربوا من هذا الماء الذي انبعته لكم بلا سعي منكم ولا كد واعبدوا الذي سخر لكم ذلك \"ولا تعثوا في الارض مفسدين\" ولا تقابلوا النعم بالعصيان فتسلبوها.وقد بسطه المفسرون في كلامهم كما قال: ابن عباس رضي الله عنه وجعل بين ظهرانيهم حجر مربع وامر موسي عليه السلام فضربه بعصاه فانفجرت منه ",
        "char_start": 0,
        "char_end": 13423,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_008_026_chunk00",
        "verse_key": "8:26",
        "text_ar": "ينبه تعالي عباده المومنين علي نعمه عليهم واحسانه اليهم ، حيث كانوا قليلين فكثرهم ، ومستضعفين خايفين فقواهم ونصرهم ، وفقراء عاله فرزقهم من الطيبات ، واستشكرهم فاطاعوه ، وامتثلوا جميع ما امرهم . وهذا كان حال المومنين حال مقامهم بمكه قليلين مستخفين مضطرين يخافون ان يتخطفهم الناس من ساير بلاد الله ، من مشرك ومجوسي ورومي ، كلهم اعداء لهم لقلتهم وعدم قوتهم ، فلم يزل ذلك دابهم حتي اذن الله لهم في الهجره الي المدينه ، فاواهم اليها ، وقيض لهم اهلها ، اووا ونصروا يوم بدر وغيره واسوا باموالهم ، وبذلوا مهجه",
        "char_start": 0,
        "char_end": 1171,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_057_chunk00",
        "verse_key": "2:57",
        "text_ar": "«وظلَّلنا عليكم الغمام» سترناكم بالسحاب الرقيق من حر الشمس في التيه «وأنزلنا عليكم» فيه «المن والسلوى» هما الترنجبين والطير السماني بتخفيف الميم والقصر، وقلنا: «كلوا من طيبات ما رزقناكم» ولا تدَّخروا، فكفروا النعمة وادخروا فقطع عنهم «وما ظلمونا» بذلك «ولكن كانوا أنفسهم يظلمون» لأن وباله عليهم.",
        "char_start": 0,
        "char_end": 294,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_168_chunk00",
        "verse_key": "2:168",
        "text_ar": "ونزل فيمن حرَّم السوائب ونحوها: «يا أيها الناس كلوا مما في الأرض حلالا» حال «طيبا» صفة مؤكدة أي مستلذاً «ولا تتبعوا خطوات» طرق «الشيطان» أي تزيينه «إنه لكم عدو مبين» بَيِّنُ العداوة.",
        "char_start": 0,
        "char_end": 182,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_172_chunk00",
        "verse_key": "2:172",
        "text_ar": "«يا أيها الذين آمنوا كلوا من طيِّبات» حلالات «ما رزقناكم واشكروا لله» على ما أحل لكم «إن كنتم إياه تعبدون».",
        "char_start": 0,
        "char_end": 107,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "«يا أيها الذين آمنوا أنفقوا» أي زكوا «من طيبات» جياد «ما كسبتم» من المال «ومـ» ـن طيبات «ما أخرجنا لكم من الأرض» من الحبوب والثمار «ولا تيمموا» تقصدوا «الخبيث» الرديء «منه» أي من المذكور «تنفقونـ» ـه في الزكاة حال من ضمير تيمموا «ولستم بآخذيه» أي الخبيث لو أعطيتموه في حقوقكم «إلا أن تغمضوا فيه» بالتساهل وغض البصر فكيف تؤدون منه حق الله «واعلموا أن الله غني» عن نفقاتكم «حميد» محمود على كل حال.",
        "char_start": 0,
        "char_end": 395,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_038_chunk00",
        "verse_key": "3:38",
        "text_ar": "«هنالك» أي لما رأى زكريَّا ذلك وعلم أن القادر على الإتيان بالشيء في غير حينه قادر على الإتيان بالولد على الكبر وكان أهل بيته انقرضوا «دعا زَكَريَّاُ ربَّه» لما دخل المحراب للصلاة جوف الليل «قال ربِّ هب لي من لدنك» من عندك «ذرية طيبة» ولدا صالحا «إنك سميع» مجيب «الدعاء».",
        "char_start": 0,
        "char_end": 270,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_003_179_chunk00",
        "verse_key": "3:179",
        "text_ar": "«ما كان الله ليذر» ليترك «المؤمنين على ما أنتم» أيها الناس «عليه» من اختلاط المخلص بغيره «حتى يَمِيزَ» بالتخفيف والتشديد يفصل «الخبيث» المنافق «من الطيب» المؤمن بالتكاليف الشاقة المبينة لذلك ففعل ذلك يوم أحد «وما كان الله ليطلعكم على الغيب» فتعرفوا المنافق من غيره قبل التمييز «ولكنَّ الله يجتبي» يختار «من رسله من يشاء» فيطلعه على غيبه كما أطلع النبي صلى الله عليه وسلم على حال المنافقين «فآمنوا بالله ورسله وإن تؤمنوا وتتقوا» النفاق «فلكم أجر عظيم».",
        "char_start": 0,
        "char_end": 451,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_002_chunk00",
        "verse_key": "4:2",
        "text_ar": "ونزل في يتيم طلب من وليه ماله فمنعه: «وآتوا اليتامى» الصغار الذين لا أب لهم «أموالهم» إذا بلغوا «ولا تتبدلوا الخبيث» الحرام «بالطيب» الحلال أي تأخذوه بدله كما تفعلون من أخذ الجيد من مال اليتيم وجعل الرديء من مالكم مكانه «ولا تأكلوا أموالهم» مضمومة «إلى أموالكم إنه» أي أكلها «كان حوبا» ذنبا «كبيرا» عظيما ولما نزلت تحرجوا من ولاية اليتامى وكان فيهم من تحته العشر أو الثمان من الأزواج فلا يعدل بينهن فنزل.",
        "char_start": 0,
        "char_end": 404,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_043_chunk00",
        "verse_key": "4:43",
        "text_ar": "«يا أيها الذين آمنوا لا تقربوا الصلاة» أي لا تصلوا «وأنتم سكارى» من الشراب لأن سبب نزولها صلاة جماعة في حال سكر «حتى تعلموا ما تقولون» بأن تصْحوا «ولا جُنُبا» بإيلاج أو إنزال ونصبه على الحال وهو يطلق على المفرد وغيره «إلا عابري» مجتازي «سبيل» طريق أي مسافرين «حتى تغتسلوا» فلكم أن تصلوا واستثناء المسافر لأن له حكما آخر سيأتي وقيل المراد النهي عن قربان مواضع الصلاة أي المساجد إلا عبورها من غير مكث «وإن كنتم مرضى» مرضا يضره الماء «أو على سفر» أي مسافرين وأنتم جنب أو محدثون «أو جاء أحد منكم من الغائ",
        "char_start": 0,
        "char_end": 942,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_004_160_chunk00",
        "verse_key": "4:160",
        "text_ar": "«فبظلم» أي فبسبب ظلم «من الذين هادوا» هم اليهود «حرمنا عليهم طيبات أحلت لهم» من التي في قوله تعالى: (حرمنا كل ذي ظفر) الآية «وبصدهم» الناس «عن سبيل الله» دينه صدا «كثيرا».",
        "char_start": 0,
        "char_end": 171,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_004_chunk00",
        "verse_key": "5:4",
        "text_ar": "«يسئلونك» يا محمد «ماذا أُحل لهم» من الطعام «قل أحل لكم الطيَّبات» المستلذات «و» صيد «ما علَّمتم من الجوارح» الكواسب من الكلاب والسباع والطير «مكلِّبين» حال من كلَّبت الكلب بالتشديد أي أرسلته على الصيد «تعلمونهن» حال من ضمير مكلبين أي تؤدبونهن «مما علَّمَكُمُ الله» من آداب الصيد «فكلوا مما أمسكن عليكم» وإن قتلته بأن لم يأكلن منه بخلاف غير المعلمة فلا يحل صيدها وعلامتها أن تترسل إذا أرسلت وتنزجر إذا زجرت وتمسك الصيد ولا تأكل منه وأقل ما يعرف به ثلاث مرات فإن أكلت منه فليس مما أمسكن على صاحبها فلا",
        "char_start": 0,
        "char_end": 669,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "«اليوم أحل لكم الطيبات» المستلذات «وطعام الذين أوتوا الكتاب» أي ذبائح اليهود والنصارى «حلٌ» حلال «لكم وطعامكم» إياهم «حل لهم والمحصنات من المؤمنات والمحصنات» الحرائر «من الذين أوتوا الكتاب من قبلكم» حل لكم أن تنكحوهن «إذا آتيتموهنَّ أجورهنَّ» مهورهنَّ «محصنين» متزوجين «غير مسافحين» معلنين بالزنا بهن «ولا متخذي أخدان» منهن تسرون بالزنا بهن «ومن يكفر بالإيمان» أي يرتد «فقد حبط عمله» الصالح قبل ذلك فلا يعتد به ولا يثاب عليه «وهو في الآخرة من الخاسرين» إذا مات عليه.",
        "char_start": 0,
        "char_end": 466,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_006_chunk00",
        "verse_key": "5:6",
        "text_ar": "«يا أيها الذين آمنوا إذا قمتم» أي أردتم القيام «إلى الصلاة» وأنتم محدثون «فاغسلوا وجوهكم وأيديكم إلى المرافق» أي معها كما بينته السنة «وامسحوا برؤوسكم» الباء للإلصاق أي ألصقوا المسح بها من غير إسالة ماء وهو اسم جنس فيكفي أقل ما يصدق عليه وهو مسح بعض شعرة وعليه الشافعي «وأرجلكم» بالنصب عطفا على أيديكم وبالجر على الجوار «إلى الكعبين» أي معهما كما بينته السنة وهما العظمان الناتئان في كل رجل عند مفصل الساق والقدم والفصل بين الأيدي والأرجل المغسولة بالرأس المسموح يفيد وجوب الترتيب في طهارة هذه الأعضا",
        "char_start": 0,
        "char_end": 1100,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_087_chunk00",
        "verse_key": "5:87",
        "text_ar": "ونزل لما همَّ قوم من الصحابة أن يلازموا الصوم والقيام ولا يقربوا النساء والطيب ولا يأكلوا اللحم ولا يناموا على الفراش «يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا» تتجاوزوا أمر الله «إن الله لا يحب المعتدين».",
        "char_start": 0,
        "char_end": 227,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_088_chunk00",
        "verse_key": "5:88",
        "text_ar": "«وكلوا مما رزقكم الله حلالا طيبا» مفعول والجار والمجرور قبله حال متعلق به «واتقوا الله الذي أنتم به مؤمنون».",
        "char_start": 0,
        "char_end": 108,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_005_100_chunk00",
        "verse_key": "5:100",
        "text_ar": "«قل لا يستوي الخبيث» الحرام «والطيب» الحلال «ولو أعجبك» أي سرك «كثرة الخبيث فاتقوا الله» في تركه «يا أولي الألباب لعلكم تفلحون» تفوزون.",
        "char_start": 0,
        "char_end": 135,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_032_chunk00",
        "verse_key": "7:32",
        "text_ar": "«قل» إنكارا عليهم «من حرَّم زينة الله التي أخرج لعباده» من اللباس «والطيبات» المستلذات «من الرزق قل هي للذين آمنوا في الحياة الدنيا» بالاستحقاق وإن فيها غيرهم «خالصةٌ» خاصة بهم بالرفع والنصب حال «يوم القيامة كذلك نفصِّل الآيات» نبينها مثل ذلك التفصيل «قوم يعلمون» يتدبَّرون فإنهم المنتفعون بها.",
        "char_start": 0,
        "char_end": 294,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_058_chunk00",
        "verse_key": "7:58",
        "text_ar": "«والبلد الطيب» العذب التراب «يخرج نباته» حسنا «بإذن ربه» هذا مثل للمؤمن يسمع الموعظة فينتفع بها «والذي خبث» ترابه «لا يخرج» نباته «إلا نكدا» عسرا بمشقة وهذا مثل للكافر «كذلك» كما بينا ما ذكر «نُصرِّف» نبين «الآيات لقوم يشكرون» الله يؤمنون.",
        "char_start": 0,
        "char_end": 239,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_157_chunk00",
        "verse_key": "7:157",
        "text_ar": "«الذين يتبعون الرسول النبي الأمي» محمدا صلى الله عليه وسلم «الذي يجدونه مكتوبا عندهم في التوراة والإنجيل» باسمه وصفته «يأمرهم بالمعروف وينهاهم عن المنكر ويحل لهم الطيبات» مما حُرم في شرعهم «ويحرم عليهم الخبائث» من الميتة ونحوها «ويضع عنهم إصرَهُم» ثقلهم «والأغلال» الشدائد «التي كانت عليهم» كقتل النفس من التوبة وقطع أثر النجاسة. «فالذين آمنوا به» منهم «وعَزَّروه» ووقروه «ونصروه واتبعوا النور الذي أنزل معه» أي القرآن «أولئك هم المفلحون».",
        "char_start": 0,
        "char_end": 439,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_007_160_chunk00",
        "verse_key": "7:160",
        "text_ar": "«وقَطَّعناهم» فّرَّقنا بني إسرائيل «اثنتي عشرة» حال «أسباطا» بدل منه، أي قبائل «أمما» بدل مما قبله «وأوحينا إلى موسى إذ استسقاه قومه» في التيه «أن اضرب بعصاك الحجر» فضربه «فانبجست» انفجرت «منه اثنتا عشرة عينا» بعدد الأسباط «قد علم كل أُناس» سبط منهم «مشربهم وظللنا عليهم الغمام» في التيه من حر الشمس «وأنزلنا عليهم المن والسلوى» هما الترنجبين والطير السماني بتخفيف الميم والقصر وقلنا لهم «كلوا من طيبات ما رزقناكم وما ظلمونا ولكن كانوا أنفسهم يظلمون».",
        "char_start": 0,
        "char_end": 451,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_008_026_chunk00",
        "verse_key": "8:26",
        "text_ar": "«واذكروا إذ أنتم قليل مستضعَفون في الأرض» أرض مكة «تخافون أن يتخطَّفكم الناس» يأخذكم الكفار بسرعة «فآواكم» إلى المدينة «وأيَّدكم» قوَّاكم «بنصره» يوم بدر بالملائكة «ورزقكم من الطيبات» الغنائم «لعلكم تشكرون» نعمه.",
        "char_start": 0,
        "char_end": 212,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_057_chunk00",
        "verse_key": "2:57",
        "text_ar": "واذكروا نعمتنا عليكم حين كنتم تتيهون في الارض; اذ جعلنا السحاب مظللا عليكم من حَرِّ الشمس، وانزلنا عليكم المنَّ، وهو شيء يشبه الصَّمغ طعمه كالعسل، وانزلنا عليكم السَّلوي وهو طير يشبه السُّمانَي، وقلنا لكم: كلوا من طيِّبات ما رزقناكم، ولا تخالفوا دينكم، فلم تمتثلوا. وما ظلمونا بكفران النعم، ولكن كانوا انفسهم يظلمون; لان عاقبه الظلم عايده عليهم.",
        "char_start": 0,
        "char_end": 345,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_168_chunk00",
        "verse_key": "2:168",
        "text_ar": "يا أيها الناس كلوا من رزق الله الذي أباحه لكم في الأرض، وهو الطاهر غير النجس، النافع غير الضار، ولا تتبعوا طرق الشيطان في التحليل والتحريم، والبدع والمعاصي. إنه عدو لكم ظاهر العداوة.",
        "char_start": 0,
        "char_end": 182,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_172_chunk00",
        "verse_key": "2:172",
        "text_ar": "يا أيها المؤمنون كلوا من الأطعمة المستلَذَّة الحلال التي رزقناكم، ولا تكونوا كالكفار الذين يحرمون الطيبات، ويستحِلُّون الخبائث، واشكروا لله نعمه العظيمة عليكم بقلوبكم وألسنتكم وجوارحكم، إن كنتم حقًا منقادين لأمره، سامعين مطيعين له، تعبدونه وحده لا شريك له.",
        "char_start": 0,
        "char_end": 256,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "يا من آمنتم بي واتبعتم رسلي أنفقوا من الحلال الطيب الذي كسبتموه ومما أخرجنا لكم من الأرض، ولا تقصدوا الرديء منه لتعطوه الفقراء، ولو أُعطِيتموه لم تأخذوه إلا إذا تغاضيتم عما فيه من رداءة ونقص. فكيف ترضون لله ما لا ترضونه لأنفسكم؟ واعلموا أن الله الذي رزقكم غني عن صدقاتكم، مستحق للثناء، محمود في كل حال.",
        "char_start": 0,
        "char_end": 302,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_038_chunk00",
        "verse_key": "3:38",
        "text_ar": "عندما رأى زكريا ما أكرم الله به مريم مِن رزقه وفضله توجه إلى ربه قائلا يا ربِّ أعطني من عندك ولدًا صالحًا مباركًا، إنك سميع الدعاء لمن دعاك.",
        "char_start": 0,
        "char_end": 140,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_003_179_chunk00",
        "verse_key": "3:179",
        "text_ar": "ما كان الله ليَدَعَكم أيها المصدقون بالله ورسوله العاملون بشرعه على ما أنتم عليه من التباس المؤمن منكم بالمنافق حتى يَمِيزَ الخبيث من الطيب، فيُعرف المنافق من المؤمن الصادق. وما كان مِن حكمة الله أن يطلعكم -أيها المؤمنون- على الغيب الذي يعلمه من عباده، فتعرفوا المؤمن منهم من المنافق، ولكنه يميزهم بالمحن والابتلاء، غير أن الله تعالى يصطفي من رسله مَن يشاء؛ ليطلعه على بعض علم الغيب بوحي منه، فآمنوا بالله ورسوله، وإن تؤمنوا إيمانًا صادقًا وتتقوا ربكم بطاعته، فلكم أجر عظيم عند الله.",
        "char_start": 0,
        "char_end": 483,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_002_chunk00",
        "verse_key": "4:2",
        "text_ar": "وأعطوا مَن مات آباؤهم وهم دون البلوغ، -وكنتم عليهم أوصياء- أموالهم إذا وصلوا سن البلوغ، ورأيتم منهم قدرة على حفظ أموالهم، ولا تأخذوا الجيِّد من أموالهم، وتجعلوا مكانه الرديء من أموالكم، ولا تخلطوا أموالهم بأموالكم; لتحتالوا بذلك على أكل أموالهم. إن من تجرأ على ذلك فقد ارتكب إثمًا عظيمًا.",
        "char_start": 0,
        "char_end": 288,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_043_chunk00",
        "verse_key": "4:43",
        "text_ar": "يا ايها الذين صدَّقوا بالله ورسوله وعملوا بشرعه، لا تقربوا الصلاه ولا تقوموا اليها حال السكر حتي تميزوا وتعلموا ما تقولون (وقد كان هذا قبل التحريم القاطع للخمر في كل حال) ، ولا تقربوا الصلاه ان اصابكم الحدث الاكبر، ولا تقربوا كذلك مواضعها وهي المساجد، الا من كان منكم مجتازًا من باب الي باب، حتي تتطهروا بالاغتسال. وان كنتم في حال مرض لا تقدرون معه علي استعمال الماء، او حال سفر، او جاء احد منكم من الغايط، او جامعتم النساء، فلم تجدوا ماء للطهاره فاقصدوا ترابًا طاهرًا، فامسحوا بوجوهكم وايديكم منه. ا",
        "char_start": 0,
        "char_end": 561,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_004_160_chunk00",
        "verse_key": "4:160",
        "text_ar": "فبسبب ظلم اليهود بما ارتكبوه من الذنوب العظيمة حَرَّم الله عليهم طيبات من المأكل كانت حلالا لهم، وبسبب صدِّهم أنفسهم وغيرهم عن دين الله القويم.",
        "char_start": 0,
        "char_end": 143,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_004_chunk00",
        "verse_key": "5:4",
        "text_ar": "يسالك اصحابك -ايها النبي-: ماذا اُحِلَّ لهم اَكْلُه؟ قل لهم: اُحِلَّ لكم الطيبات وصيدُ ما دَرَّبتموه من ذوات المخالب والانياب من الكلاب والفهود والصقور ونحوها مما يُعَلَّم، تعلمونهن طلب الصيد لكم، مما علمكم الله، فكلوا مما امسكن لكم، واذكروا اسم الله عند ارسالها للصيد، وخافوا الله فيما امركم به وفيما نهاكم عنه. ان الله سريع الحساب.",
        "char_start": 0,
        "char_end": 333,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "ومن تمام نعمة الله عليكم اليوم -أيها المؤمنون- أن أَحَلَّ لكم الحلال الطيب، وذبائحُ اليهود والنصارى -إن ذكَّوها حَسَبَ شرعهم- حلال لكم وذبائحكم حلال لهم. وأَحَلَّ لكم -أيها المؤمنون- نكاح المحصنات، وهُنَّ الحرائر من النساء المؤمنات، العفيفات عن الزنى، وكذلك نكاحَ الحرائر العفيفات من اليهود والنصارى إذا أعطيتموهُنَّ مهورهن، وكنتم أعِفَّاء غير مرتكبين للزنى، ولا متخذي عشيقات، وأمِنتم من التأثر بدينهن. ومن يجحد شرائع الإيمان فقد بطل عمله، وهو يوم القيامة من الخاسرين.",
        "char_start": 0,
        "char_end": 468,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_006_chunk00",
        "verse_key": "5:6",
        "text_ar": "يا ايها الذين امنوا اذا اردتم القيام الي الصلاه، وانتم علي غير طهاره فاغسلوا وجوهكم وايديكم مع المرافق (والمِرْفَق: المِفْصَل الذي بين الذراع والعَضُد) وامسحوا رووسكم، واغسلوا ارجلكم مع الكعبين (وهما: العظمان البارزان عند ملتقي الساق بالقدم) . وان اصابكم الحدث الاكبر فتطهروا بالاغتسال منه قبل الصلاه. فان كنتم مرضي، او علي سفر في حال الصحه، او قضي احدكم حاجته، او جامع زوجته فلم تجدوا ماء فاضربوا بايديكم وجه الارض، وامسحوا وجوهكم وايديكم منه. ما يريد الله في امر الطهاره ان يُضَيِّق عليكم، بل اباح ",
        "char_start": 0,
        "char_end": 647,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_087_chunk00",
        "verse_key": "5:87",
        "text_ar": "يا أيها الذين آمنوا لا تحرِّموا طيبات أحلَّها الله لكم من المطاعم والمشارب ونكاح النساء، فتضيقوا ما وسَّع الله عليكم، ولا تتجاوزوا حدود ما حرَّم الله. إن الله لا يحب المعتدين.",
        "char_start": 0,
        "char_end": 175,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_088_chunk00",
        "verse_key": "5:88",
        "text_ar": "وتمتعوا -أيها المؤمنون- بالحلال الطيب مما أعطاكم الله ومنحكم إياه، واتقوا الله بامتثال أوامره، واجتناب نواهيه; فإن إيمانكم بالله يوجب عليكم تقواه ومراقبته.",
        "char_start": 0,
        "char_end": 155,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_005_100_chunk00",
        "verse_key": "5:100",
        "text_ar": "قل -أيها الرسول-: لا يستوي الخبيث والطيب من كل شيء، فالكافر لا يساوي المؤمن، والعاصي لا يساوي المطيع، والجاهل لا يساوي العالم، والمبتدع لا يساوي المتبع، والمال الحرام لا يساوي الحلال، ولو أعجبك -أيها الإنسان- كثرة الخبيث وعدد أهله. فاتقوا الله يا أصحاب العقول الراجحة باجتناب الخبائث، وفعل الطيبات; لتفلحوا بنيل المقصود الأعظم، وهو رضا الله تعالى والفوز بالجنة.",
        "char_start": 0,
        "char_end": 361,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_032_chunk00",
        "verse_key": "7:32",
        "text_ar": "قل -ايها الرسول- لهولاء الجهله من المشركين: مَن الذي حرم عليكم اللباس الحسن الذي جعله الله تعالي زينه لكم؟ ومَن الذي حرَّم عليكم التمتع بالحلال الطيب من رزق الله تعالي؟ قل -ايها الرسول- لهولاء المشركين: انَّ ما احله الله من الملابس والطيبات من المطاعم والمشارب حق للذين امنوا في الحياه الدنيا يشاركهم فيها غيرهم، خالصه لهم يوم القيامه. مثل ذلك التفصيل يفصِّل الله الايات لقوم يعلمون ما يبيِّن لهم، ويفقهون ما يميز لهم.",
        "char_start": 0,
        "char_end": 418,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_058_chunk00",
        "verse_key": "7:58",
        "text_ar": "والأرض النقية إذا نزل عليها المطر تُخْرج نباتًا -بإذن الله ومشيئته- طيبًا ميسرًا، وكذلك المؤمن إذا نزلت عليه آيات الله انتفع بها، وأثمرت فيه حياة صالحة، أما الأرض السَّبِخة الرديئة فإنها لا تُخرج النبات إلا عسرًا رديئا لا نفع فيه، ولا تُخرج نباتًا طيبًا، وكذلك الكافر لا ينتفع بآيات الله. مثل ذلك التنويع البديع في البيان نُنوِّع الحجج والبراهين لإثبات الحق لأناس يشكرون نعم الله، ويطيعونه.",
        "char_start": 0,
        "char_end": 390,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_157_chunk00",
        "verse_key": "7:157",
        "text_ar": "هذه الرحمة سأكتبها للذين يخافون الله ويجتنبون معاصيه، ويتبعون الرسول النبي الأمي الذي لا يقرأ ولا يكتب، وهو محمد صلى الله عليه وسلم، الذي يجدون صفته وأمره مكتوبَيْن عندهم في التوراة والإنجيل، يأمرهم بالتوحيد والطاعة وكل ما عرف حُسْنه، وينهاهم عن الشرك والمعصية وكل ما عرف قُبْحه، ويُحِلُّ لهم الطيبات من المطاعم والمشارب والمناكح، ويُحرِّم عليهم الخبائث منها كلحم الخنزير، وما كانوا يستحلُّونه من المطاعم والمشارب التي حرَّمها الله، ويذهب عنهم ما كُلِّفوه من الأمور الشاقة كقطع موضع النجاسة من الثوب،",
        "char_start": 0,
        "char_end": 747,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_007_160_chunk00",
        "verse_key": "7:160",
        "text_ar": "وفرَّقنا قوم موسي مِن بني اسراييل اثنتي عشره قبيله بعدد الاسباط -وهم ابناء يعقوب- كل قبيله معروفه من جهه نقيبها. واوحينا الي موسي اذ طلب منه قومه السقيا حين عطشوا في التِّيْه: ان اضرب بعصاك الحجر، فضربه، فانفجرت منه اثنتا عشره عينًا من الماء، قد علمت كل قبيله من القبايل الاثنتي عشره مشربهم، لا تدخل قبيله علي غيرها في شربها، وظلَّلنا عليهم السحاب، وانزلنا عليهم المنَّ -وهو شيء يشبه الصَّمغ، طعمه كالعسل- والسلوي، وهو طاير يشبه السُّمَانَي، وقلنا لهم: كلوا من طيبات ما رزقناكم، فكرهوا ذلك وملُّوه من",
        "char_start": 0,
        "char_end": 729,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_008_026_chunk00",
        "verse_key": "8:26",
        "text_ar": "واذكروا ايها المومنون نِعَم الله عليكم اذ انتم بـ «مكه» قليلو العدد مقهورون، تخافون ان ياخذكم الكفار بسرعه، فجعل لكم ماوي تاوون اليه وهو «المدينه» ، وقوَّاكم بنصره عليهم يوم «بدر» ، واطعمكم من الطيبات -التي من جملتها الغنايم-; لكي تشكروا له علي ما رزقكم وانعم به عليكم.",
        "char_start": 0,
        "char_end": 269,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_057_chunk00",
        "verse_key": "2:57",
        "text_ar": "قوله تعالى : وظللنا عليكم الغمام وأنزلنا عليكم المن والسلوى كلوا من طيبات ما رزقناكم وما ظلمونا ولكن كانوا أنفسهم يظلمونفيه ثماني مسائل : الأولى : قوله تعالى : وظللنا عليكم الغمام أي جعلناه عليكم كالظلة والغمام جمع غمامة كسحابة وسحاب قاله الأخفش سعيد . قال الفراء ويجوز غمائم وهي السحاب ؛ لأنها تغم السماء أي تسترها وكل مغطى فهو مغموم ، ومنه المغموم على عقله وغم الهلال إذا غطاه الغيم والغين مثل الغيم ، ومنه قوله عليه السلام ( إنه ليغان على قلبي ) قال صاحب العين : غين عليه غطي عليه والغين شجر ملتف ",
        "char_start": 0,
        "char_end": 4630,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_168_chunk00",
        "verse_key": "2:168",
        "text_ar": "قوله تعالى : يا أيها الناس كلوا مما في الأرض حلالا طيبا ولا تتبعوا خطوات الشيطان إنه لكم عدو مبينفيه أربع مسائل :الأولى : قوله تعالى : يا أيها الناس الآية . قيل : إنها نزلت في ثقيف وخزاعة وبني مدلج فيما حرموه على أنفسهم من الأنعام ، واللفظ عام . والطيب هنا الحلال ، فهو تأكيد لاختلاف اللفظ ، وهذا قول مالك في الطيب . وقال الشافعي : الطيب المستلذ ، فهو تنويع ، ولذلك يمنع أكل الحيوان القذر . وسيأتي بيان هذا في \" الأنعام \" و \" الأعراف \" إن شاء الله تعالى .الثانية : قوله تعالى : حلالا طيبا حلالا حال ،",
        "char_start": 0,
        "char_end": 3014,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_172_chunk00",
        "verse_key": "2:172",
        "text_ar": "قوله تعالى : يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم واشكروا لله إن كنتم إياه تعبدونهذا تأكيد للأمر الأول ، وخص المؤمنين هنا بالذكر تفضيلا . والمراد بالأكل الانتفاع من جميع الوجوه . وقيل : هو الأكل المعتاد . وفي صحيح مسلم عن أبي هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم : أيها الناس إن الله تعالى طيب لا يقبل إلا طيبا وإن الله أمر المؤمنين بما أمر به المرسلين فقال يا أيها الرسل كلوا من الطيبات واعملوا صالحا إني بما تعملون عليم وقال : يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم",
        "char_start": 0,
        "char_end": 694,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "ياأيها الذين آمنوا أنفقوا من طيبات ما كسبتم ومما أخرجنا لكم من الأرض ولا تيمموا الخبيث منه تنفقون ولستم بآخذيه إلا أن تغمضوا فيه واعلموا أن الله غني حميد[ ص: 292 ] فيه إحدى عشرة مسألة :الأولى : قوله تعالى : يا أيها الذين آمنوا أنفقوا هذا خطاب لجميع أمة محمد صلى الله عليه وسلم . واختلف العلماء في المعنى المراد بالإنفاق هنا ، فقال علي بن أبي طالب وعبيدة السلماني وابن سيرين : هي الزكاة المفروضة ، نهى الناس عن إنفاق الرديء فيها بدل الجيد . قال ابن عطية : والظاهر من قول البراء بن عازب والحسن وقتادة أ",
        "char_start": 0,
        "char_end": 12342,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_038_chunk00",
        "verse_key": "3:38",
        "text_ar": "هنالك دعا زكريا ربه هنالك في موضع نصب ; لأنه ظرف يستعمل للزمان والمكان وأصله للمكان . وقال المفضل بن سلمة : \" هنالك \" في الزمان و \" هناك \" في المكان ، وقد يجعل هذا مكان هذا . هب لي أعطني . من لدنك من عندك . ذرية طيبة أي نسلا صالحا . والذرية تكون واحدة وتكون جمعا ذكرا وأنثى ، وهو هنا واحد . يدل عليه قوله . فهب لي من لدنك وليا ولم يقل أولياء ، وإنما أنث طيبة لتأنيث لفظ الذرية ; كقوله :أبوك خليفة ولدته أخرى وأنت خليفة ذاك الكمالفأنث ولدته لتأنيث لفظ الخليفة .وروي من حديث أنس قال : قال رسول الله - ص",
        "char_start": 0,
        "char_end": 2749,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_003_179_chunk00",
        "verse_key": "3:179",
        "text_ar": "ما كان الله ليذر المؤمنين على ما أنتم عليه حتى يميز الخبيث من الطيب وما كان الله ليطلعكم على الغيب ولكن الله يجتبي من رسله من يشاء فآمنوا بالله ورسله وإن تؤمنوا وتتقوا فلكم أجر عظيمقال أبو العالية : سأل المؤمنون أن يعطوا علامة يفرقون بها بين المؤمن والمنافق ; فأنزل الله عز وجل ما كان الله ليذر المؤمنين على ما أنتم عليه الآية . واختلفوا من المخاطب بالآية على أقوال . فقال ابن عباس والضحاك ومقاتل والكلبي وأكثر المفسرين : الخطاب للكفار والمنافقين . أي ما كان الله ليذر المؤمنين على ما أنتم عليه من ال",
        "char_start": 0,
        "char_end": 3436,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_002_chunk00",
        "verse_key": "4:2",
        "text_ar": "قوله تعالى : وآتوا اليتامى أموالهم ولا تتبدلوا الخبيث بالطيب ولا تأكلوا أموالهم إلى أموالكم إنه كان حوبا كبيرافيه خمس مسائل :الأولى قوله تعالى : وآتوا اليتامى أموالهم وأراد باليتامى الذين كانوا أيتاما ؛ كقوله : وألقي السحرة ساجدين ولا سحر مع السجود ، فكذلك لا يتم مع البلوغ . وكان يقال للنبي صلى الله عليه وسلم : \" يتيم أبي طالب \" استصحابا لما كان . وآتوا أي أعطوا . والإيتاء الإعطاء . ولفلان أتو ، أي عطاء . أبو زيد : أتوت الرجل آتوه إتاوة ، وهي الرشوة . واليتيم من لم يبلغ الحلم ، وقد تقدم في \" الب",
        "char_start": 0,
        "char_end": 4759,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_043_chunk00",
        "verse_key": "4:43",
        "text_ar": "قوله تعالى : ياأيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى حتى تعلموا ما تقولون ولا جنبا إلا عابري سبيل حتى تغتسلوا وإن كنتم مرضى أو على سفر أو جاء أحد منكم من الغائط أو لامستم النساء فلم تجدوا ماء فتيمموا صعيدا طيبا فامسحوا بوجوهكم وأيديكم إن الله كان عفوا غفورافيه أربعة وأربعون مسألة :الأولى : قوله تعالى : يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى خص الله سبحانه وتعالى بهذا الخطاب المؤمنين ؛ لأنهم كانوا يقيمون الصلاة وقد أخذوا من الخمر وأتلفت عليهم أذهانهم فخصوا بهذا الخطاب ؛ إذ كان ا",
        "char_start": 0,
        "char_end": 37071,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_004_160_chunk00",
        "verse_key": "4:160",
        "text_ar": "قوله تعالى : فبظلم من الذين هادوا حرمنا عليهم طيبات أحلت لهم وبصدهم عن سبيل الله كثيراقوله تعالى : فبظلم من الذين هادوا قال الزجاج : هذا بدل من فبما نقضهم [ ص: 375 ] . والطيبات ما نصه في قوله تعالى : وعلى الذين هادوا حرمنا كل ذي ظفر وقدم الظلم على التحريم إذ هو الغرض الذي قصد إلى الإخبار عنه بأنه سبب التحريم . وبصدهم عن سبيل الله أي وبصدهم أنفسهم وغيرهم عن اتباع محمد صلى الله عليه وسلم . وأخذهم الربا وقد نهوا عنه وأكلهم أموال الناس بالباطل كله تفسير للظلم الذي تعاطوه ، وكذلك ما قبله من نقضهم الم",
        "char_start": 0,
        "char_end": 600,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_004_chunk00",
        "verse_key": "5:4",
        "text_ar": "قوله تعالى : يسألونك ماذا أحل لهم قل أحل لكم الطيبات وما علمتم من الجوارح مكلبين تعلمونهن مما علمكم الله فكلوا مما أمسكن عليكم واذكروا اسم الله عليه واتقوا الله إن الله سريع الحساب .فيه تسع عشرة مسألة :الأولى : قوله تعالى : يسألونك . الآية نزلت بسبب عدي بن حاتم وزيد بن مهلهل وهو زيد الخيل الذي سماه رسول الله صلى الله عليه وسلم زيد الخير ; قالا : يا رسول الله إنا قوم نصيد بالكلاب والبزاة ، وإن الكلاب تأخذ البقر والحمر والظباء فمنه ما ندرك ذكاته ، ومنه ما تقتله فلا ندرك ذكاته ، وقد حرم الله الميتة",
        "char_start": 0,
        "char_end": 17004,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "قوله تعالى : اليوم أحل لكم الطيبات وطعام الذين أوتوا الكتاب حل لكم وطعامكم حل لهم والمحصنات من المؤمنات والمحصنات من الذين أوتوا الكتاب من قبلكم إذا آتيتموهن أجورهن محصنين غير مسافحين ولا متخذي أخدان ومن يكفر بالإيمان فقد حبط عمله وهو في الآخرة من الخاسرينفيه عشر مسائل :الأولى : قوله تعالى : اليوم أحل لكم الطيبات أي : اليوم أكملت لكم دينكم و اليوم أحل لكم الطيبات فأعاد تأكيدا أي : أحل لكم الطيبات التي سألتم عنها ; وكانت الطيبات أبيحت للمسلمين قبل نزول هذه الآية ; فهذا جواب سؤالهم إذ قالوا : ماذا",
        "char_start": 0,
        "char_end": 7155,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_006_chunk00",
        "verse_key": "5:6",
        "text_ar": "قوله تعالى : ياأيها الذين آمنوا إذا قمتم إلى الصلاة فاغسلوا وجوهكم وأيديكم إلى المرافق وامسحوا برءوسكم وأرجلكم إلى الكعبين وإن كنتم جنبا فاطهروا وإن كنتم مرضى أو على سفر أو جاء أحد منكم من الغائط أو لامستم النساء فلم تجدوا ماء فتيمموا صعيدا طيبا فامسحوا بوجوهكم وأيديكم منه ما يريد الله ليجعل عليكم من حرج ولكن يريد ليطهركم وليتم نعمته عليكم لعلكم تشكرونفيه اثنتا وثلاثون مسألة :الأولى : ذكر القشيري وابن عطية أن هذه الآية نزلت في قصة عائشة حين فقدت العقد في غزوة المريسيع ، وهي آية الوضوء . قال ابن ",
        "char_start": 0,
        "char_end": 37074,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_087_chunk00",
        "verse_key": "5:87",
        "text_ar": "قوله تعالى : يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا إن الله لا يحب المعتدينقوله تعالى : يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا فيه خمس مسائل :الأولى : أسند الطبري إلى ابن عباس أن الآية نزلت بسبب رجل أتى النبي صلى الله عليه وسلم فقال : يا رسول الله إني إذا أصبت من اللحم انتشرت وأخذتني شهوتي فحرمت اللحم ; فأنزل الله هذه الآية . وقيل : إنها نزلت بسبب جماعة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو بكر وعلي وابن مسعود وعبد الله بن عمر وأبو ذر الغف",
        "char_start": 0,
        "char_end": 5479,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_088_chunk00",
        "verse_key": "5:88",
        "text_ar": "قوله تعالى : وكلوا مما رزقكم الله حلالا طيبا واتقوا الله الذي أنتم به مؤمنونقوله تعالى : وكلوا مما رزقكم الله حلالا طيبا فيه مسألة واحدة : الأكل في هذه الآية عبارة عن التمتع بالأكل والشرب واللباس والركوب ونحو ذلك ، وخص الأكل بالذكر ; لأنه أعظم المقصود وأخص الانتفاعات بالإنسان ، وسيأتي بيان حكم الأكل والشرب واللباس في \" الأعراف \" إن شاء الله تعالى ، وأما شهوة الأشياء الملذة ، ومنازعة النفس إلى طلب الأنواع الشهية ، فمذاهب الناس في تمكين النفس منها مختلفة ; فمنهم من يرى صرف النفس عنها وقهرها عن اتب",
        "char_start": 0,
        "char_end": 946,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_005_100_chunk00",
        "verse_key": "5:100",
        "text_ar": "قوله تعالى : قل لا يستوي الخبيث والطيب ولو أعجبك كثرة الخبيث فاتقوا الله يا أولي الألباب لعلكم تفلحونقوله تعالى : قل لا يستوي الخبيث والطيب فيه ثلاث مسائل :[ ص: 250 ] الأولى : قال الحسن : الخبيث والطيب الحلال والحرام ، وقال السدي : المؤمن والكافر ، وقيل : المطيع والعاصي . وقيل : الرديء والجيد ; وهذا على ضرب المثال ، والصحيح أن اللفظ عام في جميع الأمور ، يتصور في المكاسب والأعمال والناس ، والمعارف من العلوم وغيرها ; فالخبيث من هذا كله لا يفلح ولا ينجب ، ولا تحسن له عاقبة وإن كثر ، والطيب وإن قل ن",
        "char_start": 0,
        "char_end": 3843,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_032_chunk00",
        "verse_key": "7:32",
        "text_ar": "قوله تعالى قل من حرم زينة الله التي أخرج لعباده والطيبات من الرزق قل هي للذين آمنوا في الحياة الدنيا خالصة يوم القيامة كذلك نفصل الآيات لقوم يعلمونفيه أربع مسائل :الأولى : قوله تعالى قل من حرم زينة الله بين أنهم حرموا من تلقاء أنفسهم ما لم يحرمه الله عليهم . والزينة هنا الملبس الحسن ، إذا قدر عليه صاحبه . وقيل : جميع الثياب ; كما روي عن عمر : إذا وسع الله عليكم فأوسعوا . وقد تقدم . وروي عن علي بن الحسين بن علي بن أبي طالب شيخ مالك رضي الله عنهم أنه كان يلبس كساء خز بخمسين دينارا ، يلبسه في الشتا",
        "char_start": 0,
        "char_end": 7905,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_058_chunk00",
        "verse_key": "7:58",
        "text_ar": "قوله تعالى والبلد الطيب يخرج نباته بإذن ربه والذي خبث لا يخرج إلا نكدا كذلك نصرف الآيات لقوم يشكرونقوله تعالى والبلد الطيب يخرج نباته بإذن ربه والذي خبث لا يخرج إلا نكدا أي التربة الطيبة . والخبيث الذي في تربته حجارة أو شوك ; عن الحسن . وقيل : معناه التشبيه ، شبه تعالى السريع الفهم بالبلد الطيب ، والبليد بالذي خبث ; عن النحاس . وقيل : هذا مثل للقلوب ; فقلب يقبل الوعظ والذكرى ، وقلب فاسق ينبو عن ذلك ; قاله الحسن أيضا . وقال قتادة : مثل للمؤمن يعمل محتسبا متطوعا ، والمنافق غير محتسب ; قال رسول الل",
        "char_start": 0,
        "char_end": 1088,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_157_chunk00",
        "verse_key": "7:157",
        "text_ar": "قوله تعالى الذين يتبعون الرسول النبي الأمي الذي يجدونه مكتوبا عندهم في التوراة والإنجيل يأمرهم بالمعروف وينهاهم عن المنكر ويحل لهم الطيبات ويحرم عليهم الخبائث ويضع عنهم إصرهم والأغلال التي كانت عليهم فالذين آمنوا به وعزروه ونصروه واتبعوا النور الذي أنزل معه أولئك هم المفلحون فيه عشر مسائل :الأولى : روى يحيى بن أبي كثير عن نوف البكالي الحميري : لما اختار موسى قومه سبعين رجلا لميقات ربه قال الله تعالى لموسى : أنا أجعل لكم الأرض مسجدا وطهورا تصلون حيث أدركتكم الصلاة إلا عند مرحاض أو حمام أو قبر ، و",
        "char_start": 0,
        "char_end": 7111,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_007_160_chunk00",
        "verse_key": "7:160",
        "text_ar": "قوله تعالى وقطعناهم اثنتي عشرة أسباطا أمما عدد نعمه على بني إسرائيل ، وجعلهم أسباطا ليكون أمر كل سبط معروفا من جهة رئيسهم ; فيخف الأمر على موسى . وفي التنزيل : وبعثنا منهم اثني عشر نقيبا وقد تقدم .وقوله : اثنتي عشرة والسبط مذكر لأن بعده أمما فذهب التأنيث إلى الأمم . ولو قال : اثني عشر لتذكير السبط جاز ; عن الفراء . وقيل : أراد بالأسباط القبائل والفرق ; فلذلك أنث العدد . قال الشاعر :وإن قريشا كلها عشر أبطن وأنت بريء من قبائلها العشرفذهب بالبطن إلى القبيلة والفصيلة ; فلذلك أنثها . والبطن مذكر ; كم",
        "char_start": 0,
        "char_end": 768,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_008_026_chunk00",
        "verse_key": "8:26",
        "text_ar": "قوله تعالى واذكروا إذ أنتم قليل مستضعفون في الأرض تخافون أن يتخطفكم الناس فآواكم وأيدكم بنصره ورزقكم من الطيبات لعلكم تشكرونقوله تعالى واذكروا إذ أنتم قليل قال الكلبي : نزلت في المهاجرين ; يعني وصف حالهم قبل الهجرة وفي ابتداء الإسلام .مستضعفون نعت .في الأرض أي [ ص: 353 ] أرض مكة تخافون نعت أن يتخطفكم في موضع نصب . والخطف : الأخذ بسرعة الناس رفع على الفاعل . قتادة وعكرمة : هم مشركو قريش . وهب بن منبه : فارس والروم .فآواكم قال ابن عباس : إلى الأنصار . السدي : إلى المدينة ; والمعنى واحد . آوى إليه ",
        "char_start": 0,
        "char_end": 687,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_057_chunk00",
        "verse_key": "2:57",
        "text_ar": "ثم ذكر نعمته عليكم في التيه والبريه الخاليه من الظلال وسعه الارزاق، فقال: { وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَاَنْزَلْنَا عَلَيْكُمُ الْمَنَّ } وهو اسم جامع لكل رزق حسن يحصل بلا تعب، ومنه الزنجبيل والكماه والخبز وغير ذلك. { وَالسَّلْوَي } طاير صغير يقال له السماني، طيب اللحم، فكان ينزل عليهم من المن والسلوي ما يكفيهم ويقيتهم { كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ } اي: رزقا لا يحصل نظيره لاهل المدن المترفهين, فلم يشكروا هذه النعمه, واستمروا علي قساوه القلوب وكثره الذنوب. { وَمَا ظَلَمُونَ",
        "char_start": 0,
        "char_end": 664,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_168_chunk00",
        "verse_key": "2:168",
        "text_ar": "هذا خطاب للناس كلهم, مومنهم وكافرهم، فامتن عليهم بان امرهم ان ياكلوا من جميع ما في الارض، من حبوب, وثمار, وفواكه, وحيوانات, حاله كونها { حَلَالًا } اي: محللا لكم تناوله، ليس بغصب ولا سرقه, ولا محصلا بمعامله محرمه او علي وجه محرم، او معينا علي محرم. { طَيِّبًا } اي: ليس بخبيث, كالميته والدم, ولحم الخنزير, والخبايث كلها، ففي هذه الايه, دليل علي انَّ الاصل في الاعيان الاباحه، اكلا وانتفاعا, وانَّ المحرم نوعان: اما محرم لذاته, وهو الخبيث الذي هو ضد الطيب، واما محرم لما عرض له, وهو المحرم لتعلق حق ال",
        "char_start": 0,
        "char_end": 955,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_172_chunk00",
        "verse_key": "2:172",
        "text_ar": "هذا امر للمومنين خاصه, بعد الامر العام, وذلك انهم هم المنتفعون علي الحقيقه بالاوامر والنواهي, بسبب ايمانهم, فامرهم باكل الطيبات من الرزق, والشكر لله علي انعامه, باستعمالها بطاعته, والتقوي بها علي ما يوصل اليه، فامرهم بما امر به المرسلين في قوله { يَا اَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا } فالشكر في هذه الايه, هو العمل الصالح، وهنا لم يقل \\\" حلالا \\\" لان المومن اباح الله له الطيبات من الرزق خالصه من التبعه، ولان ايمانه يحجزه عن تناول ما ليس له. وقوله { اِنْ كُنْتُمْ ا",
        "char_start": 0,
        "char_end": 808,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "يامر تعالي عباده المومنين بالنفقه من طيبات ما يسر لهم من المكاسب، ومما اخرج لهم من الارض فكما منَّ عليكم بتسهيل تحصيله فانفقوا منه شكرا لله واداء لبعض حقوق اخوانكم عليكم، وتطهيرا لاموالكم، واقصدوا في تلك النفقه الطيب الذي تحبونه لانفسكم، ولا تيمموا الرديء الذي لا ترغبونه ولا تاخذونه الا علي وجه الاغماض والمسامحه { واعلموا ان الله غني حميد } فهو غني عنكم ونفع صدقاتكم واعمالكم عايد اليكم، ومع هذا فهو حميد علي ما يامركم به من الاوامر الحميده والخصال السديده، فعليكم ان تمتثلوا اوامره لانها قوت القلو",
        "char_start": 0,
        "char_end": 528,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_038_chunk00",
        "verse_key": "3:38",
        "text_ar": "اي: دعا زكريا عليه السلام ربه ان يرزقه ذريه طيبه، اي: طاهره الاخلاق، طيبه الاداب، لتكمل النعمه الدينيه والدنيويه بهم. فاستجاب له دعاءه.",
        "char_start": 0,
        "char_end": 135,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_003_179_chunk00",
        "verse_key": "3:179",
        "text_ar": "اي: ما كان في حكمه الله ان يترك المومنين علي ما انتم عليه من الاختلاط وعدم التميز حتي يميز الخبيث من الطيب، والمومن من المنافق، والصادق من الكاذب. ولم يكن في حكمته ايضا ان يُطلع عباده علي الغيب الذي يعلمه من عباده، فاقتضت حكمته الباهره ان يبتلي عباده، ويفتنهم بما به يتميز الخبيث من الطيب، من انواع الابتلاء والامتحان، فارسل الله رسله، وامر بطاعتهم، والانقياد لهم، والايمان بهم، ووعدهم علي الايمان والتقوي الاجر العظيم. فانقسم الناس بحسب اتباعهم للرسل قسمين: مطيعين وعاصين، ومومنين ومنافقين، ومسلمين ",
        "char_start": 0,
        "char_end": 571,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_002_chunk00",
        "verse_key": "4:2",
        "text_ar": "وقوله تعالي: { وَاتُوا الْيَتَامَي اَمْوَالَهُمْ ولا تتبدلوا الخبيث بالطيب ولا تاكلوا اموالهم الي اموالكم انه كان حوبا كبيرا } هذا اول ما اوصي به من حقوق الخلق في هذه السوره. وهم اليتامي الذين فقدوا اباءهم الكافلين لهم، وهم صغار ضعاف لا يقومون بمصالحهم. فامر الرءوف الرحيم عباده ان يُحسنوا اليهم، وان لا يقربوا اموالهم الا بالتي هي احسن، وان يوتوهم اموالهم اذا بلغوا ورشدوا، كامله موفره، وان لا { تَتَبَدَّلُوا الْخَبِيثَ } الذي هو اكل مال اليتيم بغير حق. { بِالطَّيِّبِ } وهو الحلال الذي ما فيه حرج ",
        "char_start": 0,
        "char_end": 1055,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_043_chunk00",
        "verse_key": "4:43",
        "text_ar": "ينهي تعالي عباده المومنين ان يقربوا الصلاه وهم سكاري، حتي يعلموا ما يقولون، وهذا شامل لقربان مواضع الصلاه، كالمسجد، فانه لا يمكَّن السكران من دخوله. وشامل لنفس الصلاه، فانه لا يجوز للسكران صلاه ولا عباده، لاختلاط عقله وعدم علمه بما يقول، ولهذا حدد تعالي ذلك وغياه الي وجود العلم بما يقول السكران. وهذه الايه الكريمه منسوخه بتحريم الخمر مطلقا، فان الخمر -في اول الامر- كان غير محرم، ثم ان الله تعالي عرض لعباده بتحريمه بقوله: { يَسْاَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ قُلْ فِيهِمَا اِثْمٌ كَبِيرٌ و",
        "char_start": 0,
        "char_end": 4471,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_004_160_chunk00",
        "verse_key": "4:160",
        "text_ar": "ثم أخبر تعالى أنه حرم على أهل الكتاب كثيرا من الطيبات التي كانت حلالا عليهم، وهذا تحريم عقوبة بسبب ظلمهم واعتدائهم، وصدهم الناس عن سبيل الله، ومنعهم إياهم من الهدى، وبأخذهم الربا وقد نهوا عنه، فمنعوا المحتاجين ممن يبايعونه عن العدل، فعاقبهم الله من جنس فعلهم فمنعهم من كثير من الطيبات التي كانوا بصدد حلها، لكونها طيبة، وأما التحريم الذي على هذه الأمة فإنه تحريم تنزيه لهم عن الخبائث التي تضرهم في دينهم ودنياهم.",
        "char_start": 0,
        "char_end": 412,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_004_chunk00",
        "verse_key": "5:4",
        "text_ar": "يقول تعالي لنبيه محمد صلي الله عليه وسلم: { يَسْاَلُونَكَ مَاذَا اُحِلَّ لَهُمْ ْ} من الاطعمه؟ { قُلْ اُحِلَّ لَكُمُ الطَّيِّبَاتُ ْ} وهي كل ما فيه نفع او لذه, من غير ضرر بالبدن ولا بالعقل، فدخل في ذلك جميع الحبوب والثمار التي في القري والبراري، ودخل في ذلك جميع حيوانات البحر وجميع حيوانات البر، الا ما استثناه الشارع، كالسباع والخبايث منها. ولهذا دلت الايه بمفهومها علي تحريم الخبايث، كما صرح به في قوله تعالي: { وَيُحِلُّ لَهُمُ الطَّيِّبَاتِ وَيُحَرِّمُ عَلَيْهِمُ الْخَبَايِثَ ْ} { وَمَا عَلَّمْ",
        "char_start": 0,
        "char_end": 2329,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "كرر تعالي احلال الطيبات لبيان الامتنان، ودعوه للعباد الي شكره والاكثار من ذكره، حيث اباح لهم ما تدعوهم الحاجه اليه، ويحصل لهم الانتفاع به من الطيبات. { وَطَعَامُ الَّذِينَ اُوتُوا الْكِتَابَ حِلٌّ لَّكُمْ ْ} اي: ذبايح اليهود والنصاري حلال لكم -يا معشر المسلمين- دون باقي الكفار، فان ذبايحهم لا تحل للمسلمين، وذلك لان اهل الكتاب ينتسبون الي الانبياء والكتب. وقد اتفق الرسل كلهم علي تحريم الذبح لغير الله، لانه شرك، فاليهود والنصاري يتدينون بتحريم الذبح لغير الله، فلذلك ابيحت ذبايحهم دون غيرهم. والدلي",
        "char_start": 0,
        "char_end": 2771,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_006_chunk00",
        "verse_key": "5:6",
        "text_ar": "هذه ايه عظيمه قد اشتملت علي احكام كثيره، نذكر منها ما يسره الله وسهله. احدها: ان هذه المذكورات فيها امتثالها والعمل بها من لوازم الايمان الذي لا يتم الا به، لانه صدرها بقوله { يَاَيُّهَا الَّذِينَ امَنُوا ْ} الي اخرها. اي: يا ايها الذين امنوا، اعملوا بمقتضي ايمانكم بما شرعناه لكم. الثاني: الامر بالقيام بالصلاه لقوله: { اِذَا قُمْتُمْ اِلَي الصَّلَاهِ ْ} الثالث: الامر بالنيه للصلاه، لقوله: { اِذَا قُمْتُمْ اِلَي الصَّلَاهِ ْ} اي: بقصدها ونيتها. الرابع: اشتراط الطهاره لصحه الصلاه، لان الله امر بها",
        "char_start": 0,
        "char_end": 6343,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_087_chunk00",
        "verse_key": "5:87",
        "text_ar": "يقول تعالي { يَا اَيُّهَا الَّذِينَ امَنُوا لَا تُحَرِّمُوا طَيِّبَاتِ مَا اَحَلَّ اللَّهُ لَكُمْ } من المطاعم والمشارب، فانها نعم انعم الله بها عليكم، فاحمدوه اذ احلها لكم، واشكروه ولا تردوا نعمته بكفرها او عدم قبولها، او اعتقاد تحريمها، فتجمعون بذلك بين القول علي الله الكذب، وكفر النعمه، واعتقاد الحلال الطيب حراما خبيثا، فان هذا من الاعتداء. والله قد نهي عن الاعتداء فقال: { وَلَا تَعْتَدُوا اِنَّ اللَّهَ لَا يُحِبُّ الْمُعْتَدِينَ } بل يبغضهم ويمقتهم ويعاقبهم علي ذلك.",
        "char_start": 0,
        "char_end": 474,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_088_chunk00",
        "verse_key": "5:88",
        "text_ar": "ثم امر بضد ما عليه المشركون، الذين يحرمون ما احل الله فقال: { وَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلَالًا طَيِّبًا } اي: كلوا من رزقه الذي ساقه اليكم، بما يسره من الاسباب، اذا كان حلَالًا لا سرقه ولا غصبا ولا غير ذلك من انواع الاموال التي توخذ بغير حق، وكان ايضا طيبا، وهو الذي لا خبث فيه، فخرج بذلك الخبيث من السباع والخبايث. { وَاتَّقُوا اللَّهَ } في امتثال اوامره، واجتناب نواهيه. { الَّذِي اَنْتُمْ بِهِ مُوْمِنُونَ } فان ايمانكم بالله يوجب عليكم تقواه ومراعاه حقه، فانه لا يتم الا بذلك. ودلت الا",
        "char_start": 0,
        "char_end": 871,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_005_100_chunk00",
        "verse_key": "5:100",
        "text_ar": "اي: { قُلْ } للناس محذرا عن الشر ومرغبا في الخير: { لَا يَسْتَوِي الْخَبِيثُ وَالطَّيِّبُ } من كل شيء، فلا يستوي الايمان والكفر، ولا الطاعه والمعصيه، ولا اهل الجنه واهل النار، ولا الاعمال الخبيثه والاعمال الطيبه، ولا المال الحرام بالمال الحلال. { وَلَوْ اَعْجَبَكَ كَثْرَهُ الْخَبِيثِ } فانه لا ينفع صاحبه شييا، بل يضره في دينه ودنياه. { فَاتَّقُوا اللَّهَ يَا اُولِي الْاَلْبَابِ لَعَلَّكُمْ تُفْلِحُونَ } فامر اُولي الالباب، اي: اهل العقول الوافيه، والاراء الكامله، فان الله تعالي يوجه اليهم الخطاب",
        "char_start": 0,
        "char_end": 686,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_032_chunk00",
        "verse_key": "7:32",
        "text_ar": "يقول تعالي منكرا علي من تعنت، وحرم ما احل اللّه من الطيبات { قُلْ مَنْ حَرَّمَ زِينَهَ اللَّهِ الَّتِي اَخْرَجَ لِعِبَادِهِ } من انواع اللباس علي اختلاف اصنافه، والطيبات من الرزق، من ماكل ومشرب بجميع انواعه، اي: مَن هذا الذي يقدم علي تحريم ما انعم اللّه بها علي العباد، ومن ذا الذي يضيق عليهم ما وسَّعه اللّه؟\". وهذا التوسيع من اللّه لعباده بالطيبات، جعله لهم ليستعينوا به علي عبادته، فلم يبحه الا لعباده المومنين، ولهذا قال: { قُلْ هِيَ لِلَّذِينَ امَنُوا فِي الْحَيَاهِ الدُّنْيَا خَالِصَهً يَوْمَ ",
        "char_start": 0,
        "char_end": 862,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_058_chunk00",
        "verse_key": "7:58",
        "text_ar": "ثم ذكر تفاوت الاراضي، التي ينزل عليها المطر، فقال: { وَالْبَلَدُ الطَّيِّبُ } اي: طيب التربه والماده، اذا نزل عليه مطر { يَخْرُجُ نَبَاتُهُ } الذي هو مستعد له { بِاِذْنِ رَبِّهِ } اي: باراده اللّه ومشييته، فليست الاسباب مستقله بوجود الاشياء، حتي ياذن اللّه بذلك. { وَالَّذِي خَبُثَ } من الاراضي { لَا يَخْرُجُ اِلَّا نَكِدًا } اي: الا نباتا خاسا لا نفع فيه ولا بركه. { كَذَلِكَ نُصَرِّفُ الْايَاتِ لِقَوْمٍ يَشْكُرُونَ } اي: ننوعها ونبينها ونضرب فيها الامثال ونسوقها لقوم يشكرون اللّه بالاعتراف بنعمه",
        "char_start": 0,
        "char_end": 1231,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_157_chunk00",
        "verse_key": "7:157",
        "text_ar": "الَّذِينَ يَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الامِّيَّ احتراز عن ساير الانبياء، فان المقصود بهذا محمد بن عبد اللّه بن عبد المطلب صلي الله عليه وسلم. والسياق في احوال بني اسراييل وان الايمان بالنبي محمد صلي الله عليه وسلم شرط في دخولهم في الايمان، وان المومنين به المتبعين، هم اهل الرحمه المطلقه، التي كتبها اللّه لهم، ووصفه بالامي لانه من العرب الامه الاميه، التي لا تقرا ولا تكتب، وليس عندها قبل القران كتاب. الَّذِي يَجِدُونَهُ مَكْتُوبًا عِنْدَهُمْ فِي التَّوْرَاهِ وَالاِنْجِيلِ باسمه وصفته، التي",
        "char_start": 0,
        "char_end": 1755,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_007_160_chunk00",
        "verse_key": "7:160",
        "text_ar": "وَقَطَّعْنَاهُمُ اي: قسمناهم اثْنَتَيْ عَشْرَهَ اَسْبَاطًا اُمَمًا اي: اثنتي عشره قبيله متعارفه متوالفه، كل بني رجل من اولاد يعقوب قبيله. وَاَوْحَيْنَا اِلَي مُوسَي اِذِ اسْتَسْقَاهُ قَوْمُهُ اي: طلبوا منه ان يدعو اللّه تعالي، ان يسقيهم ماء يشربون منه وتشرب منه مواشيهم، وذلك لانهم - واللّه اعلم - في محل قليل الماء. فاوحي اللّه لموسي اجابه لطلبتهم اَنِ اضْرِبْ بِعَصَاكَ الْحَجَرَ يحتمل انه حجر معين، ويحتمل انه اسم جنس، يشمل اي حجر كان، فضربه فَانْبَجَسَتْ اي: انفجرت من ذلك الحجر اثْنَتَا عَشْرَهَ",
        "char_start": 0,
        "char_end": 1208,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_008_026_chunk00",
        "verse_key": "8:26",
        "text_ar": "يقول تعالي ممتنا علي عباده في نصرهم بعد الذله، وتكثيرهم بعد القله، واغنايهم بعد العيله‏.‏ ‏{‏وَاذْكُرُوا اِذْ اَنْتُمْ قَلِيلٌ مُسْتَضْعَفُونَ فِي الارْضِ‏}‏ اي‏:‏ مقهورون تحت حكم غيركم ‏{‏تَخَافُونَ اَنْ يَتَخَطَّفَكُمُ النَّاسُ‏}‏ اي‏:‏ ياخذونكم‏.‏ ‏{‏فَاوَاكُمْ وَاَيَّدَكُمْ بِنَصْرِهِ وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ‏}‏ فجعل لكم بلدا تاوون اليه، وانتصر من اعدايكم علي ايديكم، وغنمتم من اموالهم ما كنتم به اغنياء‏.‏ ‏{‏لَعَلَّكُمْ تَشْكُرُونَ‏}‏ اللّه علي منته العظيمه واحسانه التام، بان تعبدوه و",
        "char_start": 0,
        "char_end": 520,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_057_chunk00",
        "verse_key": "2:57",
        "text_ar": "القول في تاويل قوله تعالي وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ(وظللنا عليكم الغمام) عطف علي قوله: ثُمَّ بَعَثْنَاكُمْ مِنْ بَعْدِ مَوْتِكُمْ . فتاويل الايه: ثم بعثناكم من بعد موتكم , وظللنا عليكم الغمام - وعدد عليهم ساير ما انعم به عليهم - لعلكم تشكرون .* * *و \" الغمام \" جمع \" غمامه \"، كما السحاب جمع سحابه ,\" والغمام \" هو ما غم السماء فالبسها من سحاب وقتام، وغير ذلك مما يسترها عن اعين الناظرين . وكل مغطي فالعرب تسميه مغموما. (175)* * *وقد قيل: ان الغمام التي ظللها الله علي بني اسراييل لم تكن سحابا",
        "char_start": 0,
        "char_end": 18407,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_168_chunk00",
        "verse_key": "2:168",
        "text_ar": "القول في تاويل قوله تعالي : يَا اَيُّهَا النَّاسُ كُلُوا مِمَّا فِي الاَرْضِ حَلالا طَيِّبًا وَلا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ اِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ (168)قال ابو جعفر: يعني تعالي ذكره بذلك: يا ايّها الناسُ كلوا مما احللت لكم من الاطعمه علي لسان رسولي محمد صلي الله عليه وسلم فطيَّبْته لكم - مما تُحرِّمونه عَلي انفسكم من البحاير والسوايب والوصايل وما اشبه ذلك مما لم احرِّمه عليكم = دون مَا حرَّمته عليكم من المطاعم والماكل فنجَّسته من مَيته ودم ولحم خنـزير وما اهِلّ به لغيري. ودَعوا ",
        "char_start": 0,
        "char_end": 3493,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_172_chunk00",
        "verse_key": "2:172",
        "text_ar": "القول في تاويل قوله تعالي : يَا اَيُّهَا الَّذِينَ امَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُوا لِلَّهِ اِنْ كُنْتُمْ اِيَّاهُ تَعْبُدُونَ (172)قال ابو جعفر: يعني تعالي ذكره بقوله: \" يا ايها الذين امنوا \"، يا ايها الذين صدَّقوا الله ورسوله, واقروا لله بالعبوديه, واذعنوا له بالطاعه، كما:-2467- حدثني المثني قال، حدثنا اسحاق قال، حدثنا ابو زهير، عن جويبر, عن الضحاك في قوله: \" يا ايها الذين امنوا \"، يقول: صدَّقوا.* * *\" كلوا من طيبات ما رَزَقناكم \"، يعني: اطعَموا من حَلال الرزق الذي ",
        "char_start": 0,
        "char_end": 1409,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_267_chunk00",
        "verse_key": "2:267",
        "text_ar": "القول في تاويل قوله : يَا اَيُّهَا الَّذِينَ امَنُوا اَنْفِقُواقال ابو جعفر: يعني جل ثناوه بقوله: \" يا ايها الذين امنوا \"، صدقوا بالله ورسوله واي كتابه.* * *ويعني بقوله: \" انفقوا \"، زكُّوا وتصدقوا، كما:-6120 - حدثني المثني، قال: حدثنا عبد الله، قال: حدثني معاويه، عن علي، عن ابن عباس قوله: \" انفقوا من طيبات ما كسبتم \" يقول: تصدَّقوا.* * *القول في تاويل قوله : مِنْ طَيِّبَاتِ مَا كَسَبْتُمْيعني بذلك جل ثناوه: زكوا من طيّب ما كسبتم بتصرُّفكم= اما بتجاره، واما بصناعه= من الذهب والفضه.ويعني ب \" الطيب",
        "char_start": 0,
        "char_end": 21666,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_038_chunk00",
        "verse_key": "3:38",
        "text_ar": "القول في تاويل قوله : هُنَالِكَ دَعَا زَكَرِيَّا رَبَّهُ قَالَ رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّهً طَيِّبَهً اِنَّكَ سَمِيعُ الدُّعَاءِ (38)قال ابو جعفر: واما قوله: \" هنالك دعا زكريا ربه \"، فمعناها: عند ذلك، اي: عند رويه زكريا ما راي عند مريم من رزق الله الذي رَزَقها، وفضله الذي اتاها من غير تسبُّب احد من الادميين في ذلك لها = (1) ومعاينته عندَها الثمره &; 6-360 &; الرّطبه التي لا تكون في حين رويته اياها عندَها في الارض = (2) طمع بالولد، مع كبر سنه، من المراه العاقر. فرجا ان يرزقه الله منها ",
        "char_start": 0,
        "char_end": 5433,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_003_179_chunk00",
        "verse_key": "3:179",
        "text_ar": "القول في تاويل قوله : مَا كَانَ اللَّهُ لِيَذَرَ الْمُوْمِنِينَ عَلَي مَا اَنْتُمْ عَلَيْهِ حَتَّي يَمِيزَ الْخَبِيثَ مِنَ الطَّيِّبِقال ابو جعفر: يعني بقوله: \" ما كان الله ليذر المومنين \"، ما كان الله ليدع المومنين (31) =\" علي ما انتم عليه \" من التباس المومن منكم بالمنافق، فلا يعرف هذا من هذا=\" حتي يميز الخبيث من الطيب \"، يعني بذلك: \" حتي يميز الخبيث \" وهو المنافق المستسرُّ للكفر (32) =\" من الطيب \"، وهو المومن المخلص الصادق الايمان، (33) بالمحن والاختبار، كما ميَّز بينهم يوم احد عند لقاء العدوّ",
        "char_start": 0,
        "char_end": 5408,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_002_chunk00",
        "verse_key": "4:2",
        "text_ar": "القول في تاويل قوله : وَاتُوا الْيَتَامَي اَمْوَالَهُمْ وَلا تَتَبَدَّلُوا الْخَبِيثَ بِالطَّيِّبِقال ابو جعفر: يعني بذلك تعالي ذكره اوصياءَ اليتامي. يقول لهم: واعطوا يا معشر اوصياء اليتامي: [اليتامي] اموالهم اذا هم بلغوا الحلم، (24) واونس منهم الرشد (25) = \" ولا تتبدلوا الخبيث بالطيب \"، يقول: ولا تستبدلوا الحرام عليكم من اموالهم باموالكم الحلال لكم، كما:-8436 - حدثنا محمد بن عمرو قال، حدثنا ابو عاصم قال، حدثنا عيسي، عن ابن ابي نجيح، عن مجاهد في قول الله تعالي: \" ولا تتبدلوا الخبيث بالطيب \"، قال",
        "char_start": 0,
        "char_end": 8577,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_043_chunk00",
        "verse_key": "4:43",
        "text_ar": "يا ايها الذين امنوا لا تقربوا الصلاه وانتم سكاري حتي تعلموا ماالقول في تاويل قوله تعالي : { يا ايها الذين امنوا لا تقربوا الصلاه وانتم سكاري حتي تعلموا ما تقولون } يعني بقوله جل ثناوه : { يا ايها الذين امنوا } صدقوا الله ورسوله { لا تقربوا الصلاه } لا تصلوا { وانتم سكاري } وهو جمع سكران , { حتي تعلموا ما تقولون } في صلاتكم , وتقرءون فيها مما امركم الله به , او ندبكم الي قيله فيها مما نهاكم عنه وزجركم . ثم اختلف اهل التاويل في السكر الذي عناه الله بقوله : { لا تقربوا الصلاه وانتم سكاري } فقال بعض",
        "char_start": 0,
        "char_end": 38721,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_004_160_chunk00",
        "verse_key": "4:160",
        "text_ar": "القول في تاويل قوله : فَبِظُلْمٍ مِنَ الَّذِينَ هَادُوا حَرَّمْنَا عَلَيْهِمْ طَيِّبَاتٍ اُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَنْ سَبِيلِ اللَّهِ كَثِيرًا (160)قال ابو جعفر: يعني بذلك جل ثناوه: فحرَّمنا علي اليهود الذين نقضوا ميثاقهم الذي واثقوا ربهم، وكفروا بايات الله، وقتلوا انبياءهم، وقالوا البهتان علي مريم، وفعلوا ما وصفهم الله في كتابه= طيباتٍ من الماكل وغيرها، كانت لهم حلالا عقوبه لهم بظلمهم، الذي اخبر الله عنهم في كتابه، (68) كما:-10833- حدثنا بشر بن معاذ قال، حدثنا يزيد قال، حدثنا سعيد، عن قت",
        "char_start": 0,
        "char_end": 1596,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_004_chunk00",
        "verse_key": "5:4",
        "text_ar": "يسالونك ماذا احل لهم قل احل لكم الطيبات وما علمتم من الجوارح مكلبينالقول في تاويل قوله تعالي : { يسالونك ماذا احل لهم قل احل لكم الطيبات وما علمتم من الجوارح مكلبين } يعني بذلك جل ثناوه : يسالك يا محمد اصحابك ما الذي احل لهم اكله من المطاعم والماكل , فقل لهم : احل منها الطيبات , وهي الحلال الذي اذن لكم ربكم في اكله من الذبايح , واحل لكم ايضا مع ذلك صيد ما علمتم من الجوارح , ومن الكواسب من سباع البهايم والطير , سميت جوارح لجرحها لاربابها وكسبها اياهم اقواتهم من الصيد , يقال منه : جرح فلان لاهله خ",
        "char_start": 0,
        "char_end": 26724,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_005_chunk00",
        "verse_key": "5:5",
        "text_ar": "القول في تاويل قوله : الْيَوْمَ اُحِلَّ لَكُمُ الطَّيِّبَاتُ وَطَعَامُ الَّذِينَ اُوتُوا الْكِتَابَ حِلٌّ لَكُمْ وَطَعَامُكُمْ حِلٌّ لَهُمْقال ابو جعفر: يعني جل ثناوه بقوله: \" اليوم احل لكم الطيبات \"، اليوم احل لكم، ايها المومنون، الحلالُ من الذبايح والمطاعم دون الخبايث منها.وقوله: \" وطعام الذين اوتوا الكتاب حلٌّ لكم \"، وذبايحُ اهل الكتاب من &; 9-573 &; اليهود والنصاري = وهم الذين اوتوا التوراه والانجيل وانـزل عليهم, فدانُوا بهما او باحدهما =\" حل لكم \" (176) يقول: حلالٌ لكم، اكله دون ذبايح ساير ",
        "char_start": 0,
        "char_end": 30549,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_006_chunk00",
        "verse_key": "5:6",
        "text_ar": "يا ايها الذين امنوا اذا قمتم اليالقول في تاويل قوله تعالي : { يا ايها الذين امنوا اذا قمتم الي الصلاه } يعني بذلك جل ثناوه : يا ايها الذين امنوا اذا قمتم الي الصلاه وانتم علي غير طهر الصلاه , فاغسلوا وجوهكم بالماء , وايديكم الي المرافق . ثم اختلف اهل التاويل في قوله : { اذا قمتم الي الصلاه } امراد به كل حال قام اليها , او بعضها ؟ واي احوال القيام اليها ؟ فقال بعضهم في ذلك بنحو ما قلنا فيه من انه معني به بعض احوال القيام اليها دون كل الاحوال , وان الحال التي عني بها حال القيام اليها علي غير طهر .",
        "char_start": 0,
        "char_end": 38671,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_087_chunk00",
        "verse_key": "5:87",
        "text_ar": "القول في تاويل قوله : يَا اَيُّهَا الَّذِينَ امَنُوا لا تُحَرِّمُوا طَيِّبَاتِ مَا اَحَلَّ اللَّهُ لَكُمْ وَلا تَعْتَدُوا اِنَّ اللَّهَ لا يُحِبُّ الْمُعْتَدِينَ (87)قال ابو جعفر: يقول تعالي ذكره: يا ايها الذين صدَّقوا الله ورسوله، واقرُّوا بما جاءهم به نبيُّهم صلي الله عليه وسلم انه حق من عند الله=\" لا تحرّموا طيبات ما احل الله لكم \"، يعني بـ\" الطيبات \"، اللذيذات التي تشتهيها النفوس، وتميل اليها القلوب، (15)فتمنعوها ايّاها، كالذي فعله القسِّيسون والرُّهبان، فحرَّموا علي انفسِهم النساءَ والمطاعم",
        "char_start": 0,
        "char_end": 15233,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_088_chunk00",
        "verse_key": "5:88",
        "text_ar": "القول في تاويل قوله : وَكُلُوا مِمَّا رَزَقَكُمُ اللَّهُ حَلالا طَيِّبًا وَاتَّقُوا اللَّهَ الَّذِي اَنْتُمْ بِهِ مُوْمِنُونَ (88)قال ابو جعفر: يقول تعالي ذكره، لهولاء المومنين الذين نهَاهم ان يحرِّموا طيبات ما احلّ الله لهم: كُلوا، ايها المومنون، من رزق الله الذي رَزقكم واحله لكم، حلالا طيِّبًا، (33) كما:-12355 - حدثنا القاسم قال، حدثنا الحسين قال، حدثني حجاج، عن ابن جريج، عن عكرمه: \" وكلوا مما رزقكم الله حلالا طيبًا \" يعني: ما احل الله لهم من الطعام.* * *واما قوله: \" واتقوا الله الذي انتم به م",
        "char_start": 0,
        "char_end": 897,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_005_100_chunk00",
        "verse_key": "5:100",
        "text_ar": "القول في تاويل قوله : قُلْ لا يَسْتَوِي الْخَبِيثُ وَالطَّيِّبُ وَلَوْ اَعْجَبَكَ كَثْرَهُ الْخَبِيثِقال ابو جعفر: يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم، قل يا محمد: لا يعتدل الرديء والجيد, والصالح والطالح, والمطيع والعاصي (112) = ولو اعجبك كثره الخبيث \"، يقول: لا يعتدل العاصي والمطيع لله عند الله، ولو كثر اهل المعاصي فعجبت من كثرتهم, لان اهل طاعه الله هم المفلحون الفايزون بثواب الله يوم القيامه وان قلُّوا، دون اهل معصيته= وان اهل معاصيه هم الاخسرون الخايبون وان كثروا.يقول تعالي ذكره لنب",
        "char_start": 0,
        "char_end": 1772,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_032_chunk00",
        "verse_key": "7:32",
        "text_ar": "القول في تاويل قوله : قُلْ مَنْ حَرَّمَ زِينَهَ اللَّهِ الَّتِي اَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِقال ابو جعفر: يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم: قل، يا محمد، لهولاء الجهله من العرب الذين يتعرّون عند طوافهم بالبيت, ويحرمون علي انفسهم ما احللت لهم من طيبات الرزق: من حرَّم، ايها القوم، عليكم زينه الله التي خلقها لعباده ان تتزيَّنوا بها وتتجملوا بلباسها, والحلال من رزق الله الذي رزق خلقه لمطاعمهم ومشاربهم. (12)* * *واختلف اهل التاويل في المعنيّ: بـ\" الطيبات من الرزق \"،",
        "char_start": 0,
        "char_end": 9665,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_058_chunk00",
        "verse_key": "7:58",
        "text_ar": "القول في تاويل قوله : وَالْبَلَدُ الطَّيِّبُ يَخْرُجُ نَبَاتُهُ بِاِذْنِ رَبِّهِ وَالَّذِي خَبُثَ لا يَخْرُجُ اِلا نَكِدًا كَذَلِكَ نُصَرِّفُ الايَاتِ لِقَوْمٍ يَشْكُرُونَ (58)قال ابو جعفر: يقول تعالي ذكره: والبلدُ الطيبه تربته، العذبهُ مشاربه، يخرج نباته اذا انـزل الله الغيث وارسل عليه الحيا، باذنه، طيبًا ثمرُه في حينه ووقته. والذي خَبُث فردوت تربته، وملحت مشاربه، لا يخرج نباته الا نكدًا == يقول: الا عَسِرًا في شده، كما قال الشاعر: (1)لا تُنْجِــزُ الوعْـدَ, اِنْ وَعَـدْتَ, واناَعْطَيْــتَ اَعْ",
        "char_start": 0,
        "char_end": 4478,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_157_chunk00",
        "verse_key": "7:157",
        "text_ar": "القول في تاويل قوله : الَّذِينَ يَتَّبِعُونَ الرَّسُولَ النَّبِيَّ الاُمِّيَّ الَّذِي يَجِدُونَهُ مَكْتُوبًا عِنْدَهُمْ فِي التَّوْرَاهِ وَالاِنْجِيلِقال ابو جعفر: وهذا القول ابانهٌ من الله جل ثناوه عن انّ الذين وَعَد موسي نبيَّه عليه السلام ان يكتب لهم الرحمه التي وصفَها جل ثناوه بقوله: وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ ، هم امه محمد صلي الله عليه وسلم, لانه لا يعلم لله رسولٌ وُصف بهذه الصفه = اعني \" الامي\" = غير نبينا محمد صلي الله عليه وسلم. وبذلك جاءت الروايات عن اهل التاويل.* ذكر من قال ذلك",
        "char_start": 0,
        "char_end": 12252,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_007_160_chunk00",
        "verse_key": "7:160",
        "text_ar": "القول في تاويل قوله : وَقَطَّعْنَاهُمُ اثْنَتَيْ عَشْرَهَ اَسْبَاطًا اُمَمًاقال ابو جعفر: يقول تعالي ذكره: فرقناهم= يعني قوم موسي من بني اسراييل, فرقهم الله فجعلهم قبايل شتي, اثنتي عشره قبيله.* * *وقد بينا معني \" الاسباط\"، فيما مضي، ومن هم. (1)* * *واختلف اهل العربيه في وجه تانيث \" الاثنتي عشره \"، و \" الاسباط\" جمع مذكر. فقال بعض نحويي البصره: اراد اثنتي عشره فرقه, ثم اخبر ان الفرق \" اسباط\", ولم يجعل العدد علي \" اسباط\".* * *وكان بعضهم يستخِلُّ هذا التاويل ويقول (2) لا يخرج العدد علي غير التالي, (",
        "char_start": 0,
        "char_end": 5064,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_008_026_chunk00",
        "verse_key": "8:26",
        "text_ar": "القول في تاويل قوله : وَاذْكُرُوا اِذْ اَنْتُمْ قَلِيلٌ مُسْتَضْعَفُونَ فِي الاَرْضِ تَخَافُونَ اَنْ يَتَخَطَّفَكُمُ النَّاسُ فَاوَاكُمْ وَاَيَّدَكُمْ بِنَصْرِهِ وَرَزَقَكُمْ مِنَ الطَّيِّبَاتِ لَعَلَّكُمْ تَشْكُرُونَ (26)قال ابو جعفر: وهذا تذكيرٌ من الله عز وجل اصحابَ رسول الله صلي الله عليه وسلم، ومناصحه. يقول: اطيعوا الله ورسوله، ايها المومنون, واستجيبوا له اذا دعاكم لما يحييكم، ولا تخالفوا امرَه وان امركم بما فيه عليكم المشقه والشده, فان الله يهوِّنه عليكم بطاعتكم اياه، ويعجِّل لكم منه ما تح",
        "char_start": 0,
        "char_end": 4530,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [],
  "incoming_edges": [],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [
      {
        "value": "ORG_TONGUE",
        "citation_type": "rule",
        "confidence": 0.95,
        "citation_ref": "RULE_SPEECH_TONGUE"
      }
    ],
    "internal_external": {
      "value": "ظاهر",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_EXTERNAL_BEH_SPEECH_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 42,
    "quran_direct_count": 42,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 0,
    "causal_path_count": 0,
    "context_known_count": 1,
    "context_unknown_count": 6
  },
  "completeness_score": 0.764,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "intention_niyyah",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:49.703294Z",
  "schema_version": "1.0.0"
}