{
  "behavior_id": "BEH_SPI_RECITATION",
  "label_ar": "التلاوة",
  "label_en": "Recitation",
  "category": "spiritual",
  "roots": [
    "ت-ل-و"
  ],
  "stems": [],
  "synonyms_ar": [
    "يتلون",
    "تلا",
    "التالين",
    "قراءة القرآن"
  ],
  "synonyms_en": [],
  "antonyms": [],
  "morphological_variants": [],
  "quranic_phrases": [],
  "quran_evidence": [
    {
      "verse_key": "2:44",
      "text_ar": "أَتَأْمُرُونَ ٱلنَّاسَ بِٱلْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ ٱلْكِتَـٰبَ ۚ أَفَلَا تَعْقِلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:54",
      "text_ar": "وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِۦ يَـٰقَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُم بِٱتِّخَاذِكُمُ ٱلْعِجْلَ فَتُوبُوٓا۟ إِلَىٰ بَارِئِكُمْ فَٱقْتُلُوٓا۟ أَنفُسَكُمْ ذَٰلِكُمْ خَيْرٌ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ ۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:61",
      "text_ar": "وَإِذْ قُلْتُمْ يَـٰمُوسَىٰ لَن نَّصْبِرَ عَلَىٰ طَعَامٍ وَٰحِدٍ فَٱدْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنۢبِتُ ٱلْأَرْضُ مِنۢ بَقْلِهَا وَقِثَّآئِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا ۖ قَالَ أَتَسْتَبْدِلُونَ ٱلَّذِى هُوَ أَدْنَىٰ بِٱلَّذِى هُوَ خَيْرٌ ۚ ٱهْبِطُوا۟ مِصْرًا فَإِنَّ لَكُم مَّا سَأَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ وَٱلْمَسْكَنَةُ وَبَآءُو بِغَضَبٍ مِّنَ ٱللَّهِ ۗ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيْرِ ٱلْحَقِّ ۗ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:85",
      "text_ar": "ثُمَّ أَنتُمْ هَـٰٓؤُلَآءِ تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَـٰرِهِمْ تَظَـٰهَرُونَ عَلَيْهِم بِٱلْإِثْمِ وَٱلْعُدْوَٰنِ وَإِن يَأْتُوكُمْ أُسَـٰرَىٰ تُفَـٰدُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ ۚ أَفَتُؤْمِنُونَ بِبَعْضِ ٱلْكِتَـٰبِ وَتَكْفُرُونَ بِبَعْضٍ ۚ فَمَا جَزَآءُ مَن يَفْعَلُ ذَٰلِكَ مِنكُمْ إِلَّا خِزْىٌ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَيَوْمَ ٱلْقِيَـٰمَةِ يُرَدُّونَ إِلَىٰٓ أَشَدِّ ٱلْعَذَابِ ۗ وَمَا ٱللَّهُ بِغَـٰفِلٍ عَمَّا تَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:87",
      "text_ar": "وَلَقَدْ ءَاتَيْنَا مُوسَى ٱلْكِتَـٰبَ وَقَفَّيْنَا مِنۢ بَعْدِهِۦ بِٱلرُّسُلِ ۖ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَـٰتِ وَأَيَّدْنَـٰهُ بِرُوحِ ٱلْقُدُسِ ۗ أَفَكُلَّمَا جَآءَكُمْ رَسُولٌۢ بِمَا لَا تَهْوَىٰٓ أَنفُسُكُمُ ٱسْتَكْبَرْتُمْ فَفَرِيقًا كَذَّبْتُمْ وَفَرِيقًا تَقْتُلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:91",
      "text_ar": "وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ بِمَآ أَنزَلَ ٱللَّهُ قَالُوا۟ نُؤْمِنُ بِمَآ أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَآءَهُۥ وَهُوَ ٱلْحَقُّ مُصَدِّقًا لِّمَا مَعَهُمْ ۗ قُلْ فَلِمَ تَقْتُلُونَ أَنۢبِيَآءَ ٱللَّهِ مِن قَبْلُ إِن كُنتُم مُّؤْمِنِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:102",
      "text_ar": "وَٱتَّبَعُوا۟ مَا تَتْلُوا۟ ٱلشَّيَـٰطِينُ عَلَىٰ مُلْكِ سُلَيْمَـٰنَ ۖ وَمَا كَفَرَ سُلَيْمَـٰنُ وَلَـٰكِنَّ ٱلشَّيَـٰطِينَ كَفَرُوا۟ يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحْرَ وَمَآ أُنزِلَ عَلَى ٱلْمَلَكَيْنِ بِبَابِلَ هَـٰرُوتَ وَمَـٰرُوتَ ۚ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّىٰ يَقُولَآ إِنَّمَا نَحْنُ فِتْنَةٌ فَلَا تَكْفُرْ ۖ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِۦ بَيْنَ ٱلْمَرْءِ وَزَوْجِهِۦ ۚ وَمَا هُم بِضَآرِّينَ بِهِۦ مِنْ أَحَدٍ إِلَّا بِإِذْنِ ٱللَّهِ ۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلَا يَنفَعُهُمْ ۚ وَلَقَدْ عَلِمُوا۟ لَمَنِ ٱشْتَرَىٰهُ مَا لَهُۥ فِى ٱلْـَٔاخِرَةِ مِنْ خَلَـٰقٍ ۚ وَلَبِئْسَ مَا شَرَوْا۟ بِهِۦٓ أَنفُسَهُمْ ۚ لَوْ كَانُوا۟ يَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:113",
      "text_ar": "وَقَالَتِ ٱلْيَهُودُ لَيْسَتِ ٱلنَّصَـٰرَىٰ عَلَىٰ شَىْءٍ وَقَالَتِ ٱلنَّصَـٰرَىٰ لَيْسَتِ ٱلْيَهُودُ عَلَىٰ شَىْءٍ وَهُمْ يَتْلُونَ ٱلْكِتَـٰبَ ۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ لَا يَعْلَمُونَ مِثْلَ قَوْلِهِمْ ۚ فَٱللَّهُ يَحْكُمُ بَيْنَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:121",
      "text_ar": "ٱلَّذِينَ ءَاتَيْنَـٰهُمُ ٱلْكِتَـٰبَ يَتْلُونَهُۥ حَقَّ تِلَاوَتِهِۦٓ أُو۟لَـٰٓئِكَ يُؤْمِنُونَ بِهِۦ ۗ وَمَن يَكْفُرْ بِهِۦ فَأُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:129",
      "text_ar": "رَبَّنَا وَٱبْعَثْ فِيهِمْ رَسُولًا مِّنْهُمْ يَتْلُوا۟ عَلَيْهِمْ ءَايَـٰتِكَ وَيُعَلِّمُهُمُ ٱلْكِتَـٰبَ وَٱلْحِكْمَةَ وَيُزَكِّيهِمْ ۚ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:151",
      "text_ar": "كَمَآ أَرْسَلْنَا فِيكُمْ رَسُولًا مِّنكُمْ يَتْلُوا۟ عَلَيْكُمْ ءَايَـٰتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ ٱلْكِتَـٰبَ وَٱلْحِكْمَةَ وَيُعَلِّمُكُم مَّا لَمْ تَكُونُوا۟ تَعْلَمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:164",
      "text_ar": "إِنَّ فِى خَلْقِ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَـٰفِ ٱلَّيْلِ وَٱلنَّهَارِ وَٱلْفُلْكِ ٱلَّتِى تَجْرِى فِى ٱلْبَحْرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٍ فَأَحْيَا بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍ وَتَصْرِيفِ ٱلرِّيَـٰحِ وَٱلسَّحَابِ ٱلْمُسَخَّرِ بَيْنَ ٱلسَّمَآءِ وَٱلْأَرْضِ لَـَٔايَـٰتٍ لِّقَوْمٍ يَعْقِلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:190",
      "text_ar": "وَقَـٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ ٱلَّذِينَ يُقَـٰتِلُونَكُمْ وَلَا تَعْتَدُوٓا۟ ۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلْمُعْتَدِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:191",
      "text_ar": "وَٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأَخْرِجُوهُم مِّنْ حَيْثُ أَخْرَجُوكُمْ ۚ وَٱلْفِتْنَةُ أَشَدُّ مِنَ ٱلْقَتْلِ ۚ وَلَا تُقَـٰتِلُوهُمْ عِندَ ٱلْمَسْجِدِ ٱلْحَرَامِ حَتَّىٰ يُقَـٰتِلُوكُمْ فِيهِ ۖ فَإِن قَـٰتَلُوكُمْ فَٱقْتُلُوهُمْ ۗ كَذَٰلِكَ جَزَآءُ ٱلْكَـٰفِرِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:193",
      "text_ar": "وَقَـٰتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌ وَيَكُونَ ٱلدِّينُ لِلَّهِ ۖ فَإِنِ ٱنتَهَوْا۟ فَلَا عُدْوَٰنَ إِلَّا عَلَى ٱلظَّـٰلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:217",
      "text_ar": "يَسْـَٔلُونَكَ عَنِ ٱلشَّهْرِ ٱلْحَرَامِ قِتَالٍ فِيهِ ۖ قُلْ قِتَالٌ فِيهِ كَبِيرٌ ۖ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفْرٌۢ بِهِۦ وَٱلْمَسْجِدِ ٱلْحَرَامِ وَإِخْرَاجُ أَهْلِهِۦ مِنْهُ أَكْبَرُ عِندَ ٱللَّهِ ۚ وَٱلْفِتْنَةُ أَكْبَرُ مِنَ ٱلْقَتْلِ ۗ وَلَا يَزَالُونَ يُقَـٰتِلُونَكُمْ حَتَّىٰ يَرُدُّوكُمْ عَن دِينِكُمْ إِنِ ٱسْتَطَـٰعُوا۟ ۚ وَمَن يَرْتَدِدْ مِنكُمْ عَن دِينِهِۦ فَيَمُتْ وَهُوَ كَافِرٌ فَأُو۟لَـٰٓئِكَ حَبِطَتْ أَعْمَـٰلُهُمْ فِى ٱلدُّنْيَا وَٱلْـَٔاخِرَةِ ۖ وَأُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:244",
      "text_ar": "وَقَـٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:246",
      "text_ar": "أَلَمْ تَرَ إِلَى ٱلْمَلَإِ مِنۢ بَنِىٓ إِسْرَٰٓءِيلَ مِنۢ بَعْدِ مُوسَىٰٓ إِذْ قَالُوا۟ لِنَبِىٍّ لَّهُمُ ٱبْعَثْ لَنَا مَلِكًا نُّقَـٰتِلْ فِى سَبِيلِ ٱللَّهِ ۖ قَالَ هَلْ عَسَيْتُمْ إِن كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ أَلَّا تُقَـٰتِلُوا۟ ۖ قَالُوا۟ وَمَا لَنَآ أَلَّا نُقَـٰتِلَ فِى سَبِيلِ ٱللَّهِ وَقَدْ أُخْرِجْنَا مِن دِيَـٰرِنَا وَأَبْنَآئِنَا ۖ فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ تَوَلَّوْا۟ إِلَّا قَلِيلًا مِّنْهُمْ ۗ وَٱللَّهُ عَلِيمٌۢ بِٱلظَّـٰلِمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:252",
      "text_ar": "تِلْكَ ءَايَـٰتُ ٱللَّهِ نَتْلُوهَا عَلَيْكَ بِٱلْحَقِّ ۚ وَإِنَّكَ لَمِنَ ٱلْمُرْسَلِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "2:253",
      "text_ar": "تِلْكَ ٱلرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۘ مِّنْهُم مَّن كَلَّمَ ٱللَّهُ ۖ وَرَفَعَ بَعْضَهُمْ دَرَجَـٰتٍ ۚ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَـٰتِ وَأَيَّدْنَـٰهُ بِرُوحِ ٱلْقُدُسِ ۗ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلَ ٱلَّذِينَ مِنۢ بَعْدِهِم مِّنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَـٰتُ وَلَـٰكِنِ ٱخْتَلَفُوا۟ فَمِنْهُم مَّنْ ءَامَنَ وَمِنْهُم مَّن كَفَرَ ۚ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلُوا۟ وَلَـٰكِنَّ ٱللَّهَ يَفْعَلُ مَا يُرِيدُ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:21",
      "text_ar": "إِنَّ ٱلَّذِينَ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلنَّبِيِّـۧنَ بِغَيْرِ حَقٍّ وَيَقْتُلُونَ ٱلَّذِينَ يَأْمُرُونَ بِٱلْقِسْطِ مِنَ ٱلنَّاسِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:58",
      "text_ar": "ذَٰلِكَ نَتْلُوهُ عَلَيْكَ مِنَ ٱلْـَٔايَـٰتِ وَٱلذِّكْرِ ٱلْحَكِيمِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:93",
      "text_ar": "كُلُّ ٱلطَّعَامِ كَانَ حِلًّا لِّبَنِىٓ إِسْرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسْرَٰٓءِيلُ عَلَىٰ نَفْسِهِۦ مِن قَبْلِ أَن تُنَزَّلَ ٱلتَّوْرَىٰةُ ۗ قُلْ فَأْتُوا۟ بِٱلتَّوْرَىٰةِ فَٱتْلُوهَآ إِن كُنتُمْ صَـٰدِقِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:108",
      "text_ar": "تِلْكَ ءَايَـٰتُ ٱللَّهِ نَتْلُوهَا عَلَيْكَ بِٱلْحَقِّ ۗ وَمَا ٱللَّهُ يُرِيدُ ظُلْمًا لِّلْعَـٰلَمِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:111",
      "text_ar": "لَن يَضُرُّوكُمْ إِلَّآ أَذًى ۖ وَإِن يُقَـٰتِلُوكُمْ يُوَلُّوكُمُ ٱلْأَدْبَارَ ثُمَّ لَا يُنصَرُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:112",
      "text_ar": "ضُرِبَتْ عَلَيْهِمُ ٱلذِّلَّةُ أَيْنَ مَا ثُقِفُوٓا۟ إِلَّا بِحَبْلٍ مِّنَ ٱللَّهِ وَحَبْلٍ مِّنَ ٱلنَّاسِ وَبَآءُو بِغَضَبٍ مِّنَ ٱللَّهِ وَضُرِبَتْ عَلَيْهِمُ ٱلْمَسْكَنَةُ ۚ ذَٰلِكَ بِأَنَّهُمْ كَانُوا۟ يَكْفُرُونَ بِـَٔايَـٰتِ ٱللَّهِ وَيَقْتُلُونَ ٱلْأَنۢبِيَآءَ بِغَيْرِ حَقٍّ ۚ ذَٰلِكَ بِمَا عَصَوا۟ وَّكَانُوا۟ يَعْتَدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:113",
      "text_ar": "لَيْسُوا۟ سَوَآءً ۗ مِّنْ أَهْلِ ٱلْكِتَـٰبِ أُمَّةٌ قَآئِمَةٌ يَتْلُونَ ءَايَـٰتِ ٱللَّهِ ءَانَآءَ ٱلَّيْلِ وَهُمْ يَسْجُدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:153",
      "text_ar": "إِذْ تُصْعِدُونَ وَلَا تَلْوُۥنَ عَلَىٰٓ أَحَدٍ وَٱلرَّسُولُ يَدْعُوكُمْ فِىٓ أُخْرَىٰكُمْ فَأَثَـٰبَكُمْ غَمًّۢا بِغَمٍّ لِّكَيْلَا تَحْزَنُوا۟ عَلَىٰ مَا فَاتَكُمْ وَلَا مَآ أَصَـٰبَكُمْ ۗ وَٱللَّهُ خَبِيرٌۢ بِمَا تَعْمَلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:156",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَكُونُوا۟ كَٱلَّذِينَ كَفَرُوا۟ وَقَالُوا۟ لِإِخْوَٰنِهِمْ إِذَا ضَرَبُوا۟ فِى ٱلْأَرْضِ أَوْ كَانُوا۟ غُزًّى لَّوْ كَانُوا۟ عِندَنَا مَا مَاتُوا۟ وَمَا قُتِلُوا۟ لِيَجْعَلَ ٱللَّهُ ذَٰلِكَ حَسْرَةً فِى قُلُوبِهِمْ ۗ وَٱللَّهُ يُحْىِۦ وَيُمِيتُ ۗ وَٱللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:164",
      "text_ar": "لَقَدْ مَنَّ ٱللَّهُ عَلَى ٱلْمُؤْمِنِينَ إِذْ بَعَثَ فِيهِمْ رَسُولًا مِّنْ أَنفُسِهِمْ يَتْلُوا۟ عَلَيْهِمْ ءَايَـٰتِهِۦ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ ٱلْكِتَـٰبَ وَٱلْحِكْمَةَ وَإِن كَانُوا۟ مِن قَبْلُ لَفِى ضَلَـٰلٍ مُّبِينٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:167",
      "text_ar": "وَلِيَعْلَمَ ٱلَّذِينَ نَافَقُوا۟ ۚ وَقِيلَ لَهُمْ تَعَالَوْا۟ قَـٰتِلُوا۟ فِى سَبِيلِ ٱللَّهِ أَوِ ٱدْفَعُوا۟ ۖ قَالُوا۟ لَوْ نَعْلَمُ قِتَالًا لَّٱتَّبَعْنَـٰكُمْ ۗ هُمْ لِلْكُفْرِ يَوْمَئِذٍ أَقْرَبُ مِنْهُمْ لِلْإِيمَـٰنِ ۚ يَقُولُونَ بِأَفْوَٰهِهِم مَّا لَيْسَ فِى قُلُوبِهِمْ ۗ وَٱللَّهُ أَعْلَمُ بِمَا يَكْتُمُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:168",
      "text_ar": "ٱلَّذِينَ قَالُوا۟ لِإِخْوَٰنِهِمْ وَقَعَدُوا۟ لَوْ أَطَاعُونَا مَا قُتِلُوا۟ ۗ قُلْ فَٱدْرَءُوا۟ عَنْ أَنفُسِكُمُ ٱلْمَوْتَ إِن كُنتُمْ صَـٰدِقِينَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:169",
      "text_ar": "وَلَا تَحْسَبَنَّ ٱلَّذِينَ قُتِلُوا۟ فِى سَبِيلِ ٱللَّهِ أَمْوَٰتًۢا ۚ بَلْ أَحْيَآءٌ عِندَ رَبِّهِمْ يُرْزَقُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:190",
      "text_ar": "إِنَّ فِى خَلْقِ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَـٰفِ ٱلَّيْلِ وَٱلنَّهَارِ لَـَٔايَـٰتٍ لِّأُو۟لِى ٱلْأَلْبَـٰبِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "3:195",
      "text_ar": "فَٱسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّى لَآ أُضِيعُ عَمَلَ عَـٰمِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ بَعْضُكُم مِّنۢ بَعْضٍ ۖ فَٱلَّذِينَ هَاجَرُوا۟ وَأُخْرِجُوا۟ مِن دِيَـٰرِهِمْ وَأُوذُوا۟ فِى سَبِيلِى وَقَـٰتَلُوا۟ وَقُتِلُوا۟ لَأُكَفِّرَنَّ عَنْهُمْ سَيِّـَٔاتِهِمْ وَلَأُدْخِلَنَّهُمْ جَنَّـٰتٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ثَوَابًا مِّنْ عِندِ ٱللَّهِ ۗ وَٱللَّهُ عِندَهُۥ حُسْنُ ٱلثَّوَابِ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:6",
      "text_ar": "وَٱبْتَلُوا۟ ٱلْيَتَـٰمَىٰ حَتَّىٰٓ إِذَا بَلَغُوا۟ ٱلنِّكَاحَ فَإِنْ ءَانَسْتُم مِّنْهُمْ رُشْدًا فَٱدْفَعُوٓا۟ إِلَيْهِمْ أَمْوَٰلَهُمْ ۖ وَلَا تَأْكُلُوهَآ إِسْرَافًا وَبِدَارًا أَن يَكْبَرُوا۟ ۚ وَمَن كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ ۖ وَمَن كَانَ فَقِيرًا فَلْيَأْكُلْ بِٱلْمَعْرُوفِ ۚ فَإِذَا دَفَعْتُمْ إِلَيْهِمْ أَمْوَٰلَهُمْ فَأَشْهِدُوا۟ عَلَيْهِمْ ۚ وَكَفَىٰ بِٱللَّهِ حَسِيبًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:29",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَأْكُلُوٓا۟ أَمْوَٰلَكُم بَيْنَكُم بِٱلْبَـٰطِلِ إِلَّآ أَن تَكُونَ تِجَـٰرَةً عَن تَرَاضٍ مِّنكُمْ ۚ وَلَا تَقْتُلُوٓا۟ أَنفُسَكُمْ ۚ إِنَّ ٱللَّهَ كَانَ بِكُمْ رَحِيمًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:66",
      "text_ar": "وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ ٱقْتُلُوٓا۟ أَنفُسَكُمْ أَوِ ٱخْرُجُوا۟ مِن دِيَـٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِيلٌ مِّنْهُمْ ۖ وَلَوْ أَنَّهُمْ فَعَلُوا۟ مَا يُوعَظُونَ بِهِۦ لَكَانَ خَيْرًا لَّهُمْ وَأَشَدَّ تَثْبِيتًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:75",
      "text_ar": "وَمَا لَكُمْ لَا تُقَـٰتِلُونَ فِى سَبِيلِ ٱللَّهِ وَٱلْمُسْتَضْعَفِينَ مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلْوِلْدَٰنِ ٱلَّذِينَ يَقُولُونَ رَبَّنَآ أَخْرِجْنَا مِنْ هَـٰذِهِ ٱلْقَرْيَةِ ٱلظَّالِمِ أَهْلُهَا وَٱجْعَل لَّنَا مِن لَّدُنكَ وَلِيًّا وَٱجْعَل لَّنَا مِن لَّدُنكَ نَصِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:76",
      "text_ar": "ٱلَّذِينَ ءَامَنُوا۟ يُقَـٰتِلُونَ فِى سَبِيلِ ٱللَّهِ ۖ وَٱلَّذِينَ كَفَرُوا۟ يُقَـٰتِلُونَ فِى سَبِيلِ ٱلطَّـٰغُوتِ فَقَـٰتِلُوٓا۟ أَوْلِيَآءَ ٱلشَّيْطَـٰنِ ۖ إِنَّ كَيْدَ ٱلشَّيْطَـٰنِ كَانَ ضَعِيفًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:82",
      "text_ar": "أَفَلَا يَتَدَبَّرُونَ ٱلْقُرْءَانَ ۚ وَلَوْ كَانَ مِنْ عِندِ غَيْرِ ٱللَّهِ لَوَجَدُوا۟ فِيهِ ٱخْتِلَـٰفًا كَثِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:89",
      "text_ar": "وَدُّوا۟ لَوْ تَكْفُرُونَ كَمَا كَفَرُوا۟ فَتَكُونُونَ سَوَآءً ۖ فَلَا تَتَّخِذُوا۟ مِنْهُمْ أَوْلِيَآءَ حَتَّىٰ يُهَاجِرُوا۟ فِى سَبِيلِ ٱللَّهِ ۚ فَإِن تَوَلَّوْا۟ فَخُذُوهُمْ وَٱقْتُلُوهُمْ حَيْثُ وَجَدتُّمُوهُمْ ۖ وَلَا تَتَّخِذُوا۟ مِنْهُمْ وَلِيًّا وَلَا نَصِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:90",
      "text_ar": "إِلَّا ٱلَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍۭ بَيْنَكُمْ وَبَيْنَهُم مِّيثَـٰقٌ أَوْ جَآءُوكُمْ حَصِرَتْ صُدُورُهُمْ أَن يُقَـٰتِلُوكُمْ أَوْ يُقَـٰتِلُوا۟ قَوْمَهُمْ ۚ وَلَوْ شَآءَ ٱللَّهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَـٰتَلُوكُمْ ۚ فَإِنِ ٱعْتَزَلُوكُمْ فَلَمْ يُقَـٰتِلُوكُمْ وَأَلْقَوْا۟ إِلَيْكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:91",
      "text_ar": "سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأْمَنُوكُمْ وَيَأْمَنُوا۟ قَوْمَهُمْ كُلَّ مَا رُدُّوٓا۟ إِلَى ٱلْفِتْنَةِ أُرْكِسُوا۟ فِيهَا ۚ فَإِن لَّمْ يَعْتَزِلُوكُمْ وَيُلْقُوٓا۟ إِلَيْكُمُ ٱلسَّلَمَ وَيَكُفُّوٓا۟ أَيْدِيَهُمْ فَخُذُوهُمْ وَٱقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ۚ وَأُو۟لَـٰٓئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَـٰنًا مُّبِينًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:135",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ كُونُوا۟ قَوَّٰمِينَ بِٱلْقِسْطِ شُهَدَآءَ لِلَّهِ وَلَوْ عَلَىٰٓ أَنفُسِكُمْ أَوِ ٱلْوَٰلِدَيْنِ وَٱلْأَقْرَبِينَ ۚ إِن يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَٱللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا۟ ٱلْهَوَىٰٓ أَن تَعْدِلُوا۟ ۚ وَإِن تَلْوُۥٓا۟ أَوْ تُعْرِضُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "4:157",
      "text_ar": "وَقَوْلِهِمْ إِنَّا قَتَلْنَا ٱلْمَسِيحَ عِيسَى ٱبْنَ مَرْيَمَ رَسُولَ ٱللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَـٰكِن شُبِّهَ لَهُمْ ۚ وَإِنَّ ٱلَّذِينَ ٱخْتَلَفُوا۟ فِيهِ لَفِى شَكٍّ مِّنْهُ ۚ مَا لَهُم بِهِۦ مِنْ عِلْمٍ إِلَّا ٱتِّبَاعَ ٱلظَّنِّ ۚ وَمَا قَتَلُوهُ يَقِينًۢا",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:24",
      "text_ar": "قَالُوا۟ يَـٰمُوسَىٰٓ إِنَّا لَن نَّدْخُلَهَآ أَبَدًا مَّا دَامُوا۟ فِيهَا ۖ فَٱذْهَبْ أَنتَ وَرَبُّكَ فَقَـٰتِلَآ إِنَّا هَـٰهُنَا قَـٰعِدُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:33",
      "text_ar": "إِنَّمَا جَزَٰٓؤُا۟ ٱلَّذِينَ يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُۥ وَيَسْعَوْنَ فِى ٱلْأَرْضِ فَسَادًا أَن يُقَتَّلُوٓا۟ أَوْ يُصَلَّبُوٓا۟ أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُم مِّنْ خِلَـٰفٍ أَوْ يُنفَوْا۟ مِنَ ٱلْأَرْضِ ۚ ذَٰلِكَ لَهُمْ خِزْىٌ فِى ٱلدُّنْيَا ۖ وَلَهُمْ فِى ٱلْـَٔاخِرَةِ عَذَابٌ عَظِيمٌ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:70",
      "text_ar": "لَقَدْ أَخَذْنَا مِيثَـٰقَ بَنِىٓ إِسْرَٰٓءِيلَ وَأَرْسَلْنَآ إِلَيْهِمْ رُسُلًا ۖ كُلَّمَا جَآءَهُمْ رَسُولٌۢ بِمَا لَا تَهْوَىٰٓ أَنفُسُهُمْ فَرِيقًا كَذَّبُوا۟ وَفَرِيقًا يَقْتُلُونَ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    },
    {
      "verse_key": "5:95",
      "text_ar": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَقْتُلُوا۟ ٱلصَّيْدَ وَأَنتُمْ حُرُمٌ ۚ وَمَن قَتَلَهُۥ مِنكُم مُّتَعَمِّدًا فَجَزَآءٌ مِّثْلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ يَحْكُمُ بِهِۦ ذَوَا عَدْلٍ مِّنكُمْ هَدْيًۢا بَـٰلِغَ ٱلْكَعْبَةِ أَوْ كَفَّـٰرَةٌ طَعَامُ مَسَـٰكِينَ أَوْ عَدْلُ ذَٰلِكَ صِيَامًا لِّيَذُوقَ وَبَالَ أَمْرِهِۦ ۗ عَفَا ٱللَّهُ عَمَّا سَلَفَ ۚ وَمَنْ عَادَ فَيَنتَقِمُ ٱللَّهُ مِنْهُ ۗ وَٱللَّهُ عَزِيزٌ ذُو ٱنتِقَامٍ",
      "text_en": "",
      "relevance": "direct",
      "confidence": 0.85
    }
  ],
  "tafsir_evidence": {
    "baghawi": [
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "{أتأمرون الناس بالبر} أي بالطاعة، نزلت في علماء اليهود، وذلك أن الرجل منهم كان يقول لقريبه وحليفه من المسلمين إذا سأله عن أمر محمد صلى الله عليه وسلم: اثبت على دينه فإن أمره حق وقوله صدق.وقيل: هو خطاب لأحبارهم حيث أمروا أتباعهم بالتمسك بالتوراة، ثم خالفوا وغيروا نعت محمد صلى الله عليه وسلم.{وتنسون أنفسكم} أي تتركون أنفسكم فلا تتبعونه.{وأنتم تتلون الكتاب} تقرؤون التوراة فيها نعته وصفته.{أفلا تعقلون} أنه حق فتتبعونه.والعقل مأخوذ من عقال الدابة؛ وهو ما يشد به ركبة البعير فيمنعه من الشرود، فكذلك الع",
        "char_start": 0,
        "char_end": 1449,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_054_chunk00",
        "verse_key": "2:54",
        "text_ar": "{وإذ قال موسى لقومه} الذين عبدوا العجل.{يا قوم إنكم ظلمتم أنفسكم} ضررتم بأنفسكم.{باتخاذكم العجل} إلهاً قالوا: فأي شيء نصنع؟ قال:{فتوبوا} فارجعوا{إلى بارئكم} خالقكم. قالوا: كيف نتوب؟ قال:{فاقتلوا أنفسكم} يعني ليقتل البريء منكم المجرم.{ذلكم} أي القتل.{خير لكم عند بارئكم} فلما أمرهم موسى بالقتل قالوا: نصبر لأمر الله فجلسوا بالأفنية محتبين وقيل لهم: من مد حبوته أو مد طرفه إلى قاتله أو اتقاه بيد أو رجل فهو ملعون مردودة توبته، وأصلت القوم عليهم الخناجر، فكان الرجل يرى ابنه وأباه وأخاه وقريبه وصديقه وج",
        "char_start": 0,
        "char_end": 1142,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "قوله تعالى: {وإذ قلتم يا موسى لن نصبر على طعام واحد} وذلك أنهم أجمعوا وسئموا من أكل المن والسلوى، وإنما قال: {على طعام واحد} وهما اثنان لأن العرب تعبر عن الاثنين بلفظ الواحد كما تعبر عن الواحد بلفظ الاثنين، كقوله تعالى: {يخرج منهما اللؤلؤ والمرجان} [22-الرحمن] وإنما يخرج من المالح دون العذب.وقيل: كانوا يأكلون أحدهما بالآخر فكانا كطعام واحد.وقال عبد الرحمن بن زيد بن أسلم: \"كانوا يعجنون المن بالسلوى فيصيران واحداً\".{فادع لنا} فاسأل لأجلنا.{ربك يخرج لنا مما تنبت الأرض من بقلها وقثائها وفومها} قال ا",
        "char_start": 0,
        "char_end": 2307,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "قوله عز وجل: {ثم أنتم هؤلاء} يعني: يا هؤلاء، وهؤلاء للتنبيه.{تقتلون أنفسكم} أي (يقتل) بعضكم بعضاً.{وتخرجون فريقاً منكم من ديارهم تظاهرون عليهم} بتشديد الظاء أي تتظاهرون أدغمت التاء في الظاء، وقرأ عاصم وحمزة والكسائي بتخفيف الظاء فحذفوا تاء التفاعل وأبقوا تاء الخطاب كقوله تعالى: {ولا تعاونوا} معناهما جميعاً: تتعاونون، والظهير: العون.{بالإثم والعدوان} المعصية والظلم.{وإن يأتوكم أسارى} وقرأ حمزة: أسرى، وهما جمع أسير، ومعناهما واحد.{تفادوهم} بالمال وتنقذوهم.وقرأ أهل المدينة وعاصم والكسائي ويعقوب ( ت",
        "char_start": 0,
        "char_end": 1904,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_087_chunk00",
        "verse_key": "2:87",
        "text_ar": "قوله تعالى : {ولقد آتينا} أعطينا.{موسى الكتاب} التوراة، جملة واحده.{وقفينا} وأتبعنا.{من بعده بالرسل} رسولا بعد رسول.{وآتينا عيسى ابن مريم البينات} الدلالات الواضحات وهي ما ذكر الله في سورة آل عمران والمائدة، وقيل: أراد الإنجيل.{وأيدناه} قويناه.{بروح القدس} قرأ ابن كثير القدس بسكون الدال والآخرون بضمها وهما لغتان مثل الرُّعب والرَّعب ، واختلفوا في روح القدس:قال الربيع وغيره: \"أراد بالروح الروح الذي نفخ فيه، والقدس هو الله أضافه إلى نفسه تكريماً وتخصيصاً نحو بيت الله، وناقة الله، كما قال : {فنفخنا",
        "char_start": 0,
        "char_end": 1757,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_091_chunk00",
        "verse_key": "2:91",
        "text_ar": "قوله تعالى: {وإذا قيل لهم آمنوا بما أنزل الله} يعني القرآن.{قالوا نؤمن بما أنزل علينا} يعني التوراة، يكفينا ذلك.{ويكفرون بما وراءه} أي بما سواه من الكتب كقوله عز وجل {فمن ابتغى وراء ذلك} [7-المؤمنون] أي سواه، وقال أبو عبيدة: \"(بما وراءه) أي: بما سواه من الكتب\".{وهو الحق} يعني القرآن.{مصدقاً} نصب على الحال.{لما معهم} من التوراة.{قل} لهم يا محمد.{فلم تقتلون} أي قتلتم.{أنبياء الله من قبل} ولم: أصله لما فحذفت الألف فرقاً بين الجر والاستفهام كقولهم فيمَ وبِمَ؟.{إن كنتم مؤمنين} بالتوراة، وقد نهيتم فيه",
        "char_start": 0,
        "char_end": 531,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_102_chunk00",
        "verse_key": "2:102",
        "text_ar": "قوله تعالى : ( واتبعوا ) يعني اليهود ( ما تتلو الشياطين ) أي : ما تلت ، والعرب تضع المستقبل موضع الماضي ، والماضي موضع المستقبل ، وقيل : ما كنت تتلو أي تقرأ ، قال ابن عباس رضي الله عنه : تتبع وتعمل به ، وقال عطاء تحدث وتكلم به ( على ملك سليمان ) أي : في ملكه وعهده .وقصة الآية أن الشياطين كتبوا السحر والنيرنجيات على لسان آصف بن برخيا هذا ما علم آصف بن برخيا سليمان الملك ، ثم دفنوها تحت مصلاه حتى نزع الله الملك عنه ولم يشعر بذلك سليمان فلما مات استخرجوها وقالوا للناس : إنما ملكهم سليمان بها فتعلمو",
        "char_start": 0,
        "char_end": 9777,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "قوله ( وقالت اليهود ليست النصارى على شيء ) نزلت في يهود المدينة ونصارى أهل نجران وذلك أن وفد نجران لما قدموا على النبي صلى الله عليه وسلم أتاهم أحبار اليهود : فتناظروا حتى ارتفعت أصواتهم فقالت لهم اليهود ، ما أنتم على شيء من الدين ، وكفروا بعيسى والإنجيل ، وقالت لهم النصارى : ما أنتم على شيء من الدين ، وكفروا بموسى والتوراة فأنزل الله تعالى ( وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب ) [ وكلا الفريقين يقرءون الكتاب ، قيل : معناه ليس في كتبهم هذا الاختلاف فدل تلاوتهم الكتاب ومخالفتهم ما ",
        "char_start": 0,
        "char_end": 949,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "{الذين آتيناهم الكتاب} قال ابن عباس رضي الله عنهما: \"نزلت في أهل السفينة الذين قدموا مع جعفر بن أبي طالب رضي الله عنه وكانوا أربعين رجلاً اثنان وثلاثون من الحبشة وثمانية من رهبان الشام منهم بحيرا\"، وقال الضحاك: \"هم من آمن من اليهود عبد الله بن سلام وسعية بن عمرو وتمام بن يهودا وأسد وأسيد ابنا كعب وابن يامين وعبد الله بن صوريا\"،وقال قتادة وعكرمة: \"هم أصحاب محمد صلى الله عليه وسلم\"، وقيل: هم المؤمنون عامة.{يتلونه حق تلاوته} قال الكلبي: \"يصفونه في كتبهم حق صفته لمن سألهم من الناس\".والهاء راجعة إلى ",
        "char_start": 0,
        "char_end": 837,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_129_chunk00",
        "verse_key": "2:129",
        "text_ar": "{ربنا وابعث فيهم} أي في الأمة المسلمة من ذرية إبراهيم وإسماعيل، وقيل: من أهل مكة.{رسولاً منهم} أي مرسلاً أراد به محمداً صلى الله عليه وسلم.حدثنا السيد أبو القاسم علي بن موسى الموسوي حدثنى أبو بكر أحمد بن محمد بن عباس البلخي أنا الإمام أبو سليمان حمد بن محمد بن إبراهيم الخطابي أنا محمد بن المكي أنا إسحاق بن إبراهيم أنا ابن أخي ابن وهب أنا عمي أنا معاوية عن صالح عن سعيد بن سويد عن عبد الأعلى بن هلال السلمي عن العرباض بن سارية عن رسول الله صلى الله عليه وسلم قال: \"إني عند الله مكتوب خاتم النبيين، و",
        "char_start": 0,
        "char_end": 1873,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_151_chunk00",
        "verse_key": "2:151",
        "text_ar": "قوله تعالى: {كما أرسلنا فيكم} هذه الكاف للتشبيه وتحتاج إلى شيء يرجع إليه، فقال بعضهم: ترجع إلى ما قبلها معناه ولأتم نعمتي عليكم كما أرسلنا رسولاً قال محمد بن جرير: \"دعا إبراهيم عليه السلام بدعوتين - إحداهما - قال {ربنا واجعلنا مسلمين لك ومن ذريتنا أمة مسلمة لك} [128-البقرة] فبعث الله الرسول وهو محمد صلى الله عليه وسلم، ووعد إجابة الدعوة الثانية بأن يجعل من ذريته أمة مسلمة، كما أجبت دعوته بأن أهديكم لدينه وأجعلكم مسلمين وأتم نعمتي عليكم ببيان شرائع الملة الحنيفية\".وقال مجاهد وعطاء والكلبي: \"هي مت",
        "char_start": 0,
        "char_end": 859,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "فأنزل الله عز وجل {إن في خلق السموات والأرض} ذكر السماوات بلفظ الجمع والأرض بلفظ الواحد لأن كل سماء ليست من جنس واحد بل من جنس آخر، والأرضون كلها من جنس واحد وهو التراب، فالآية في السماوات سمكها وارتفاعها من غير عمد ولا علاقة وما ترى فيها من الشمس والقمر والنجوم، والآية في الأرض مدها وبسطها وسعتها وماترى فيها من الأشجار والأنهار والجبال والبحار والجواهر والنبات.قوله تعالى: {واختلاف الليل والنهار} أي تعاقبهما في الذهاب والمجيء يخلف أحدهما صاحبه إذا ذهب أحدهما جاء الآخر خلفه أي بعده نظيره قوله تعا",
        "char_start": 0,
        "char_end": 2645,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_190_chunk00",
        "verse_key": "2:190",
        "text_ar": "( وقاتلوا في سبيل الله ) أي في طاعة الله ( الذين يقاتلونكم ) كان في ابتداء الإسلام أمر الله تعالى رسوله صلى الله عليه وسلم بالكف عن قتال المشركين ثم لما هاجر إلى المدينة أمره بقتال من قاتله منهم بهذه الآية وقال الربيع بن أنس : هذه أول آية نزلت في القتال ثم أمره بقتال المشركين كافة قاتلوا أو لم يقاتلوا بقوله ( فاقتلوا المشركين ) فصارت هذه الآية منسوخة بها وقيل نسخ بقوله ( فاقتلوا المشركين ) قريب من سبعين آية وقوله ( ولا تعتدوا ) أي لا تبدءوهم بالقتال ، وقيل هذه الآية محكمة غير منسوخة أمر النبي صل",
        "char_start": 0,
        "char_end": 1699,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_191_chunk00",
        "verse_key": "2:191",
        "text_ar": "قوله تعالى : ( واقتلوهم حيث ثقفتموهم ) قيل نسخت الآية الأولى بهذه الآية وأصل الثقافة الحذق والبصر بالأمور ، ومعناه واقتلوهم حيث بصرتم مقاتلتهم وتمكنتم من قتلهم ( وأخرجوهم من حيث أخرجوكم ) وذلك أنهم أخرجوا المسلمين من مكة فقال أخرجوهم من ديارهم كما أخرجوكم من دياركم ( والفتنة أشد من القتل ) يعني شركهم بالله عز وجل أشد وأعظم من قتلكم إياهم في الحرم والإحرام ( ولا تقاتلوهم عند المسجد الحرام حتى يقاتلوكم فيه فإن قاتلوكم فاقتلوهم ) قرأ حمزة والكسائي : ( ولا تقتلوهم حتى يقتلوكم فإن قتلوكم ) بغير ألف ف",
        "char_start": 0,
        "char_end": 1044,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_193_chunk00",
        "verse_key": "2:193",
        "text_ar": "( وقاتلوهم ) يعني المشركين ( حتى لا تكون فتنة ) أي شرك يعني قاتلوهم حتى يسلموا فلا يقبل من الوثني إلا الإسلام فإن أبى قتل (قال نافع : جاء رجل إلى ابن عمر في فتنة ابن الزبير فقال ما يمنعك أن تخرج ؟ قال يمنعني أن الله تعالى قد حرم دم أخي ، قال ألا تسمع ما ذكره الله عز وجل \" وإن طائفتان من المؤمنين اقتتلوا \" ( 9 - الحجرات ) قال يا ابن أخي لأن أعير بهذه الآية ولا أقاتل أحب إلي من أن أعير بالآية التي يقول الله عز وجل فيها \" ومن يقتل مؤمنا متعمدا \" ( 93 - النساء ) قال ألم يقل الله ( وقاتلوهم حتى لا تك",
        "char_start": 0,
        "char_end": 1420,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "قوله تعالى : ( يسألونك عن الشهر الحرام قتال فيه ) سبب نزول هذه الآية أن رسول الله صلى الله عليه وسلم بعث عبد الله بن جحش وهو ابن عمة النبي صلى الله عليه وسلم أخت أبيه في جمادى الآخرة قبل قتال بدر بشهرين على رأس سبعة عشر شهرا من مقدمه إلى المدينة وبعث معه ثمانية رهط من المهاجرين : سعد بن أبي وقاص الزهري وعكاشة بن محصن الأسدي وعتبة بن غزوان السلمي وأبا حذيفة بن عتبة بن ربيعة وسهيل بن بيضاء وعامر بن ربيعة وواقد بن عبد الله وخالد بن بكير وكتب لأميرهم عبد الله بن جحش كتابا وقال له : \" سر على اسم الله",
        "char_start": 0,
        "char_end": 4293,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_244_chunk00",
        "verse_key": "2:244",
        "text_ar": "( وقاتلوا في سبيل الله ) أي في طاعة الله أعداء الله ( واعلموا أن الله سميع عليم ) قال أكثر أهل التفسير : هذا خطاب للذين أحيوا أمروا بالقتال في سبيل الله فخرجوا من ديارهم فرارا من الجهاد فأماتهم الله ثم أحياهم وأمرهم أن يجاهدوا : وقيل : الخطاب لهذه الأمة أمرهم بالجهاد .",
        "char_start": 0,
        "char_end": 269,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "قوله تعالى ( ألم تر إلى الملأ من بني إسرائيل ) والملأ من القوم : وجوههم وأشرافهم وأصل الملأ الجماعة من الناس ولا واحد له من لفظه كالقوم والرهط والإبل والخيل والجيش وجمعه أملاء ( من بعد موسى ) أي من بعد موت موسى ( إذ قالوا لنبي لهم ) واختلفوا في ذلك النبي فقال قتادة هو يوشع بن نون بن افرائيم بن يوسف عليه السلام وقال السدي : اسمه شمعون وإنما سمي شمعون لأن أمه دعت الله أن يرزقها غلاما فاستجاب الله دعاءها فولدت غلاما فسمته سمعون تقول سمع الله تعالى دعائي والسين تصير شينا بالعبرانية وهو شمعون بن صفية",
        "char_start": 0,
        "char_end": 4128,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_252_chunk00",
        "verse_key": "2:252",
        "text_ar": "\" تلك آيات الله نتلوها عليك بالحق وإنك لمن المرسلين \".",
        "char_start": 0,
        "char_end": 54,
        "relevance": "direct"
      },
      {
        "source": "baghawi",
        "chunk_id": "baghawi_002_253_chunk00",
        "verse_key": "2:253",
        "text_ar": "( تلك الرسل فضلنا بعضهم على بعض منهم من كلم الله ) أي كلمه الله تعالى يعني موسى عليه السلام ( ورفع بعضهم درجات ) يعني محمدا صلى الله عليه وسلم قال الشيخ الإمام رحمة الله عليه : وما أوتي نبي آية إلا وقد أوتي نبينا مثل تلك الآية وفضل على غيره بآيات مثل : انشقاق القمر بإشارته وحنين الجذع على مفارقته وتسليم الحجر والشجر عليه وكلام البهائم والشهادة برسالته ونبع الماء من بين أصابعه وغير ذلك من المعجزات والآيات التي لا تحصى وأظهرها القرآن الذي عجز أهل السماء وأهل الأرض عن الإتيان بمثله .أخبرنا أبو بكر ",
        "char_start": 0,
        "char_end": 2321,
        "relevance": "direct"
      }
    ],
    "ibn_kathir": [
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "يقول تعالي : كيف يليق بكم - يا معشر اهل الكتاب ، وانتم تامرون الناس بالبر ، وهو جماع الخير - ان تنسوا انفسكم ، فلا تاتمروا بما تامرون الناس به ، وانتم مع ذلك تتلون الكتاب ، وتعلمون ما فيه علي من قصر في اوامر الله ؟ افلا تعقلون ما انتم صانعون بانفسكم ؛ فتنتبهوا من رقدتكم ، وتتبصروا من عمايتكم . وهذا كما قال عبد الرزاق عن معمر ، عن قتاده في قوله تعالي : ( اتامرون الناس بالبر وتنسون انفسكم ) قال : كان بنو اسراييل يامرون الناس بطاعه الله وبتقواه ، وبالبر ، ويخالفون ، فعيرهم الله ، عز وجل . وكذلك قال",
        "char_start": 0,
        "char_end": 8988,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_054_chunk00",
        "verse_key": "2:54",
        "text_ar": "هذه صفه توبته تعالي علي بني اسراييل من عباده العجل ، قال الحسن البصري ، رحمه الله ، في قوله تعالي : ( واذ قال موسي لقومه يا قوم انكم ظلمتم انفسكم باتخاذكم العجل ) فقال ذلك حين وقع في قلوبهم من شان عبادتهم العجل ما وقع حين قال الله تعالي : ( ولما سقط في ايديهم وراوا انهم قد ضلوا قالوا لين لم يرحمنا ربنا ويغفر لنا ) الايه [ الاعراف : 149 ] .قال : فذلك حين يقول موسي : ( يا قوم انكم ظلمتم انفسكم باتخاذكم العجل )وقال ابو العاليه ، وسعيد بن جبير ، والربيع بن انس : ( فتوبوا الي باريكم ) اي الي خالقكم .",
        "char_start": 0,
        "char_end": 4292,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "يقول تعالي : واذكروا نعمتي عليكم في انزالي عليكم المن والسلوي ، طعاما طيبا نافعا هنييا سهلا واذكروا دبركم وضجركم مما رزقتكم وسوالكم موسي استبدال ذلك بالاطعمه الدنيه من البقول ونحوها مما سالتم . وقال الحسن البصري رحمه الله : فبطروا ذلك ولم يصبروا عليه ، وذكروا عيشهم الذي كانوا فيه ، وكانوا قوما اهل اعداس وبصل وبقل وفوم ، فقالوا : ( يا موسي لن نصبر علي طعام واحد فادع لنا ربك يخرج لنا مما تنبت الارض من بقلها وقثايها وفومها وعدسها وبصلها ) [ وهم ياكلون المن والسلوي ، لانه لا يتبدل ولا يتغير كل يوم ف",
        "char_start": 0,
        "char_end": 6742,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "( ثم انتم هولاء تقتلون انفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالاثم والعدوان وان ياتوكم اساري تفادوهم وهو محرم عليكم اخراجهم ) قال محمد بن اسحاق بن يسار : حدثني محمد بن ابي محمد ، عن سعيد بن جبير او عكرمه عن ابن عباس : ( ثم انتم هولاء تقتلون انفسكم ) الايه ، قال : انبهم الله من فعلهم ، وقد حرم عليهم في التوراه سفك دمايهم وافترض عليهم فيها فداء اسراهم ، فكانوا فريقين : طايفه منهم بنو قينقاع وانهم حلفاء الخزرج ، والنضير ، وقريظه وانهم حلفاء الاوس ، فكانوا اذا كانت بين الاوس والخزرج حرب",
        "char_start": 0,
        "char_end": 3715,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_087_chunk00",
        "verse_key": "2:87",
        "text_ar": "ينعت ، تبارك وتعالي ، بني اسراييل بالعتو والعناد والمخالفه ، والاستكبار علي الانبياء ، وانهم انما يتبعون اهواءهم ، فذكر تعالي انه اتي موسي الكتاب وهو التوراه فحرفوها وبدلوها ، وخالفوا اوامرها واولوها . وارسل الرسل والنبيين من بعده الذين يحكمون بشريعته ، كما قال تعالي : ( انا انزلنا التوراه فيها هدي ونور يحكم بها النبيون الذين اسلموا للذين هادوا والربانيون والاحبار بما استحفظوا من كتاب الله وكانوا عليه شهداء ) الايه [ المايده : 44 ] ، ولهذا قال : ( وقفينا من بعده بالرسل ) قال السدي ، عن ابي مالك ",
        "char_start": 0,
        "char_end": 5517,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_091_chunk00",
        "verse_key": "2:91",
        "text_ar": "قول تعالي : ( واذا قيل لهم ) اي : لليهود وامثالهم من اهل الكتاب ( امنوا بما انزل الله ) [ اي ] : علي محمد صلي الله عليه وسلم وصدقوه واتبعوه ( قالوا نومن بما انزل علينا ) اي : يكفينا الايمان بما انزل علينا من التوراه والانجيل ولا نقر الا بذلك ، ( ويكفرون بما وراءه ) يعني : بما بعده ( وهو الحق مصدقا لما معهم ) اي : وهم يعلمون ان ما انزل علي محمد صلي الله عليه وسلم الحق ( مصدقا ) منصوب علي الحال ، اي في حال تصديقه لما معهم من التوراه والانجيل ، فالحجه قايمه عليهم بذلك ، كما قال تعالي : ( الذين اتين",
        "char_start": 0,
        "char_end": 1454,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_102_chunk00",
        "verse_key": "2:102",
        "text_ar": "قال العوفي في تفسيره ، عن ابن عباس في قوله تعالي : ( واتبعوا ما تتلو الشياطين علي ملك سليمان وما كفر سليمان ولكن الشياطين كفروا ) وكان حين ذهب ملك سليمان ارتد فيام من الجن والانس واتبعوا الشهوات ، فلما رجع الله الي سليمان ملكه ، وقام الناس علي الدين كما كان اوان سليمان ، ظهر علي كتبهم فدفنها تحت كرسيه ، وتوفي سليمان ، عليه السلام ، حدثان ذلك ، فظهر الانس والجن علي الكتب بعد وفاه سليمان ، وقالوا : هذا كتاب من الله نزل علي سليمان واخفاه عنا فاخذوا به فجعلوه دينا . فانزل الله : ( ولما جاءهم رسول من",
        "char_start": 0,
        "char_end": 37036,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "وقوله تعالي : ( وقالت اليهود ليست النصاري علي شيء وقالت النصاري ليست اليهود علي شيء وهم يتلون الكتاب ) يبين به تعالي تناقضهم وتباغضهم وتعاديهم وتعاندهم . كما قال محمد بن اسحاق : حدثني محمد بن ابي محمد ، عن عكرمه او سعيد بن جبير ، عن ابن عباس ، قال : لما قدم اهل نجران من النصاري علي رسول الله صلي الله عليه وسلم ، اتتهم احبار يهود ، فتنازعوا عند رسول الله صلي الله عليه وسلم ، فقال رافع بن حريمله ما انتم علي شيء ، وكفر بعيسي وبالانجيل . وقال رجل من اهل نجران من النصاري لليهود : ما انتم علي شيء . وج",
        "char_start": 0,
        "char_end": 2843,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "وقوله تعالي : ( الذين اتيناهم الكتاب يتلونه حق تلاوته ) قال عبد الرزاق ، عن معمر ، عن قتاده : هم اليهود والنصاري . وهو قول عبد الرحمن بن زيد بن اسلم ، واختاره ابن جرير .وقال : سعيد عن قتاده : هم اصحاب رسول الله صلي الله عليه وسلم .وقال ابن ابي حاتم : حدثنا ابي ، حدثنا ابراهيم بن موسي ، وعبد الله بن عمران الاصبهاني ، قالا حدثنا يحيي بن يمان ، حدثنا اسامه بن زيد ، عن ابيه ، عن عمر بن الخطاب ( يتلونه حق تلاوته ) قال : اذا مر بذكر الجنه سال الله الجنه ، واذا مر بذكر النار تعوذ بالله من النار .وقال ا",
        "char_start": 0,
        "char_end": 3557,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_129_chunk00",
        "verse_key": "2:129",
        "text_ar": "يقول تعالي اخبارا عن تمام دعوه ابراهيم لاهل الحرم ان يبعث الله فيهم رسولا منهم ، اي من ذريه ابراهيم . وقد وافقت هذه الدعوه المستجابه قدر الله السابق في تعيين محمد صلوات الله وسلامه عليه رسولا في الاميين اليهم ، الي ساير الاعجمين ، من الانس والجن ، كما قال الامام احمد : حدثنا عبد الرحمن بن مهدي ، حدثنا معاويه بن صالح ، عن سعيد بن سويد الكلبي ، عن عبد الاعلي بن هلال السلمي ، عن العرباض بن ساريه قال : قال رسول الله صلي الله عليه وسلم : \" اني عند الله لخاتم النبيين ، وان ادم لمنجدل في طينته ، وسانبي",
        "char_start": 0,
        "char_end": 2638,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_151_chunk00",
        "verse_key": "2:151",
        "text_ar": "يذكر تعالي عباده المومنين ما انعم به عليهم من بعثه الرسول محمد صلي الله عليه وسلم اليهم ، يتلو عليهم ايات الله مبينات ويزكيهم ، اي : يطهرهم من رذايل الاخلاق ودنس النفوس وافعال الجاهليه ، ويخرجهم من الظلمات الي النور ، ويعلمهم الكتاب وهو القران والحكمه وهي السنه ويعلمهم ما لم يكونوا يعلمون . فكانوا في الجاهليه الجهلاء يسفهون بالقول الفري ، فانتقلوا ببركه رسالته ، ويمن سفارته ، الي حال الاولياء ، وسجايا العلماء فصاروا اعمق الناس علما ، وابرهم قلوبا ، واقلهم تكلفا ، واصدقهم لهجه . وقال تعالي : ( لق",
        "char_start": 0,
        "char_end": 862,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "ثم ذكر الدليل علي تفرده بالالهيه [ بتفرده ] بخلق السماوات والارض وما فيهما ، وما بين ذلك مما ذرا وبرا من المخلوقات الداله علي وحدانيته ، فقال : ( ان في خلق السماوات والارض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس وما انزل الله من السماء من ماء فاحيا به الارض بعد موتها وبث فيها من كل دابه وتصريف الرياح والسحاب المسخر بين السماء والارض لايات لقوم يعقلون ) يقول تعالي : ( ان في خلق السماوات والارض ) تلك في [ لطافتها و ] ارتفاعها واتساعها وكواكبها السياره والثوابت ودوران فلكها ،",
        "char_start": 0,
        "char_end": 4294,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_190_chunk00",
        "verse_key": "2:190",
        "text_ar": "قال ابو جعفر الرازي ، عن الربيع بن انس ، عن ابي العاليه في قوله تعالي : ( وقاتلوا في سبيل الله الذين يقاتلونكم ) قال : هذه اول ايه نزلت في القتال بالمدينه ، فلما نزلت كان رسول الله صلي الله عليه وسلم يقاتل من قاتله ، ويكف عمن كف عنه حتي نزلت سوره براءه وكذا قال عبد الرحمن بن زيد بن اسلم حتي قال : هذه منسوخه بقوله : ( فاقتلوا المشركين حيث وجدتموهم ) [ التوبه : 5 ] وفي هذا نظر ; لان قوله : ( الذين يقاتلونكم ) انما هو تهييج واغراء بالاعداء الذين همتهم قتال الاسلام واهله ، اي : كما يقاتلونكم فقاتلوه",
        "char_start": 0,
        "char_end": 2806,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_191_chunk00",
        "verse_key": "2:191",
        "text_ar": "قال ابو جعفر الرازي ، عن الربيع بن انس ، عن ابي العاليه في قوله تعالي : ( وقاتلوا في سبيل الله الذين يقاتلونكم ) قال : هذه اول ايه نزلت في القتال بالمدينه ، فلما نزلت كان رسول الله صلي الله عليه وسلم يقاتل من قاتله ، ويكف عمن كف عنه حتي نزلت سوره براءه وكذا قال عبد الرحمن بن زيد بن اسلم حتي قال : هذه منسوخه بقوله : ( فاقتلوا المشركين حيث وجدتموهم ) [ التوبه : 5 ] وفي هذا نظر ; لان قوله : ( الذين يقاتلونكم ) انما هو تهييج واغراء بالاعداء الذين همتهم قتال الاسلام واهله ، اي : كما يقاتلونكم فقاتلوه",
        "char_start": 0,
        "char_end": 4437,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_193_chunk00",
        "verse_key": "2:193",
        "text_ar": "ثم امر تعالي بقتال الكفار : ( حتي لا تكون فتنه ) اي : شرك . قاله ابن عباس ، وابو العاليه ، ومجاهد ، والحسن ، وقتاده ، والربيع ، ومقاتل بن حيان ، والسدي ، وزيد بن اسلم .( ويكون الدين لله ) اي : يكون دين الله هو الظاهر [ العالي ] علي ساير الاديان ، كما ثبت في الصحيحين : عن ابي موسي الاشعري ، قال : سيل النبي صلي الله عليه وسلم عن الرجل يقاتل شجاعه ، ويقاتل حميه ، ويقاتل رياء ، اي ذلك في سبيل الله ؟ فقال : \" من قاتل لتكون كلمه الله هي العليا فهو في سبيل الله \" . وفي الصحيحين : \" امرت ان اقاتل الناس ",
        "char_start": 0,
        "char_end": 2629,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "قال ابن ابي حاتم : حدثنا ابي ، حدثنا محمد بن ابي بكر المقدمي ، حدثنا المعتمر بن سليمان ، عن ابيه ، حدثني الحضرمي ، عن ابي السوار ، عن جندب بن عبد الله ، ان رسول الله صلي الله عليه وسلم بعث رهطا ، وبعث عليهم ابا عبيده بن الجراح [ او عبيده بن الحارث ] فلما ذهب ينطلق ، بكي صبابه الي رسول الله صلي الله عليه وسلم ، فجلس ، فبعث عليهم مكانه عبد الله بن جحش ، وكتب له كتابا ، وامره الا يقرا الكتاب حتي يبلغ مكان كذا وكذا ، وقال : لا تكرهن احدا علي السير معك من اصحابك . فلما قرا الكتاب استرجع ، وقال : سمعا",
        "char_start": 0,
        "char_end": 8334,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_244_chunk00",
        "verse_key": "2:244",
        "text_ar": "وقوله : ( وقاتلوا في سبيل الله واعلموا ان الله سميع عليم ) اي : كما ان الحذر لا يغني من القدر كذلك الفرار من الجهاد وتجنبه لا يقرب اجلا ولا يباعده ، بل الاجل المحتوم والرزق المقسوم مقدر مقنن لا يزاد فيه ولا ينقص منه كما قال تعالي : ( الذين قالوا لاخوانهم وقعدوا لو اطاعونا ما قتلوا قل فادرءوا عن انفسكم الموت ان كنتم صادقين ) [ ال عمران : 168 ] وقال تعالي : ( وقالوا ربنا لم كتبت علينا القتال لولا اخرتنا الي اجل قريب قل متاع الدنيا قليل والاخره خير لمن اتقي ولا تظلمون فتيلا اينما تكونوا يدرككم المو",
        "char_start": 0,
        "char_end": 935,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "قال عبد الرزاق عن معمر عن قتاده : هذا النبي هو يوشع بن نون . قال ابن جرير : يعني ابن افراثيم بن يوسف بن يعقوب . وهذا القول بعيد ; لان هذا كان بعد موسي بدهر طويل ، وكان ذلك في زمان داود عليه السلام ، كما هو مصرح به في القصه وقد كان بين داود وموسي ما ينيف عن الف سنه والله اعلم .وقال السدي : هو شمعون وقال مجاهد : هو شمويل عليه السلام . وكذا قال محمد بن اسحاق عن وهب بن منبه وهو : شمويل بن بالي بن علقمه بن يرخام بن اليهو بن تهو بن صوف بن علقمه بن ماحث بن عموصا بن عزريا بن صفنيه بن علقمه بن ابي ياسف ب",
        "char_start": 0,
        "char_end": 2082,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_252_chunk00",
        "verse_key": "2:252",
        "text_ar": "ثم قال تعالي : ( تلك ايات الله نتلوها عليك بالحق وانك لمن المرسلين ) اي : هذه ايات الله التي قصصناها عليك من امر الذين ذكرناهم بالحق اي : بالواقع الذي كان عليه الامر ، المطابق لما بايدي اهل الكتاب من الحق الذي يعلمه علماء بني اسراييل ( وانك ) يا محمد ( لمن المرسلين ) وهذا توكيد وتوطيه للقسم .",
        "char_start": 0,
        "char_end": 293,
        "relevance": "direct"
      },
      {
        "source": "ibn_kathir",
        "chunk_id": "ibn_kathir_002_253_chunk00",
        "verse_key": "2:253",
        "text_ar": "يخبر تعالي انه فضل بعض الرسل علي بعض كما قال : ( ولقد فضلنا بعض النبيين علي بعض واتينا داود زبورا ) [ الاسراء : 55 ] وقال هاهنا : ( تلك الرسل فضلنا بعضهم علي بعض منهم من كلم الله ) يعني : موسي ومحمدا صلي الله عليه وسلم وكذلك ادم ، كما ورد به الحديث المروي في صحيح ابن حبان عن ابي ذر رضي الله عنه ( ورفع بعضهم درجات ) كما ثبت في حديث الاسراء حين راي النبي صلي الله عليه وسلم الانبياء في السماوات بحسب تفاوت منازلهم عند الله عز وجل .فان قيل : فما الجمع بين هذه الايه وبين الحديث الثابت في الصحيحين عن ا",
        "char_start": 0,
        "char_end": 1768,
        "relevance": "direct"
      }
    ],
    "jalalayn": [
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "«أتأمرون الناس بالبر» بالإيمان بمحمد «وتنسون أنفسكم» تتركونها فلا تأمرونها به «وأنتم تتلون الكتاب» التوراة وفيها الوعيد على مخالفة القول العمل «أفلا تعقلون» سوء فعلكم فترجعون، فجملة النسيان محل الاستفهام الإنكاري.",
        "char_start": 0,
        "char_end": 213,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_054_chunk00",
        "verse_key": "2:54",
        "text_ar": "«وإذ قال موسى لقومه» الذين عبدوا العجل «يا قوم إنكم ظلمتم أنفسكم باتخاذكم العجل» إلهاً «فتوبوا إلى بارئكم» خالقكم من عبادته «فاقتلوا أنفسكم» أي ليقتل البريءُ منكم المجرم «ذلكم» القتل «خير لكم عند بارئكم» فوفقكم لفعل ذلك وأرسل عليكم سحابة سوداء لئلا يبصر بعضكم بعضا فيرحمه حتى قتل منكم نحو سبعين ألفا «فتاب عليكم» قبل توبتكم «أنه هو التواب الرحيم».",
        "char_start": 0,
        "char_end": 347,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "«وإذا قلتم يا موسى لن نصبر على طعام» أي نوع منه «واحد» وهو المن والسلوى «فادع لنا ربَّك يُخرج لنا» شيئاً «مما تنبت الأرض من» للبيان «بقلها وقثائها وفومها» حنطتها «وعدسها وبصلها قال» لهم موسى «أتستبدلون الذي هو أدنى» أخس «بالذي هو خير» أشرف أي أتأخذونه بدله، والهمزة للإنكار فأبوا أن يرجعوا فدعا الله تعالى فقال تعالى «اهبطوا» انزلوا «مصراً» من الأمصار «فإن لكم» فيه «ما سألتم» من النبات «وضُربت» جعلت «عليهم الذلة» الذل والهوان «والمسكنة» أي أثر الفقر من السكون والخزي فهي لازمة لهم، وإن كانوا أغنياء",
        "char_start": 0,
        "char_end": 743,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "«ثم أنتم» يا «هؤلاء تقتلون أنفسكم» بقتل بعضكم بعضا «وتخرجون فريقا منكم من ديارهم تَظَّاهَرُونَ» فيه إدغام التاء في الأصل في الظاء، وفي قراءة بالتخفيف على حذفها تتعاونون «عليهم بالإثم» بالمعصية «والعدوان» الظلم «وإن يأتوكم أسارى» وفي قراءة أسرى «تَفْدُوهُمْ» وفي قراءة «تُفَادُوهُمْ» تنقذوهم من الأسر بالمال أو غيره وهو مما عهد إليهم «وهو» أي الشأن «محرَّم عليكم إخراجهم» متصل بقوله وتخرجون والجملة بينهما اعتراض: أي كما حرم ترك الفداء، وكانت قريظةُ حالفوا الأوسَ، والنضيرُ الخزرجَ فكان كل فريق يقاتل ",
        "char_start": 0,
        "char_end": 954,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_087_chunk00",
        "verse_key": "2:87",
        "text_ar": "«ولقد آتينا موسى الكتاب» التوراة «وقفيَّنا من بعده بالرسل» أي اتبعناهم رسولا في إثر رسول «وآتينا عيسى ابن مريم البينات» المعجزات كإحياء الموتى وإبراء الأكمه والأبرص «وأيدناه» قويناه «بروح القدس» من إضافة الموصوف إلى الصفة أي الروح المقدسة جبريل لطهارته يسير معه حيث سار فلم تستقيموا «أفكلما جاءكم رسول بما لا تهوى» تحب «أنفسُكم» من الحق «استكبرتم» تكبرتم عن إتباعه جواب كلما وهو محل الاستفهام، والمراد به التوبيخ «ففريقا» منهم «كذبتم» كعيسى «وفريقاً تقتلون» المضارع لحكاية الحال الماضية: أي قتلتم كزك",
        "char_start": 0,
        "char_end": 510,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_091_chunk00",
        "verse_key": "2:91",
        "text_ar": "«وإذا قيل لهم آمِنوا بما أنزل الله» القرآن وغيره «قالوا نؤمن بما أنزل علينا» أي التوراة قال تعالى: «ويكفرون» الواو للحال «بما وراءه» سواه أو بعده من القرآن «وهو الحق» حال «مصدقاً» حال ثانية مؤكدة «لما معهم قل» لهم «فلم تقتلون» أي قتلتم «أنبياء الله من قبل إن كنتم مؤمنين» بالتوراة وقد نهيتم فيها عن قتلهم والخطاب للموجودين في زمن نبينا بما فعل آباؤهم لرضاهم به.",
        "char_start": 0,
        "char_end": 361,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_102_chunk00",
        "verse_key": "2:102",
        "text_ar": "«واتبعوا» عطف على نبذ «ما تتلوا» أي تلت «الشياطين على» عهد «ملك سليمان» من السحر وكانت دفنته تحت كرسيه لما نزع ملكه أو كانت تسترق السمع وتضم إليه أكاذيب وتلقيه إلى الكهنة فيدونونه وفشا ذلك وشاع أن الجن تعلم الغيب فجمع سليمان الكتب ودفنها فلما مات دلت الشياطين عليها الناس فاستخرجوها فوجدوا فيها السحر فقالوا إنما ملككم بهذا فتعلموه فرفضوا كتب أنبيائهم قال تعالى تبرئه لسليمان ورداً على اليهود في قولهم انظروا إلى محمد يذكر سليمان في الأنبياء وما كان إلا ساحراً: «وما كفر سليمان» أي لم يعمل السحر لأنه",
        "char_start": 0,
        "char_end": 1517,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "«وقالت اليهود ليست النصارى على شئ» معتد به وكفرت بعيسى «وقالت النصارى ليست اليهود على شئ» معتد به وكفرت بموسى «وهم» أي الفريقان «يتلون الكتاب» المنزل عليهم، وفي كتاب اليهود تصديق عيسى، وفي كتاب النصارى تصديق موسى والجملة حال «كذلك» كما قال هؤلاء «قال الذين لا يعلمون» أي المشركون من العرب وغيرهم «مثل قولهم» بيان لمعنى ذلك: أي قالوا لكل ذي دين ليسوا على شئ «فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون» من أمر الدين فيدخل المحقُّ الجنة والمبطل النار.",
        "char_start": 0,
        "char_end": 458,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "«الذين آتيناهم الكتاب» مبتدأً «يتلونه حق تلاوته» أي يقرؤونه كما أنزل والجملة حال وحق نصب على المصدر والخبر «أولئك يؤمنون به» نزلت في جماعة قدموا من الحبشة وأسلموا «ومن يكفر به» أي بالكتاب المؤتى بأن يحرفه «فأولئك هم الخاسرون» لمصيرهم إلى النار المؤبدة عليهم.",
        "char_start": 0,
        "char_end": 258,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_129_chunk00",
        "verse_key": "2:129",
        "text_ar": "«ربنا وابعث فيهم» أي أهل البيت «رسولا منهم» من أنفسهم وقد أجاب الله دعاءه بمحمد «يتلو عليهم آياتك» القرآن «ويعلمهم الكتاب» القرآن «والحكمة» أي ما فيه من الأحكام «ويزكيهم» يطهرهم من الشرك «إنك أنت العزيز» الغالب «الحكيم» في صنعه.",
        "char_start": 0,
        "char_end": 228,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_151_chunk00",
        "verse_key": "2:151",
        "text_ar": "«كما أرسلنا» متعلق بأتم أي إتماما كإتمامها بإرسالنا «فيكم رسولا منكم» محمد «يتلو عليكم آياتنا» القرآن «ويزكيكم» يطهركم من الشرك «ويعلمكم الكتاب» القرآن «والحكمة» ما فيه من الأحكام «ويعلمكم ما لم تكونوا تعلمون».",
        "char_start": 0,
        "char_end": 210,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "إن في خلق السماوات والأرض» وما فيهما من العجائب «واختلاف الليل والنهار» بالذهاب والمجيء والزيادة والنقصان «والفلك» السفن «التي تجري في البحر» ولا ترسب موقرة «بما ينفع الناس» من التجارات والحمل «وما أنزل الله من السماء من ماء» مطر «فأحيا به الأرض» بالنبات «بعد موتها» يبسها «وبث» فرق ونشربه «فيها من كل دابة» لأنهم ينمون بالخصب الكائن عنه «وتصريف الرياح» تقليبها جنوبا وشمالا حارة وباردة «والسحاب» الغيم «المسخَّر» المذلَّل بأمر الله تعالى يسير إلى حيث شاء الله «بين السماء والأرض» بلا علاقة «لآيات» د",
        "char_start": 0,
        "char_end": 547,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_190_chunk00",
        "verse_key": "2:190",
        "text_ar": "ولما صُدَّ محمد صلى الله عليه وسلم عن البيت عام الحديبية وصالح الكفار على أن يعود العام القابل ويُخلوا له مكة ثلاثة أيام وتجهز لعمرة القضاء وخافوا أن لا تفي قريش ويقاتلوهم وكره المسلمون قتالهم في الحرم والإحرام والشهر الحرام نزل «وقاتلوا في سبيل الله» أي لإعلاء دينه «الذين يقاتلونكم» الكفار «ولا تعتدوا» عليهم بالابتداء بالقتال «إن الله لا يحب المعتدين» المتجاوزين ما حد لهم وهذا منسوخ بآية براءة أو بقوله.",
        "char_start": 0,
        "char_end": 407,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_191_chunk00",
        "verse_key": "2:191",
        "text_ar": "«واقتلوهم حيث ثقفتموهم» وجدتموهم «وأخرجوهم من حيث أخرجوكم» أي من مكة وقد فعل بهم ذلك عام الفتح «والفتنة» الشرك منهم «أشد» أعظم «من القتل» لهم في الحرم أو الإحرام والذي استعظمتموه «ولا تقاتلوهم عند المسجد الحرام» أي في الحرم «حتى يقاتلوكم فيه فإن قاتلوكم» فيه «فاقتلوهم» فيه، وفي قراءة بلا ألف في الأفعال الثلاثة «كذلك» القتل والإخراج «جزاء الكافرين».",
        "char_start": 0,
        "char_end": 350,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_193_chunk00",
        "verse_key": "2:193",
        "text_ar": "«وقاتلوهم حتى لا تكون» توجد «فتنة» شرك «ويكون الدين» العبادة «لله» وحده لا يعبد سواه «فإن انتهوا» عن الشرك فلا تعتدوا عليهم دل على هذا «فلا عدوان» اعتداء بقتل أو غيره «إلا على الظالمين» ومن انتهى فليس بظالم فلا عدوان عليه.",
        "char_start": 0,
        "char_end": 222,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "وأرسل النبي صلى الله عليه وسلم أول سراياه وعليها عبد الله بن جحش فقاتلوا المشركين وقتلوا ابن الحضرمي آخر يوم من جمادى الآخرة والتبس عليهم برجب فعيرهم الكفار باستحلاله فنزل: «يسألونك عن الشهر الحرام» المحرم «قتال فيه» بدل اشتمال «قل» لهم «قتال فيه كبير» عظيم وزرا مبتدأ وخبر «وصد» مبتدأ منع للناس «عن سبيل الله» دينه «وكفر به» بالله «و» صد عن «المسجد الحرام» أي مكة «وإخراج أهله منه» وهم النبي صلى الله عليه وسلم والمؤمنون وخبر المبتدأ «أكبر» أعظم وزرا «عند الله» من القتال فيه «والفتنة» الشرك منكم «أ",
        "char_start": 0,
        "char_end": 879,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_244_chunk00",
        "verse_key": "2:244",
        "text_ar": "«وقاتلوا في سبيل الله» أي لإعلاء دينه «واعلموا أن الله سميع» لأقوالكم «عليم» بأحوالكم فمجازيكم.",
        "char_start": 0,
        "char_end": 95,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "«ألم تر إلى الملأ» الجماعة «من بني إسرائيل من بعد» موت «موسى» أي إلى قصتهم وخبرهم «إذ قالوا لنبي لهم» هو شمويل «ابعث» أقم «لنا ملكا نقاتل» معه «في سبيل الله» تنتظم به كلمتنا ونرجع إليه «قال» النبي لهم «هل عسَيتم» بالفتح والكسر «إن كتب عليكم القتال أ» ن «لا تقاتلوا» خبر عسى والاستفهام لتقرير التوقع بها «قالوا وما لنا أ» ن «لا نقاتل في سبيل الله وقد أُخرجنا من ديارنا وأبنائنا» بسبيهم وقتلهم وقد فعل بهم ذلك قوم جالوت أي لا مانع لنا منه مع وجود مقتضيه قال تعالى: «فلما كُتب عليهم القتال تولوا» عنه وج",
        "char_start": 0,
        "char_end": 639,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_252_chunk00",
        "verse_key": "2:252",
        "text_ar": "«تلك» هذه الآيات «آيات الله نتلوها» نقصها «عليك» يا محمد «بالحق» بالصدق «وإنك لمن المرسلين» التأكيد بأن وغيرها ردٌ لقول الكفار له لست مرسلا.",
        "char_start": 0,
        "char_end": 140,
        "relevance": "direct"
      },
      {
        "source": "jalalayn",
        "chunk_id": "jalalayn_002_253_chunk00",
        "verse_key": "2:253",
        "text_ar": "«تلك» مبتدأ «الرسل» نعت أو عطف بيان والخبر «فضلنا بعضهم على بعض» بتخصيصه بمنقبة ليست لغيره «منهم من كلّم الله» كموسى «ورفع بعضهم» أي محمد صلى الله عليه وسلم «درجات» على غيره بعموم الدعوة وختم النبوة وتفضيل أمته على سائر الأمم والمعجزات المتكاثرة والخصائص العديدة «وآتينا عيسى بن مريم البينات وأيدناه» قويناه «بروح القدس» جبريل يسير معه حيث سار «ولو شاء الله» هدى الناس جميعا «ما اقتتل الذين من بعدهم» بعد الرسل أي أممهم «من بعد ما جاءتهم البينات» لاختلافهم وتضليل بعضهم بعضا «ولكن اختلفوا» لمشيئته ذل",
        "char_start": 0,
        "char_end": 654,
        "relevance": "direct"
      }
    ],
    "muyassar": [
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "ما أقبح حالَكم وحالَ علمائكم حين تأمرون الناس بعمل الخيرات، وتتركون أنفسكم، فلا تأمرونها بالخير العظيم، وهو الإسلام، وأنتم تقرءون التوراة، التي فيها صفات محمد صلى الله عليه وسلم، ووجوب الإيمان به!! أفلا تستعملون عقولكم استعمالا صحيحًا؟",
        "char_start": 0,
        "char_end": 235,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_054_chunk00",
        "verse_key": "2:54",
        "text_ar": "واذكروا نعمتنا عليكم حين قال موسي لقومه: انكم ظلمتم انفسكم باتخاذكم العجل الهًا، فتوبوا الي خالقكم: بان يَقْتل بعضكم بعضًا، وهذا خير لكم عند خالقكم من الخلود الابدي في النار، فامتثلتم ذلك، فمنَّ الله عليكم بقَبول توبتكم. انه تعالي هو التواب لمن تاب مِن عباده، الرحيم بهم.",
        "char_start": 0,
        "char_end": 271,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "واذكروا حين انزلنا عليكم الطعام الحلو، والطير الشهي، فبطِرتم النعمه كعادتكم، واصابكم الضيق والملل، فقلتم: يا موسي لن نصبر علي طعام ثابت لا يتغير مع الايام، فادع لنا ربك يخرج لنا من نبات الارض طعامًا من البقول والخُضَر، والقثاء والحبوب التي توكل، والعدس، والبصل. قال موسي -مستنكرًا عليهم-: اتطلبون هذه الاطعمه التي هي اقل قدرًا، وتتركون هذا الرزق النافع الذي اختاره الله لكم؟ اهبطوا من هذه الباديه الي اي مدينه، تجدوا ما اشتهيتم كثيرًا في الحقول والاسواق. ولما هبطوا تبيَّن لهم انهم يُقَدِّمون اختياره",
        "char_start": 0,
        "char_end": 764,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "ثم أنتم يا هؤلاء يقتل بعضكم بعضًا، ويُخرج بعضكم بعضًا من ديارهم، ويَتَقَوَّى كل فريق منكم على إخوانه بالأعداء بغيًا وعدوانًا. وأن يأتوكم أسارى في يد الأعداء سعيتم في تحريرهم من الأسر، بدفع الفدية، مع أنه محرم عليكم إخراجهم من ديارهم. ما أقبح ما تفعلون حين تؤمنون ببعض أحكام التوراة وتكفرون ببعضها! فليس جزاء مَن يفعل ذلك منكم إلا ذُلا وفضيحة في الدنيا. ويوم القيامة يردُّهم الله إلى أفظع العذاب في النار. وما الله بغافل عما تعملون.",
        "char_start": 0,
        "char_end": 431,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_087_chunk00",
        "verse_key": "2:87",
        "text_ar": "ولقد أعطينا موسى التوراة، وأتبعناه برسل من بني إسرائيل، وأعطينا عيسى ابن مريم المعجزات الواضحات، وقوَّيناه بجبريل عليه السلام. أفكلما جاءكم رسول بوحي من عند الله لا يوافق أهواءكم، استعليتم عليه، فكذَّبتم فريقًا وتقتلون فريقًا؟",
        "char_start": 0,
        "char_end": 226,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_091_chunk00",
        "verse_key": "2:91",
        "text_ar": "واذا قال بعض المسلمين لليهود: صدِّقوا بما انزل الله من القران، قالوا: نحن نصدِّق بما انزل الله علي انبياينا، ويجحدون ما انزل الله بعد ذلك، وهو الحق مصدقًا لما معهم. فلو كانوا يومنون بكتبهم حقًا لامنوا بالقران الذي صدَّقها. قل لهم -ايها الرسول-: ان كنتم مومنين بما انزل الله عليكم، فلماذا قتلتم انبياء الله مِن قبل؟",
        "char_start": 0,
        "char_end": 314,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_102_chunk00",
        "verse_key": "2:102",
        "text_ar": "واتبع اليهود ما تُحَدِّث الشياطينُ به السحرهَ علي عهد ملك سليمان بن داود. وما كفر سليمان وما تَعَلَّم السِّحر، ولكنَّ الشياطين هم الذين كفروا بالله حين علَّموا الناس السحر; افسادًا لدينهم. وكذلك اتبع اليهود السِّحر الذي اُنزل علي الملَكَين هاروت وماروت، بارض «بابل» في «العراق» ; امتحانًا وابتلاء من الله لعباده، وما يعلِّم الملكان من احد حتي ينصحاه ويحذِّراه من تعلم السحر، ويقولا له: لا تكفر بتعلم السِّحر وطاعه الشياطين. فيتعلم الناس من الملكين ما يُحْدِثون به الكراهيه بين الزوجين حتي يتفرقا. ولا",
        "char_start": 0,
        "char_end": 865,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "وقالت اليهود: ليست النصاري علي شيء من الدين الصحيح، وكذلك قالت النصاري في اليهود وهم يقروون التوراه والانجيل، وفيهما وجوب الايمان بالانبياء جميعًا. كذلك قال الذين لا يعلمون من مشركي العرب وغيرهم مثل قولهم، اي قالوا لكل ذي دين: لستَ علي شيء، فالله يفصل بينهم يوم القيامه فيما اختلفوا فيه مِن امر الدين، ويجازي كلا بعمله.",
        "char_start": 0,
        "char_end": 319,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "الذين أعطيناهم الكتاب من اليهود والنصارى، يقرؤونه القراءة الصحيحة، ويتبعونه حق الاتباع، ويؤمنون بما جاء فيه من الإيمان برسل الله، ومنهم خاتمهم نبينا ورسولنا محمد صلى الله عليه وسلم، ولا يحرفون ولا يبدِّلون ما جاء فيه. هؤلاء هم الذين يؤمنون بالنبي محمد صلى الله عليه وسلم وبما أنزل عليه، وأما الذين بدَّلوا بعض الكتاب وكتموا بعضه، فهؤلاء كفار بنبي الله محمد صلى الله عليه وسلم وبما أنزل عليه، ومن يكفر به فأولئك هم أشد الناس خسرانًا عند الله.",
        "char_start": 0,
        "char_end": 441,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_129_chunk00",
        "verse_key": "2:129",
        "text_ar": "ربنا وابعث في هذه الأمة رسولا من ذرية إسماعيل يتلو عليهم آياتك ويعلمهم القرآن والسنة، ويُطهرهم من الشرك وسوء الأخلاق. إنك أنت العزيز الذي لا يمتنع عليه شيء، الحكيم الذي يضع الأشياء في مواضعها.",
        "char_start": 0,
        "char_end": 192,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_151_chunk00",
        "verse_key": "2:151",
        "text_ar": "كما أنعمنا عليكم باستقبال الكعبة أرسلنا فيكم رسولا منكم يتلو عليكم الآيات المبينة للحق من الباطل، ويطهركم من دنس الشرك وسوء الأخلاق، ويعلمكم الكتاب والسنة وأحكام الشريعة، ويعلمكم من أخبار الأنبياء، وقصص الأمم السابقة ما كنتم تجهلونه.",
        "char_start": 0,
        "char_end": 233,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "إن في خلق السماوات بارتفاعها واتساعها، والأرض بجبالها وسهولها وبحارها، وفي اختلاف الليل والنهار من الطول والقصر، والظلمة والنور، وتعاقبهما بأن يخلف كل منهما الآخر، وفي السفن الجارية في البحار، التي تحمل ما ينفع الناس، وما أنزل الله من السماء من ماء المطر، فأحيا به الأرض، فصارت مخضرَّة ذات بهجة بعد أن كانت يابسة لا نبات فيها، وما نشره الله فيها من كل ما دبَّ على وجه الأرض، وما أنعم به عليكم من تقليب الرياح وتوجيهها، والسحاب المُسيَّر بين السماء والأرض، إن في كل الدلائل السابقة لآياتٍ على وحدانية ",
        "char_start": 0,
        "char_end": 601,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_190_chunk00",
        "verse_key": "2:190",
        "text_ar": "وقاتلوا -أيها المؤمنون- لنصرة دين الله الذين يقاتلونكم، ولا ترتكبوا المناهي من المُثْلة، والغُلول، وقَتْلِ من لا يحل قتله من النساء والصبيان والشيوخ، ومن في حكمهم. إن الله لا يحبُّ الذين يُجاوزون حدوده، فيستحلون ما حرَّم الله ورسوله صلى الله عليه وسلم.",
        "char_start": 0,
        "char_end": 252,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_191_chunk00",
        "verse_key": "2:191",
        "text_ar": "واقتلوا الذين يقاتلونكم من المشركين حيث وجدتموهم، واخرجوهم من المكان الذي اخرجوكم منه وهو «مكه» . والفتنه -وهي الكفر والشرك والصد عن الاسلام- اشد من قتلكم اياهم. ولا تبدووهم بالقتال عند المسجد الحرام تعظيمًا لحرماته حتي يبدووكم بالقتال فيه، فان قاتلوكم في المسجد الحرام فاقتلوهم فيه. مثل ذلك الجزاء الرادع يكون جزاء الكافرين.",
        "char_start": 0,
        "char_end": 325,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_193_chunk00",
        "verse_key": "2:193",
        "text_ar": "واستمروا -أيها المؤمنون- في قتال المشركين المعتدين، حتى لا تكون فتنة للمسلمين عن دينهم ولا شرك بالله، ويبقى الدين لله وحده خالصًا لا يُعْبَد معه غيره. فإن كفُّوا عن الكفر والقتال فكُفُّوا عنهم; فالعقوبة لا تكون إلا على المستمرين على كفرهم وعدوانهم.",
        "char_start": 0,
        "char_end": 248,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "يسالك المشركون -ايها الرسول- عن الشهر الحرام: هل يحل فيه القتال؟ قل لهم: القتال في الشهر الحرام عظيم عند الله استحلاله وسفك الدماء فيه، ومَنْعكم الناس من دخول الاسلام بالتعذيب والتخويف، وجحودكم بالله وبرسوله وبدينه، ومَنْع المسلمين من دخول المسجد الحرام، واخراج النبي والمهاجرين منه وهم اهله واولياوه، ذلك اكبر ذنبًا، واعظم جرمًا عند الله من القتال في الشهر الحرام. والشرك الذي انتم فيه اكبر واشد من القتل في الشهر الحرام. وهولاء الكفار لم يرتدعوا عن جرايمهم، بل هم مستمرون عليها، ولا يزالون يقاتلونك",
        "char_start": 0,
        "char_end": 698,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_244_chunk00",
        "verse_key": "2:244",
        "text_ar": "وقاتلوا -أيها المسلمون- الكفار لنصرة دين الله، واعلموا أن الله سميع لأقوالكم، عليم بنيَّاتكم وأعمالكم.",
        "char_start": 0,
        "char_end": 102,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "الم تعلم -ايها الرسول- قصه الاشراف والوجهاء من بني اسراييل من بعد زمان موسي; حين طلبوا من نبيهم ان يولي عليهم ملكا، يجتمعون تحت قيادته، ويقاتلون اعداءهم في سبيل الله. قال لهم نبيهم: هل الامر كما اتوقعه انْ فُرِض عليكم القتال في سبيل الله انكم لا تقاتلون; فاني اتوقع جبنكم وفراركم من القتال، قالوا مستنكرين توقع نبيهم: واي مانع يمنعنا عن القتال في سبيل الله، وقد اَخْرَجَنَا عدوُّنا من ديارنا، وابعدنا عن اولادنا بالقتل والاسر؟ فلما فرض الله عليهم القتال مع الملِك الذي عيَّنه لهم جَبُنوا وفرُّوا عن ا",
        "char_start": 0,
        "char_end": 576,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_252_chunk00",
        "verse_key": "2:252",
        "text_ar": "تلك حجج الله وبراهينه، نقصُّها عليك -أيها النبي- بالصدق، وإنك لمن المرسلين الصادقين.",
        "char_start": 0,
        "char_end": 84,
        "relevance": "direct"
      },
      {
        "source": "muyassar",
        "chunk_id": "muyassar_002_253_chunk00",
        "verse_key": "2:253",
        "text_ar": "هولاء الرسل الكرام فضَّل الله بعضهم علي بعض، بحسب ما منَّ الله به عليهم: فمنهم مَن كلمه الله كموسي ومحمد عليهما الصلاه والسلام، وفي هذا اثبات صفه الكلام لله عز وجل علي الوجه اللايق بجلاله، ومنهم مَن رفعه الله درجاتٍ عاليهً كمحمد صلي الله عليه وسلم، بعموم رسالته، وختم النبوه به، وتفضيل امته علي جميع الامم، وغير ذلك. واتي الله تعالي عيسي ابن مريم عليه السلام البينات المعجزات الباهرات، كابراء مَن ولد اعمي باذن الله تعالي، ومَن به برص باذن الله، وكاحيايه الموتي باذن الله، وايده بجبريل عليه السلام. و",
        "char_start": 0,
        "char_end": 837,
        "relevance": "direct"
      }
    ],
    "qurtubi": [
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "قوله تعالى : أتأمرون الناس بالبر وتنسون أنفسكم وأنتم تتلون الكتاب أفلا تعقلونفيه تسع مسائل : الأولى : قوله تعالى : أتأمرون الناس بالبر هذا استفهام التوبيخ ، والمراد في قول أهل التأويل علماء اليهود . قال ابن عباس ( كان يهود المدينة يقول الرجل منهم لصهره ولذي قرابته ولمن بينه وبينه رضاع من المسلمين : اثبت على الذي أنت عليه ، وما يأمرك به هذا الرجل يريدون محمدا صلى الله عليه وسلم فإن أمره حق فكانوا يأمرون الناس بذلك ، ولا يفعلونه ) وعن ابن عباس أيضا ( كان الأحبار يأمرون مقلديهم وأتباعهم باتباع التو",
        "char_start": 0,
        "char_end": 8750,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_054_chunk00",
        "verse_key": "2:54",
        "text_ar": "قوله تعالى : وإذ قال موسى لقومه يا قوم إنكم ظلمتم أنفسكم باتخاذكم العجل فتوبوا إلى بارئكم فاقتلوا أنفسكم ذلكم خير لكم عند بارئكم فتاب عليكم إنه هو التواب الرحيمقوله تعالى : وإذ قال موسى لقومه القوم الجماعة الرجال دون النساء قال الله تعالى لا يسخر قوم من قوم ثم قال ولا نساء من نساء وقال زهير :وما أدري وسوف إخال أدري أقوم آل حصن أم نساء[ ص: 376 ] وقال تعالى ولوطا إذ قال لقومه أراد الرجال دون النساء وقد يقع القوم على الرجال والنساء قال الله تعالى إنا أرسلنا نوحا إلى قومه وكذا كل نبي مرسل إلى النساء",
        "char_start": 0,
        "char_end": 4433,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "قوله تعالى : وإذ قلتم يا موسى لن نصبر على طعام واحد فادع لنا ربك يخرج لنا مما تنبت الأرض من بقلها وقثائها وفومها وعدسها وبصلها قال أتستبدلون الذي هو أدنى بالذي هو خير اهبطوا مصرا فإن لكم ما سألتم وضربت عليهم الذلة والمسكنة وباءوا بغضب من الله ذلك بأنهم كانوا يكفرون بآيات الله ويقتلون النبيين بغير الحق ذلك بما عصوا وكانوا يعتدونقوله تعالى : وإذ قلتم يا موسى لن نصبر على طعام واحد كان هذا القول منهم في التيه حين ملوا المن والسلوى وتذكروا عيشهم الأول بمصر ، قال الحسن : كانوا نتانى أهل كراث وأبصال وأ",
        "char_start": 0,
        "char_end": 14579,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "قوله تعالى : ثم أنتم هؤلاء تقتلون أنفسكم وتخرجون فريقا منكم من ديارهم تظاهرون عليهم بالإثم والعدوان وإن يأتوكم أسارى تفادوهم وهو محرم عليكم إخراجهم أفتؤمنون ببعض الكتاب وتكفرون ببعض فما جزاء من يفعل ذلك منكم إلا خزي في الحياة الدنيا ويوم القيامة يردون إلى أشد العذاب وما الله بغافل عما تعملون أولئك الذين اشتروا الحياة الدنيا بالآخرة فلا يخفف عنهم العذاب ولا هم ينصرونقوله تعالى : ثم أنتم هؤلاء أنتم في موضع رفع بالابتداء ، ولا يعرب ; لأنه مضمر . وضمت التاء من أنتم لأنها كانت مفتوحة إذا خاطبت واحدا ",
        "char_start": 0,
        "char_end": 5797,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_087_chunk00",
        "verse_key": "2:87",
        "text_ar": "قوله تعالى : ولقد آتينا موسى الكتاب وقفينا من بعده بالرسل وآتينا عيسى ابن مريم البينات وأيدناه بروح القدس أفكلما جاءكم رسول بما لا تهوى أنفسكم استكبرتم ففريقا كذبتم وفريقا تقتلونقوله تعالى : ولقد آتينا موسى الكتاب يعني التوراة . وقفينا أي أتبعنا والتقفية : الإتباع والإرداف ، مأخوذ من إتباع القفا وهو مؤخر العنق . تقول استقفيته إذا جئت من خلفه ، ومنه سميت قافية الشعر ; لأنها تتلو سائر الكلام . والقافية : القفا ، ومنه الحديث : يعقد الشيطان على قافية رأس أحدكم . والقفي والقفاوة : ما يدخر من اللبن وغ",
        "char_start": 0,
        "char_end": 2811,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_091_chunk00",
        "verse_key": "2:91",
        "text_ar": "قوله تعالى : وإذا قيل لهم آمنوا بما أنزل الله قالوا نؤمن بما أنزل علينا ويكفرون بما وراءه وهو الحق مصدقا لما معهم قل فلم تقتلون أنبياء الله من قبل إن كنتم مؤمنين قوله تعالى : وإذا قيل لهم آمنوا أي صدقوا بما أنزل الله يعني القرآن قالوا نؤمن أي نصدق بما أنزل علينا يعني التوراة . ويكفرون بما وراءه أي بما سواه ، عن الفراء . وقتادة : بما بعده ، وهو قول أبي عبيدة ، والمعنى واحد . قال الجوهري : وراء بمعنى خلف ، وقد تكون بمعنى قدام . وهي من الأضداد ، قال الله تعالى : وكان وراءهم ملك أي أمامهم ، وتصغيرها",
        "char_start": 0,
        "char_end": 1931,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_102_chunk00",
        "verse_key": "2:102",
        "text_ar": "واتبعوا ما تتلو الشياطين على ملك سليمان وما كفر سليمان ولكن الشياطين كفروا يعلمون الناس السحر وما أنزل على الملكين ببابل هاروت وماروت وما يعلمان من أحد حتى يقولا إنما نحن فتنة فلا تكفر فيتعلمون منهما ما يفرقون به بين المرء وزوجه وما هم بضارين به من أحد إلا بإذن الله ويتعلمون ما يضرهم ولا ينفعهم ولقد علموا لمن اشتراه ما له في الآخرة من خلاق ولبئس ما شروا به أنفسهم لو كانوا يعلمون[ ص: 41 ] فيه أربع وعشرون مسألة : الأولى : قوله تعالى : واتبعوا ما تتلو الشياطين على ملك سليمان هذا إخبار من الله تعالى",
        "char_start": 0,
        "char_end": 24532,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "قوله تعالى : وقالت اليهود ليست النصارى على شيء وقالت النصارى ليست اليهود على شيء وهم يتلون الكتاب كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون [ ص: 73 ] معناه ادعى كل فريق منهم أن صاحبه ليس على شيء ، وأنه أحق برحمة الله منه . وهم يتلون الكتاب يعني التوراة والإنجيل ، والجملة في موضع الحال .كذلك قال الذين لا يعلمون مثل قولهم فالله يحكم بينهم يوم القيامة فيما كانوا فيه يختلفون والمراد ب الذين لا يعلمون في قول الجمهور : كفار العرب ; لأنهم لا كتاب لهم . وقال ",
        "char_start": 0,
        "char_end": 767,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "قوله تعالى : الذين آتيناهم الكتاب يتلونه حق تلاوته أولئك يؤمنون به ومن يكفر به فأولئك هم الخاسرونقوله تعالى : الذين آتيناهم الكتاب قال قتادة : هم أصحاب النبي صلى الله عليه وسلم ، والكتاب على هذا التأويل القرآن . وقال ابن زيد : هم من أسلم من بني إسرائيل . والكتاب على هذا التأويل : التوراة ، والآية تعم . والذين رفع بالابتداء ، آتيناهم صلته ، يتلونه خبر الابتداء ، وإن شئت كان الخبر أولئك يؤمنون به .[ ص: 92 ] واختلف في معنى يتلونه حق تلاوته فقيل : يتبعونه حق اتباعه ، باتباع الأمر والنهي ، فيحللون حل",
        "char_start": 0,
        "char_end": 1429,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_129_chunk00",
        "verse_key": "2:129",
        "text_ar": "قوله تعالى : ربنا وابعث فيهم رسولا منهم يتلو عليهم آياتك ويعلمهم الكتاب والحكمة ويزكيهم إنك أنت العزيز الحكيم قوله تعالى : ربنا وابعث فيهم رسولا منهم يعني محمدا صلى الله عليه وسلم . وفي قراءة أبي \" وابعث في آخرهم رسولا منهم \" . وقد روى خالد بن معدان : أن نفرا من أصحاب النبي صلى الله عليه وسلم قالوا له : يا رسول الله ، أخبرنا عن نفسك ، قال : نعم أنا دعوة أبي إبراهيم وبشرى عيسى . ورسولا أي مرسلا ، وهو فعول من الرسالة . قال ابن الأنباري : يشبه أن يكون أصله من قولهم : ناقة مرسال ورسلة ، إذا كانت سهل",
        "char_start": 0,
        "char_end": 1788,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_151_chunk00",
        "verse_key": "2:151",
        "text_ar": "قوله تعالى : كما أرسلنا فيكم رسولا منكم يتلو عليكم آياتنا ويزكيكم ويعلمكم الكتاب والحكمة ويعلمكم ما لم تكونوا تعلمون قوله تعالى : كما أرسلنا الكاف في موضع نصب على النعت لمصدر محذوف ، المعنى : ولأتم نعمتي عليكم إتماما مثل ما أرسلنا ، قاله الفراء . قال ابن عطية : وهذا أحسن الأقوال ، أي ولأتم نعمتي عليكم في بيان سنة إبراهيم عليه السلام مثل ما أرسلنا . وقيل : المعنى ولعلكم تهتدون اهتداء مثل ما أرسلنا . وقيل : هي في موضع نصب على الحال ، والمعنى : ولأتم نعمتي عليكم في هذه الحال . والتشبيه واقع على أن ",
        "char_start": 0,
        "char_end": 1149,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "قوله تعالى : إن في خلق السماوات والأرض واختلاف الليل والنهار والفلك التي تجري في البحر بما ينفع الناس وما أنزل الله من السماء من ماء فأحيا به الأرض بعد موتها وبث فيها من كل دابة وتصريف الرياح والسحاب المسخر بين السماء والأرض لآيات لقوم يعقلون فيه أربع عشرة مسألة :الأولى : قال عطاء : لما نزلت وإلهكم إله واحد قالت كفار قريش : كيف يسع الناس إله واحد ، فنزلت إن في خلق السماوات والأرض . ورواه سفيان عن أبيه عن أبي الضحى قال : لما نزلت وإلهكم إله واحد قالوا هل من دليل على ذلك ؟ فأنزل الله تعالى إن في خ",
        "char_start": 0,
        "char_end": 18648,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_190_chunk00",
        "verse_key": "2:190",
        "text_ar": "قوله تعالى وقاتلوا في سبيل الله الذين يقاتلونكم ولا تعتدوا إن الله لا يحب المعتدينفيه ثلاث مسائل :الأولى : قوله تعالى : وقاتلوا هذه الآية أول آية نزلت في الأمر بالقتال ، ولا خلاف في أن القتال كان محظورا قبل الهجرة بقوله : ادفع بالتي هي أحسن وقوله : فاعف عنهم واصفح وقوله : واهجرهم هجرا جميلا وقوله : لست عليهم بمسيطر وما كان مثله مما نزل بمكة ، فلما هاجر إلى المدينة أمر بالقتال فنزل : وقاتلوا في سبيل الله الذين يقاتلونكم قاله الربيع بن أنس وغيره ، وروي عن أبي بكر الصديق أن أول آية نزلت في القتال :",
        "char_start": 0,
        "char_end": 5455,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_191_chunk00",
        "verse_key": "2:191",
        "text_ar": "قوله تعالى : واقتلوهم حيث ثقفتموهم وأخرجوهم من حيث أخرجوكم والفتنة أشد من القتل ولا تقاتلوهم عند المسجد الحرام حتى يقاتلوكم فيه فإن قاتلوكم فاقتلوهم كذلك جزاء الكافرينفيه مسائل :الأولى : قوله تعالى : ثقفتموهم يقال : ثقف يثقف ثقفا وثقفا ، ورجل ثقف لقف : إذا كان محكما لما يتناوله من الأمور . وفي هذا دليل على قتل الأسير ، وسيأتي بيان هذا في \" الأنفال \" إن شاء الله تعالى . وأخرجوهم من حيث أخرجوكم أي مكة . قال الطبري : الخطاب للمهاجرين والضمير لكفار قريش .[ ص: 327 ] الثانية : قوله تعالى : والفتنة أشد",
        "char_start": 0,
        "char_end": 4368,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_193_chunk00",
        "verse_key": "2:193",
        "text_ar": "قوله تعالى : وقاتلوهم حتى لا تكون فتنة ويكون الدين لله فإن انتهوا فلا عدوان إلا على الظالمين فيه مسألتان :الأولى : وقاتلوهم أمر بالقتال لكل مشرك في كل موضع ، على من رآها ناسخة ، ومن رآها غير ناسخة قال : المعنى قاتلوا هؤلاء الذين قال الله فيهم : فإن قاتلوكم والأول أظهر ، وهو أمر بقتال مطلق لا بشرط أن يبدأ الكفار . دليل ذلك قوله تعالى : \" ويكون الدين لله \" ، وقال عليه السلام : أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله ، فدلت الآية والحديث على أن سبب القتال هو الكفر ; لأنه قال : حتى لا تكون فت",
        "char_start": 0,
        "char_end": 1211,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير وصد عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر عند الله والفتنة أكبر من القتل ولا يزالون يقاتلونكم حتى يردوكم عن دينكم إن استطاعوا ومن يرتدد منكم عن دينه فيمت وهو كافر فأولئك حبطت أعمالهم في الدنيا والآخرة وأولئك أصحاب النار هم فيها خالدونفيه احدى عشرة مسألة :الأولى : قوله تعالى : \" يسألونك \" تقدم القول فيه . وروى جرير بن عبد الحميد [ ص: 39 ] ومحمد بن فضيل عن عطاء بن السائب عن سعيد بن جبير عن ابن عباس قال : ( ما رأيت قوما خيرا من أص",
        "char_start": 0,
        "char_end": 15485,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_244_chunk00",
        "verse_key": "2:244",
        "text_ar": "قوله تعالى : وقاتلوا في سبيل الله واعلموا أن الله سميع عليمهذا خطاب لأمة محمد صلى الله عليه وسلم بالقتال في سبيل الله في قول الجمهور . وهو الذي ينوى به أن تكون كلمة الله هي العليا . وسبل الله كثيرة فهي عامة في كل سبيل ، قال الله تعالى : قل هذه سبيلي . قال مالك : سبل الله كثيرة ، وما من سبيل إلا يقاتل عليها أو فيها أو لها ، وأعظمها دين الإسلام ، لا خلاف في هذا . وقيل : الخطاب للذين أحيوا من بني إسرائيل ، وروي عن ابن عباس والضحاك . والواو على هذا في قوله \" وقاتلوا \" عاطفة على الأمر المتقدم ، وفي ا",
        "char_start": 0,
        "char_end": 871,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "قوله تعالى : ألم تر إلى الملإ من بني إسرائيل من بعد موسى إذ قالوا لنبي لهم ابعث لنا ملكا نقاتل في سبيل الله قال هل عسيتم إن كتب عليكم القتال ألا تقاتلوا قالوا وما لنا ألا نقاتل في سبيل الله وقد أخرجنا من ديارنا وأبنائنا فلما كتب عليهم القتال تولوا إلا قليلا منهم والله عليم بالظالمين[ ص: 222 ] ذكر في التحريض على القتال قصة أخرى جرت في بني إسرائيل . والملأ : الأشراف من الناس ، كأنهم ممتلئون شرفا . وقال الزجاج : سموا بذلك لأنهم ممتلئون مما يحتاجون إليه منهم . والملأ في هذه الآية القوم ؛ لأن المعنى ",
        "char_start": 0,
        "char_end": 3184,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_252_chunk00",
        "verse_key": "2:252",
        "text_ar": "قوله تعالى : تلك آيات الله نتلوها عليك بالحق وإنك لمن المرسلين ( تلك ) ابتداء ( آيات الله ) خبره ، وإن شئت كان بدلا والخبر نتلوها عليك بالحق . وإنك لمن المرسلين خبر إن ؛ أي وإنك لمرسل . نبه الله تعالى نبيه صلى الله عليه وسلم أن هذه الآيات التي تقدم ذكرها لا يعلمها إلا نبي مرسل .",
        "char_start": 0,
        "char_end": 279,
        "relevance": "direct"
      },
      {
        "source": "qurtubi",
        "chunk_id": "qurtubi_002_253_chunk00",
        "verse_key": "2:253",
        "text_ar": "تلك الرسل فضلنا بعضهم على بعض منهم من كلم الله ورفع بعضهم درجات وآتينا عيسى ابن مريم البينات وأيدناه بروح القدس ولو شاء الله ما اقتتل الذين من بعدهم من بعد ما جاءتهم البينات ولكن اختلفوا فمنهم من آمن ومنهم من كفر ولو شاء الله ما اقتتلوا ولكن الله يفعل ما يريد[ ص: 239 ] قوله تعالى : تلك الرسل قال : ( تلك ) ولم يقل : ذلك مراعاة لتأنيث لفظ الجماعة ، وهي رفع بالابتداء . و ( الرسل ) نعته ، وخبر الابتداء الجملة . وقيل : ( الرسل ) عطف بيان ، و ( فضلنا ) الخبر . وهذه آية مشكلة ، والأحاديث ثابتة بأن النب",
        "char_start": 0,
        "char_end": 6987,
        "relevance": "direct"
      }
    ],
    "saadi": [
      {
        "source": "saadi",
        "chunk_id": "saadi_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "{ اَتَاْمُرُونَ النَّاسَ بِالْبِرِّ } اي: بالايمان والخير { وَتَنْسَوْنَ اَنْفُسَكُمْ } اي: تتركونها عن امرها بذلك، والحال: { وَاَنْتُمْ تَتْلُونَ الْكِتَابَ اَفَلَا تَعْقِلُونَ } واسمي العقل عقلا لانه يعقل به ما ينفعه من الخير, وينعقل به عما يضره، وذلك ان العقل يحث صاحبه ان يكون اول فاعل لما يامر به, واول تارك لما ينهي عنه، فمن امر غيره بالخير ولم يفعله, او نهاه عن الشر فلم يتركه, دل علي عدم عقله وجهله, خصوصا اذا كان عالما بذلك, قد قامت عليه الحجه. وهذه الايه, وان كانت نزلت في سبب بني اسراييل, ",
        "char_start": 0,
        "char_end": 1159,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_054_chunk00",
        "verse_key": "2:54",
        "text_ar": "{وَاِذْ قَالَ مُوسَي لِقَوْمِهِ يَا قَوْمِ اِنَّكُمْ ظَلَمْتُمْ اَنْفُسَكُمْ بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوبُوا اِلَي بَارِيِكُمْ فَاقْتُلُوا اَنْفُسَكُمْ...} ثم انه امركم بالتوبه علي لسان نبيه موسي بان يقتل بعضكم بعضا؛ فعفا الله عنكم بسبب ذلك.",
        "char_start": 0,
        "char_end": 245,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "اي: واذكروا, اذ قلتم لموسي, علي وجه التملل لنعم الله والاحتقار لها، { لَنْ نَصْبِرَ عَلَي طَعَامٍ وَاحِدٍ } اي: جنس من الطعام, وان كان كما تقدم انواعا, لكنها لا تتغير، { فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنْبِتُ الْاَرْضُ مِنْ بَقْلِهَا } اي: نباتها الذي ليس بشجر يقوم علي ساقه، { وَقِثَّايِهَا } وهو الخيار { وَفُومِهَا } اي: ثومها، والعدس والبصل معروف، قال لهم موسي { اَتَسْتَبْدِلُونَ الَّذِي هُوَ اَدْنَي } وهو الاطعمه المذكوره، { بِالَّذِي هُوَ خَيْرٌ } وهو المن والسلوي, فهذا غير لاي",
        "char_start": 0,
        "char_end": 2617,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "تفسير الايات من 84 ال 85 وهذا الفعل المذكور في هذه الايه, فعل للذين كانوا في زمن الوحي بالمدينه، وذلك ان الاوس والخزرج - وهم الانصار - كانوا قبل مبعث النبي صلي الله عليه وسلم مشركين, وكانوا يقتتلون علي عاده الجاهليه، فنزلت عليهم الفرق الثلاث من فرق اليهود, بنو قريظه, وبنو النضير, وبنو قينقاع، فكل فرقه منهم حالفت فرقه من اهل المدينه. فكانوا اذا اقتتلوا اعان اليهودي حليفه علي مقاتليه الذين تعينهم الفرقه الاخري من اليهود, فيقتل اليهودي اليهودي, ويخرجه من دياره اذا حصل جلاء ونهب، ثم اذا وضعت الحرب ا",
        "char_start": 0,
        "char_end": 1250,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_087_chunk00",
        "verse_key": "2:87",
        "text_ar": "يمتن تعالي علي بني اسراييل ان ارسل لهم كليمه موسي, واتاه التوراه, ثم تابع من بعده بالرسل الذين يحكمون بالتوراه, الي ان ختم انبياءهم بعيسي ابن مريم عليه السلام، واتاه من الايات البينات ما يومن علي مثله البشر، { وَاَيَّدْنَاهُ بِرُوحِ الْقُدُسِ } اي: قواه الله بروح القدس. قال اكثر المفسرين: انه جبريل عليه السلام, وقيل: انه الايمان الذي يويد الله به عباده. ثم مع هذه النعم التي لا يقدر قدرها, لما اتوكم { بِمَا لَا تَهْوَي اَنْفُسُكُمُ اسْتَكْبَرْتُمْ } عن الايمان بهم، { فَفَرِيقًا } منهم { كَذَّبْتُ",
        "char_start": 0,
        "char_end": 615,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_091_chunk00",
        "verse_key": "2:91",
        "text_ar": "اي: واذا امر اليهود بالايمان بما انزل الله علي رسوله, وهو القران استكبروا وعتوا, و { قَالُوا نُوْمِنُ بِمَا اُنْزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَاءَهُ } اي: بما سواه من الكتب، مع ان الواجب ان يومن بما انزل الله مطلقا, سواء انزل عليهم, او علي غيرهم, وهذا هو الايمان النافع, الايمان بما انزل الله علي جميع رسل الله. واما التفريق بين الرسل والكتب, وزعم الايمان ببعضها دون بعض, فهذا ليس بايمان, بل هو الكفر بعينه, ولهذا قال تعالي: { اِنَّ الَّذِينَ يَكْفُرُونَ بِاللَّهِ وَرُسُلِهِ وَيُرِيدُونَ اَن",
        "char_start": 0,
        "char_end": 1631,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_102_chunk00",
        "verse_key": "2:102",
        "text_ar": "ولما كان من العوايد القدريه والحكمه الالهيه ان من ترك ما ينفعه، وامكنه الانتفاع به فلم ينتفع, ابتلي بالاشتغال بما يضره, فمن ترك عباده الرحمن, ابتلي بعباده الاوثان, ومن ترك محبه الله وخوفه ورجاءه, ابتلي بمحبه غير الله وخوفه ورجايه, ومن لم ينفق ماله في طاعه الله انفقه في طاعه الشيطان, ومن ترك الذل لربه, ابتلي بالذل للعبيد، ومن ترك الحق ابتلي بالباطل. كذلك هولاء اليهود لما نبذوا كتاب الله { اتبعوا ما تتلوا الشياطين } وتختلق من السحر { علي ملك سليمان } حيث اخرجت الشياطين للناس السحر، وزعموا ان سليما",
        "char_start": 0,
        "char_end": 2883,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "وذلك أنه بلغ بأهل الكتاب الهوى والحسد, إلى أن بعضهم ضلل بعضا, وكفر بعضهم بعضا, كما فعل الأميون من مشركي العرب وغيرهم. فكل فرقة تضلل الفرقة الأخرى, ويحكم الله في الآخرة بين المختلفين بحكمه العدل, الذي أخبر به عباده, فإنه لا فوز ولا نجاة إلا لمن صدق جميع الأنبياء والمرسلين, وامتثل أوامر ربه, واجتنب نواهيه, ومن عداهم, فهو هالك.",
        "char_start": 0,
        "char_end": 326,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "يخبر تعالي ان الذين اتاهم الكتاب, ومنَّ عليهم به منه مطلقه, انهم { يَتْلُونَهُ حَقَّ تِلَاوَتِهِ } اي: يتبعونه حق اتباعه, والتلاوه: الاتباع، فيحلون حلاله, ويحرمون حرامه, ويعملون بمحكمه, ويومنون بمتشابهه، وهولاء هم السعداء من اهل الكتاب, الذين عرفوا نعمه الله وشكروها, وامنوا بكل الرسل, ولم يفرقوا بين احد منهم. فهولاء, هم المومنون حقا, لا من قال منهم: { نومن بما انزل علينا ويكفرون بما وراءه } ولهذا توعدهم بقوله { وَمَنْ يَكْفُرْ بِهِ فَاُولَيِكَ هُمُ الْخَاسِرُونَ } وقد تقدم تفسير الايه التي بعدها",
        "char_start": 0,
        "char_end": 501,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_129_chunk00",
        "verse_key": "2:129",
        "text_ar": "{ رَبَّنَا وَابْعَثْ فِيهِمْ } اي: في ذريتنا { رَسُولًا مِنْهُمْ } ليكون ارفع لدرجتهما, ولينقادوا له, وليعرفوه حقيقه المعرفه. { يَتْلُو عَلَيْهِمْ ايَاتِكَ } لفظا, وحفظا, وتحفيظا { وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَهَ } معني. { وَيُزَكِّيهِمْ } بالتربيه علي الاعمال الصالحه والتبري من الاعمال الرديه, التي لا تزكو النفوس معها. { اِنَّكَ اَنْتَ الْعَزِيزُ } اي: القاهر لكل شيء, الذي لا يمتنع علي قوته شيء. { الْحَكِيمُ } الذي يضع الاشياء مواضعها، فبعزتك وحكمتك, ابعث فيهم هذا الرسول. فاستجاب الله ",
        "char_start": 0,
        "char_end": 708,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_151_chunk00",
        "verse_key": "2:151",
        "text_ar": "يقول تعالي: ان انعامنا عليكم باستقبال الكعبه واتمامها بالشرايع والنعم المتممه, ليس ذلك ببدع من احساننا, ولا باوله, بل انعمنا عليكم باصول النعم ومتمماتها, فابلغها ارسالنا اليكم هذا الرسول الكريم منكم, تعرفون نسبه وصدقه, وامانته وكماله ونصحه. { يَتْلُو عَلَيْكُمْ ايَاتِنَا } وهذا يعم الايات القرانيه وغيرها، فهو يتلو عليكم الايات المبينه للحق من الباطل, والهدي من الضلال, التي دلتكم اولا, علي توحيد الله وكماله, ثم علي صدق رسوله, ووجوب الايمان به, ثم علي جميع ما اخبر به من المعاد والغيوب, حتي حصل لكم",
        "char_start": 0,
        "char_end": 2672,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "اخبر تعالي ان في هذه المخلوقات العظيمه, ايات اي: ادله علي وحدانيه الباري والهيته، وعظيم سلطانه ورحمته وساير صفاته، ولكنها { لِقَوْمٍ يَعْقِلُونَ } اي: لمن لهم عقول يُعملونها فيما خُلِقَتْ له، فعلي حسب ما منّ الله علي عبده من العقل, ينتفع بالايات ويعرفها بعقله وفكره وتدبُّره، ففي { خَلْقِ السَّمَاوَاتِ } في ارتفاعها واتساعها, واحكامها, واتقانها, وما جعل الله فيها من الشمس والقمر, والنجوم, وتنظيمها لمصالح العباد. وفي خلق { الْاَرْضِ } مهادا للخلق, يمكنهم القرار عليها والانتفاع بما عليها, والاعتبار",
        "char_start": 0,
        "char_end": 4723,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_190_chunk00",
        "verse_key": "2:190",
        "text_ar": "هذه الايات, تتضمن الامر بالقتال في سبيل الله, وهذا كان بعد الهجره الي المدينه, لما قوي المسلمون للقتال, امرهم الله به, بعد ما كانوا مامورين بكف ايديهم، وفي تخصيص القتال { فِي سَبِيلِ اللَّهِ } حث علي الاخلاص, ونهي عن الاقتتال في الفتن بين المسلمين. { الَّذِينَ يُقَاتِلُونَكُمْ } اي: الذين هم مستعدون لقتالكم, وهم المكلفون الرجال, غير الشيوخ الذين لا راي لهم ولا قتال. والنهي عن الاعتداء, يشمل انواع الاعتداء كلها, من قتل من لا يقاتل, من النساء, والمجانين والاطفال, والرهبان ونحوهم والتمثيل بالقتلي, ",
        "char_start": 0,
        "char_end": 632,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_191_chunk00",
        "verse_key": "2:191",
        "text_ar": "{ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ } هذا امر بقتالهم, اينما وجدوا في كل وقت, وفي كل زمان قتال مدافعه, وقتال مهاجمه ثم استثني من هذا العموم قتالهم { عِنْدَ الْمَسْجِدِ الْحَرَامِ } وانه لا يجوز الا ان يبداوا بالقتال, فانهم يُقاتلون جزاءً لهم علي اعتدايهم، وهذا مستمر في كل وقت, حتي ينتهوا عن كفرهم فيسلموا, فانَّ الله يتوب عليهم, ولو حصل منهم ما حصل من الكفر بالله, والشرك في المسجد الحرام, وصد الرسول والمومنين عنه وهذا من رحمته وكرمه بعباده. ولما كان القتال عند المسجد الحرام, يتوهم انه مفسده ف",
        "char_start": 0,
        "char_end": 725,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_193_chunk00",
        "verse_key": "2:193",
        "text_ar": "ثم ذكر تعالي المقصود من القتال في سبيله, وانه ليس المقصود به, سفك دماء الكفار, واخذ اموالهم، ولكن المقصود به ان { يَكُونَ الدِّينُ لِلَّهِ } تعالي, فيظهر دين الله [تعالي], علي ساير الاديان, ويدفع كل ما يعارضه, من الشرك وغيره, وهو المراد بالفتنه، فاذا حصل هذا المقصود, فلا قتل ولا قتال، { فَاِنِ انْتَهَوْا } عن قتالكم عند المسجد الحرام { فَلَا عُدْوَانَ اِلَّا عَلَي الظَّالِمِينَ } اي: فليس عليهم منكم اعتداء, الا من ظلم منهم, فانه يستحق المعاقبه, بقدر ظلمه.",
        "char_start": 0,
        "char_end": 459,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "الجمهور علي ان تحريم القتال في الاشهر الحرم, منسوخ بالامر بقتال المشركين حيثما وجدوا، وقال بعض المفسرين: انه لم ينسخ, لان المطلق محمول علي المقيد، وهذه الايه مقيده لعموم الامر بالقتال مطلقا؛ ولان من جمله مزيه الاشهر الحرم، بل اكبر مزاياها, تحريم القتال فيها, وهذا انما هو في قتال الابتداء، واما قتال الدفع فانه يجوز في الاشهر الحرم, كما يجوز في البلد الحرام. ولما كانت هذه الايه نازله بسبب ما حصل, لسريه عبد الله بن جحش, وقتلهم عمرو بن الحَضْرَمِيِّ, واخذهم اموالهم, وكان ذلك - علي ما قيل - في شهر رج",
        "char_start": 0,
        "char_end": 2664,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_244_chunk00",
        "verse_key": "2:244",
        "text_ar": "ثم امر تعالي بالقتال في سبيله، وهو قتال الاعداء الكفار لاعلاء كلمه الله ونصر دينه، فقال: { وقاتلوا في سبيل الله واعلموا ان الله سميع عليم } اي: فاحسنوا نياتكم واقصدوا بذلك وجه الله، واعلموا انه لا يفيدكم القعود عن القتال شييا، ولو ظننتم ان في القعود حياتكم وبقاءكم، فليس الامر كذلك، ولهذا ذكر القصه السابقه توطيه لهذا الامر، فكما لم ينفع الذين خرجوا من ديارهم حذر الموت خروجهم، بل اتاهم ما حذروا من غير ان يحتسبوا، فاعلموا انكم كذلك.",
        "char_start": 0,
        "char_end": 433,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "يقص تعالي علي نبيه قصه الملا من بني اسراييل وهم الاشراف والروساء، وخص الملا بالذكر، لانهم في العاده هم الذين يبحثون عن مصالحهم ليتفقوا فيتبعهم غيرهم علي ما يرونه، وذلك انهم اتوا الي نبي لهم بعد موسي عليه السلام فقالوا له { ابعث لنا ملكا } اي: عيِّن لنا ملكا { نقاتل في سبيل الله } ليجتمع متفرقنا ويقاوم بنا عدونا، ولعلهم في ذلك الوقت ليس لهم رييس يجمعهم، كما جرت عاده القبايل اصحاب البيوت، كل بيت لا يرضي ان يكون من البيت الاخر رييس، فالتمسوا من نبيهم تعيين ملك يرضي الطرفين ويكون تعيينه خاصا لعوايده",
        "char_start": 0,
        "char_end": 1398,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_252_chunk00",
        "verse_key": "2:252",
        "text_ar": "ثم قال تعالي: { تلك ايات الله نتلوها عليك بالحق } اي: بالصدق الذي لا ريب فيها المتضمن للاعتبار والاستبصار وبيان حقايق الامور { وانك لمن المرسلين } فهذه شهاده من الله لرسوله برسالته التي من جمله ادلتها ما قصه الله عليه من اخبار الامم السالفين والانبياء واتباعهم واعدايهم التي لولا خبر الله اياه لما كان عنده بذلك علم بل لم يكن في قومه من عنده شيء من هذه الامور، فدل انه رسول الله حقا ونبيه صدقا الذي بعثه بالحق ودين الحق ليظهره علي الدين كله ولو كره المشركون. وفي هذه القصه من الايات والعبر ما يتذكر ب",
        "char_start": 0,
        "char_end": 1700,
        "relevance": "direct"
      },
      {
        "source": "saadi",
        "chunk_id": "saadi_002_253_chunk00",
        "verse_key": "2:253",
        "text_ar": "يخبر تعالي انه فضل بعض الرسل علي بعض بما خصهم من بين ساير الناس بايحايه وارسالهم الي الناس، ودعايهم الخلق الي الله، ثم فضل بعضهم علي بعض بما اودع فيهم من الاوصاف الحميده والافعال السديده والنفع العام، فمنهم من كلمه الله كموسي بن عمران خصه بالكلام، ومنهم من رفعه علي سايرهم درجات كنبينا صلي الله عليه وسلم الذي اجتمع فيه من الفضايل ما تفرق في غيره، وجمع الله له من المناقب ما فاق به الاولين والاخرين { واتينا عيسي ابن مريم البينات } الدالات علي نبوته وانه عبد الله ورسوله وكلمته القاها الي مريم وروح م",
        "char_start": 0,
        "char_end": 1886,
        "relevance": "direct"
      }
    ],
    "tabari": [
      {
        "source": "tabari",
        "chunk_id": "tabari_002_044_chunk00",
        "verse_key": "2:44",
        "text_ar": "القول في تاويل قوله تعالي : اَتَاْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ اَنْفُسَكُمْقال ابو جعفر: اختلف اهل التاويل في معني البر الذي كان المخاطبون بهذه الايه يامرون الناس به وينسون انفسهم, بعد اجماع جميعهم علي ان كل طاعه لله فهي تسمي \" برا \". فروي عن ابن عباس ما:-840- حدثنا به ابن حميد, قال: حدثنا سلمه, عن ابن اسحاق, عن محمد بن ابي محمد, عن عكرمه, او عن سعيد بن جبير, عن ابن عباس: ( اَتَاْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ اَنْفُسَكُمْ وَاَنْتُمْ تَتْلُونَ الْكِتَابَ اَفَلا تَعْقِلُونَ ",
        "char_start": 0,
        "char_end": 5231,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_054_chunk00",
        "verse_key": "2:54",
        "text_ar": "القول في تاويل قوله تعالي ذكره وَاِذْ قَالَ مُوسَي لِقَوْمِهِ يَا قَوْمِ اِنَّكُمْ ظَلَمْتُمْ اَنْفُسَكُمْ بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوبُوا اِلَي بَارِيِكُمْ فَاقْتُلُوا اَنْفُسَكُمْ ذَلِكُمْ خَيْرٌ لَكُمْ عِنْدَ بَارِيِكُمْ فَتَابَ عَلَيْكُمْ اِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ (54)وتاويل ذلك: اذكروا ايضا اذ قال موسي لقومه من بني اسراييل: يا قوم انكم ظلمتم انفسكم . وظلمهم اياها، كان فعلَهم بها ما لم يكن لهم ان يفعلوه بها، مما اوجب لهم العقوبه من الله تعالي. وكذلك كل فاعل فعلا يستوجب به العقو",
        "char_start": 0,
        "char_end": 11914,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_061_chunk00",
        "verse_key": "2:61",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذْ قُلْتُمْ يَا مُوسَي لَنْ نَصْبِرَ عَلَي طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنْبِتُ الاَرْضُ مِنْ بَقْلِهَا وَقِثَّايِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَاقد دللنا -فيما مضي قبل- علي معني \" الصبر \" وانه كف النفس وحبسها عن الشيء. (46) فاذ كان ذلك كذلك , فمعني الايه اذا: واذكروا اذا قلتم -يا معشر بني اسراييل-: لن نطيق حبس انفسنا علي طعام واحد - وذلك \" الطعام الواحد \"، هو ما اخبر الله جل ثناوه انه اطعمهموه في تيههم، وهو \" السلوي \" &; 2-12",
        "char_start": 0,
        "char_end": 26605,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_085_chunk00",
        "verse_key": "2:85",
        "text_ar": "القول في تاويل قوله تعالي : ثُمَّ اَنْتُمْ هَوُلاءِ تَقْتُلُونَ اَنْفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِنْكُمْ مِنْ دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِمْ بِالاِثْمِ وَالْعُدْوَانِقال ابو جعفر: ويتجه في قوله: (ثم انتم هولاء) وجهان. احدهما ان يكون اريد به: ثم انتم يا هولاء, فترك \" يا \" استغناء بدلاله الكلام عليه, كما قال: يُوسُفُ اَعْرِضْ عَنْ هَذَا [ يوسف: 29]، وتاويله: يا يوسف اعرض عن هذا. فيكون معني الكلام حينيذ: ثم انتم يا معشر يهود بني اسراييل - بعد اقراركم بالميثاق الذي اخذته عليكم: لا تسفكون دم",
        "char_start": 0,
        "char_end": 18866,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_087_chunk00",
        "verse_key": "2:87",
        "text_ar": "القول في تاويل قوله تعالي : وَلَقَدْ اتَيْنَا مُوسَي الْكِتَابَ وَقَفَّيْنَا مِنْ بَعْدِهِ بِالرُّسُلِقال ابو جعفر: يعني بقوله جل ثناوه: (اتينا موسي الكتاب): انـزلناه اليه. وقد بينا ان معني \" الايتاء \" الاعطاء، فيما مضي قبل. (49)* * *و \" الكتاب \" الذي اتاه الله موسي عليه السلام، هو التوراه.واما قوله: (وقفينا)، فانه يعني: واردفنا واتبعنا بعضهم خلف بعض, كما يقفو الرجل الرجل: اذا سار في اثره من ورايه. واصله من \" القفا \", يقال منه: \" قفوت فلانا: اذا صرت خلف قفاه, كما يقال: \" دبرته \": اذا صرت في دبره",
        "char_start": 0,
        "char_end": 9540,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_091_chunk00",
        "verse_key": "2:91",
        "text_ar": "القول في تاويل قوله تعالي : وَاِذَا قِيلَ لَهُمْ امِنُوا بِمَا اَنْزَلَ اللَّهُ قَالُوا نُوْمِنُ بِمَا اُنْزِلَ عَلَيْنَاقال ابو جعفر: يعني بقوله جل ثناوه: (واذا قيل لهم)، واذا قيل لليهود من بني اسراييل - للذين كانوا بين ظهراني مهاجر رسول الله صلي الله عليه وسلم-: (امنوا)، اي صدقوا,(بما انـزل الله)، يعني بما انـزل الله من القران علي محمد صلي الله عليه وسلم، (قالوا: نومن)، اي نصدق,(بما انـزل علينا)، يعني بالتوراه التي انـزلها الله علي موسي.* * *القول في تاويل قوله تعالي : وَيَكْفُرُونَ بِمَا وَرَ",
        "char_start": 0,
        "char_end": 8914,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_102_chunk00",
        "verse_key": "2:102",
        "text_ar": "واتبعوا ما تتلو الشياطينالقول في تاويل قوله تعالي : { واتبعوا ما تتلوا الشياطين } يعني بقوله : { واتبعوا ما تتلوا الشياطين } الفريق من احبار اليهود وعلمايها الذين وصفهم الله جل ثناوه بانهم نبذوا كتابه الذي انزله علي موسي وراء ظهورهم , تجاهلا منهم وكفرا بما هم به عالمون , كانهم لا يعلمون . فاخبر عنهم انهم رفضوا كتابه الذي يعلمون انه منزل من عنده علي نبيه صلي الله عليه وسلم , ونقضوا عهده الذي اخذه عليهم في العمل بما فيه , واثروا السحر الذي تلته الشياطين في ملك سليمان بن داود فاتبعوه ; وذلك هو الخس",
        "char_start": 0,
        "char_end": 37694,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_113_chunk00",
        "verse_key": "2:113",
        "text_ar": "القول في تاويل قوله تعالي : وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَي عَلَي شَيْءٍ وَقَالَتِ النَّصَارَي لَيْسَتِ الْيَهُودُ عَلَي شَيْءٍ وَهُمْ يَتْلُونَ الْكِتَابَقال ابو جعفر: ذكر ان هذه الايه نـزلت في قوم من اهل الكتابين تنازعوا عند رسول الله صلي الله عليه وسلم ، فقال بعضهم لبعض.* ذكر من قال ذلك:1811- حدثنا ابن حميد قال، حدثنا سلمه ، وحدثنا ابو كريب قال، حدثنا يونس بن بكير ، قالا جميعا- حدثنا محمد بن اسحاق قال، حدثني محمد بن ابي محمد مولي زيد بن ثابت قال، حدثني سعيد بن جبير او عكرمه ، عن ابن",
        "char_start": 0,
        "char_end": 7315,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_121_chunk00",
        "verse_key": "2:121",
        "text_ar": "القول في تاويل قوله تعالي : الَّذِينَ اتَيْنَاهُمُ الْكِتَابَقال ابو جعفر: اختلف اهل التاويل في الذين عناهم الله جل ثناوه بقوله: (الذين اتيناهم الكتاب) فقال بعضهم: هم المومنون برسول الله صلي الله عليه وسلم ، وبما جاء به من اصحابه.*ذكر من قال ذلك:1878- حدثنا بشر بن معاذ قال، حدثنا يزيد بن زريع ، عن سعيد ، عن قتاده قوله: (الذين اتيناهم الكتاب) ، هولاء اصحاب نبي الله صلي الله عليه وسلم ، امنوا بكتاب الله وصدقوا به.* * *وقال اخرون: بل عني الله بذلك علماء بني اسراييل ، الذين امنوا بالله وصدقوا رسله، ",
        "char_start": 0,
        "char_end": 11965,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_129_chunk00",
        "verse_key": "2:129",
        "text_ar": "رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ ايَاتِكَالْقَوْل فِي تَاْوِيل قَوْله تَعَالَي : { رَبّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِنْهُمْ } / وَهَذِهِ دَعْوَه ابْرَاهِيم وَاِسْمَاعِيل لِنَبِيِّنَا مُحَمَّد صَلَّي اللَّه عَلَيْهِ وَسَلَّمَ خَاصَّه , وَهِيَ الدَّعْوَه الَّتِي كَانَ نَبِيّنَا صَلَّي اللَّه عَلَيْهِ وَسَلَّمَ يَقُول : \" اَنَا دَعْوَه اَبِي ابْرَاهِيم وَبُشْرَي عِيسَي \" . 1708 - حَدَّثَنَا بِذَلِكَ ابْن حُمَيْد , قَالَ : ثنا سَلَمَه , عَنْ مُحَمَّد بْن اسْحَاق , ع",
        "char_start": 0,
        "char_end": 6890,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_151_chunk00",
        "verse_key": "2:151",
        "text_ar": "القول في تاويل قوله تعالي : كَمَا اَرْسَلْنَا فِيكُمْ رَسُولا مِنْكُمْ يَتْلُو عَلَيْكُمْ ايَاتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ الْكِتَابَ وَالْحِكْمَهَ وَيُعَلِّمُكُمْ مَا لَمْ تَكُونُوا تَعْلَمُونَ (151)قال ابو جعفر: يعني بقوله جل ثناوه: \" كما ارسلنا فيكم رسولا \"، ولاتمّ نعمتي عليكم ببيان شرايع ملتكم الحنيفيه, واهديَكم لدين خليلي ابراهيم عليه السلام, فاجعل لكم دَعوتَه التي دعاني بها ومسالتَه التي سالنيها فقال: رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا اُمَّهً مُسْلِمَهً ل",
        "char_start": 0,
        "char_end": 4044,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_164_chunk00",
        "verse_key": "2:164",
        "text_ar": "القول في المعني الذي من اجله انـزل الله علي نبيه صلي الله عليه وسلم قوله: اِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالاَرْضِ وَاخْتِلافِ اللَّيْلِ وَالنَّهَارِ* * *قال ابو جعفر: اختلف اهل التاويل في السبب الذي من اجله انـزل الله تعالي ذكره هذه الايه علي نَبيّه محمد صلي الله عليه وسلم.* * *فقال بعضهم: انـزلها عليه احتجاجًا له علي اهل الشرك به من عبده الاوثان. وذلك ان الله تعالي ذكره لما انـزل علي نبيه محمد صلي الله عليه وسلم: وَاِلَهُكُمْ اِلَهٌ وَاحِدٌ لا اِلَهَ اِلا هُوَ الرَّحْمَنُ الرَّحِيمُ فتلا ذلك ",
        "char_start": 0,
        "char_end": 14773,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_190_chunk00",
        "verse_key": "2:190",
        "text_ar": "القول في تاويل قوله تعالي : وَقَاتِلُوا فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ وَلا تَعْتَدُوا اِنَّ اللَّهَ لا يُحِبُّ الْمُعْتَدِينَ (190)قال ابو جعفر: اختلف اهلُ التاويل في تاويل هذه الايه.فقال بعضهم: هذه الايه هي اول ايه نـزلت في امر المسلمين بقتال اهل الشرك. وقالوا: امر فيها المسلمون بقتال من قاتلهم من المشركين، والكف عمن كفّ عنهم، ثم نُسخت ب \" براءه \".* ذكر من قال ذلك:3089 - حدثني المثني قال، حدثنا اسحاق قال، حدثنا عبد الرحمن بن سعد، وابن ابي جعفر، عن ابي جعفر، عن الربيع في قوله: \"",
        "char_start": 0,
        "char_end": 4120,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_191_chunk00",
        "verse_key": "2:191",
        "text_ar": "القول في تاويل قوله تعالي : وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَاَخْرِجُوهُمْ مِنْ حَيْثُ اَخْرَجُوكُمْقال ابو جعفر: يعني تعالي ذكره بذلك: واقتلوا ايها المومنون الذين يقاتلونكم من المشركين حيث اصبتم مَقاتلهم وامكنكم قتلهم، وذلك هو معني قوله: \" حيث ثقفتموهم \".* * *ومعني \" الثِّقْفَه \" بالامر (1) الحِذق به والبصر، يقال: \" انه لثَقِفَ لَقفٌ\"، اذا كان جيد الحَذر في القتال، بصيرا بمواقع القتل. واما \" التَّثْقيف \" فمعني غير هذا، وهو التقويم.* * *فمعني: \" واقتلوهم حيث ثقفتموهم \"، اقتلوهم في اي مكان",
        "char_start": 0,
        "char_end": 6359,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_193_chunk00",
        "verse_key": "2:193",
        "text_ar": "القول في تاويل قوله تعالي : وَقَاتِلُوهُمْ حَتَّي لا تَكُونَ فِتْنَهٌ وَيَكُونَ الدِّينُ لِلَّهِقال ابو جعفر: يقول تعالي ذكره لنبيه محمد صلي الله عليه وسلم: وقاتلوا المشركين الذين يقاتلونكم حتي لا تكون فتنه = يعني: حتي لا يكون شركٌ بالله، وحتي لا يُعبد دونه احدٌ، وتضمحلَّ عباده الاوثان والالهه والانداد، وتكونَ العباده والطاعه لله وحده دون غيره من الاصنام والاوثان، كما قال قتاده فيما:3113- حدثنا بشر بن معاذ قال، حدثنا يزيد قال، حدثنا سعيد، عن قتاده قوله: \" وقاتلوهم حتي لا تكون فتنه \" قال: حتي لا ",
        "char_start": 0,
        "char_end": 6579,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_217_chunk00",
        "verse_key": "2:217",
        "text_ar": "القول في تاويل قوله تعالي : يَسْاَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ قُلْ قِتَالٌ فِيهِ كَبِيرٌ وَصَدٌّ عَنْ سَبِيلِ اللَّهِ وَكُفْرٌ بِهِ وَالْمَسْجِدِ الْحَرَامِ وَاِخْرَاجُ اَهْلِهِ مِنْهُ اَكْبَرُ عِنْدَ اللَّهِ وَالْفِتْنَهُ اَكْبَرُ مِنَ الْقَتْلِقال ابو جعفر: يعني بذلك جل ثناوه: يسالك يا محمد اصحابُك عن الشهر الحرام = وذلك رَجبٌ = عن قتالٍ فيه.&; 4-300 &;وخفضُ\" القتال \" علي معني تكرير \" عن \" عليه، وكذلك كانت قراءهُ عبد الله بن مسعود فيما ذكر لنا. وقد:-4080 - حدثت عن عمار بن ا",
        "char_start": 0,
        "char_end": 26980,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_244_chunk00",
        "verse_key": "2:244",
        "text_ar": "القول في تاويل قوله : وَقَاتِلُوا فِي سَبِيلِ اللَّهِ وَاعْلَمُوا اَنَّ اللَّهَ سَمِيعٌ عَلِيمٌ (244)قال ابو جعفر: يعني تعالي ذكره بذلك: \" وقاتلوا \"، ايها المومنون=\" في سبيل الله \"، يعني: في دينه الذي هداكم له, (214) لا في طاعه الشيطان= اعداء دينكم, (215) الصادين عن سبيل ربكم, ولا تحتموا عن قتالهم عند لقايهم, ولا تجبنوا عن حربهم، (216) فان بيدي حياتكم وموتكم. ولا يمنعن احدكم من لقايهم وقتالهم حذر الموت وخوف المنيه علي نفسه بقتالهم, فيدعوه ذلك الي التعريد عنهم والفرار منهم, (217) فتذلوا, وياتيكم ",
        "char_start": 0,
        "char_end": 3636,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_246_chunk00",
        "verse_key": "2:246",
        "text_ar": "القول في تاويل قوله : اَلَمْ تَرَ اِلَي الْمَلاِ مِنْ بَنِي اِسْرَايِيلَ مِنْ بَعْدِ مُوسَي اِذْ قَالُوا لِنَبِيٍّ لَهُمُ ابْعَثْ لَنَا مَلِكًا نُقَاتِلْ فِي سَبِيلِ اللَّهِقال ابو جعفر: يعني تعالي ذكره بقوله: \" الم تر \"، الم تر، يا محمد، بقلبك, (1) فتعلم بخبري اياك، يا محمد=\" الي الملا \"، يعني: الي وجوه بني اسراييل واشرافهم وروسايهم=\" من بعد موسي \"، يقول: من بعد ما قبض موسي فمات=\" اذ قالوا لنبي لهم ابعث لنا ملكا نقاتل في سبيل الله \". فذكر لي ان النبي الذي قال لهم ذلك شمويل (2) بن بالي (3) بن عل",
        "char_start": 0,
        "char_end": 24399,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_252_chunk00",
        "verse_key": "2:252",
        "text_ar": "القول في تاويل قوله تعالي : تِلْكَ ايَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ وَاِنَّكَ لَمِنَ الْمُرْسَلِينَ (252)قال ابو جعفر: يعني تعالي ذكره بقوله: \" تلك ايات الله \" (135) هذه الايات التي اقتص الله فيها امر الذين خرجوا من ديارهم وهم الوف حذر الموت، وامر الملا من بني اسراييل من بعد موسي الذين سالوا نبيهم ان يبعث لهم طالوت ملكا وما بعدها من الايات الي قوله : وَلَكِنَّ اللَّهَ ذُو فَضْلٍ عَلَي الْعَالَمِينَ .ويعني بقوله : \" ايات الله \"، حججه واعلامه وادلته. (136) .* * *يقول الله تعالي ذكره: ",
        "char_start": 0,
        "char_end": 1978,
        "relevance": "direct"
      },
      {
        "source": "tabari",
        "chunk_id": "tabari_002_253_chunk00",
        "verse_key": "2:253",
        "text_ar": "القول في تاويل قوله تعالي : تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَي بَعْضٍ مِنْهُمْ مَنْ كَلَّمَ اللَّهُ وَرَفَعَ بَعْضَهُمْ دَرَجَاتٍقال ابو جعفر: يعني تعالي ذكره بقوله: \" تلك \"، الرسل الذين قص الله قصصهم في هذه السوره، كموسي بن عمران وابراهيم واسماعيل واسحاق ويعقوب وشمويل وداود، وساير من ذكر نباهم في هذه السوره. يقول تعالي ذكره: هولاء رسلي فضلت بعضهم علي بعض، فكلمت بعضهم = والذي كلمته منهم موسي صلي الله عليه وسلم = ورفعت بعضهم درجات علي بعض بالكرامه ورفعه المنـزله، كما:-5755 - حدثني محمد ",
        "char_start": 0,
        "char_end": 4268,
        "relevance": "direct"
      }
    ]
  },
  "outgoing_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 7,
      "evidence_refs": [
        {
          "verse_key": "1:1",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_001_001_chunk23",
          "char_start": 477,
          "char_end": 639,
          "relevance": "direct"
        },
        {
          "verse_key": "2:106",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_106_chunk10",
          "char_start": 173,
          "char_end": 335,
          "relevance": "direct"
        },
        {
          "verse_key": "2:129",
          "source": "qurtubi",
          "chunk_id": "qurtubi_002_129_chunk01",
          "char_start": 313,
          "char_end": 475,
          "relevance": "direct"
        },
        {
          "verse_key": "2:144",
          "source": "baghawi",
          "chunk_id": "baghawi_002_144_chunk00",
          "char_start": 14,
          "char_end": 176,
          "relevance": "direct"
        },
        {
          "verse_key": "2:238",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_238_chunk18",
          "char_start": 13,
          "char_end": 175,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_COG_KNOWLEDGE",
      "target_label_ar": "العلم",
      "target_label_en": "Knowledge",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "2:78",
          "source": "saadi",
          "chunk_id": "saadi_002_078_chunk00",
          "char_start": 113,
          "char_end": 275,
          "relevance": "direct"
        },
        {
          "verse_key": "2:238",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_002_238_chunk18",
          "char_start": 13,
          "char_end": 175,
          "relevance": "direct"
        },
        {
          "verse_key": "29:45",
          "source": "saadi",
          "chunk_id": "saadi_029_045_chunk00",
          "char_start": 120,
          "char_end": 282,
          "relevance": "direct"
        },
        {
          "verse_key": "29:45",
          "source": "saadi",
          "chunk_id": "saadi_029_045_chunk00",
          "char_start": 145,
          "char_end": 307,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_PHY_STANDING",
      "target_label_ar": "القيام",
      "target_label_en": "Standing",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "3:113",
          "source": "baghawi",
          "chunk_id": "baghawi_003_113_chunk01",
          "char_start": 500,
          "char_end": 662,
          "relevance": "direct"
        },
        {
          "verse_key": "28:85",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_028_085_chunk00",
          "char_start": 34,
          "char_end": 196,
          "relevance": "direct"
        },
        {
          "verse_key": "73:6",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_073_006_chunk00",
          "char_start": 446,
          "char_end": 608,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPEECH_REMEMBRANCE",
      "target_label_ar": "ذكر الله",
      "target_label_en": "Verbal Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "24:36",
          "source": "tabari",
          "chunk_id": "tabari_024_036_chunk04",
          "char_start": 73,
          "char_end": 235,
          "relevance": "direct"
        },
        {
          "verse_key": "39:23",
          "source": "ibn_kathir",
          "chunk_id": "ibn_kathir_039_023_chunk03",
          "char_start": 79,
          "char_end": 241,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "BEH_SPI_CONTEMPLATION",
      "target_label_ar": "التدبر",
      "target_label_en": "Contemplation",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 3,
      "evidence_refs": [
        {
          "verse_key": "54:17",
          "source": "muyassar",
          "chunk_id": "muyassar_054_017_chunk00",
          "char_start": 0,
          "char_end": 102,
          "relevance": "direct"
        },
        {
          "verse_key": "54:22",
          "source": "muyassar",
          "chunk_id": "muyassar_054_022_chunk00",
          "char_start": 0,
          "char_end": 121,
          "relevance": "direct"
        },
        {
          "verse_key": "54:32",
          "source": "muyassar",
          "chunk_id": "muyassar_054_032_chunk00",
          "char_start": 0,
          "char_end": 101,
          "relevance": "direct"
        }
      ],
      "confidence": 0.53
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 12,
      "evidence_refs": [
        {
          "verse_key": "2:38",
          "source": "tabari",
          "chunk_id": "tabari_002_038_chunk03",
          "char_start": 327,
          "char_end": 489,
          "relevance": "direct"
        },
        {
          "verse_key": "2:78",
          "source": "saadi",
          "chunk_id": "saadi_002_078_chunk00",
          "char_start": 113,
          "char_end": 275,
          "relevance": "direct"
        },
        {
          "verse_key": "3:58",
          "source": "tabari",
          "chunk_id": "tabari_003_058_chunk01",
          "char_start": 392,
          "char_end": 554,
          "relevance": "direct"
        },
        {
          "verse_key": "22:52",
          "source": "baghawi",
          "chunk_id": "baghawi_022_052_chunk03",
          "char_start": 198,
          "char_end": 360,
          "relevance": "direct"
        },
        {
          "verse_key": "22:53",
          "source": "baghawi",
          "chunk_id": "baghawi_022_053_chunk03",
          "char_start": 198,
          "char_end": 360,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "ORG_BRAIN",
      "target_label_ar": "عقل",
      "target_label_en": "Mind/Intellect",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:41",
          "source": "tabari",
          "chunk_id": "tabari_002_041_chunk10",
          "char_start": 405,
          "char_end": 567,
          "relevance": "direct"
        },
        {
          "verse_key": "2:41",
          "source": "tabari",
          "chunk_id": "tabari_002_041_chunk10",
          "char_start": 413,
          "char_end": 575,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "ORG_FOOT",
      "target_label_ar": "رجل",
      "target_label_en": "Foot",
      "edge_type": "COMPLEMENTS",
      "direction": "outgoing",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:121",
          "source": "tabari",
          "chunk_id": "tabari_002_121_chunk09",
          "char_start": 603,
          "char_end": 765,
          "relevance": "direct"
        },
        {
          "verse_key": "2:121",
          "source": "tabari",
          "chunk_id": "tabari_002_121_chunk09",
          "char_start": 617,
          "char_end": 779,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    }
  ],
  "incoming_edges": [
    {
      "target_id": "AGT_ALLAH",
      "target_label_ar": "الله",
      "target_label_en": "Allah",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 11,
      "evidence_refs": [
        {
          "verse_key": "1:1",
          "source": "tabari",
          "chunk_id": "tabari_001_001_chunk07",
          "char_start": 386,
          "char_end": 548,
          "relevance": "direct"
        },
        {
          "verse_key": "2:45",
          "source": "tabari",
          "chunk_id": "tabari_002_045_chunk01",
          "char_start": 228,
          "char_end": 390,
          "relevance": "direct"
        },
        {
          "verse_key": "2:102",
          "source": "tabari",
          "chunk_id": "tabari_002_102_chunk09",
          "char_start": 605,
          "char_end": 767,
          "relevance": "direct"
        },
        {
          "verse_key": "3:114",
          "source": "tabari",
          "chunk_id": "tabari_003_114_chunk11",
          "char_start": 448,
          "char_end": 610,
          "relevance": "direct"
        },
        {
          "verse_key": "8:2",
          "source": "qurtubi",
          "chunk_id": "qurtubi_008_002_chunk02",
          "char_start": 153,
          "char_end": 315,
          "relevance": "direct"
        }
      ],
      "confidence": 0.6
    },
    {
      "target_id": "BEH_SPI_REMEMBRANCE",
      "target_label_ar": "الذكر",
      "target_label_en": "Remembrance",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 4,
      "evidence_refs": [
        {
          "verse_key": "2:265",
          "source": "tabari",
          "chunk_id": "tabari_002_265_chunk03",
          "char_start": 175,
          "char_end": 337,
          "relevance": "direct"
        },
        {
          "verse_key": "11:17",
          "source": "tabari",
          "chunk_id": "tabari_011_017_chunk09",
          "char_start": 0,
          "char_end": 147,
          "relevance": "direct"
        },
        {
          "verse_key": "22:52",
          "source": "tabari",
          "chunk_id": "tabari_022_052_chunk09",
          "char_start": 0,
          "char_end": 139,
          "relevance": "direct"
        },
        {
          "verse_key": "24:36",
          "source": "tabari",
          "chunk_id": "tabari_024_036_chunk04",
          "char_start": 27,
          "char_end": 189,
          "relevance": "direct"
        }
      ],
      "confidence": 0.58
    },
    {
      "target_id": "BEH_SPI_WORSHIP",
      "target_label_ar": "العبادة",
      "target_label_en": "Worship",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:82",
          "source": "tabari",
          "chunk_id": "tabari_005_082_chunk09",
          "char_start": 532,
          "char_end": 694,
          "relevance": "direct"
        },
        {
          "verse_key": "14:11",
          "source": "qurtubi",
          "chunk_id": "qurtubi_014_011_chunk00",
          "char_start": 235,
          "char_end": 397,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "ORG_EYE",
      "target_label_ar": "عين",
      "target_label_en": "Eye",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "5:83",
          "source": "tabari",
          "chunk_id": "tabari_005_083_chunk00",
          "char_start": 252,
          "char_end": 414,
          "relevance": "direct"
        },
        {
          "verse_key": "5:83",
          "source": "tabari",
          "chunk_id": "tabari_005_083_chunk00",
          "char_start": 282,
          "char_end": 444,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    },
    {
      "target_id": "ORG_EYE",
      "target_label_ar": "عين",
      "target_label_en": "Eye",
      "edge_type": "OPPOSITE_OF",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:51",
          "source": "tabari",
          "chunk_id": "tabari_002_051_chunk04",
          "char_start": 195,
          "char_end": 359,
          "relevance": "direct"
        },
        {
          "verse_key": "2:51",
          "source": "tabari",
          "chunk_id": "tabari_002_051_chunk04",
          "char_start": 236,
          "char_end": 400,
          "relevance": "direct"
        }
      ],
      "confidence": 0.56
    },
    {
      "target_id": "ORG_FACE",
      "target_label_ar": "وجه",
      "target_label_en": "Face",
      "edge_type": "COMPLEMENTS",
      "direction": "incoming",
      "evidence_count": 2,
      "evidence_refs": [
        {
          "verse_key": "2:186",
          "source": "tabari",
          "chunk_id": "tabari_002_186_chunk07",
          "char_start": 176,
          "char_end": 338,
          "relevance": "direct"
        },
        {
          "verse_key": "26:219",
          "source": "tabari",
          "chunk_id": "tabari_026_219_chunk02",
          "char_start": 556,
          "char_end": 718,
          "relevance": "direct"
        }
      ],
      "confidence": 0.48
    }
  ],
  "causal_paths": [],
  "bouzidani_contexts": {
    "organ_links": [
      {
        "value": "ORG_HEART",
        "citation_type": "rule",
        "confidence": 0.9,
        "citation_ref": "RULE_EMOTION_HEART"
      }
    ],
    "internal_external": {
      "value": "باطن",
      "citation_type": "rule",
      "confidence": 0.9,
      "citation_ref": "RULE_INTERNAL_BEH_SPI_"
    },
    "situational_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "systemic_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "spatial_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "temporal_context": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    },
    "intention_niyyah": {
      "value": "with_intention",
      "citation_type": "rule",
      "confidence": 0.85,
      "citation_ref": "RULE_WORSHIP_INTENTION"
    },
    "recurrence_dawrah": {
      "value": "unknown",
      "citation_type": "unknown",
      "confidence": 0.0,
      "reason_if_unknown": "no_evidence"
    }
  },
  "evidence_stats": {
    "quran_verse_count": 50,
    "quran_direct_count": 50,
    "quran_indirect_count": 0,
    "tafsir_chunk_count": 140,
    "tafsir_sources_covered": [
      "baghawi",
      "ibn_kathir",
      "jalalayn",
      "muyassar",
      "qurtubi",
      "saadi",
      "tabari"
    ],
    "relationship_count": 14,
    "causal_path_count": 0,
    "context_known_count": 2,
    "context_unknown_count": 5
  },
  "completeness_score": 0.929,
  "missing_fields": [
    "situational_context",
    "systemic_context",
    "spatial_context",
    "temporal_context",
    "recurrence_dawrah"
  ],
  "generated_at": "2026-01-01T20:08:50.196328Z",
  "schema_version": "1.0.0"
}